{
    "title": "Collaborate better | InVision",
    "body": "InVisionApp, Inc.InVisionApp, Inc.ProductCustomersResourcesPricingFreehand OverviewTransformative collaboration for all the work you doTemplatesPricingSecuritySupportFreehandA collaborative canvas to work on anything from anywhere.TemplatesPurpose-built templates to help your team collaborate more effectively.IntegrationsAll your favorite tools, built right in.For teamsProduct teamsDesign teamsHR teamsMarketing teamsWhat's new?New Whiteboard ImporterBring your Miro or Mural whiteboards into Freehand. Keep your work, cut your costs.New Product Manager TemplatesTake product ideas from planning to launch – and every step in between.See all product updates100% of the Fortune 100 collaborate with InVision.IBMEstablishing a cross-functional workflow with IBMSalesforceRedesigning the customer co-creation experience with SalesforceWPPHow WPP partnered with InVision to scale creativityZendeskHow Zendesk used InVision to launch the Thank You MachineCredit SuisseHow Credit Suisse empowers design autonomy with InVisionNetflixThe freedom and flexibility at NetflixSee all customer storiesBlogAll TopicsTeamsCollaborationRemote workInsightsAll Resources InVision 2023 Trends ReportPodcastsHandbooksFilmsTransformation by DesignSquadsDesign DisruptorsThe LoopEventsAll eventsWebinarsVirtual eventsBack ButtonBackSign inSign up freeThe all-in-one collaborative online whiteboardInVision’s Freehand has everything your team needs to bring together people, tools, and workCreate a whiteboard – FreeRequest a demoBrainstorm. Plan. Collaborate. Actually get stuff done.Try FreehandMultiplayer whiteboardA workspace for teams to get work done in real-time or asynchronouslyPowerful integrationsSeamlessly connect to the tools you use every dayScalable solutionGive everyone a seat at the table – one price for your whole teamMake all your work teamworkTeams need a place to do the messy work. To come to the table, to ideate, to actually collaborate. With pre-built templates, organized spaces for project management, and interactive widgets and reactions, InVision’s Freehand centralizes your entire workflow so that you can ensure alignment at every stage of your process and get work done.Learn more about FreehandThe tools your team knows and loves — all in one placeInVision’s Freehand integrates with the tools your team is already using to do their best work every day. Whether you want to turn ideas into tasks in Jira or Asana, edit your Google Docs or collaborate via video chat with Zoom or Webex, InVision’s Freehand has you covered.Learn more about integrationsCentral hub for projectsBring people, tools and work together in one place to give context to and create a single source of truth for all projects. Using a specialized tool? No problem. InVision’s Freehand enables you to curate all of your project artifacts in one place no matter which tool they live in.Learn moreAll the critical features, half the costWith InVision’s Freehand you get all the critical features at half the cost of the other Leading Visual Collaboration tools. Democratize collaboration by giving everyone a seat at the table. Collaboration shouldn’t be dependent on a line item in the budget.Collaborate betterCut your costs, keep your workWhether your team is working in Miro or Mural, you can port your work directly over using InVision Freehand’s Whiteboard Importer today at no additional cost.Learn more about the Whiteboard ImporterThere is something so natural about collaborating in Freehand. It feels like you’re holding a marker, and making ideas happen. I can’t imagine doing that in another tool. It captures that human essence of being in person and talking to someone that is right next to you and getting work done together. Especially in today’s world when everything is remote. It makes for really organic communication.Kirti BansalSr. Product Designer, AdvisorEngineLoading...Loading...Evolve your team’s collaborative intelligence today.Try Freehand—FreeInVisionApp, Inc.Inside InVisionContact usAbout InVisionCareersNewsBrand assetsCompareFigJamLucidsparkMiroMuralBe inspiredFreehandDefined by InVisionGet SupportGet helpProduct documentationSystem statusReport abuseTerms of ServicePrivacy PolicySecurity© 2023 InVisionApp Inc. All rights reserved.",
    "links": [
        "https://www.invisionapp.com/",
        "https://www.invisionapp.com/",
        "/freehand/pricing",
        "https://www.freehandapp.com",
        "https://www.invisionapp.com/freehand/templates",
        "https://www.invisionapp.com/freehand/pricing",
        "https://www.invisionapp.com/security",
        "https://support.invisionapp.com/hc/en-us",
        "https://www.invisionapp.com/freehand",
        "https://www.invisionapp.com/freehand/templates",
        "https://www.invisionapp.com/integrations",
        "https://www.invisionapp.com/teams/product",
        "https://www.invisionapp.com/teams/design",
        "https://www.invisionapp.com/teams/human-resources",
        "https://www.invisionapp.com/teams/marketing",
        "https://www.invisionapp.com/inside-design/whiteboard-importer/",
        "https://www.invisionapp.com/freehand/gen-product-manager-templates",
        "https://www.invisionapp.com/inside-design/category/product-updates/",
        "https://www.invisionapp.com/customers/ibm",
        "https://www.invisionapp.com/customers/salesforce",
        "https://www.invisionapp.com/customers/wpp",
        "https://www.invisionapp.com/customers/zendesk",
        "https://www.invisionapp.com/customers/credit-suisse",
        "https://www.invisionapp.com/customers/netflix",
        "https://www.invisionapp.com/customers",
        "https://www.invisionapp.com/inside-design/",
        "https://www.invisionapp.com/inside-design/category/teams/",
        "https://www.invisionapp.com/inside-design/category/collaboration/",
        "https://www.invisionapp.com/inside-design/category/remote-work/",
        "https://www.invisionapp.com/insights",
        "https://www.invisionapp.com/inside-design/trend-report-2023/",
        "https://www.designbetter.co/podcast",
        "https://www.designbetter.co/books",
        "https://www.invisionapp.com/films/transformation-by-design",
        "https://www.invisionapp.com/films/squads",
        "https://www.invisionapp.com/films/design-disruptors",
        "https://www.invisionapp.com/films/the-loop",
        "https://www.invisionapp.com/events",
        "https://www.invisionapp.com/events/types/webinars",
        "https://www.invisionapp.com/events/types/virtual-events",
        "https://login.invisionapp.com/auth/sign-in?entry=authenticate",
        "https://www.invisionapp.com/api/v2/plans/reservation?fetchId=13309e13-0c79-4649-ba5c-fdcb784ef472&invSource=global-nav",
        "/api/v2/plans/reservation?fetchId=13309e13-0c79-4649-ba5c-fdcb784ef472",
        "https://www.invisionapp.com/lp/enterprise-freehand-short-new-gen",
        "/api/v2/plans/reservation?fetchId=13309e13-0c79-4649-ba5c-fdcb784ef472&invSource=global-nav",
        "https://www.invisionapp.com/freehand",
        "https://www.invisionapp.com/integrations",
        "https://www.invisionapp.com/freehand",
        "https://www.invisionapp.com/product/why-invision",
        "https://www.invisionapp.com/inside-design/whiteboard-importer/",
        "/api/v2/plans/reservation?fetchId=13309e13-0c79-4649-ba5c-fdcb784ef472",
        "https://www.invisionapp.com/",
        "https://www.invisionapp.com/contact",
        "https://www.invisionapp.com/company",
        "https://www.invisionapp.com/careers",
        "https://www.invisionapp.com/news",
        "https://www.invisionapp.com/resources/brand",
        "https://freehandapp.com/why-freehand-figjam/",
        "https://freehandapp.com/why-freehand-lucidspark/",
        "https://freehandapp.com/why-freehand-miro/",
        "https://freehandapp.com/why-freehand-mural/",
        "https://www.invisionapp.com/freehand",
        "https://www.invisionapp.com/defined",
        "https://help.invisionapp.com/hc/en-us/requests/new",
        "https://support.invisionapp.com/",
        "https://status.invisionapp.com/",
        "https://www.invisionapp.com/resources/report-abuse",
        "https://www.invisionapp.com/legal/terms-of-service",
        "https://www.invisionapp.com/legal/privacy-policy",
        "https://www.invisionapp.com/security"
    ]
}