{
    "title": "Stanford Doerr School of Sustainability launches with campus celebration | Stanford Doerr School of Sustainability",
    "body": "\n\n        Skip to main content\n      \n\n        Skip to secondary navigation\n      \n\n\n\nStanford University(link is external)\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nSearch this site\n\nSubmit Search\n\n\nMenu\nOur ImpactGet InvolvedA Living LabStanford at COP27Our CommunityFacultyFaculty talksCommunity SpotlightsExploring Identities Within our CommunityCommunity AwardsDiversity, Equity & InclusionAbout our DEI VisionCommunity DEI ResourcesDEI LibraryProspective StudentsCurrent StudentsFaculty & StaffExcellence in DEI AwardsMeet the DEI TeamSURGESURGE program detailsFAQsLand AcknowledgmentEventsAlumniEventsAll EventsGet InvolvedAdvance your CareerAwardsLeadershipDean Arun MajumdarDeans OfficeAdmissions & EducationStudent ExperienceAdmissionsField LearningWrigley Field Program in HawaiiProfessional DevelopmentAcademic Professional ProgramThe PillarsFAQsEventsExecutive educationCareersK-12 OutreachGeokids ProgramGeokids FAQsYoung InvestigatorsPostdoctoral ResourcesThe SchoolDepartments & ProgramsEnvironmental Behavior SciencesGlobal Environmental PolicyOceansInstitutes & CentersSustainability AcceleratorThe challenge of scalingFirst-round Accelerator GrantsAccelerator Faculty Advisory CouncilShared Analytical Facilities & Research ResourcesIndustrial Affiliates ProgramsNews & EventsResearch NewsSchool HighlightsEventsHistoryGivingFoundational Launch PartnersFunding PrioritiesAnnual GivingNew FacultyStudent SupportInstitutes & InitiativesResearch GrantsMatching ProgramPlanned GivingWays to Give\nSearch\n\n\n\n\n\n\n\n\nMain content start\n\n\n\nSchool highlights\n\n\n\n\nStanford Doerr School of Sustainability launches with campus celebration\n\n\n\nThe school formally launched with more than 600 guests and speakers urging action on climate change and other sustainability challenges.\n\n\n\n\n\n \nSeptember 30, 2022\n\n\n\n                 |           \nDanielle Torrent Tucker\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudents, researchers, school leaders, and supporters gather on stage for the ceremonial garland-cutting on Sept. 29 at the Mitchell Earth Sciences Building. (Photo credit: Paul Sakuma)\n\n\n\n\n\n\n\n \nMore than 600 students, faculty, staff, and friends celebrated the launch of the Stanford Doerr School of Sustainability on Sept. 29 with invited speakers and about 100 protesters alike calling for the school to address climate change and other urgent challenges.\nAs inaugural dean Arun Majumdar addressed the audience, he noted the importance of hearing all voices supporting the future of the planet – especially those holding the school accountable for its actions.\n“If you put your ear to the ground and listen to what Mother Earth is saying, you will discover that it is a planet that is really protesting,” Majumdar said. “Mother Earth is begging us to restore the atmosphere, the oceans, and our biodiversity – for our own sake and for the sake of our children and grandchildren. The faculty and students here are translating Mother Earth's protest in a language that we all can understand.”\n\n\n\n\nMajumdar spoke about the global issues that worry him most, such as devastating droughts and floods, unbearable heat, and the inequitable displacement of people and animals in the wake of destruction. “We are playing Russian roulette with extreme climate events,” he said, referencing the opening line of an op-ed in The New York Times he wrote last year about the importance of developing early forecasting for climate hazards.\n“We are here to lock our arms together and make a pledge,” Majumdar said. “Our pledge is to use all the powers we have – the knowledge, the education, the talent, the innovation, the resources, the solutions, and our influence – to restore Mother Earth.”\nOn a nearby lawn, students and faculty held signs and chanted against fossil fuel funding for research.\nThe Stanford Doerr School of Sustainability officially opened Sept. 1, following four years of strategic planning and iterations through Stanford’s Long-Range Vision. It includes academic departments spanning all areas of scholarship that are needed to advance the long-term sustainability of the planet; institutes that bridge disciplines and bring multiple viewpoints to bear on urgent challenges; and a Sustainability Accelerator that drives new policy and technology solutions through a worldwide network of partners to develop solutions at a global scale.\nStanford President Marc Tessier-Lavigne, who affirmed the university’s commitment to sustainability and climate research through the school, remarked on how its structure takes advantage of Stanford’s strength across disciplines and interdisciplinary approach to advance deep fundamental discovery. \n\n \n\nCommunity members celebrate the Doerr School of Sustainability on Sept. 29. (Photo credit: Paul Sakuma)“The new school will amplify research and accelerate impact across multiple areas of scholarship, including the natural sciences, engineering, and the social sciences and humanities,” Tessier-Lavigne said. “This combination of deep scholarship to advance knowledge, paired with the focus and robust application of knowledge to develop solutions, has the potential to create solutions of the scale and magnitude that are needed for this very urgent moment.”\nAttendees also heard from Knight-Hennessy scholar Anela Arifi, a PhD student in the Emmett Interdisciplinary Program in Environment and Resources (E-IPER) and a Knight-Hennessy Fellow who grew up in Bosnia and Herzegovina amongst energy scarcity, poverty, and inequality. That personal experience led her to pursue research on scaling biofuel production in the aviation sector, she said.\n“I needed to become an engineer who not only understands the technology but also understands energy policies and prioritizes deeply engaging with frontline communities,” Arifi said. “Stanford was one of the very few institutions in the world that allowed me to pursue exactly this: An interdisciplinary PhD on producing bioenergy within the context of complex social-environmental systems and existing inequalities.”\nArifi acknowledged the future impact the school could make in these areas, and her hope that its “commitment to environmental justice will truly be reflected in Stanford's future scholarship.” \n“I also hope that the school will carefully listen to and proactively engage with all the voices highlighting the critical importance of partnerships with entities who are fully aligned with Stanford's vision for slashing emissions, and that it'll refuse funding from all those entities that undermine this big question,” she added.\nArifi’s comments were followed by those of John Doerr, the engineer and venture capitalist who invested $1.1 billion to the new school to accelerate solutions to the global climate crisis. Doerr, who also chairs Kleiner Perkins, shared the story of being catalyzed by his then 16-year-old daughter’s reaction to watching the movie “An Inconvenient Truth.”\n“With my partners at Kleiner Perkins, many of whom are here today, we set out to invest in climate solutions. We traveled around the world looking for scalable innovations,” Doerr said. “But whatever we've done is not enough. It's not nearly enough. Climate change is the greatest single issue facing humanity.”\nHe expressed hope and optimism around the potential impacts of the Doerr School of Sustainability, while also acknowledging the real challenges of inventing and scaling solutions that can help all the planet’s inhabitants.\n“This is not going to be easy; this is not some kind of green kumbaya party that we're having,” said Doerr, who authored bestsellers Measure What Matters and Speed & Scale: An Action Plan for Solving Our Climate Crisis Now. “It's a worldwide economic revolution.”Climate science could become the new computer science, he added.\nThe remarks were followed by a ceremonial garland-cutting by undergraduate students, graduate students, and a postdoctoral researcher. One of the participants, Christopher Noll, a senior majoring in geological sciences, expressed his confidence that leadership will improve cross-departmental collaborations that were historically siloed.\n“I’m excited about all the possibilities and the new majors coming into being – especially the focus on environmental justice,” said Noll, who was previously part of Stanford’s School of Earth, Energy & Environmental Sciences. “The new school has so much more involved with it – it’s a whole new experience.”\nDespite the enormity of the challenges ahead and the heated issues voiced by protestors, Doerr left attendees with a note of inspiration: to envision climate change as one of the greatest opportunities ever presented to mankind.\n“We have the chance to address longstanding inequities, to reinvent and strengthen our economy, to come together as a global community in ways that are unprecedented,” Doerr said. “That's what cleanly fuels our hopes – that together we just might save this amazing planet.”\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelated Topics\n\nSchool highlights\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nStay connected\nGet involved\nFollow us\nContact Us\nVisit Us\n\t \n\n\n\n\n\n\nFacebook\n\n\n\n\n\nLinkedIn\n\n\n\n\n\nTwitter\n\n\n\n\n\nInstagram\n\n\n\n\n\n\nQuick links\n\n\nAdmissions\n\n\nUpcoming events\n\n\nGive\n\n\nOpen staff positions\n\n\nOpen faculty positions\n\n\nIntranet\n\n\nLogin\n\n\nWebsite feedback\n\n\n\n\nLearn more\n\n\nDepartments and Programs\n\n\nStanford Woods Institute for the Environment\n\n\nPrecourt Institute for Energy\n\n\nSustainability Accelerator\n\n\nStanford land acknowledgement\n\n\n\n\n\nFeedback or questions?\nContact us at sustainability_initiative@stanford.edu\n\n\n\n\n\n\n\nStanfordUniversity\n\n\n\n\nStanford Home(link is external)\n\nMaps & Directions(link is external)\n\nSearch Stanford(link is external)\n\nEmergency Info(link is external)\n\n\n\nTerms of Use(link is external)\n\nPrivacy(link is external)\n\nCopyright(link is external)\n\nTrademarks(link is external)\n\nNon-Discrimination(link is external)\n\nAccessibility(link is external)\n\n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n \n\n\n\n  Back to Top\n\n\n\n\n",
    "links": [
        "#main-content",
        "#secondary-navigation",
        "https://stanford.edu",
        "https://sustainability.stanford.edu/",
        "/our-impact",
        "/our-impact/get-involved",
        "/our-impact/living-lab",
        "/un-cop-insights",
        "/our-community",
        "/our-community/faculty",
        "/our-community/faculty/faculty-forum-talks",
        "/our-community/community-spotlights",
        "/our-community/community-spotlights/exploring-identities-within-our-community",
        "/our-community/community-awards",
        "/our-community/dei",
        "/our-community/dei/about-our-dei-vision",
        "/our-community/dei/community-dei-resources",
        "/our-community/dei/dei-library",
        "/our-community/dei/community-dei-resources/prospective-students",
        "/our-community/dei/community-dei-resources/current-students",
        "/our-community/dei/faculty-staff-resources",
        "/our-community/dei/excellence-dei-awards",
        "/our-community/dei/meet-dei-team",
        "/our-community/dei/surge",
        "/our-community/dei/surge/program-details",
        "/our-community/dei/surge/surge-faqs",
        "/our-community/dei/land-acknowledgment",
        "/our-community/dei/dei-events",
        "/alumni",
        "/alumni/events",
        "/alumni/events/all-alumni-events",
        "/alumni/get-involved",
        "/alumni/career-education",
        "/alumni/awards",
        "/our-community/leadership",
        "/our-community/leadership/dean-arun-majumdar",
        "/our-community/deans-office",
        "/admissions-and-education",
        "/our-community/student-experience",
        "/admissions",
        "/admissions-education/field-learning",
        "https://earth.stanford.edu/hawaii/",
        "/admissions-education/professional-development",
        "/admissions-education/professional-development/academic-professional-program",
        "/admissions-education/professional-development/academic-professional-program/pillars",
        "/admissions-education/professional-development/academic-professional-program/faqs",
        "/admissions-education/professional-development/professional-development-events",
        "/admissions-and-education/executive-education",
        "/admissions-education/careers",
        "/admissions-education/k-12-outreach",
        "/admissions-education/k-12-outreach/geokids",
        "/admissions-education/k-12-outreach/geokids/geokids-faqs",
        "/admissions-education/k-12-outreach/young-investigators",
        "/our-community/dei/postdoctoral-resources",
        "/about-school",
        "/school/departments",
        "/school/departments/environmental-behavioral-sciences",
        "/school/departments/global-environmental-policy",
        "/school/departments/oceans",
        "/about-school/institutes-and-centers",
        "/school/sustainability-accelerator",
        "/school/sustainability-accelerator/challenge-scaling",
        "/school/sustainability-accelerator/first-round-accelerator-grants",
        "/school/sustainability-accelerator/accelerator-faculty-advisory-council",
        "/school/shared-analytical-facilities-and-research-resources",
        "/school/industrial-affiliate-programs",
        "/about-school/news-and-events",
        "https://earth.stanford.edu/earth-matters#gs.9nc9hp",
        "/about-school/news-and-events/school-highlights",
        "/events",
        "/history",
        "/giving",
        "/giving/foundational-launch-partners",
        "/giving/funding-priorities",
        "/giving/annual-giving",
        "/giving/faculty",
        "/giving/students",
        "/giving/institutes",
        "/giving/research",
        "/giving/matching-program",
        "/giving/planned-giving",
        "/giving/ways-to-give",
        "/search",
        "/news/school-highlights",
        "https://www.nytimes.com/2021/02/25/opinion/weather-forecast-climate-change.html",
        "https://sustainability.stanford.edu",
        "https://ourvision.stanford.edu",
        "https://sustainability.stanford.edu/news/sustainability-accelerator-brings-people-policy-fast-track-real-world-solutions",
        "https://earth.stanford.edu/eiper",
        "https://news.stanford.edu/2022/05/04/stanford-doerr-school-sustainability-universitys-first-new-school-70-years-will-accelerate-solutions-global-climate-crisis/",
        "/news/school-highlights",
        "https://sustainability.stanford.edu/",
        "/our-impact/get-involved",
        "/follow-us",
        "/node/471",
        "/node/2411",
        "https://www.facebook.com/stanforddoerr/",
        "https://www.linkedin.com/company/stanford-school-of-sustainability/",
        "https://www.twitter.com/stanforddoerr/",
        "https://www.instagram.com/stanford.doerr/",
        "/academics",
        "/alumni/events",
        "/giving/funding-priorities",
        "https://careersearch.stanford.edu/jobs/search/10032490",
        "https://facultypositions.stanford.edu/en-us/filter/?job-mail-subscribe-privacy=agree&search-keyword=&category=doerr%20school%20of%20sustainability",
        "https://insidesdss.stanford.edu/",
        "/saml_login",
        "https://stanford.service-now.com/it_services?id=sc_cat_item&sys_id=676f7ee513286b40d3b6b3b12244b0e5",
        "/school/departments",
        "https://woods.stanford.edu",
        "https://energy.stanford.edu",
        "/school/sustainability-accelerator",
        "https://www.stanford.edu/native-peoples-relationship/",
        "mailto:sustainability_initiative@stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}