{
    "title": "About the President – Office of the President – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Office of the President\n\t\t\t    \n                            PRES Menu\n                        Show search box.Office of the PresidentAbout the PresidentUniversity LeadershipExecutive MemorandumPresidential CommunicationsResourcesSpace AllocationCSU Executive OrdersContact UsContact UsRequest Presidential AppearancePresidential SearchOffice of the PresidentAbout the PresidentUniversity LeadershipExecutive MemorandumPresidential CommunicationsResourcesSpace AllocationCSU Executive OrdersContact UsContact UsRequest Presidential AppearancePresidential Search\n        Our Office\n        Location Icon\n                                                                            Kendall Hall, Room 105\n                                                                530-898-5201Regular Hours\n                                                                            8 a.m.–5 p.m.\n                                                                \n                                                                                Monday–Friday\n                                                                    Mailing Address\n                                                                            Office of the President\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0150\n                                                                    Request Presidential AppearanceGive a GiftPRESCurrent page:  About the President\n                        \n    \t\tAbout the President\n    \tGayle E. Hutchinson has served as President of California State University, Chico since July 2016. An accomplished former professor and dean, she also held the position of provost and vice president for Academic Affairs at CSU, Channel Islands for three years from 2013-2016. She is Chico State’s 12th president and the first female president in the University's 134-year history.As President, Dr. Hutchinson has worked with the campus community to strengthen governance and promote equity, diversity, and inclusion in a community focused on academic excellence, innovation, accountability, trust, transparency, and respect. She successfully led the University through a strategic planning process, which resulted in three strategic priorities: Equity, Diversity, and Inclusion; Civic and Global Engagement; and Resilient and Sustainable Systems. Dr. Hutchinson and her team are now working on implementation of the Strategic Plan, Campus Physical Master Plan, and 2020 Climate Action and Resilience Plan.Dr. Hutchinson serves as the presidential liaison for the California State University Native American Initiative and on a number of other systemwide committees. In the broader educational community, she is on the NCAA Constitution Committee, the NCAA President’s Council and Executive Committee. She also recently became a member of the board of directors for the American Association of Colleges for Teacher Education.Beginning her career in higher education at Chico State, Dr. Hutchinson joined the faculty as an assistant professor in the Department of Kinesiology in 1990. She taught in the classroom for 17 years, earning tenure and the rank of full professor. She held a variety of instructional and leadership roles at the University, including project director for the Pacific Wellness Center, and the principal investigator and co-director of the Northern CA Physical Education-Health Subject Matter Project. She was elected Academic Senate chair in 2006 after serving as statewide senator from 2003-2005, and she chaired the Diversity Scorecard Committee responsible for drafting the University’s Diversity Action Plan. Hutchinson’s scholarship and grant writing focused on teacher socialization, social psychology of sport, comprehensive school-based wellness programs, and equity in sport and physical education.She holds a BS in physical education teacher education from the University of Massachusetts, Amherst; an MA in teaching analysis and curriculum development from Teachers College, Columbia University; and an EdD in teacher education and staff development from University of Massachusetts, Amherst. Office of the PresidentKendall Hall, Room 105530-898-5201president@csuchico.eduwww.csuchico.edu/presOther DivisionsAcademic AffairsBusiness and FinanceCalifornia Faculty Association(opens in new window)Information TechnologyStudent AffairsUniversity Advancement\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "about-the-president.shtml",
        "leadership/index.shtml",
        "em/index.shtml",
        "pres-messages/index.shtml",
        "resources/space-allocation.shtml",
        "resources/csu-executive-orders.shtml",
        "contact/index.shtml",
        "contact/request-presidential-appearance.shtml",
        "search/index.shtml",
        "index.shtml",
        "about-the-president.shtml",
        "leadership/index.shtml",
        "em/index.shtml",
        "pres-messages/index.shtml",
        "resources/space-allocation.shtml",
        "resources/csu-executive-orders.shtml",
        "contact/index.shtml",
        "contact/request-presidential-appearance.shtml",
        "search/index.shtml",
        "tel:530-898-5201",
        "contact/request-presidential-appearance.shtml",
        "https://securelb.imodules.com/s/1751/wide.aspx?sid=1751&gid=2&pgid=405&cid=1058",
        "index.shtml",
        "mailto:president@csuchico.edu",
        "index.shtml",
        "https://www.csuchico.edu/vpaa/",
        "https://www.csuchico.edu/vpbf/index.shtml",
        "https://www.calfac.org/csu-chico",
        "https://www.csuchico.edu/it/index.shtml",
        "https://www.csuchico.edu/sa/index.shtml",
        "https://www.csuchico.edu/advancement/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}