{
    "title": "Premium Web Hosting Services | Media Temple",
    "body": "AboutBlogCartLoginDomainsHostingSSLServicesSupportMenu Looking for new web hosting?We are no longer accepting new customers as we prepare to move current Media Temple customers to GoDaddy. Please visit GoDaddy to purchase new hosting products.To learn more about this change, please visit our Customer Migration FAQ page.HostingBuild your next project on premier solutions tuned to your needs.LEARN MOREExpertiseTrust that your project is hosted by a company that understands it.LEARN MORESupportReach out anytime. Weâ\u0080\u0099re here every hour, every day to help.LEARN MOREServicesEnhance your hosting plan with powerful tools and expert services.LEARN MOREFor Sites That Crave AttentionYour sites get the performance they deserve with Media Templeâ\u0080\u0099s new VPS hosting. Custom configure a server to your needsGET STARTEDExpertiseCampaignsDigital PublishingEcommercePresenceExpand your reach. Not your risk.So, your agency nabbed a massive new client, your creative is killer, and now you need a host that wonâ\u0080\u0099t crack under the pressure. Weâ\u0080\u0099ll get it done.Find out howComplex content. Quickly delivered.Your media site has troves of long-form articles and high-res images that need to be in visitorsâ\u0080\u0099 eyeballs fast. Thatâ\u0080\u0099s where we come in. Find out howConversion's bestÂ friend.The quest to vanquish cart abandonment starts with a powerful, secure, and flexible hosting solution for your self-hosted ecommerce platform.Find out howFirst impressions. Forever improved.Your brand is everything. Your site shows prospective clients that youâ\u0080\u0099re smart, quick, and trustworthy. And it helps if your web hosting is too. Find out howFrom the BlogShould I Care About SSLs?Short answer: Yes. The chances of people browsing your site are slim without an SSL certificate. Make sure you know about the different types of SSLs and how they protect your customers.READ MOREStep Forward with Plesk ObsidianPlesk has released the next big version of its popular, powerful control panel. Find out about the most notable updates and how to upgrade your VPS hosting.READ MORE3 Advances in Web Design, And Why We Embraced ThemA new cycle of trends and innovations are shaping the next generation of the web. We looked to them in redesigning our site â\u0080\u0093 and you may be looking at leveraging them yourself.READ MOREOur experts are here to help.We can help you:Find the right solution for your site.Break down pricing and options.Figure out what resources you need.Open a chat or give us a call at 310.841.5500 from 5 am to 7 pm Pacific Time.HostingManaged WordPressWordPress EcommerceShared HostingShared Hosting PlusSelf Managed VPSFully Managed VPSExpertiseCampaignsPresenceEcommercePublishingSupportSupport CenterSystem StatusKnowledge BaseStatement of SupportServicesAdvanced SupportDomainsSSL CertificatesMigrationCompanyAbout UsCareersContactResourcesBlogLegalPrivacyDo Not Sell My Personal InformationÂ© 1998 - 2022 MEDIA TEMPLEOur site uses cookies. By agreeing to use our site, you are agreeing to our cookie policy.Accept & Close",
    "links": [
        "/company/about",
        "/blog",
        "https://cart.mediatemple.net/",
        "https://ac.mediatemple.net/login.mt",
        "/",
        "/services/domains",
        "/webhosting",
        "/services/ssl",
        "/services",
        "/support",
        "https://www.godaddy.com",
        "/community/products/all/8884159911437/",
        "/webhosting",
        "/webhosting",
        "/expertise",
        "/expertise",
        "/support",
        "/support",
        "/services",
        "/services",
        "/webhosting/vps-hosting/managed",
        "/expertise/campaigns",
        "/expertise/digital-publishing",
        "/expertise/ecommerce",
        "/expertise/presence",
        "https://mediatemple.net/blog/web-development-tech/ssl-certificates/",
        "https://mediatemple.net/blog/tips/plesk-obsidian/",
        "https://mediatemple.net/blog/news/3-advances-web-design/",
        "tel:+13108415500",
        "/webhosting",
        "/webhosting/managed-wordpress",
        "/webhosting/wordpress-ecommerce",
        "/webhosting/shared-hosting",
        "/webhosting/shared-hosting-plus",
        "/webhosting/vps-hosting/managed",
        "/webhosting/vps-hosting/fully-managed",
        "/expertise",
        "/expertise/campaigns",
        "/expertise/presence",
        "/expertise/ecommerce",
        "/expertise/digital-publishing",
        "/support",
        "/support",
        "https://status.mediatemple.net/",
        "https://mediatemple.net/community/",
        "/legal/statement-of-support",
        "/services",
        "/services/advanced-support",
        "/services/domains",
        "/services/ssl",
        "/services/site-migration",
        "/company/about",
        "https://careers.godaddy.com/search-jobs",
        "/company/about#3130",
        "https://mediatemple.net/blog",
        "/legal",
        "/legal/privacy-policy",
        "/legal/cookie-policy",
        "/legal/cookie-policy/"
    ]
}