{
    "title": "Parents and Family | Bing Overseas Studies Programs",
    "body": "\n\n        Skip to main content\n      \n\n        Skip to secondary navigation\n      \n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\n\n\n\nUndergrad\n\n\n\n\n\n\n \nBing Overseas\nStudies Program\n\n\n\n\n\nSearch this site\n\nSubmit Search\n\n\nMenu\nGet StartedCompare All Study Away ProgramsFinancing Study AwayFrequently Asked Questions (FAQs)Explore ProgramsAustraliaAustralia HomeAustralia OverviewApproaching AustraliaKey DatesWhat I Did in AustraliaEmily BrieantKenny HuaPrerequisitesMeet the FacultyIndividual Research ProjectsSearch CoursesBerlinBerlin HomeBerlin OverviewApproaching BerlinKey DatesWhat I Did in BerlinCat FergesenStephen QueenerAndrew SleughRelated On-Campus CoursesLanguage PrerequisiteMeet the Berlin FacultyResearchInternshipsOverviewRequirements for ParticipationHow to ApplyApplication TimelineSelected Profiles of Past InternsReceiving Course CreditInternship FAQsContactPhoto GallerySearch CoursesCape TownCape Town HomeCape Town OverviewApproaching Cape TownKey DatesWhat I Did in Cape TownSarah GriffinAna De Almeida AmaralCape Town Organizational ProjectsMeet the FacultySearch CoursesFlorenceFlorence HomeAcademicsOn-Site RequirementsLearning Italian in FlorenceClasses at Local InstitutionsMeet Our InstructorsBenefits by MajorSearch CoursesKey DatesEngageActivitiesStudent LifeBOSP Florence GalleryFlorence Program HighlightsStudent Voices from FlorenceGabby CrooksFahad NabiIsabella SaraccoSou Min ShinBefore You GoFaculty VoicesRob Reich: Thoughts on FlorenceResources for BOSP Florence StudentsHong KongHong Kong HomeHong Kong OverviewApproaching Hong KongKey DatesWhat I Did in Hong KongMatthew NguyenCaroline WangMeet the Hong Kong FacultyResearch and InternshipsSearch CoursesIstanbulIstanbul HomeProgram OverviewWhat I Did in IstanbulAmaya MarionBailey NicolsonIstanbul Key DatesResearch and InternshipsSearch CoursesKyotoKyoto HomeWhy Study in Kyoto?OverviewRelated On-Campus CoursesHousing in KyotoKey DatesWhat I Did in KyotoBryant JimenezGrace LeeJi Hong NiLanguage PrerequisiteMeet the FacultySummer InternshipsInternships OverviewRecent Student ExperiencesRecent Host OrganizationsSearch CoursesKyoto (KCJS)MadridMadrid HomeMadrid OverviewApproaching MadridKey DatesWhat I Did in MadridLuis QuirogaEstefi Acuna LacarieriDeba ElaihoMadrid Language PrerequisiteMeet the Madrid FacultyResearch and InternshipsSearch CoursesNew YorkStanford in New York HomeAbout SiNYNewsletter - Autumn 2022Newsletter - Spring 2022Faculty and StaffRosina S. MillerMohammed BadiEmily BellMatt BoggieJonathan BronsonRichard GowanDanielle JacksonJoshua Jelly-SchapiroKay KostopoulosChiseche MibengeMark OldmanJulie OrringerJames S. RussellInternships Placement GuideWhat I Did in New YorkTanner ChristensenMikaela OrtegaFrequently Asked Questions (FAQs)Apply for SiNYKey DatesThe New York City SeminarAutumn Quarter on the Arts, Architecture, Design, and Urban StudiesThe New York City SeminarThe Agile CityPerforming New YorkAutumn Quarter InternshipsWalking New York CityWriting in the CityWinter Quarter on Media, Business, and FinanceThe New York City SeminarBusiness Innovation and Technology for Social ChangeFinance in New YorkImaging Change: Global Arts and Social ChangeIngenious EntrepreneurshipTrust and MediaWinter Quarter InternshipsSpring Quarter: The Global CityThe New York City SeminarBusiness Innovation and Technology for Social ChangeDesign for Extreme Scalability: An Introduction to Health Media InnovationMaking Noise in New York: Experimental Sound Art in History and PracticePractical BusinessSafe Cities: A Study of Institutional Responses to Gender Based Violence in the Global CityThe UN in ActionSpring Quarter InternshipsGalleriesCall for ArtPrevious GalleriesStop. Motion. Stanford Artists Around New York.SiNY EventsSiNY Past Events ArchiveOxfordOxford HomeOxford OverviewRelated On-Campus CoursesApproaching OxfordKey DatesWhat I Did in OxfordSophie AndrewsAngela LiuBing TripsPrerequisitesTutorialsTutorial Choice OverviewHumanitiesEnglish Language and LiteratureMathematical, Physical, and Life SciencesMedical SciencesSocial SciencesMeet the FacultyResearch and InternshipsSearch CoursesParisParis HomeParis OverviewCoursework at Local Partner Institutions in ParisRelated On-Campus CoursesApproaching ParisParis Accommodations FAQsKey DatesPlanning Your Time in ParisParis Winter Program FAQsWhat I Did in ParisJean LaguerreMac SimpsonLanguage PrerequisiteMeet the Paris FacultyResearch and InternshipsSearch CoursesSantiagoSantiago HomeSantiago OverviewApproaching SantiagoKey DatesRelated On-Campus CoursesWhat I Did in SantiagoZiva Berkowitz KimmelKylie\tCreightonLanguage PrerequisiteMeet the FacultyVolunteering and Internship OpportunitiesSearch CoursesGlobal SeminarsGlobal Seminars HomeOverviewExplore Global SeminarsGovernance, Culture, and Innovation in OxfordThe Uttermost Part of the Earth: The Intersection of Nature and the Human Enterprise in Southernmost PatagoniaKangnam Style: South Korea’s Soft Power EmpireEngineering and Technology in IndiaBio-Cultural Diversity and Community-Based Conservation in OaxacaCommunity Health in OaxacaInterdisciplinary Introduction to African Urban StudiesIntroduction to Japan: History, Religion, CultureHealth and SafetyHow to ApplyGlobal Seminars (FAQs)Non-Stanford Study Abroad OpportunitiesNon-Stanford Study Abroad Opportunities HomeSearch CoursesAdvisingStudy Away AdvisingStudent AmbassadorsApplyApplication ProcessParticipation AgreementApplication PortalPreparePassports and VisasPassportsVisasExtensions and WithdrawalsHealth and SafetyStudy Away and COVID-19Health InsuranceHealth Planning and RisksSafetyRegistration and AcademicsAxess InstructionsStudent PoliciesTravel GuidelinesDiversity and IdentityQuestionsResourcesVote While AbroadParents and FamilyParents and Family FAQsTips for Parents and FamilyReturnRe-EntryFuture OpportunitiesBOSP Photo ContestBOSP Photo Contest Galleries2021-222019-202018-192017-182016-17TeachFaculty in ResidenceApply for Faculty in ResidenceFaculty HandbooksGlobal SeminarsApply to be a Faculty LeaderFaculty Leader Role and ResponsibilitiesAbout UsStanford Staff ListingStanford at The University of QueenslandStanford Program in BerlinStanford Program in Cape TownStanford Program in FlorenceStanford at The Chinese University of Hong KongStanford at Koç UniversityStanford Program in KyotoStanford Program in MadridStanford in New YorkStanford Program in OxfordStanford Program in ParisStanford Program in SantiagoAnnual ReportsAbroad Alumni NewsletterFaculty CommitteesSupport the Program\n\n\n\n\n\n\n\n\n\n\n\n\nParents and Family\n\n\n\n\n\n\n\nMain navigation\nSkip to main content\n\nSecondary Navigation\n\n            Passports and Visas\n                      \n            Extensions and Withdrawals\n                      \n            Health and Safety\n                      \n            Registration and Academics\n                      \n            Student Policies\n                      \n            Travel Guidelines\n                      \n            Diversity and Identity\n                      \n            Vote While Abroad\n                      \n            Parents and Family\n                      \n            Parents and Family FAQs\n                      \n            Tips for Parents and Family\n                      \n\n\n\n\nMain content start\n\n\n\n \n\n \nAs parents, you may have some questions about how the Bing Overseas Studies Program (BOSP) at Stanford helps and prepares your student to study abroad. However, due to the Family Educational Rights and Privacy Act of 1974 (FERPA), BOSP staff is prohibited from discussing individual student issues directly with parents and family.  Please encourage your student to communicate directly with our staff regarding your questions or concerns. That said, we put together an overview of the study abroad process, included some helpful links, and a few resources such as tips for parents and family to give you a better idea how you can best support your student before, during, and after he or she studies abroad.\nExploring BOSP Programs\nBOSP offers your student many study abroad opportunities including quarter length programs, overseas seminars, and internships. See our Study Abroad Overview to explore all of these opportunities. BOSP also provides study abroad advising for every BOSP program as well as other information such as Courses, Faculty-in-Residence,  Language Prerequisite FAQs, Internship Opportunities and Important Program Dates that students should consider before choosing a program.\nAll BOSP programs offer direct Stanford credit for courses.\nMany BOSP courses fulfill General Education Requirements and frequently count toward one or more majors.\nStanford Faculty-in-Residence teach abroad in most BOSP quarter length program.\nMany BOSP programs offer internship and service learning opportunities!\nTake Action: Help your student consider all of the opportunities BOSP offers and research them; there might be a “best-fit” program that he or she hadn’t even considered before.\nFinancing Study Abroad\nStanford is committed to providing undergraduates the opportunity to study abroad with BOSP, regardless of financial circumstances. To view a breakdown of the cost comparisons of a quarter studying abroad vs. a quarter on campus, and other financial resources visit Financing Study Abroad.\nRegular Stanford tuition applies.\nFinancial Aid continues and aid packages are automatically adjusted in accordance with differences in travel and personal expenses while abroad, taking into consideration a student’s inability to work while out of the country.\nTake action: Have your student contact the Financial Aid Office (FAO) to find out what financial assistance may be available.\nApplication Process\nStudents need to submit an application two quarters in advance for all programs (except for the Overseas Summer Seminars, which have an application deadline during Autumn Quarter).\nBOSP strongly encourages students to spend more than one quarter abroad, if possible. Students can apply to and participate in multiple quarter-length programs abroad. They can extend their quarter abroad to two or three quarters depending upon the program and quarter without reapplying.\nAdditional internship/research/course opportunities may be available\nHigher level of language fluency and cultural understanding\nExplore and immerse in a different culture and achieving language literacy\nGaining substantive understanding of other perspectives in the world that deepen a student's awareness of him/herself, his/her educational goals, and his/her own society.\nTake Action: Help your student consider the benefits of studying abroad for two quarters.\nBOSP Preparing Students and Setting Expectations\nStanford University believes that students are ultimately responsible for preparing themselves to study abroad and for making the most of their time overseas. This responsibility encompasses but is not limited to:\nA wide range of mandatory participation requirements:\nComplete and pass the minimum language or academic prerequisite prior to the first day of the quarter in an overseas program or the arrival date for an Overseas Seminar, Other Programs (this does not include non-Stanford study abroad programs), and/or our Consortium Programs.\nBe in good academic standing prior to the first day of the start of the overseas program.\nSubmit all required materials by the deadline established by the Bing Overseas Studies Program.\nPolicies and Standards:\nUpholding Stanford University policies, rules and regulations, and meeting academic requirements.\nCompleting all the necessary steps to obtain a visa (if required) in a timely manner and responsible for associated costs and for complying with the terms of the visa.\nObtaining and maintaining health insurance coverage equal to or greater than that offered by the Stanford Cardinal Care plan.  Said coverage shall, at a minimum, include coverage for medical care and treatment outside the United States and coverage for both medical evacuation and repatriation of remains.\nShould the policies and standards not be upheld by the student, the student MUST provide timely notice OR at the sole discretion of the Bing Overseas Studies Program after providing timely notice,  they may be (involuntarily) withdrawn from the program and subject to late withdrawal penalties. This is to ensure fairness to all students on the program and program waitlist.\nTake Action: Help support your student prepare for studying abroad by coming up with a communication plan together. See our Tips for Parents and Family page to get started.\nReturning to Stanford\nReturning to Stanford after studying abroad can be challenging for your student who might have trouble re-adjusting to campus life and re-assimilating into American culture. After studying abroad, your student might have different goals, academic or career plans. They might also want to consider taking advantage of other opportunities at Stanford or abroad and/or become an active part of BOSP's growing alumni network.\nThere are important steps your student will need to take before he or she returns to Stanford: enrollment in axess, housing and dining, university billing and financial aid. For more information, see our Before You Return page.\nRe-entry shock and other difficulties re-adjusting to campus are challenges your student might face. Read about Re-entry and how a student might prepare him or herself to return and transition back to campus.\nReturning students often apply for scholarship and fellowships and take advantage of many Future Opportunities abroad, including research, working, studying, teaching, and volunteering.\nYour student can stay connected as an alum to his or her study abroad experience by reading about exciting program updates and changes in our Abroad Alumni Newsletter.\nTake Action: You can play a very positive role in your student's transition back to campus by taking a personal interest in actively listening and learning about his or her abroad experience abroad.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n \nBing Overseas\nStudies Program\n\n\n\nWeb Login\n\n\n\nAddress\n\nBing Overseas Studies Program\nSweet Hall, Ground Floor\n590 Escondido Mall\nStanford, CA 94305-3089\nUnited States\n\n\n\nVisit\n\n\nCampus Map\n\n\nContact Us\n\n\n\n\n\n\nBOSP Facebook\n\n\n\n\n\nBOSP Instagram\n\n\n\n\n\nBOSP Twitter\n\n\n\n\n\nBOSP Youtube\n\n\n\n\n\n\nQuick Links\n\n\nAbout Us and Program Center Contacts\n\n\nStaff Listing for BOSP at Stanford\n\n\nStudent Ambassadors\n\n\nStanford Undergrad\n\n\n\n\n\n\nSubscribe to BOSP's mailing list to receive more information about programs, application deadlines, and events.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nVPUE\n\nVice Provost for Undergraduate Education\n\n\n\n\nStanford Undergrad is your guide to undergraduate academics and opportunities found within the Vice Provost for Undergraduate Education.\n\n\n\nSweet Hall\n590 Escondido Mall\nStanford, CA 94305\nmap\n\nConnect with us!\n\n\n\n\nTwitter\n\n\n\n\n\nStanford Facebook\n\n\n\n\n\nStanford Instagram\n\n\n\n\n\nYoutube\n\n\n\n\n\n\n\nNeed help?\nvpue@stanford.edu\n(650)723-4463\n\nMore to Explore\n\nAcademic Advising\nResearch and Independent Projects\nTutoring and Support\nFor Faculty / Staff\n\nVPUE Units\n\nAcademic Advising\nBing Overseas Studies Programs\nCenter for Teaching and Learning\nHaas Center for Public Service\nProgram in Writing and Rhetoric\nStanford Introductory Studies\nVice Provost’s Office\n\n\n\nVPUE Programs\n\nApproaching Stanford (APSU)\nArts Intensive (AI)\nBing Honors College (BHC)\nBing Overseas Studies Programs (BOSP)\nCardinal Service\nCivic, Liberal, and Global Education (COLLEGE)\nEducation as Self-Fashioning (ESF)\nFrosh 101 / Transfer 101\nHume Center for Writing and Speaking\nIntroductory Seminars (IntroSems)\nITALIC: Immersion in the Arts\nLeland Scholars Program (LSP)\nNew Student Orientation (NSO)\nOral Communication Program\nProgram in Writing and Rhetoric (PWR)\nSophomore College (SoCo)\nStructured Liberal Education (SLE)\nStudent Learning Programs\nSummer Bridge Programs\nSummer Fellows Program (SSFP)\nResearch and Independent Projects\nWays of Thinking / Ways of Doing (WAYS)\n\n\n\n\n\n\n\nStanfordUniversity\n\n\n\n\nStanford Home(link is external)\n\nMaps & Directions(link is external)\n\nSearch Stanford(link is external)\n\nEmergency Info(link is external)\n\n\n\nTerms of Use(link is external)\n\nPrivacy(link is external)\n\nCopyright(link is external)\n\nTrademarks(link is external)\n\nNon-Discrimination(link is external)\n\nAccessibility(link is external)\n\n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n \n\n\n  Back to Top\n\n\n\n\n",
    "links": [
        "#main-content",
        "#secondary-navigation",
        "https://bosp.stanford.edu/",
        "/get-started",
        "/get-started/overview/compare-programs",
        "/get-started/overview/financing-study-away",
        "/advising/bosp-faqs",
        "/explore-programs",
        "/explore/australia",
        "/explore/australia",
        "/explore/australia/overview",
        "/explore/australia/overview/approaching-australia",
        "/explore/australia/overview/key-dates",
        "/explore/australia/overview/what-i-did-australia",
        "/explore/australia/overview/what-i-did-australia/emily-brieant",
        "/explore/australia/overview/what-i-did-australia/kenny-hua",
        "/explore/australia/prerequisites",
        "/explore/australia/faculty",
        "/explore/australia/individual-research-projects",
        "/explore/search-courses",
        "/explore-programs/berlin",
        "/explore/berlin",
        "/explore/berlin/overview",
        "/explore/berlin/overview/approaching-berlin",
        "/explore/berlin/overview/key-dates",
        "/explore/berlin/overview/what-i-did-in-berlin",
        "/explore/berlin/overview/what-i-did-in-berlin/cat-fergesen",
        "/explore/berlin/overview/what-i-did-berlin/stephen-queener",
        "/explore/berlin/overview/what-i-did-berlin/andrew-sleugh",
        "/explore/berlin/overview/related-courses",
        "/explore/berlin/language-prerequisite",
        "/explore/berlin/meet-faculty",
        "/explore/berlin/research",
        "/explore/berlin/internships",
        "/explore/berlin/internships/overview",
        "/explore/berlin/internships/requirements-participation",
        "/explore/berlin/internships/how-to-apply",
        "/explore/berlin/internships/krupp-application-timeline",
        "/explore/berlin/internships/past-interns",
        "/explore/berlin/internships/course-credit",
        "/explore/berlin/internships/faqs",
        "/explore/internships/coordinator-contact",
        "/explore/berlin/internships/photo-gallery",
        "/explore/search-courses",
        "/explore/cape-town",
        "/explore/cape-town",
        "/explore/cape-town/overview",
        "/explore/cape-town/overview/approaching-cape-town",
        "/explore/cape-town/overview/key-dates",
        "/explore/cape-town/overview/what-i-did-in-cape-town",
        "/explore/cape-town/overview/what-i-did-in-cape-town/sarah-griffin",
        "/explore/cape-town/overview/what-i-did-in-cape-town/ana-de-almeida-amaral",
        "/explore/cape-town/overview/organizational-projects",
        "/explore/cape-town/faculty",
        "/explore/search-courses",
        "/explore-programs/florence",
        "/explore-programs/florence",
        "/explore/florence/academics",
        "/explore/florence/academics/on-site-requirements",
        "/explore/florence/academics/learning-italian-florence",
        "/explore/florence/academics/classes-local-institutions",
        "/explore/florence/academics/meet-instructors",
        "/explore/florence/academics/benefits-by-major",
        "/explore/search-courses",
        "/explore/florence/key-dates",
        "/explore/florence/engage",
        "/explore/florence/engage/activities",
        "/explore/florence/engage/student-life",
        "/explore/florence/engage/bosp-florence-gallery",
        "/explore/florence/highlights",
        "/explore/florence/student-voices",
        "/explore/florence/student-voices/gabby-crooks",
        "/explore/florence/student-voices/fahad-nabi",
        "/explore/florence/student-voices/isabella-saracco",
        "/explore/florence/student-voices/sou-min-shin",
        "/explore/florence/student-voices/before-you-go",
        "/explore/florence/faculty-voices",
        "/explore/florence/faculty-voices/rob-reich",
        "/explore/florence/resources",
        "/explore-programs/hong-kong",
        "/explore-programs/hong-kong",
        "/explore/hong-kong/overview",
        "/explore/hong-kong/overview/approaching",
        "/explore/hong-kong/overview/key-dates",
        "/explore/hong-kong/overview/what-i-did-hong-kong",
        "/explore/hong-kong/overview/what-i-did-hong-kong/matthew-nguyen",
        "/explore/hong-kong/overview/what-i-did-hong-kong/caroline-wang",
        "/explore/hong-kong/faculty",
        "/explore/hong-kong/research-internships",
        "/explore/search-courses",
        "/explore/istanbul",
        "/explore/istanbul",
        "/explore/istanbul/overview",
        "/explore/istanbul/overview/what-i-did-in-istanbul",
        "/explore/istanbul/overview/what-i-did-in-istanbul/amaya-marion",
        "/explore/istanbul/overview/what-i-did-in-istanbul/bailey-nicolson",
        "/explore/istanbul/overview/key-dates",
        "/explore/istanbul/research-internships",
        "/explore/search-courses",
        "/explore/kyoto",
        "/explore/kyoto",
        "/explore/kyoto/why-study-in-kyoto",
        "/explore/kyoto/overview",
        "/explore/kyoto/overview/related-courses",
        "/explore/kyoto/overview/housing-kyoto",
        "/explore/kyoto/overview/key-dates",
        "/explore/kyoto/overview/what-i-did-kyoto",
        "/explore/kyoto/overview/what-i-did-kyoto/bryant-jimenez",
        "/explore/kyoto/overview/what-i-did-kyoto/grace-lee",
        "/explore/kyoto/overview/what-i-did-kyoto/ji-hong-ni",
        "/explore/kyoto/language-prerequisite",
        "/explore/kyoto/meet-faculty",
        "/explore/kyoto/summer-internships",
        "/explore/kyoto/summer-internships/overview",
        "/explore/kyoto/summer-internships/recent-student-experiences",
        "/explore/kyoto/summer-internships/recent-host-organizations",
        "/explore/search-courses",
        "/explore-programs/kyoto-kcjs",
        "/explore-programs/madrid",
        "/explore-programs/madrid",
        "/explore/madrid/overview",
        "/explore/madrid/overview/approaching-madrid",
        "/explore/madrid/overview/key-dates",
        "/explore/madrid/overview/what-i-did-in-madrid",
        "/get-started/explore-programs/madrid/madrid-overview/what-i-did-madrid/luis-quiroga",
        "/explore/madrid/overview/what-i-did-in-madrid/estefi-acuna-lacarieri",
        "/explore/madrid/overview/what-i-did-in-madrid/deba-elaiho",
        "/explore/madrid/language-prerequisite",
        "/explore/madrid/meet-faculty",
        "/explore/madrid/research-internships",
        "https://bosp.sites.stanford.edu/explore/search-courses",
        "/explore-programs/stanford-new-york",
        "/explore-programs/stanford-new-york",
        "/explore/new-york/about",
        "/explore/new-york/about/newsletter-autumn-2022",
        "/explore/new-york/about/newsletter-spring-2022",
        "/explore/new-york/about/faculty-staff",
        "/explore/new-york/about/faculty-staff/rosina-miller",
        "/explore/new-york/about/faculty-staff/mohammed-badi",
        "/explore/new-york/about/faculty-staff/emily-bell",
        "/explore/new-york/about/faculty-staff/matt-boggie",
        "/explore/new-york/about/faculty-staff/jonathan-bronson",
        "/explore/new-york/about/faculty-staff/richard-gowan",
        "/explore/new-york/about/faculty-staff/danielle-jackson",
        "/explore/new-york/about/faculty-staff/joshua-jelly-schapiro",
        "/explore/new-york/about/faculty-staff/kay-kostopoulos",
        "/explore/new-york/about/faculty-staff/chiseche-mibenge",
        "/explore/new-york/about/faculty-staff/mark-oldman",
        "/explore/new-york/about/faculty-staff/julie-orringer",
        "/explore/new-york/about/faculty-staff/james-s-russell",
        "/explore/new-york/about/internships-placement-guide",
        "/explore/new-york/about/what-i-did-in-new-york",
        "/explore/new-york/about/what-i-did-in-new-york/tanner-christensen",
        "/explore/new-york/about/what-i-did-in-new-york/mikaela-ortega",
        "/explore/new-york/about/siny-faqs",
        "/explore/new-york/apply",
        "/explore/new-york/apply/siny-program-dates-deadlines",
        "/explore/new-york/new-york-city-seminar",
        "/explore/new-york/autumn-quarter",
        "/explore/new-york/new-york-city-seminar",
        "/explore/new-york/autumn-quarter/agile-city",
        "/explore/new-york/autumn-quarter/performing-new-york",
        "/explore/new-york/autumn-quarter/internships",
        "/explore/new-york/autumn-quarter/walking-new-york-city",
        "/explore/new-york/course/writing-in-the-city",
        "/explore/new-york/winter-quarter",
        "/explore/new-york/new-york-city-seminar",
        "/explore/new-york/winter-quarter/business-innovation-and-technology-social-change",
        "/explore/new-york/winter-quarter/finance-in-new-york",
        "/explore/new-york/winter-quarter/imaging-change",
        "/explore/new-york/winter-quarter/ingenious-entrepreneurship",
        "/explore/new-york/winter-quarter/trust-and-media",
        "/explore/new-york/winter-quarter/internships",
        "/explore/new-york/spring-quarter",
        "/explore/new-york/new-york-city-seminar",
        "/explore/new-york/winter-quarter/business-innovation-and-technology-social-change",
        "/explore/new-york/spring-quarter/design-extreme-scalability-introduction-global-communication-and",
        "/explore/new-york/spring-quarter/making-noise-new-york-experimental-sound-art-history-and-practice",
        "/explore/new-york/spring-quarter/practical-business",
        "/explore/new-york/spring-quarter/safe-cities",
        "/explore/new-york/spring-quarter/un-in-action",
        "/explore/new-york/spring-quarter/internships",
        "/explore/new-york/galleries",
        "/explore/new-york/galleries/call-bipoc-art",
        "/explore/new-york/galleries/previous-galleries",
        "/explore/new-york/galleries/stop-motion",
        "/explore-programs/stanford-new-york/stanford-new-york-events",
        "/explore/new-york/past-events-archive",
        "/explore-programs/oxford",
        "/explore-programs/oxford",
        "/explore/oxford/overview",
        "/explore/oxford/overview/related-on-campus-courses",
        "/explore/oxford/overview/approaching",
        "/explore/oxford/overview/key-dates",
        "/explore/oxford/overview/what-i-did-in-oxford",
        "/explore/oxford/overview/what-i-did-in-oxford/sophie-andrews",
        "/explore/oxford/overview/what-i-did-in-oxford/angela-liu",
        "/explore/oxford/overview/bing-trips",
        "/explore/oxford/overview/prerequisites",
        "/explore/oxford/tutorials",
        "/explore/oxford/tutorials/choice-overview",
        "/explore/oxford/tutorials/humanities",
        "/explore/oxford/tutorials/humanities/english",
        "/explore/oxford/tutorials/mathematical-physical-life-sciences",
        "/explore/oxford/tutorials/medical-sciences",
        "/explore/oxford/tutorials/social-sciences",
        "/explore/oxford/meet-faculty",
        "/explore/oxford/research-internships",
        "/explore/search-courses",
        "/explore-programs/paris",
        "/explore-programs/paris",
        "/explore/paris/overview",
        "/explore/paris/overview/coursework-local-partners-paris",
        "/explore/paris/overview/related-on-campus-courses",
        "/explore/paris/approaching",
        "/explore/paris/approaching/accommodations-faqs",
        "/explore/paris/key-dates",
        "/explore/paris/planning-time",
        "/explore/paris/planning-time/winter-faqs",
        "/explore/paris/what-i-did-in-paris",
        "/explore/paris/what-i-did-in-paris/jean-laguerre",
        "/explore/paris/what-i-did-in-paris/mac-simpson",
        "/explore/paris/language-prerequisite",
        "/explore/paris/meet-the-faculty",
        "/explore/paris/research-internships",
        "/explore/search-courses",
        "/explore/santiago",
        "/explore/santiago",
        "/explore/santiago/overview",
        "/explore/santiago/overview/approaching-santiago",
        "/explore/santiago/overview/key-dates",
        "/explore/santiago/overview/related-courses",
        "/explore/santiago/overview/what-i-did-in-santiago",
        "/explore/santiago/overview/what-i-did-in-santiago/ziva-berkowitz-kimmel",
        "/explore/santiago/overview/what-i-did-in-santiago/kylie-creighton",
        "/explore/santiago/language-prerequisite",
        "/explore/santiago/meet-faculty",
        "/explore/santiago/volunteering-internship-opportunities",
        "/explore/search-courses",
        "/explore/globalseminars/home",
        "/explore/globalseminars/home",
        "/explore/short-term-programs/overview",
        "/explore/short-term-programs/explore",
        "/explore/short-term-programs/explore/governance-culture-and-innovation-oxford",
        "/explore/short-term-programs/explore/uttermost-part-earth-intersection-nature-and-human-enterprise",
        "/explore/short-term-programs/explore/kangnam-style-south-koreas-soft-power-empire",
        "/explore/short-term-programs/explore/engineering-and-technology-india",
        "/explore/short-term-programs/bio-cultural-diversity-oaxaca",
        "/explore/short-term-programs/community-health-oaxaca",
        "/explore/short-term-programs/interdisciplinary-intro-african-urban-studies",
        "/explore/short-term-programs/japan-china-early-modern-world",
        "/explore/short-term-programs/health-safety",
        "/explore/short-term-programs/how-to-apply",
        "/explore/short-term-programs/faqs",
        "/explore-programs/non-stanford-study-abroad-opportunities",
        "/explore-programs/non-stanford-study-abroad-opportunities",
        "/explore/search-courses",
        "/advising",
        "/advising",
        "/advising/student-ambassadors",
        "/apply",
        "/apply/application-process",
        "/apply/participation-agreement",
        "https://bospapp.stanford.edu/",
        "/prepare",
        "/prepare/passports-and-visas",
        "/prepare/passports-visas/passports",
        "/prepare/passports-visas/visas",
        "/prepare/extensions-withdrawals",
        "/prepare/health-safety",
        "/bosp-covid-19-updates",
        "/prepare/health-safety/health-insurance",
        "/prepare/health-safety/health-planning-risks",
        "/prepare/health-safety/safety",
        "/prepare/registration-academics",
        "/prepare/registration-academics/axess-instructions",
        "/prepare/student-policies",
        "/prepare/travel-guidelines",
        "/prepare/diversity-identity",
        "/prepare/diversity-identity/questions",
        "/prepare/diversity-identity/resources",
        "/prepare/vote-while-abroad",
        "/prepare/parents-family",
        "/prepare/parents-family/faqs",
        "/prepare/parents-family/tips",
        "/return",
        "/return/re-entry",
        "/return/future-opportunities",
        "/bosp-photo-contest",
        "/bosp-photo-contest/galleries",
        "/bosp-photo-contest/galleries/2021-22",
        "/bosp-photo-contest/galleries/2019-20",
        "/bosp-photo-contest/galleries/2018-19",
        "/bosp-photo-contest/galleries/2017-18",
        "/bosp-photo-contest/galleries/2016-17",
        "/teach",
        "/teach/faculty-residence",
        "/teach/faculty-residence/apply",
        "/teach/faculty-residence/faculty-handbooks",
        "/teach/short-term-faculty-led-programs",
        "/teach/short-term-faculty-led-programs/apply",
        "/teach/faculty-residence/faculty-leader-role",
        "/about-us",
        "/about-us/stanford-staff-listing",
        "/about-us/australia",
        "/about-us/berlin",
        "/about-us/cape-town",
        "/about-us/florence",
        "/about-us/hong-kong",
        "/about-us/stanford-koc-university",
        "/about-us/kyoto",
        "/about-us/madrid",
        "/about-us/new-york",
        "/about-us/oxford",
        "/about-us/paris",
        "/about-us/santiago",
        "/about-us/annual-reports",
        "/about-us/bosp-history",
        "/about-us/faculty-committees",
        "/about-us/support-program",
        "#main-content",
        "/prepare/passports-and-visas",
        "/prepare/extensions-withdrawals",
        "/prepare/health-safety",
        "/prepare/registration-academics",
        "/prepare/student-policies",
        "/prepare/travel-guidelines",
        "/prepare/diversity-identity",
        "/prepare/vote-while-abroad",
        "/prepare/parents-family",
        "/prepare/parents-family/faqs",
        "/prepare/parents-family/tips",
        "https://www2.ed.gov/policy/gen/guid/fpco/ferpa/index.html",
        "/prepare/parents-family/tips",
        "/get-started/overview",
        "/advising",
        "/explore/search-courses",
        "https://stanford.app.box.com/s/qv9pjg5yy23l2qtsvh6q",
        "/get-started/overview/language-prerequisite-faqs",
        "https://bosp.sites.stanford.edu/get-started/overview/select-program-by-internship-opportunities",
        "/get-started/overview/financing-study-away",
        "http://www.stanford.edu/dept/finaid/contact/index.html",
        "/prepare/parents-family/tips",
        "/return",
        "/return/re-entry",
        "/return/future-opportunities",
        "/about-us/bosp-history",
        "https://bosp.stanford.edu/",
        "/saml_login",
        "http://stanford.edu/",
        "https://campus-map.stanford.edu/",
        "https://bosp.sites.stanford.edu/about-us",
        "https://www.facebook.com/StanfordBOSP",
        "https://www.instagram.com/stanfordbosp",
        "http://twitter.com/stanfordbosp",
        "http://youtube.com/StanfordBOSP",
        "/about-us",
        "/about-us/stanford-staff-listing",
        "/advising/student-ambassadors",
        "https://undergrad.stanford.edu",
        "http://vpue.stanford.edu/",
        "http://vpue.stanford.edu/",
        "https://www.google.com/maps/place/Sweet+Hall+(AIR),+590+Escondido+Mall,+Stanford,+CA+94305/@37.425208,-122.166616,16z/data=!4m5!3m4!1s0x808fbad6e630d36f:0x217fdab2330861cf!8m2!3d37.4252082!4d-122.1666157?hl=en-US",
        "https://twitter.com/StanfordVPUE",
        "https://www.facebook.com/stanford/",
        "https://www.instagram.com/stanford_vpue",
        "https://www.youtube.com/channel/UCNAz7OoWHquLxR6AUZTL5Mw",
        "mailto:vpue@stanford.edu",
        "tel:(650)723-4463",
        "https://advising.stanford.edu",
        "https://undergradresearch.stanford.edu",
        "https://undergrad.stanford.edu/tutoring-support",
        "https://vpuefacstaff.stanford.edu",
        "https://advising.stanford.edu/",
        "https://bosp.stanford.edu/",
        "https://ctl.stanford.edu/",
        "https://haas.stanford.edu/",
        "https://pwr.stanford.edu",
        "https://sis.stanford.edu/",
        "https://undergrad.stanford.edu/about-vpue/meet-vice-provost",
        "https://approaching.stanford.edu/",
        "https://artsintensive.stanford.edu/",
        "https://undergrad.stanford.edu/programs/bing-honors-college",
        "https://bosp.stanford.edu/",
        "https://cardinalservice.stanford.edu/",
        "https://college.stanford.edu/",
        "https://sis.stanford.edu/education-self-fashioning-esf",
        "https://frosh101.stanford.edu/",
        "https://hume.stanford.edu/",
        "https://introsems.stanford.edu/",
        "https://italic.stanford.edu/",
        "https://lelandscholars.stanford.edu/",
        "https://orientation.stanford.edu/",
        "https://undergrad.stanford.edu/programs/oral-communication-program",
        "https://pwr.stanford.edu/",
        "https://soco.stanford.edu/",
        "http://sle.stanford.edu/",
        "https://studentlearning.stanford.edu/",
        "https://undergrad.stanford.edu/programs/summer-bridge",
        "https://summerfellows.stanford.edu",
        "https://undergradresearch.stanford.edu/",
        "https://ways.stanford.edu/",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://bulletin.stanford.edu/pages/c7vDgeOuJIfpZe8GKmW3/",
        "https://www.stanford.edu/site/accessibility"
    ]
}