{
    "title": "Cosmic Archaeology Forward | Chapman Newsroom",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nFind information for\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\n\nDegrees\n\n                & Programs\nMaps &\n\n                Directions\nAll Directories\nNews\nEvents\n\nSocial\n\n\n\n\n\n\n\nfacebook\n\n\n\n\n\n\n\ntwitter\n\n\n\n\n\n\n\npinterest\n\n\n\n\n\n\n\ninstagram\n\n\n\n\n\n\n\n\n\nyoutube\n\n\n\n\n\n\n\nlinkedin\n\n\n\n\n\n\n\n\n\nsnapchat\n\n\n\n\n\n\n\ntumblr\n\n\n\n\n\n\n\nitunes\n\n\n\n\n\n\nSocial hub\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\nNewsroom\n\n\n\n\n\n\n\n\nTopics\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind\n\n\n\n\n\n\n\n\n\n\nLog in\n\n\n\n\n\n\n\n\n\n\n                    Login\n\n                  \n\n\n\n\ncanva icon\n\n\nCanvas\n\n\n\n\n\n\n\n\n\n\n\n\n\nHandshake\n\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty & staff) \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n              Chapman University\n\n            \n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nChapman Newsroom\nMain Menu >\n\n\nTopics\n\n\nToggle\n\n\n\n\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\n\nToggle\n\n\n\n\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\nMain Menu\n< Chapman Newsroom \n\n\n\nAbout\n\n\n\nToggle About\n\n\n\n\n\nMaps & Directions\nVisit Chapman\nDiscover Chapman\nFacts & Rankings\nLeadership\nCampus Services\nConnect\n\n\n\nAcademics\n\n\n\nToggle Academics\n\n\n\n\n\nDegrees & Programs\n\nSchools & Colleges\nAcademic Calendar\nFaculty Directory\nLibraries\nCourse Catalogs\nInternational Study\n\n\n\nAdmission\n\n\n\nToggle Admission\n\n\n\n\n\nUndergraduate Admission\n\nUndergraduate Application\nGraduate Admission\nGraduate Application\nAffordability\nFinancial\n\n                    Aid\n\n                    Calculator\nCampus Tours\n\n\n\nAlumni\n\n\n\nToggle Alumni\n\n\n\n\n\nEvents\nGet Involved\nCareer\n\n                    Support\n\n\nArts\n\nCampus Life\n\n\n\nToggle Campus Life\n\n\n\n\n\nAthletics\nDiversity & Inclusion\nEvents\nFish Interfaith\n\n                    Center\nHealth & Safety\nResidence\n\n                    Life\nStudent Life\n\n\n\nResearch\n\n\n\nToggle Research\n\n\n\n\n\nPre-Award\n\n                    Administration\nPost-Award\n\n                    Administration\nResearch Integrity\nInstitutes &\n\n                    Centers\nCenter for\n\n                    Undergraduate\n\n                    Excellence\nGraduate Research\n\n                    Support\n\n\n\nSupport\n\n\n\nToggle Support\n\n\n\n\n\nContact Development\nGet Involved\nAreas to\n\n                    Support\nAlumni Involvement\n\n\n\n\n\n\nFind information for...\n\n\n\nToggle Find Information By Audience\n\n\n\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\nDegrees & Programs\nMaps & Directions\nAll Directories\nNews\nEvents\nSocial\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare via Facebook Share via Twitter Share via Reddit Share via Pinterest Share via Email Share via LinkedIn \n Print Friendly\n\n\n\n\n\n\n\n\nUncategorized \nCosmic Archaeology Forward For the first time in history, scientists unearth extraterrestrial culture on the international space station, led by Chapman University Professor Justin Walsh.\n Cindy HarvardNovember 8, 202214 min read\n\n\n\n\n\nCosmic\nArchaeology\nBy Rachel Morrison\n\n\n\n\n\n\n\n\n\n\nFor the first time in history, scientists unearth extraterrestrial culture on the International Space Station, led by Chapman University Professor Justin Walsh.\n\n\n\n\n\n\nGaze up at the sky on any given clear night. If you know where to look, you’ll likely catch a glimpse of the International Space Station as it charts its well-trodden easterly course across the sky.\n\n\n\n\n\n\n\n\nR esearchers from five international space agencies, including the National Aeronautics and Space Administration (NASA), live and work on the station in what is one of the world’s most ambitious multinational collaborative projects. Their research is well documented on NASA’s ISS blog and includes such wide-ranging topics as the effects of space travel on the human body, materials science, dark matter, spacecraft systems and countless other topics over the station’s over 21-year history.\nBut an additional source of endless fascination is the astronauts’ daily life in a vessel about the size of a football field, floating in microgravity with an international crew of seven people.\nHow do the astronauts wash their hair? (rinseless shampoo); sleep? (in a bag and attached to the wall); spend their free time? (mostly looking out the window, according to NASA). The ISS has been fastidiously designed to maximize the health, productivity and comfort of the crew while optimizing the efficient use of space and supplies.\nBut even as the mundane aspects of daily life are accounted for, questions remain about the more elusive but nonetheless riveting topic of culture. How do crewmembers on the ISS interact with each other and with equipment and spaces? And how do the spaces, interactions and objects inform conflict or cooperation among the crew?\n“It’s a microsociety in a miniworld,” says Chapman University’s Justin Walsh, associate professor and interim chair of the Department of Art. Walsh, an archaeologist by training, is using archaeology’s methods of inquiry and analysis – in which the objects and spaces of a culture are analyzed to provide insight into how humans adapt to their environment – to reveal new understanding of human activity in space.\n\n\n\n\n\n\nArchaeologist and Chapman Associate Professor and Interim Chair of the Department of Art conducted the first archaeological study aboard a spacecraft with co-principal investigator Alice Gorman of Flinders University in Australia.\n\n\n\n\n\n\n\n\n\n\n\n“The Past Is Right Now”\n\n\n\n\n\nAlong with co-principal investigator Alice Gorman of Flinders University in Australia, Walsh just completed Sampling Quadrangle Assemblages Research Experiment (SQuARE), the first archaeological study ever performed outside the Earth.\nPeople tend to understand archaeology as dealing with the distant past. But at its core, the discipline is primarily concerned with a type of evidence – material culture – regardless of when that culture existed.\n“The past is right now – what happened 10 seconds ago is the past and is equally available for archaeological research as something a millennia ago,” explains Walsh.\nIn his view, archaeological techniques can be used to understand what happened at a distinct time – including the present – and what humans did in that location to adapt to it. “So, the question of when and where is irrelevant,” he says. “What we are showing with this project is the potentially practical side of archaeology as a science. We are revealing aspects of a habitat that people have lived in for over 20 years, and that the very people inhabiting it 24/7 have not been aware of.”\n\n\n\n\n\n\n\n\n\nNASA astronaut Kayla Barron places the first pieces of tape to mark a sample location for the SQuARE experiment in the Japanese Experiment Module (Kibo) on January 15, 2022. Credit: NASA.\n\n\n\n\n\n\n\nThe Big “Bing”\n\n\n\n\nFor Walsh, the galvanizing moment came in 2008.\nThroughout his scholarly career, Walsh has conducted the type of research that most people associate with archaeology, complete with all the trappings expected from the discipline: trowels and brushes, pottery sherds and grids that divide ancient sites for excavation.\nHe is currently principal investigator on a Chapman excavation in Cástulo, Spain, and doing ceramics analysis at the Morgantina site in Sicily, Italy – a site with a notorious history of looting, with artifacts turning up in famous museums and private collections around the world.\n\n\n\n\n\n\n\n\n\nWalsh at the Cástulo site in 2014 holding a fragment of a fourth-century CE glass paten (a bowl for serving the Eucharist in a Christian Mass).\n\n\n\n\nBack in 2008, when the extent of that looting was just coming to light, Walsh was teaching “Cultural Heritage in the Art World,” an ethics course for graduate students who might eventually work in the culture industry. Responding to what was happening at Morgantina, the class focused on cultural heritages that need to be protected. “One day a student said, ‘What about stuff in space?’ Bing. Lightbulb. As soon as she asked the question, I thought, of course, stuff in space is heritage too,” Walsh recalls.\nConsider Tranquility Base, the site where the crew of Apollo 11 first set foot on the moon. For more than 53 years, it has remained undisturbed – no wind, no return visitors, no water, no erosion. What protections are in place to preserve the integrity of the site – to protect it from the fate that befell Morgantina?\n“It’s hard to think of a site that might be more significant in the history of humanity – it was the first time any human had set foot on something that wasn’t the Earth,” says Walsh. “Space is international territory, like the high seas or Antarctica. No country has sovereignty. So, the implication is that, unlike Earth, no one government can say it’s protected. What happens to that site when we have tourists on the moon?”\n\n\n\n\n\nNew Tools for an Old Trade\n\n\n\n\nThe most basic archaeological technique for sampling a site is the test pit. Archaeologists divide a site into a grid of squares, usually one meter by one meter, then select individual squares to dig in so that they can get a better sense of what the site is like and plan their future excavation strategy.\nFor the SQuARE project, the researchers asked the astronauts aboard the ISS to create one-meter squares on walls using tape throughout the space station – six in total. Instead of digging them to reveal new layers of soil representing different moments in the site’s history, the crew photographed each of the squares once per day to identify how those spaces were being used and how they changed over time. In a traditional test pit, each stratum of soil reveals a new layer of geographical insight and glimpse into cultural history – depth tells the story. On the ISS, it is not depth that reveals the vicissitudes of history and culture, but time.\n“When you’re doing a terrestrial dig, you are present in the landscape, you are constantly assessing what is being found, and it is an unrepeatable experiment – the work is destructive by necessity. The very act of uncovering an object is a threat to its continued survival,” explains Walsh.\nNot so with photography.\nIn 2009, Jason De León, Ph.D., an archaeologist from UCLA, gave migrants from Central America to the U.S. disposable cameras to document their journeys, in what may be the first archaeological research done with photographs. It was also the first time researchers could look at a cultural phenomenon from an archaeological – vs. historical – perspective that they couldn’t directly observe.\n“Jason’s work was the impetus for us to look at photography as a viable method for space archaeology. We’ve also been using archive photos. The sole data is the photograph. But we can go back to those photographs over and over again—it’s a repeatable experiment,” explains Walsh.\n\n\n\n\n“When you’re doing a terrestrial dig, you are present in the landscape, you are constantly assessing what is being found, and it is an unrepeatable experiment – the work is destructive by necessity. The very act of uncovering an object is a threat to its continued survival,” explains Walsh.\n\n\n\n\n\nExcavating Space\n\n\n\n\nIn his 2013 book “Consumerism in the Ancient World,” Walsh explores the acquisition of Greek pottery by ancient peoples who were not Greek, even though the shapes of the earthenware were specific to Greek practices and behavior and were decorated with images from Greek mythology. He found that many of these pieces ended up buried intact in tombs, which typically identifies them as prized possessions, likely only used in a funerary context. Zooming out, that research provides a framework for identifying the ways in which objects take on different meanings in new contexts; the linkages between the consumption of goods and identity construction; and how people use objects to signal social status and other information to others in their community. In many ways, the SQUaRE team’s early analysis of the ISS also conforms to this framework.\nTake the galley, in the ISS Node 1 (Unity), where the crew’s dining table attaches to the wall and condiments are held tight into mesh bags attached to the wall. A bar of dark chocolate seems to shrink over the course of days; a tin of Altoids moves around; and one day, most curiously, several tubes of different colored frosting appeared.\nA later Instagram Reel by U.S. astronaut Kayla Barron revealed that she and fellow astronaut Thomas Marshburn had made a birthday cake for a Russian crewmember Pyotr Dubrov using muffin tops glued together with honey, which was then decorated with the frosting.\n“And that’s an interesting phenomenon, because that’s cooking, and cooking has a lot of social implications, especially a birthday cake,” says Walsh. “It shows that you care about somebody else and that they’re special to you. Cooking is something that you really cannot do in microgravity – they usually just eat bags or cans of food. This shows us that exercising a sense of control and curating the experience of fresh ingredients is part of the culture of the American crew on the International Space Station.”\nAnother inference Walsh made was the adaptation of U.S. Node 2 (Harmony), a maintenance workstation, into an ad hoc laboratory space. An experimental bag takes up residence in the frame for a few days, which Walsh later learned was for experimenting with concrete production in microgravity.\n“From an archaeological perspective, I wouldn’t have known that they are making concrete there, but I can determine that science is happening there, and it speaks to the flexibility of the location,” Walsh says.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA sample location, the galley area in the NASA Node 1 module (Harmony) on the International Space Station, for the Sampling Quadrangle Assemblages Research Experiment (SQuARE). The area to be sampled is marked at the corners by yellow tape.\nPhoto credit: NASA/International Space Station Archaeological Project\n\n\n\n\n\n\nLaunch of Brick Moon\n\n\n\n\nThe insights gained on material culture in space gleaned on the ISS will continue to have import long after the SQuARE study ends.\nEnter: Brick Moon, the space-habitat consultancy being formed by Walsh and his colleagues. Named for the first work of fiction that described space launch, written by Edward Everett Hale in 1869, Brick Moon aims to use the firsthand knowledge gained from the SQuARE study to provide design guidance for companies and organizations with sights on building new space stations in the coming decades – companies such as Blue Origin, Orbital Reef, Star Lab and Axiom, Brick Moon’s implementation partner.\n“We are the ones providing a view into the past,” says Walsh in reference to the SQuARE data. “So we can help design the efficiencies needed in a space habitat in advance of launch, since we can’t easily modify space after a station goes up.”\nOne such design efficiency is what co-researcher Alice Gorman has dubbed “gravity surrogates” – technologies, such as Velcro patches on the wall, that simulate gravity. “In the SQuARE photos, we’ve been looking at where lots of these restraints appear. We see them increase over time and can also see glue on the wall where a patch has fallen away. Going forward, designers and engineers will want to be thinking about accommodations for microgravity environments. What we learn from the photos can inform those decisions.”\nWhen the American ISS astronauts returned Earthside last spring, Walsh had the opportunity to meet with them and discuss the experiment. As Walsh recalls, the astronauts shared that they thought the researchers would be bored with the pictures.\n“I assured them – ‘that’s not the case.’”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmergency \n\nMedia ContactsCerise Valenzuela Metzger\n\nDirector of Public Relations\n(714) 289-3143 (office)\n(657) 390-6760  (cell)\ncmetzger@chapman.edu\n\nOffice of Public Relations\n\nPR@chapman.edu \n\nNewsroom SiteChapman Magazine\n\nChapman Forward\nCOVID-19 Resources\n\nChapman Site\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment \n\nServices & PoliciesAccessibility Feedback \nWebsite Feedback \nDisability Services \nDirectory Emergency \nConsumer Disclosures \nPrivacy Policy Title IX \n\n\n\n\n\n© 2023 Chapman University           \n\n\n\n\n\n\nTopics\n\nAlumni\nArts & Film\nBusiness & Economy\nCampus & Students\nCollege Knowledge\nCommunity\nCOVID-19\nHealth & Behavior\nHumanities & Society\nScience & Engineering\nUniversity News\n\n\nOur Voices\nCOVID-19 Resources\nMagazines\n\nChapman Magazine\nChapman Forward\n\n\nPress Room\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#",
        "#",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "#",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://www.pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu/",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/edu/school?id=17838",
        "https://www.snapchat.com/add/chapmanu",
        "http://chapmanadmission.tumblr.com/",
        "http://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://social.chapman.edu/",
        "#",
        "https://www.chapman.edu/",
        "/",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "https://news.chapman.edu/wp-admin/ ",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "https://www.chapman.edu/campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu",
        "https://news.chapman.edu/work/",
        "/",
        "https://www.chapman.edu/",
        "#",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "#",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/discover/index.html",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "/about/connect",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/academics/course-catalogs/index.aspx",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "/admission/undergraduate/applynow",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/afford.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/net-cost-calculator/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/events/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/students/health-and-safety/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "/research/",
        "https://www.chapman.edu/research/sponsored-projects-services/pre-award/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/post-award/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index.aspx",
        "https://www.chapman.edu/research/graduate-research/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/contact-us.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/ways-to-give/areas-to-support.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/audiences/index.aspx",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "https://social.chapman.edu/",
        "#",
        "#",
        "#",
        "#",
        "mailto:?subject=Cosmic%20Archaeology%20Forward&body=https%3A%2F%2Fnews.chapman.edu%2F2022%2F11%2F08%2Fcosmic-archaeology-forward%2F",
        "#",
        "#",
        "https://news.chapman.edu/category/uncategorized/",
        "https://news.chapman.edu/author/harvardchapman-edu/",
        "https://www.nasa.gov/audience/foreducators/stem-on-station/ditl_free_time/",
        "https://www.chapman.edu/emergency/index.aspx",
        "tel:+1714-289-3143",
        "tel:+1657-390-6760",
        "mailto:cmetzger@chapman.edu",
        "mailto:PR@chapman.edu",
        "/magazine",
        "/forward",
        "/coronavirus/",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/jobs/index.aspx",
        "https://www.chapman.edu/accessibility/feedback-form.aspx",
        "https://www.chapman.edu/website-feedback-form.aspx",
        "https://www.chapman.edu/students/health-and-safety/disability-services/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "emergency/index.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/index.aspx",
        "https://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "https://www.chapman.edu/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/"
    ]
}