{
    "title": "\n\t\tMaster of Science in Food Science | Schmid College of Science and Technology | Chapman University\n\n\n\t",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\t\t\t\tSome of the content on this website requires JavaScript to be enabled in your web browser to function as\n\t\t\t\tintended. This includes, but is not limited to: navigation, video, image galleries, etc. While the\n\t\t\t\twebsite is\n\t\t\t\tstill usable without JavaScript, it should be enabled to enjoy the full interactive experience.\n\t\t\t\n\n\n\n\n    Skip to main content \n\n\n\n\n\n\n\n\n\n\n\n\n\nSection\nMenu\n\nToggle Section Menu\n\n\n\n\n\nMenu\n\n\n\n\n\nMenu\n\n \n\n\n\n\n\n\n        Chapman University Logo\n      \n\n\nClose Off-Canvas Menu\n\n\n\n\n\n\n\n\nSchmid College of Science & Technology\nChapman Menu\n\n\n\n\n\nSchmid College of Science and Technology\n\n\nAbout Schmid\n\n\nBack\nMessage from the Dean \nFaculty Directory\nContact Us\nSchmid College Advisory Council\nDiversity, Equity & Inclusion\n\n\n\nUndergraduate Programs\n\n\nBack\nUndergraduate Programs\nBiochemistry and Molecular Biology\nBiological Sciences\nChemistry\nEnvironmental Science and Policy\nMathematics\nMathematics and Civil Engineering\nPhysics\n\nPhilosophy\n\n\nBack\nPhilosophy\nWhy Major in Philosophy?\n\n\nSchmid Minors\n\nBeckman Scholars Program\n\n\nBack\nBeckman Scholars Program\nApply\nBeckman Mentors\nBeckman Scholars\n\n\n\nNSF Stockholm Research Experience\n\n\n\n\nGraduate Programs\n\n\nBack\nGraduate Programs\n\nM.S. Food Science\n\n\nBack\nMS Food Science\nJoint MS Food Science / MBA\nFood Science Program - Better Process Control School\n\nRanney Food Processing Lab\n\nUSDA National Needs Fellowship Program\nUSDA Fellowship Application\n\n\nMS Computational and Data Sciences\nPh.D. Computational and Data Sciences\nDoctor of Science in Mathematics, Philosophy and Physics \n\n\n\nIntegrated Degree Programs\n\n\nStudent Organizations\n\n\nSupport Schmid\n\n\nEvents & Conferences\n\n\nBack\nNews and Events\nNinth Annual Chapman Phytosanitary Irradiation Forum\n\nConferences\n\n\nBack\nSeventh Annual IEEE GameSIG Intercollegiate Computer Game Showcase\nResearch and Applications of AI for Cardiac Disease Conference\n\n\nGrothendieck Conference\nMind and Agency in the Foundations of Quantum Physics\n\n\n\nResearch\n\n\n\n\n\n\nChapman Menu\nSchmid College Menu\n\n\n\n\nAbout\n\n\nBack\n\nAbout Overview\n\n\nMaps & Directions\n\n\nVisit Chapman\n\n\nFacts and Ranking\n\n\nLeadership\n\n\nDiversity and Inclusion\n\n\nCampus Services\n\n\nConnect\n\n\n\n\nAcademics\n\n\nBack\n\nAcademics Overview\n\n\nDegrees & Programs\n\n\nSchools & Colleges\n\n\nAcademic Calendar\n\n\nFaculty Directory\n\n\nLibraries\n\n\nCourse Catalogs\n\n\nInternational Studies\n\n\n\n\nAdmission\n\n\nBack\n\nUndergraduate Admission\n\n\nUndergraduate Application\n\n\nGraduate Admission\n\n\nGraduate Application\n\n\nAffordability\n\n\nFinancial Aid Calculator\n\n\nTours and Visits\n\n\n\n\nAlumni\n\n\nBack\n\nAlumni Overview\n\n\n\n\nArts\n\n\nBack\nArts\n\nArts at Chapman Overview\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser Archives\n\n\nCollege of Performing Arts Events\n\n\nEscalette Permanent Collection of Art\n\n\nGuggenheim Gallery\n\n\nHilbert Museum of California Art\n\n\nMusco Center for the Arts\n\n\n\n\nCampus Life\n\n\nBack\nCampus Life\n\nCampus Life Overview\n\n\nAthletics\n\n\nDiversity and Inclusion\n\n\nEvents\n\n\nFish Interfaith Center\n\n\nHealth and Wellness\n\n\nResidence Life\n\n\nStudent Life\n\n\n\n\nResearch\n\n\nBack\n\nResearch Overview\n\n\nSponsored Projects Services\n\n\nResearch Integrity\n\n\nInstitutes and Centers\n\n\nCenter for Undergraduate Excellence\n\n\nIndustry Alliances and Commercialization\n\n\n\n\nSupport \n\n\nBack\n\nSupport Chapman Overview\n\n\nGet Involved\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n                                                        Alumni \n                        \n\n\n\n                                                        Community\n                        \n\n\n\n                                                        Faculty & Staff\n                        \n\n\n\n                                                        Industry Partners\n                        \n\n\n\n                                                        Parents & Family\n                        \n\n\n\n                                                        Students\n                        \n\n\n\n\n\n\n\n\n\n                                        Visit\n                    \n\n\n\n                                        Apply\n                    \n\n\n\n                                        Give\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\n\n\nSchmid College\n\n\n\n\n\n\n\n\n                    Visit\n                    \n\n\n\n\n\n                    Apply\n                    \n\n\n\n\n\n                    Give\n                    \n\n\n\n\n\n\n\n\n\nInfo For\n            \n\n\n\n\n\n\n\n\nAlumni \n\n\n\n\nCommunity\n\n\n\n\nFaculty & Staff\n\n\n\n\nIndustry Partners\n\n\n\n\nParents & Family\n\n\n\n\nStudents\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\ncanva icon\nCanvas\n\n\n\n\n\n\n\n\n\n\nHandshake (career portal)\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty and staff)\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\n\n\n\n\n\n\n\n\nAbout Overview\n\n\n\n\nMaps & Directions\n\n\n\n\nVisit Chapman\n\n\n\n\nFacts and Ranking\n\n\n\n\nLeadership\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nCampus Services\n\n\n\n\nConnect\n\n\n\n\n\n\n\n\n\nAcademics\n\n\n\n\n\n\n\n\n\nAcademics Overview\n\n\n\n\nDegrees & Programs\n\n\n\n\nSchools & Colleges\n\n\n\n\nAcademic Calendar\n\n\n\n\nFaculty Directory\n\n\n\n\nLibraries\n\n\n\n\nCourse Catalogs\n\n\n\n\nInternational Studies\n\n\n\n\n\n\n\n\n\nAdmission\n\n\n\n\n\n\n\n\n\nUndergraduate Admission\n\n\n\n\nUndergraduate Application\n\n\n\n\nGraduate Admission\n\n\n\n\nGraduate Application\n\n\n\n\nAffordability\n\n\n\n\nFinancial Aid Calculator\n\n\n\n\nTours and Visits\n\n\n\n\n\n\n\n\n\nAlumni\n\n\n\n\n\n\n\n\n\nAlumni Overview\n\n\n\n\n\n\n\n\n\nArts\n\n\n\n\n\n\n\n\n\nArts at Chapman Overview\n\n\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser Archives\n\n\n\n\nCollege of Performing Arts Events\n\n\n\n\nEscalette Permanent Collection of Art\n\n\n\n\nGuggenheim Gallery\n\n\n\n\nHilbert Museum of California Art\n\n\n\n\nMusco Center for the Arts\n\n\n\n\n\n\n\n\n\nCampus Life\n\n\n\n\n\n\n\n\n\nCampus Life Overview\n\n\n\n\nAthletics\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nEvents\n\n\n\n\nFish Interfaith Center\n\n\n\n\nHealth and Wellness\n\n\n\n\nResidence Life\n\n\n\n\nStudent Life\n\n\n\n\n\n\n\n\n\nResearch\n\n\n\n\n\n\n\n\n\nResearch Overview\n\n\n\n\nSponsored Projects Services\n\n\n\n\nResearch Integrity\n\n\n\n\nInstitutes and Centers\n\n\n\n\nCenter for Undergraduate Excellence\n\n\n\n\nIndustry Alliances and Commercialization\n\n\n\n\n\n\n\n\n\nSupport \n\n\n\n\n\n\n\n\n\nSupport Chapman Overview\n\n\n\n\nGet Involved\n\n\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip\n          over carousel to next section\n\n\n\nOff\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSchmid College of Science & Technology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSchmid College of Science and Technology\n\n\n\nAbout Schmid\n\n\nUndergraduate Programs\n\n\nGraduate Programs\n\n\nIntegrated Degree Programs\n\n\nStudent Organizations\n\n\nSupport Schmid\n\n\nEvents & Conferences\n\n\nResearch\n\n\n\n\n\n\nGraduate Programs\n\n\n\nM.S. Food Science\n\n\nMS Computational and Data Sciences\n\n\nPh.D. Computational and Data Sciences\n\n\nDoctor of Science in Mathematics, Philosophy and Physics \n\n\n\n\n\n\n\n\nFollow\n\n\n\n\n\n\n\n\n\n\n\n\n\nÂ»\n    Master of Science in Food Science\n\n\n\n\nChapman University, located in Orange County, California, offers a Master of Science in Food Science-the perfect graduate degree program to help turn your passion, knowledge and experience into a rewarding career. As a student of the Food Science program, you will apply scientific principles to study the properties of food and develop innovative ways to process and package foods resulting in safe, sustainable and nutritious food choices. Learn more about the fascinating world of food science here.\nThe home of Food Science!\nFood Science is thrilled to call home the beautiful Keck Center for Science and Engineering (you can even take a virtual tour!) Spacious food science teaching and research labs in food processing, food chemistry and food microbiology with state-of-the-art equipment provide vital hands-on experiences for our students.\n\nConvenient evening classes for working adults\nExcellent graduate and alumni career & internship placement rates\nChose an emphasis in Food Safety and Regulatory or Product Development and Sensory Evaluation\nStudent:Faculty Ratio is 10:1\nThe demand for food scientists is projected to increase 7% through 2026* and job prospects in Southern California especially continue to grow steadily.\nThe food industry is economically stable – people must eat!\n\n*According to the 2017 Occupational Outlook Handbook, U.S. Department of Labor, Bureau of Labor Statistics\n\n\n\n\n\n\nToggle Section\n\n\n\n\n\n                                                Upcoming Events\n\n                                            \n\nMaster of Science in Food Science Virtual Information Sessions\nIf you enjoy science and have a passion for food (or vice versa), explore a career in Food Science at our next info session!\nRSVP for our next Information Session on Thursday, July 20th at 5:30PM (PDT)\nCan't make it?   Schedule a 1:1 virtual appointment\nWant to visit us, and have a one on one tour? Contact Robyne Kelly.\n\n\n\n\n\n\n                                                Career and Internship Opportunities\n\n                                            \n\nToday, food science represents one of the healthiest industries in the world, with the various food industries – from processing to sales – contributing close to $42.2 billion to our national economy. With over 1,500 food-processing companies within a 90-minute drive of campus, Orange County is the ideal location for food science careers and internship opportunities. Take a look at the recent Economic Impact of Food and Beverage Processing in California report prepared for the California League of Food Processors. For the latest industry employment information, view the IFT Employment and Salary Survey Report.\nMost of our students obtain work experience via internships and our job placement rate is close to 100%. Graduates of our program have gone on to work for:\n\nBaskin-Robbins corporate headquarters\nCarl Karcher Enterprises, Inc.\nCheesecake Factory corporate headquarters\nCon-Agra\nContessa Foods\nDean Foods\nDisney Consumer Products\nDole\nDr Pepper/Seven-Up\nFresh Express\nHain Celestial\nJamba Juice corporate headquarters\nKellogg's\nMasterfoods USA\nNestle, USA\nNutrilite\nPepsiCo\nReady Pac Foods, Inc.\nSenomyx\nStarbucks corporate headquarters\nSunkist Growers, Inc.\nTaco Bell corporate headquarters\nThe Coffee Bean & Tea Leaf corporate headquarters\nUnilever\nVentura Foods\nAnd many more...\n\nGraduate students also readily gain admission into graduate programs of their choice, including medical school. The program is also beneficial for students who are about to attain medical or dental degrees, as they can complete the food science coursework in the same year that they are applying to medical school and taking exams.\n\n\n\n\n\n\n                                                Admission Requirements\n\n                                            \n\nPrerequisite Courses\nRecently admitted applicants hold degrees in chemistry, biology, pharmacy, business, chemical and mechanical engineering as well as food science and nutrition. We encourage applicants from a broad range of disciplinary interests, as long as you have completed the following coursework:\n\nGeneral Chemistry with Laboratory (two semesters)\nOrganic Chemistry with Laboratory (two semesters or one semester organic and one semester biochemistry)\nMicrobiology with Laboratory (one semester)\nStatistics (one semester)\nHuman Nutrition (one semester)\n\nAny of these courses can be completed at other accredited institutions such as your local community college and/or other four-year colleges and universities. If you have not completed some of your prerequisite course/s prior to applying, it is possible to enroll in these courses at Chapman University. However, in order for your application to be considered for review, you are required to have successfully completed one year (two semesters) of General Chemistry with Laboratory. All other prerequisites must be met by the end of the first academic year. Please contact us for more information.\nApplication Deadlines\nPriority review deadlines for fellowships and scholarships are:\n\nNovember 1 for Spring admission\nMay 1 for Fall admission.\n\nApplications received after this date will be considered on a rolling basis as space is available.\nApplication Requirements\n\nOnline application for admission (including $60 non-refundable application fee)\nOfficial transcript from degree granting institution. If prerequisite courses have been taken at schools other than the degree granting institution, those transcripts must also be submitted.\nApplicants must have earned a minimum grade point average of 3.00.\nAn interview is required for all applicants.\nSubmission of Graduate Record Exam (GRE) or Graduate Management Admission Test (GMAT) scores is optional for the M.S. Food Science program. The GRE or GMAT is required for consideration to the Joint MS/MBA program (GRE school code is 4047).\nLetters of recommendation; two letters of recommendation are required which describe your professional and academic abilities\nStatement of Intent; an essay addressing your reasons for wishing to attend Chapman University and the M.S. Food Science program\nResume; a resume or curriculum vitae is required\nLanguage Test (International Students Only) – applicants who have completed their undergraduate degree outside of the United States are required to achieve the following minimum score on Test of English as a Foreign Language (TOEFL): 550 (paper-based), or 80 (internet-based), International English Language Testing System (IELTS): 6.5, Pearson Test of English (PTE):53 or Cambridge English Advanced Exam (CAE): 180 minimum.\nFinancial Certification Form (International students only)\n\n\n\n\n\n\n\n                                                Degrees and Emphases\n\n                                            \n\nDegrees offered\n\nMS in Food Science (34 units)\nMS in Food Science with emphasis in Food Safety and Regulatory (40 units)\nMS in Food Science with emphasis in Product Development and Sensory Evaluation (40 units)\nMS in Food Science/MBA Joint program (69 units)\nIntegrated Undergraduate/Master of Science in Food Science\n\nAbout Food Science with emphasis degrees\nMS in Food Science with emphasis in Food Safety and Regulatory (40 units)\nFollowing the passage of the Food Safety Modernization Act (FSMA) in 2011, there has been an increased focus on food safety and regulations within the food industry.\nLearning outcomes of the emphasis\n\nIdentify specific hazards associated with a range of food matrices and assess how each hazard can be prevented, controlled, and/or mitigated in the food production system.\nApply knowledge of hazards to develop and audit food quality and safety assurance systems. Understand regulatory compliance of food product development, manufacturing, labeling, and marketing of food products and apply them to real-world situations.\nSee the Graduate Course Catalog for more information\n\nMS in Food Science with emphasis in Product Development and Sensory Evaluation (40 units)\nIn order to develop new food products for consumers, companies rely on project teams that include experts in product development, sensory evaluation, and marketing.  Individuals working in these areas are also expected to have expertise in food ingredients and functional foods.\nLearning outcomes of the emphasis\n\nApply core food science knowledge to develop new products and solve food industry problems.\nEnable students to function as key members of multifunctional product development teams in the workplace.\nApply knowledge of sensory evaluation to the establishment and management of sensory evaluation panels, projects and programs.\nSee the Graduate Course Catalog for more information\n\n\n\n\n\n\n\n                                                Integrated Undergraduate/Master Programs\n\n                                            \n\nChapman Undergraduates! Learn more about the Integrated Master's in Food Science program at our next Zoom Information Session !\nThe food science program offers an integrated program that enables undergraduate students to begin taking M.S. coursework in their junior or senior year and receive a Master of Science in Food Science in as little as one year after finishing their undergraduate degree. The program is open to all undergraduate majors as long as they have satisfied the prerequisites for the program and meet admission requirements.\nChapman students can apply to a graduate program in their junior or senior year. Students will receive conditional admission to the program, pending completion of their bachelor's degree as stipulated in the graduate catalog (see explanation of conditional admission in the graduate catalog). If accepted into a graduate program, undergraduate students may take up to 15 graduate credits once they have completed 90 undergraduate credits. These 15 credits may also count towards their undergraduate degree credit requirement. Students would complete the remaining credit hours of graduate coursework beginning in the semester after receiving the undergraduate degree. The application process, prerequisites, GPA and graduate program requirements are as specified for the M.S. in Food Science; however letters of recommendation are waived.\n\nIntegrated BS Biology/M.S. Food Science\nIntegrated BS Chemistry/M.S. Food Science\nIntegrated BS Biochemistry/M.S. Food Science\nIntegrated BS Health Sciences/M.S. Food Science\n\n\n\n\n\n\n\n                                                Nutrition Minor\n\n                                            \n\nStudents in the Nutrition Minor learn about the evidence that informs dietary guidelines and clinical nutrition practice, recognize misconceptions regarding nutrition, identify gaps between current knowledge and marketing of food products, garner an appreciation for nutrition across the lifespan, examine contemporary international nutrition and food sustainability issues, and explore concepts in nutritional biochemistry relating to human metabolism and chronic disease states.Unless enrolling in 3 credits of an approved independent research study or internship, students will need to successfully complete FSN 303 at least one full year in advance of planned graduation. Please contact Nutrition Minor advisor Dr. John Miklavcic for more information.\nPlease see the undergraduate course catalog for more information about declaring a minor.\n\n\n\n\n\n\n                                                Faculty Members\n\n                                            \n\n\nSchmid Food Science Faculty\n \n\n\n\n\n\n\n\nLilian Senger, Ph.D.\nProgram Director\nProfessor\n\nLilian Senger (B.S., M.S., University of Arkansas at Fayetteville; Ph.D., Purdue University) teaches courses in Food Analysis, Food Chemistry, Food Ingredients, International Nutrition, and Research Methods. Dr. Senger’s current research is focused on determining the preservative properties of phenolic and melanoidin coffee compounds, with the overall goal of enhancing the shelf life of food.\nDr. Senger recently received the Outstanding Food Science Award from her alma mater, Purdue University.\n\nView Full Bio>>\n\n\n\n\n\n\n\n\nFredric Caporaso, Ph.D.Professor\nFredric Caporaso, Ph.D. Professor Fredric Caporaso (B.S., M.S., Rutgers, State University of New Jersey; Ph.D., Pennsylvania State University) is a Professor of Food Science in the Schmid College of Science and Technology. He teaches a variety of courses including: Introduction to Food Science, Sensory Evaluation of Foods, Darwin and the Galápagos, Darwin’s Theory of Evolution: the Science and the Controversy (Honors), and Research Methodology. His professional memberships include The Institute of Food Technologists, International Union for the Conservation of Nature- Species Survival, Commission- Tortoise and Freshwater Turtle of Specialist Group, and The Turtle Survival Alliance.\nView Full Bio »\n\n\n\n\n\n\n\n \n \n \n \n \n \n \n\n\nRosalee Hellberg, Ph.D.\nAssociate Professor\n\nRosalee Hellberg is an Assistant Professor in the Food Science Program at Chapman University.  She teaches courses on Food Fraud, Food Microbiology, and General Microbiology.  Dr. Hellberg received an M.S. and Ph.D. in Food Science and Technology at Oregon State University, where she studied seafood safety and fish mislabeling.  She completed a post-doctoral fellowship at the FDA working on the development and optimization of DNA-based methods for the detection of food pathogens and food mislabeling.  Dr. Hellberg received the 2015-2017 Wang-Fradkin Assistant Professorship Award for exceptional merit in scholarly and creative activity at Chapman University.  In 2017, Dr. Hellberg was selected as a recipient of the Emerging Leaders Network Award by the Institute of Food Technologists. Most recently, Dr. Hellberg received the 2018-19 Award in Mentorship of Undergraduate Research & Creative Activity at Chapman University, and is currently Program Chair for the 2020 Pacific Fisheries Technologists Meeting to be held in Long Beach, CA (http://pftfish.net/). She has published over 30 peer-reviewed articles and book chapters. Visit her website for more information about her research.\nView Full Bio »\n \n\n\n\n\n\n\nAnuradha Prakash, Ph.D.\nProfessorDirector, Chapman Food Innovation\n\nAnuradha Prakash (B.S., University of Mumbai; M.S., Ph.D., Ohio State University) is Professor and Director of the Food Science Program at Chapman University. She has expertise in the areas of food processing and preservation, specifically microwave processing and food irradiation. Her current research focus is on the use of various technologies to enhance the safety and shelf-life of fresh-cut fruits and vegetables and ready-to-eat meals. Anuradha has a keen interest in issues of food availability and security in developing countries and the incidence of hunger and malnutrition.\nDr. Prakash was recently featured in Chapman Magazine, discussing food preservation in space and here on earth.\nView Full Bio »\n \n\n\n\n\n\nJohn Miklavcic, Ph.D.Assistant Professor\nDr. Miklavcic has a translational research program in human nutrition that focuses on understanding the therapeutic applications of functional foods and nutraceuticals in human health. He is particularly interested in how dietary lipids interact with and regulate gene function in neonatal health & development and in chronic conditions. Dr. Miklavcic uses quantitative and qualitative methods as well as applied and implementation research in studies with clinical populations of infants, adolescents and older adults.\nDr. Miklavcic recently received the Mentor Award for Summer Undergraduate Research at Chapman University and the Health and Nutrition Division New Investigator Award from the American Oil Chemists Society.\nView Full Bio>\n\n\n\n\n\nAffiliated Faculty\n\n\n\n\n\nAhmed Aftab, Ph.D.\nAssociate Professor\nSchool of Pharmacy\n\nExpertise: Proteins & Peptides; Purification and Characterization; Amino Acid Sequencing; Plant Proteomics\n\nView Full Bio>\n\n\n\n\n\n\nCedric Owens, Ph.D. \nAssistant Professor\nSchmid College of Science and Technology\nChemistry\n\n\n\nExpertise: Biological Nitrogen Fixation; Nitrogenase; Bacterial Iron Uptake; Hemophore; Bioinorganic Chemistry; Structural Biology\n\n\n\nView Full Bio>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCriselda Toto Pacioles, Ph.D.\nAssociate Professor\nSchmid College Of Science and Technology\nMathematics\n\nDr. Toto Pacioles has a PhD in Mathematical Sciences (with focus on Statistics) and an MS in Applied Statistics from Worcester Polytechnic Institute (WPI) in Worcester, Massachusetts. She also has an MS in Mathematics and a double degree in Bachelor of Secondary Education major in Computer Science and BS in Mathematics from De La Salle University in Manila, Philippines. Her dissertation work is in Small Area Estimation and Multivariate Predictive Inference using Bayesian Analysis. Her research projects in the past 10 years with faculty and students at Chapman University have been focused on applied statistics in Health Science, Food Science, Mathematics Education, and Biology Teaching. Dr. Pacioles has been teaching at Chapman University since 2011.\nView Full Bio>\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\nDonna Williams-Hill, Ph.D.\nDirector of the Microbiology Branch at the FDA Pacific Southwest Food and Feed Laboratory in Irvine, CA.  Dr. Williams-Hill received her Ph.D. in Molecular Microbiology and Immunology from the University of Southern California in 1992.  Afterwards, she served as a postdoctoral fellow in the Human Oncology Department of the University of Wisconsin, Madison where she studied the molecular genetics associated with environmental susceptibility to mammary carcinogenesis.  In 1996, Dr. Williams-Hill returned to the University of Southern California where she continued research in genetic susceptibility factors related to breast cancer.  She joined the FDA in 2000 as a microbiologist and became proficient in BAM methodologies for detection of food pathogens.  This led to her selection as  e a supervisor ultimately leading to the Branch Director position in 2011.   Dr. Williams-Hill has served on numerous FDA/ORA/ORS committees including the BAM Committee and the  FDA Science Forum.  In addition, she is an instructor in food safety for Cal Poly Pomona (CPP) and food microbiology for Chapman University.\n\n \n\n\n\n\n\n\nPart-Time Faculty\n\n\n\n\n\n \n\n\nTroy Aykan, J.D.\nTroy Aykan (B.S., Hacettepe University; M.S., Chapman University; J.D., Chapman University School of Law) teaches Food Laws & Regulations. Attorney Troy Aykan, originally a food processing engineer, received his Master's Degree in Food Science and has worked in the food industry, specifically in the field of regulations. After graduating from Chapman University School of Law, he passed the bar exams in both California and Arizona. He continues to work in the industry and maintains some independent law practice.\n\n\n\n\n\nTatiana Miranda\nTatiana holds a Bachelor’s degree, Food Engineering, De La Salle Catholic University (Bogota, Colombia). Specialist, Food Processing and Biomaterials (UNAD Colombia-UNICAMP Brazil) and MS in Food Science (Chapman University, Orange CA) and teaches Food Safety and Quality Assurance.\nTatiana is a Quality Assurance Manager, GMP Audits for Unilever Health and Wellbeing North America. In this role she manages US GMP compliance and partner with supplement businesses as well as conducts GMP audits for multiple brands: creates corporate level audit policies, collaborates, and synergizes audit processes & strategies across brands to ensure GMP compliance within the brands and at suppliers.\n\n\n\n\n\n \n\n\nDebra Topham\nMs. Debra K.W. Topham teaches courses in nutrition as well as food regulations. Her consulting business specializes in food and supplement label compliance. In addition to being a Certified Nutrition Specialist, she has professional memberships with IFT, Food Consultants Group, and Phi Upsilon Omicron. Her publications address the topics of phytochemicals and health.\n \n\n\n\n\n\nDonna Williams-Hill, Ph.D.\nDr. Donna Williams-Hill is the Director of the Microbiology Section of the FDA's Pacific Regional Laboratory Southwest, Principal Investigator of the BSL-3 at PRLSW, a member of the FDA Foreign Inspection Cadre as well as numerous FDA working groups focusing on the detection of high-risk pathogens in foods.\n\n\n\n\n\nDenise Canellos\nDenise teaches courses in Human Nutrition, Medical Nutrition Therapy and Life Cycle Nutrition. She holds a Master of Science in Human Nutrition from University of Bridegeport. Denise is a Certified Nutrition Specialist as well as a passionate, devoted nutritionist devoted to teaching practical ways to achieve better health and healing through nutrition. Denise is the author of the book \"Calm Your Inflammation\".\n\n\n\n\n\nChristina Hall\nChristina teaches International Nutrition, and holds a Master of Arts in Urban Sustainability from Antioch University. In addition, she is the Executive Director of the Orange County Food Access Coalition; a non-profit whose mission is to develop food system and food access policy and advocacy activities in Orange County, Ca.\n \n\n\n\n\n\n\n\n\n\n\n                                                Learning Outcomes\n\n                                            \n\n\nKnowledge of core food science concepts.\n\nIdentify core concepts in food chemistry and analysis, food safety and microbiology, and food processing and engineering.\nDemonstrate a clear understanding of the factors that impact the safety, quality, and nutritional value of foods.\n\n\nCritical thinking.\n\nThrough individual research projects, students will apply the scientific method to solve problems in food science.\nStudents will be able to effectively evaluate and critique professional papers and reports in the field of food science and nutrition.\n\n\nCommunication.\n\nStudents will be able to communicate scientific and technical knowledge in food science to professional audiences using written, visual, and oral means.\n\n\nProblem Solving.\n\nStudents will function effectively in the food and allied industries to solve practical, real world problems.\n\n\n\n\n\n\n\n\n\n                                                Food Science Student Testimonials\n\n                                            \n\nAlumni Spotlights\n\n \n\n\n\n\n\n\n                                                Alumni & Friends\n\n                                            \n\nWelcome to the Chapman Food Science Alumni & Friends page\nHere you'll find links to areas of interest and as well as happenings in our program and Chapman at large. We love our alumni, and hope you'll keep in touch. If you're not receiving the tri-annual Food Science Alumni Newsletter, please take a moment to update your contact information, and let us know if you'd like to mentor a current student. We promise that this information will never be shared!\nUpcoming Events!\n\nBetter Process Control School: Chapman University's Better Process Control School (BPCS) provides low acid and acidified food processing classes for food science professionals. The acidified and aseptic packed foods course is a two day workshop, and the low-acid food course is a four-day workshop. Participants who earn a passing grade on each chapter exam will be awarded a Certificate of Completion that indicates satisfactory completion of FDA and USDA-FSIS training requirements.\n\nConnect to other alumni & current students! \nJoin the \"closed\" Chapman Student & Alumni Facebook page to connect with other alumni, get information about events, post or look for jobs, and more!\nRegister your thesis in the Leatherby Libraries!\nShare your research with current students by registering it on the Leatherby Libraries Digital Commons. It's easy and will contribute to the Food Science archives.\n \n\n\n\n\n\n\n\n                                                FAQs\n\n                                            \n\nAPPLICATION\nWhat is the GRE and is it required?\nThe GRE is a general, standard exam for graduate-level admissions testing verbal reasoning, quantitative reasoning, and analytical writing (note: GRE school code for Chapman is 4047). The GRE is not a requirement for admission into the Food Science program.\nWho should my letters of recommendation come from? May I submit additional letters?\nLetters of recommendation should come from former faculty members or those you've worked with in the Food industry who can attest to your academic and professional abilities.\nWhat are the application deadlines?\nGenerally, 5/1 for Fall admission & 11/1 for Spring admission; however we will consider applications after these deadlines for qualified students.\nWhat factors are included in the application evaluation?\nGPA from the undergraduate career, personal interview, letters of recommendation, statement of intent, resumes (language test for international applicants).\nCan I submit my application before I have all the necessary documents??\nYes! Admissions will hold your application and notify us as your documents become available. You will not receive an admissions decision, however, until alldocuments have been received.\n\nSTUDENT LIFE\nAre there any student clubs/organizations? \nFood Science students are members the Food Science Student Association. Check out the Facebook page and FSA blogspot for all the latest Food Science Student Association happenings.\nWhat are the housing options?\n On-campus housing is extremely limited and graduate students are encouraged to research alternative living arrangements off-campus by visiting our Introduction to Off-Campus Living page. You can also connect to our community through our Facebook Off Campus Housing and Roommate Corner page.\nHow accessible are the professors at Chapman?\nWith a small student to professor ratio (most classes have less than 20 students), Food Science students have incredible access in this highly personalized program.\nDoes Chapman offer part-time enrollment and evening classes?\nBecause many of our Food Science students work or hold internships in the industry, most of our classes are offered in the late afternoons & evenings. Many students attend part-time.\nWhat Student Resources are available?\nWe welcome a diverse student population with a variety of needs, and Chapman University has resources available for all our students. Check our what's available on the Schmid College Diversity, Equity and Inclusion webpage!\n\nSCHOLARSHIPS, INTERNSHIPS, AND RESEARCH OPPORTUNITIES\nDoes your program offer scholarships or financial aid? Limited scholarships are awarded by the Food Science program for excellent applicants, as funding is available. Students are evaluated at the time of application (no separate application is necessary). We recommend completing the FAFSA for Financial Aid. Check out the Financial Aid website for more information.\nWhat research opportunities are there? Students have amazing opportunities for collaboration with Faculty in many compelling areas. Check out the Faculty Members section in the drop-down above for more information!\nWhat internship opportunities are there?\nBecause the Chapman Food Science program & faculty have close ties with the industry, students often receive excellent internship opportunities.\n \n\nFOR INTERNATIONAL STUDENTS\nAre Chapman's Food Science students eligible for STEM benefits?\nYes, students in our program are eligible to apply for STEM (Science, Technology, Engineering & Math) benefits. See the International Student & Scholar Services page for more information, or contact Monica Chen, at mchen@chapman.edu or (657) 304-3126.\nWhat is OPT?\nOptional Practical Training, or OPT, allows international students to work in the United States for three years (for STEM fields), following graduation, in a job related to one's major field of study. See the International Student & Scholar Services page for more information.\nWhat is CPT?\nCurricular Practical Training allows one to participate in an off-campus paid internship that is related to the student's major or field of study. More informationcan be found at International Student & Scholar Services. \n\n\n\n\n\n\n\n\n\n\nMS Food Science\n\n\nJoint MS Food Science / MBA\n\n\nFood Science Program - Better Process Control School\n\n\nRanney Food Processing Lab\n\n\nUSDA National Needs Fellowship Program\n\n\nUSDA Fellowship Application\n\n\n\n\n\n\nContact Us and Supplementary Information\n\nSharnique DowGraduate Admission Counselorsdow@chapman.edu  (714) 628-6770\nRobyne KellyGraduate Program Managerrokelly@chapman.edu(714) 289-2040Monica ChenAssociate Director of International Initiatives, DSOMchen@chapman.edu(714) 289-3590\nGraduate Financial Aidgradfinaid@chapman.edu(714) 628-2730\n\n\nGraduate Course Catalog\n\n\nAttend an Information Session\n\n\nFood Science Program Handbook\n\n\nTuition and Fees\n\n\n\n\n\n\n\n\n\nRequest Info\nApply Now\nSupport Our Program\n\n\n\n\n\n Food Science Travel Course\n\nFood Science and Nutrition students traveled to the Umbria region of Italy this May for the latest Food Industry Travel Course exploring Italian Food and Culture. Students & faculty enjoyed hunting for truffles, visiting artisan producers of Parmigiana Reggiano, balsalmic vinegar, proscuitto, Lambrusco-as well as some of the ancient wonders of the world. Will you join us when we return in 2023?\n\n\n\n\n\n\n\n\n\n\n\n\n Contact Us   Maps & Directions    Emergency \n\n\n\nOrange Campus\nOne University Drive  Orange, CA 92866   (714) 997-6815\n\nRinker Health Science Campus\n9401 Jeronimo Road  Irvine, CA 92618 \n\n\n\nGet Started\n\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment\n\n\n\nDiscover\n\nSchools and Colleges\nPrograms at Chapman\nEvents at Chapman\nNewsroom\nDirectory\n\n\n\n\nSupport\n\nReport Concern or Incident\nAccessibility Feedback\nWebsite Feedback\nDisability Services\nConsumer Disclosures\nPrivacy Policy\nTitle IX\n\n\n\n Chapman Logo                                               \n© 2022 Chapman University           \n\n\n Back to top    \n\n\n\n\n\n/_featured/Default.xml\nSchmid\nSCHMID\nDo Not Show\nDo Not Show\n\n\n\n",
    "links": [
        "#main",
        "../../../index.aspx",
        "../../index.aspx",
        "../../about/message-from-dean.aspx",
        "../../about/faculty-directory.aspx",
        "../../about/contact-us.aspx",
        "../../about/deans-advisory-council.aspx",
        "../../about/diversity-equity-inclusion.aspx",
        "../../undergraduate/index.aspx",
        "../../undergraduate/bs-biochemistry.aspx",
        "../../undergraduate/bs-biological-sciences.aspx",
        "../../undergraduate/bs-chemistry.aspx",
        "../../undergraduate/bs-environmental-science-policy.aspx",
        "../../undergraduate/bs-mathematics.aspx",
        "../../undergraduate/bs-mathematics-civil-engineering.aspx",
        "../../undergraduate/bs-physics-computational-science.aspx",
        "../../undergraduate/philosophy/index.aspx",
        "../../undergraduate/philosophy/why-major-in-philosophy.aspx",
        "../../undergraduate/minors.aspx",
        "../../undergraduate/beckman-scholars-program/index.aspx",
        "../../undergraduate/beckman-scholars-program/beckman-application.aspx",
        "../../undergraduate/beckman-scholars-program/beckman-mentors.aspx",
        "../../undergraduate/beckman-scholars-program/beckman-scholars.aspx",
        "/scst/undergraduate/nsf-ires",
        "../index.aspx",
        "index.aspx",
        "ms-food-science-mba.aspx",
        "better-process-control-school.aspx",
        "/scst/graduate/ms-food-science/ranney-food-processing-lab",
        "usda-fellowship-program.aspx",
        "usda-fellowship-application.aspx",
        "../ms-computational-science.aspx",
        "../phd-computational-science.aspx",
        "../dsci-mpp.aspx",
        "../../integrated-degree-programs.aspx",
        "../../student-activities-org.aspx",
        "/scst/support-schmid",
        "../../conferences-and-events/index.aspx",
        "../../conferences-and-events/phytosanitary-irradiation-workshop.aspx",
        "../../conferences-and-events/conferences/ieee-game-showcase.aspx",
        "../../conferences-and-events/conferences/research-and-application-of-ai-for-cardiac-disease-conference.aspx",
        "../../conferences-and-events/grothendieck-conference.aspx",
        "../../conferences-and-events/quantum-physics-conference.aspx",
        "/scst/research",
        "../../../about/index.aspx",
        "../../../about/maps-directions/index.aspx",
        "../../../about/visit/index.aspx",
        "../../../about/facts-and-rankings/index.aspx",
        "../../../about/our-family/leadership/index.aspx",
        "../../../diversity/index.aspx",
        "../../../campus-services/index.aspx",
        "../../../about/connect/index.aspx",
        "../../../academics/index.aspx",
        "../../../academics/degrees-and-programs.aspx",
        "../../../academics/schools-colleges.aspx",
        "../../../academics/academic-calendar.aspx",
        "../../../our-faculty/index.aspx",
        "../../../academics/libraries/index.aspx",
        "https://catalog.chapman.edu",
        "../../../international-studies/index.aspx",
        "../../../admission/undergraduate/index.aspx",
        "../../../admission/undergraduate/how-to-apply/index.aspx",
        "../../../admission/graduate/index.aspx",
        "../../../admission/graduate/apply/how-to-apply.aspx",
        "../../../admission/undergraduate/financing/index.aspx",
        "../../../students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://go.chapman.edu/portal/visit",
        "../../../alumni/index.aspx",
        "../../../arts/index.aspx",
        "../../../arts/index.aspx",
        "https://blogs.chapman.edu/huell-howser-archives/",
        "https://events.chapman.edu/?view=list&group_id=21",
        "../../../arts/escalette-collection.aspx",
        "../../../wilkinson/art/gallery/index.aspx",
        "https://www.hilbertmuseum.com/#california-art=",
        "https://muscocenter.org/Online/default.asp",
        "../../../campus-life/index.aspx",
        "../../../campus-life/index.aspx",
        "http://www.chapmanathletics.com/landing/index",
        "../../../diversity/index.aspx",
        "https://events.chapman.edu/",
        "../../../campus-life/fish-interfaith-center/index.aspx",
        "../../../health-and-wellness/index.aspx",
        "../../../students/services/housing-and-residence/index.aspx",
        "../../../students/life/index.aspx",
        "../../../research/index.aspx",
        "../../../research/sponsored-projects-services/index.aspx",
        "../../../research/integrity/index.aspx",
        "../../../research/institutes-and-centers/index.aspx",
        "../../../research/center-for-undergraduate-excellence/index.aspx",
        "../../../research/industry-alliances-commercialization/index.aspx",
        "../../../support-chapman/index.aspx",
        "../../../support-chapman/get-involved/index.aspx",
        "../../../support-chapman/contact-us.aspx",
        "../../../alumni/index.aspx",
        "../../../campus-services/community-relations/index.aspx",
        "/https://working.chapman.edu/",
        "../../../industry-partners/index.aspx",
        "../../../families/index.aspx",
        "../../../students/index.aspx",
        "../../../about/visit/index.aspx",
        "../../../admission/index.aspx",
        "https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "../../../index.aspx",
        "../../../index.aspx",
        "../../index.aspx",
        "../../../about/visit/index.aspx",
        "../../../admission/index.aspx",
        "https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "../../../alumni/index.aspx",
        "../../../campus-services/community-relations/index.aspx",
        "https://working.chapman.edu/",
        "../../../industry-partners/index.aspx",
        "../../../families/index.aspx",
        "../../../students/index.aspx",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "../../../campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu/",
        "https://working.chapman.edu/",
        "../../../about/index.aspx",
        "../../../about/maps-directions/index.aspx",
        "../../../about/visit/index.aspx",
        "../../../about/facts-and-rankings/index.aspx",
        "../../../about/our-family/leadership/index.aspx",
        "../../../diversity/index.aspx",
        "../../../campus-services/index.aspx",
        "../../../about/connect/index.aspx",
        "../../../academics/index.aspx",
        "../../../academics/degrees-and-programs.aspx",
        "../../../academics/schools-colleges.aspx",
        "../../../academics/academic-calendar.aspx",
        "../../../our-faculty/index.aspx",
        "../../../academics/libraries/index.aspx",
        "https://catalog.chapman.edu",
        "../../../international-studies/index.aspx",
        "../../../admission/undergraduate/index.aspx",
        "../../../admission/undergraduate/how-to-apply/index.aspx",
        "../../../admission/graduate/index.aspx",
        "../../../admission/graduate/apply/how-to-apply.aspx",
        "../../../admission/undergraduate/financing/index.aspx",
        "../../../students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://go.chapman.edu/portal/visit",
        "../../../alumni/index.aspx",
        "../../../arts/index.aspx",
        "https://blogs.chapman.edu/huell-howser-archives/",
        "https://events.chapman.edu/?view=list&group_id=21",
        "../../../arts/escalette-collection.aspx",
        "../../../wilkinson/art/gallery/index.aspx",
        "https://www.hilbertmuseum.com/#california-art=",
        "https://muscocenter.org/Online/default.asp",
        "../../../campus-life/index.aspx",
        "http://www.chapmanathletics.com/landing/index",
        "../../../diversity/index.aspx",
        "https://events.chapman.edu/",
        "../../../campus-life/fish-interfaith-center/index.aspx",
        "../../../health-and-wellness/index.aspx",
        "../../../students/services/housing-and-residence/index.aspx",
        "../../../students/life/index.aspx",
        "../../../research/index.aspx",
        "../../../research/sponsored-projects-services/index.aspx",
        "../../../research/integrity/index.aspx",
        "../../../research/institutes-and-centers/index.aspx",
        "../../../research/center-for-undergraduate-excellence/index.aspx",
        "../../../research/industry-alliances-commercialization/index.aspx",
        "../../../support-chapman/index.aspx",
        "../../../support-chapman/get-involved/index.aspx",
        "../../../support-chapman/contact-us.aspx",
        "#breadcrumbs",
        "/",
        "../../index.aspx",
        "../../about/index.aspx",
        "../../undergraduate/index.aspx",
        "../index.aspx",
        "../../integrated-degree-programs.aspx",
        "../../student-activities-org.aspx",
        "../../support-schmid/index.aspx",
        "../../conferences-and-events/index.aspx",
        "../../research/index.aspx",
        "../index.aspx",
        "index.aspx",
        "../ms-computational-science.aspx",
        "../phd-computational-science.aspx",
        "../dsci-mpp.aspx",
        "https://www.facebook.com/Chapman.fsnsa",
        "https://instagram.com/cufoodscience/",
        "https://www.youtube.com/watch?v=PIuSc7mOnzc&list=PLBAF625333A86D39F",
        "https://catalog.chapman.edu/preview_program.php?catoid=43&poid=8318&returnto=2287",
        "https://www.ift.org/career-development/learn-about-food-science/careers-in-food-science",
        "https://www.ift.org/career-development/learn-about-food-science",
        "../../../about/our-home/keck-center/index.aspx",
        "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.asteroom.com%2Fpviewer%3Fhideleadgen%3D1%26token%3Dp5zZCIjcvkWLqPuSAiszCg&data=04%7C01%7Crokelly%40chapman.edu%7Ccf6efda1f94a42fbe75308d9d1411ef4%7C809929af2d2545bf9837089eb9cfbd01%7C1%7C0%7C637770899948671178%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000&sdata=TCsZlRLOf7p8HlagCrTwHUSzQVckiOATHsVwXhhdfVs%3D&reserved=0",
        "https://www.bls.gov/ooh/life-physical-and-social-science/agricultural-and-food-scientists.htm",
        "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fyoutu.be%2FlynmzNwxlGE&data=04%7C01%7Crokelly%40chapman.edu%7Cb3aa8d56b1c444321cb208d8d91c06a7%7C809929af2d2545bf9837089eb9cfbd01%7C1%7C0%7C637498061681274043%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=FLX9u5hjT2EOXvELMpbBfHbh01Vk3xRX%2BK7lLnWHWP4%3D&reserved=0",
        "https://go.chapman.edu/portal/gr-food-science-events",
        "https://forms.gle/Tza2jzGAbunPC1zV6",
        "mailto:rokelly@chapman.edu",
        "https://s.giannini.ucop.edu/uploads/giannini_public/55/17/55176a74-315f-4566-8ea2-fb5993b3be8b/v18n4_3.pdf#:~:text=We%20estimate%20that%20the%20food,economy%20and%20nearly%20205%2C000%20jobs.",
        "../../_files/forms-pdfs/food-science/ift-2017-salary-survey-report.pdf",
        "https://catalog.chapman.edu/preview_program.php?catoid=43&poid=8350",
        "https://catalog.chapman.edu/preview_program.php?catoid=43&poid=8349",
        "https://go.chapman.edu/portal/gr-food-science-events",
        "integrated-biology-and-fs_updated-12.14.21.pdf",
        "accelerated-chem-and-fs.pdf",
        "integrated-chem-and-fs_updated-12.9.21.pdf",
        "accelerated-chem-and-fs.pdf",
        "accelerated-bchm-and-fs-21.pdf",
        "integrated-bchm-and-fs-21_updated-12.9.21.pdf",
        "integrated-hsci--fs-20_12.16.21.pdf",
        "https://catalog.chapman.edu/preview_program.php?catoid=42&poid=8081&returnto=2227",
        "mailto:miklavcic@chapman.edu",
        "https://catalog.chapman.edu/preview_program.php?catoid=42&poid=8081&returnto=2227",
        "http://www.chapman.edu/our-faculty/lilian-were",
        "http://www.chapman.edu/our-faculty/fredric-caporaso",
        "http://pftfish.net/",
        "http://sites.chapman.edu/hellberg/",
        "http://www.chapman.edu/our-faculty/rosalee-hellberg",
        "http://www.chapman.edu/foodprocessing",
        "https://news.chapman.edu/2019/05/07/the-science-of-shelf-life/",
        "http://www.chapman.edu/our-faculty/lilian-were",
        "http://www.chapman.edu/our-faculty/anuradha-prakash",
        "https://www.chapman.edu/our-faculty/john-miklavcic",
        "https://www.chapman.edu/our-faculty/aftab-ahmed",
        "https://www.chapman.edu/our-faculty/cedric-owens",
        "https://www.chapman.edu/our-faculty/criselda-toto",
        "https://www.youtube.com/watch?v=QaI3KKyD1nA&index=14&list=PL9tsZDAdknyZvHPz6YKdVzRBQYjZxKfQL",
        "https://createsend.com/t/r-A7955E84E3FDECDE2540EF23F30FEDED",
        "https://chapmanu.co1.qualtrics.com/jfe/form/SV_d727pZ9AGgvYKH3",
        "https://www.chapman.edu/scst/graduate/ms-food-science/better-process-control-school.aspx",
        "https://www.facebook.com/groups/152897253318/",
        "https://digitalcommons.chapman.edu/",
        "http://www.ets.org/gre/",
        "https://www.facebook.com/Chapman.fsnsa",
        "https://chapmanfsnsa.wixsite.com/cufoodscience",
        "../../../students/services/housing-and-residence/housing-options/off-campus-resources/index.aspx",
        "https://www.facebook.com/CUoffcampushousing",
        "https://www.chapman.edu/scst/about/diversity-equity-inclusion.aspx",
        "../../../students/tuition-and-aid/financial-aid/index.aspx",
        "../../../students/services/international-student-services/index.aspx",
        "../../../students/services/international-student-services/index.aspx",
        "../../../students/services/international-student-services/index.aspx",
        "index.aspx",
        "ms-food-science-mba.aspx",
        "better-process-control-school.aspx",
        "ranney-food-processing-lab/index.aspx",
        "usda-fellowship-program.aspx",
        "usda-fellowship-application.aspx",
        "mailto:sdow@chapman.edu",
        "mailto:rokelly@chapman.edu",
        "mailto:takada@chapman.edu",
        "mailto:gradfinaid@chapman.edu",
        "https://catalog.chapman.edu/content.php?catoid=43&navoid=2287",
        "../../../admission/graduate/visit.aspx",
        "https://www.chapman.edu/academics/graduate-education/current-students/index.aspx",
        "../../../students/tuition-and-aid/SBS/tuition-and-services/index.aspx",
        "https://go.chapman.edu/register/Schmid-info",
        "../../../admission/graduate/apply/how-to-apply.aspx",
        "https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=54&SINGLESTORE=true",
        "../../../about/connect/index.aspx",
        "../../../about/maps-directions/index.aspx",
        "../../../emergency/index.aspx",
        "https://www.google.com/maps/place/Chapman+University/@33.7931305,-117.8543282,17z/data=!3m1!4b1!4m5!3m4!1s0x80dcd9e1d9d6e8ef:0x6ebb27c51b72a8ec!8m2!3d33.7931305!4d-117.8521395?hl=en",
        "tel:+1714-997-6815",
        "https://www.google.com/maps/place/Chapman+University+Rinker+Health+Science+Campus/@33.650635,-117.7203547,17z/data=!4m13!1m7!3m6!1s0x80dce81715a0d84b:0x8fe3dc2fce1c83da!2s9401+Jeronimo+Rd,+Irvine,+CA+92618!3b1!8m2!3d33.650635!4d-117.718166!3m4!1s0x80dcde16796ddc25:0xb4afb4199eff4db8!8m2!3d33.6506535!4d-117.7181062?hl=en",
        "../../../about/visit/index.aspx",
        "../../../students/tuition-and-aid/index.aspx",
        "../../../admission/undergraduate/how-to-apply/index.aspx",
        "../../../faculty-staff/human-resources/jobs/index.aspx",
        "../../../academics/schools-colleges.aspx",
        "../../../academics/degrees-and-programs.aspx",
        "https://events.chapman.edu/",
        "https://news.chapman.edu/",
        "../../../directory/index.aspx",
        "../../../reporting/index.aspx",
        "../../../accessibility/feedback-form.aspx",
        "../../../website-feedback-form.aspx",
        "../../../students/health-and-safety/disability-services/index.aspx",
        "../../../consumer-information-disclosures/index.aspx",
        "../../../campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "../../../students/health-and-safety/title-ix/index.aspx",
        "/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu"
    ]
}