{
    "title": "Zero waste efforts lead to award winning streak - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nJuly 11, 2022 Stanford’s recent efforts toward zero waste lead to award winning streak Stanford University is now a two-time first-place winner in the National Wildlife Federation’s Campus Race to Zero Waste competition for per capita recycling in the large campus division. The award reflects many new and upcoming zero waste initiatives. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Emily Moskal\n\n\nThe pleasant and attractive chute room in EVGR is meant to encourage residents to spend more time there, properly sorting their waste. (Image credit: Keith Uyeda R&DE Video & Media Specialist)\n\nFor the second year in a row, Stanford University is the first-place winner in the Campus Race to Zero Waste competition in the large campus, per capita recycling category. The competition is in partnership with the National Wildlife Federation, one of the largest nonprofits in the U.S. dedicated to conservation.\nStanford received top honors for properly disposing of the most recyclables by weight for an eight-week stretch earlier this year among participating large universities.\n“We’re in the process of improving the design of our entire waste stream, from how it’s generated at the procurement side, all the way down to the waste hauling and how it’s processed behind the scenes,” said Aurora Winslade, director of the Office of Sustainability at Stanford.\nThe living laboratory of waste reduction\nStanford has one of the oldest and largest recycling programs in the country. Julie Muir, the zero waste systems manager at Stanford, uses the Campus Race to Zero Waste – which the university has participated in for over 15 years – as a benchmark.\nMuir expects to perform even better next year after she implements new zero waste initiatives, which started this June. Her group is setting up single-stream recycling, adding composting to every break room, composting bathroom paper towels, and adding common area recycling rather than desk-side collection, among other initiatives.\nBoth in the past and moving forward, the University also supports processes through which food scraps are fed to farm animals and other organics are repurposed – like sending cooking oil to be made into biofuels – said Muir, who added that campuses get additional points in the competition for these waste reduction methods.\nOne of the major changes in zero waste initiatives is centralizing recycling, which will require everyone to participate in the success of the waste system. Muir said this will involve behavior change and could provide a mindful break from the computer as people walk from their desk to the collection area.\nThese major changes follow a pilot done on 14 buildings, which increased the recycling rate by 29 to 44 percentage points in many areas. Stanford’s most sustainable building, Y2E2, went from a 60% recycling rate to 89%.\nAt Stanford, Winslade said, ideas are constantly evolving, and innovative strategies are applied to reach zero waste, in a process that is reminiscent of the scientific method.\n“I think viewing the campus as a living lab is the way of the future,” said Winslade. “We’re testing out our ideas; we’re bringing the best practices and industry standards to create an efficient collection system.”\nBut Winslade acknowledged that there is still a long way to go. Stanford is currently at 65% diversion of landfill waste, and there are less than eight years left to get to near 100. Studies show that by deploying various waste reduction strategies, such as enhancing reuse programs, moving to centralized collection of waste, expanding compost programs, and rethinking procurement programs, that number could easily be 96% – meeting the criteria for zero waste.\n“The next few years will be essential to take those big leaps forward,” she said.\nEducation makes a big dent\nTo change behavior, Muir’s team targets communication at a near-individual level by using technology to separate those who are recycling correctly and those who don’t by location in a building.\n\n\nStanford goes platinum\nStanford’s sustainability efforts are being recognized in other ways as well. In May, the university again earned the highest STARS rating of Platinum from the Advancement of Sustainability in Higher Education (AASHE). Short for the Sustainability Tracking, Assessment & Rating System, STARS measures and encourages sustainability in all aspects of higher education, including operations, academics, DEI, and more.\nOne point of distinction in the AASHE Platinum rating was the establishment of the Stanford Doerr School of Sustainability. Set to launch this fall, Stanford’s first new school in 70 years will catalyze interdisciplinary efforts to tackle urgent climate and sustainability challenges facing people and ecosystems worldwide.\nStanford has been participating in STARS for a decade, and this marks Stanford’s third time earning a Platinum rating. Stanford is currently one of only approximately 15 institutions with a STARS Platinum rating.\n“This Platinum rating is a great reflection of intense collaboration across the campus with dozens of partners providing sustainability content and data,” said Lincoln Bleveans, the executive director of Sustainability & Energy Management at Stanford.\n\n“We have this cool new app that monitors the contamination in bins,” Muir said. “Rather than talking to the whole building, we can go, ‘Oh, first floor on the right side, it seems like you’re struggling a little bit. Someone doesn’t know where their tea bags go.'” (Tea bags go into the compost bin.)\nMuir says the most common mistake she sees is people putting paper towels in the landfill bin when they should go in the compost bin. Getting it right is important because incorrectly sorted waste gets sent to the landfill rather than being recycled or composted. The solutions, said Muir, are education and engagement that are also motivating.\n“Waste is such a personal, individual action that people do,” said Muir. “Like 10 times a day, you’re in front of the trashcan going, ‘Okay, what do I do with this?’ So we need individuals to participate.”\nTo reach people where they’re at, Muir and her team have created the Zero Waste Campus Committee, a group launching this year that gathers people from various academic units –medical, education, law – who volunteer to become more educated about zero waste and, in return, educate their communities. Two big tasks will be learning how to recycle carpet and how to reduce the waste in the 36 cafes on campus.\nSmart solutions for students\nResidences and dining halls are where about 50% of Stanford waste originates. So, Kristin Parineh, sustainability manager for Residential & Dining Enterprises (R&DE), and her team use monitoring technology, surveys, and the latest ideas from waste reduction studies to support the journey to zero waste.\n\nWaste corrals outside Crothers Memorial Hall, which follows an “equal and visible” design theory that studies have shown can substantially reduce landfill. (Image credit: Keith Uyeda R&DE Video & Media Specialist)\n\nFor example, R&DE follows the “equal and visible” principle when designing enclosures, which research has shown can reduce landfill by over 30%. The principle states that in order to maximize sorting, each bin – recycling, compost, and landfill – must be the same size and equally visible from the entrance. Parineh and her team are also working with R&DE Strategic Communications to redesign waste rooms to be colorful, bright, and clean because they’ve learned that one of the top deterrents to proper waste sorting is that students said the process is gross and smelly.\nR&DE Stanford Dining, Hospitality & Auxiliaries continues to lead campus-wide efforts to reduce food waste in all of its locations. It has committed to a 25% food waste reduction by the end of 2022.\nOn the residential side, when Parineh found that mini-fridges constitute a significant contribution to waste every June – more than half of the students bring mini-fridges into housing and then throw them away at the end of the year – Stanford decided to furnish them for the students who stayed on campus during stay-at-home orders to be re-used year after year.\nAnother program, Give & Go, developed by R&DE, kicked into high gear in May. Through that students can donate items in good condition to those in need during moveout. So far, in 10 years, more than 390 tons have been donated through the program. Students can recognize drop-off boxes by the alpaca mascot.\nParineh said the program hits the triple bottom line of sustainability: it’s good for finances, people, and the environment.\nThat philosophy propels every sustainability project at Stanford, keeping the campus competitive enough to garner honors, like that of the Campus Race to Zero Waste.\n“At Stanford, we’re always looking to do the right thing from a cost perspective, a customer service perspective, and a sustainability perspective,” said Lincoln Bleveans, the executive director of Sustainability & Energy Management at Stanford. “And if you work hard enough, those things shouldn’t be mutually exclusive.”\n\n\n\n\n\n\n\n\n\n\n\n\nStanford News\nAwards\nSustainability\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D8019",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2022/07/EVGR-Chute-Room-1-2.jpg",
        "https://blog.nwf.org/2021/05/campus-race-to-zero-waste-2021-final-results-colleges-and-universities-keep-230-million-plastic-containers-out-of-the-landfill/",
        "https://sustainable.stanford.edu/",
        "https://sustainable.stanford.edu/campus-action/waste/waste-initiatives/zero-waste-building-pilots",
        "https://reports.aashe.org/institutions/stanford-university-ca/report/2022-03-03/PRE/introduction/PRE-2/",
        "https://sustainability.stanford.edu/",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2022/07/MCP-Waste-Corrals-Crothers-1-1.jpg",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/topic/awards/",
        "https://news.stanford.edu/report/topic/sustainability/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D8019",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}