{
    "title": "‘Ghosts’ Stories: On a Hit TV Show, CSUN Alum Uses His Voice  |  CSUN Today",
    "body": "\n\n\n\nCSUN Homepage\nWebmail\nA to Z\nPeople Finder\nEvents Calendar\nAccessibility\nSkip to Content\n \n\n\n\n\n\n\nCSUN Today\nCalifornia State University, Northridge\nNavigation\n\n\n\nSubscribe:\nRSS\n\n\n\nSearch\n\n\n\n\n\n\n\n\nHome\nTop Stories\nCSUN Leaders\nUniversity News\nFor the Media\nFaculty & Staff\nCSU News\n \n\n\n\n\n\n\n‘Ghosts’ Stories: On a Hit TV Show, CSUN Alum Uses His Voice\n\n\n\n\n\t\t\t\t\tby Jacob Bennett\t\t\t\t\n\non\nApril 26, 2023\n\n\nin\nAlumni, Arts and Culture \n\nComments Off on ‘Ghosts’ Stories: On a Hit TV Show, CSUN Alum Uses His Voice \n\n\n\n\n\n\n\n\n\n\nRomán Zaragoza. Photo by Chollete\n\nRomán Zaragoza got nervous when he read the character description before his audition for the sitcom “Ghosts.”\nAs an actor of Akimel O’otham and Mexican descent on his father’s side and Japanese and Taiwanese descent on his mother’s side, Zaragoza ’21 (Cinema and Television Arts – Film) doubted his prospects in television or film because of all the stereotypical Native American and Asian roles he found himself auditioning for — and there were so many ways the writing for this Native character could’ve gone wrong, too.\n“I was like, ‘Oh no, it’s a show called ‘Ghosts,’ and it’s a character that’s Lenape and he’s from the 1500s,’” he recalled. “‘Oh, no, they’re gonna want me to have an accent and do some stereotypical thing.’ But then right below, it said, ‘Please use your normal accent.’”\nThat changed everything.\nThe more Zaragoza learned about the multi-dimensional character, Sasappis, and the show, the more excited he became.\nHe auditioned for the role and shot the pilot in late 2020, while in his last year at California State University, Northridge. The show was picked up in early 2021, and when he graduated, Zaragoza found himself starring on what has become one of the most popular sitcoms on TV, a hit with audiences and critics alike. “Ghosts,” which airs on CBS and can be streamed on Paramount+, was recently picked up for a third season.\nFor Zaragoza, who loved sitcoms such as “How I Met Your Mother,” “Friends” and “Parks and Recreation,” landing a starring role on a hit network comedy is a dream come true.\n“It’s amazing, and then to be playing a character like Sass, it’s been a really beautiful experience,” Zaragoza said. “And seeing how the Native community has really supported him and the story, it’s really cool. I’m very, very grateful and constantly just pinching myself.”\nCSUN’s film program in the Mike Curb College of Arts, Media, and Communication intentionally makes space for voices that historically haven’t been fairly represented on TV and in films. The program is designed to give students experiences in a lot of industry roles, said Jared Rappaport, chair of CSUN’s Department of Cinema and Television Arts (CTVA).\n“We pride ourselves on developing new talents, with new voices going out in the industry,” Rappaport said. “We look at ourselves as the CTVA family. So, when our students succeed in Hollywood — we have a lot of success stories — we’re very proud of what they’ve accomplished.”\nZaragoza is already using his voice to help ensure respectful representation in his projects, and he plans to continue telling stories in a variety of ways as his career unfolds. He has starred on stage and screen and successfully ventured into directing and producing.\n“CSUN definitely gave me the tools and the space to tell my own stories,” he said.\nA Three-Dimensional Ghost\nRoman Zaragoza as Sasappis on “Ghosts.” Photo: Bertrand Calmeau/CBS\n\n“Ghosts” stars Rose McIver and Utkarsh Ambudkar as a young couple who inherit a haunted estate that they turn into a bed-and-breakfast. Many of the people who died on the property are stuck there as a sort of purgatory — among others, Sasappis haunts the property alongside the ghosts of a Viking, a Prohibition-era singer, a hippie who tried to hug a bear, and a “finance bro” who died without pants on (and now spends eternity without them).\nSasappis — shortened to “Sass,” and that’s Zaragoza’s preferred spelling of the nickname — has a dry wit and a love for pizza. He’s a talented storyteller, a hopeless romantic and a bit of a troublemaker. After being stuck on the property for hundreds of years, he creates drama out of boredom, such as when he discovered one character’s secret crush on another and told everyone almost instantly.\nWhile there’s much more progress to be made, Sass arrived at a moment when Native representation has increased in front of and behind the camera — Zaragoza cited the TV shows “Reservation Dogs” and “Rutherford Falls,” as well as the “Predator” movie prequel “Prey.”\nThe “Ghosts” showrunners invited Zaragoza’s input on the best ways to craft respectful representation on their show. At his suggestion, they hired a Lenape consultant, Joe Baker. A writer on staff, John Timothy, is Muskogee Creek.\nIn a season two episode, Sass wants to save an old tree on the property that has personal significance to him. The episode ends with a land acknowledgement, including a discussion about why they’re important.\n“The show works because it’s not only funny, but it also makes you feel things,” Zaragoza said. “It’s so healing. There are so many messages and storylines where we dive into death and love and family and loss. I just love the messages.”\nThe land acknowledgement episode was particularly meaningful to Zaragoza, who was active in CSUN’s American Indian Student Association, took American Indian Studies classes, and attended the campus’ annual Powwow to celebrate American Indian communities of Los Angeles and greater Southern California. In 2020, following conversations between the Fernandeño Tataviam Band of Mission Indians and CSUN faculty and administrators, CSUN began publicly acknowledging the Sesevitam, the first people of this ancestral and unceded territory of Sesevenga, which is now occupied by the university, and the Sesevitam descendants who are citizens of the Tataviam Band. Students advocated for additional recognition efforts on campus.\nAfter graduation, Zaragoza also hosted a video podcast for the American Indian Student Association, interviewing Indigenous artists such as writer Stephen Graham Jones, “Spirit Rangers” creator and showrunner Karissa Valencia, and his sister, recording artist Raye Zaragoza. (Román’s directing credits include some of her music videos.)\n“I’m always excited to see the relationship between universities and Indigenous nations,” he said.\n‘Your Voice Matters’\nRomán Zaragoza as Usnavi in a CSUN Department of Theatre production of “In the Heights.” Photo by Anneka Bunnag.\n\nZaragoza grew up in New York City, the son of actor Gregory Zaragoza and business professor Shirley Zaragoza. He moved to Los Angeles with his family at age 11 when his older sister, Danielle, got into UCLA. He thought he would follow in her footsteps, but he didn’t get into UCLA. CSUN accepted him, and it turned out to be a terrific fit — the CTVA program is highly regarded as one of the best in the country.\nHe arrived at CSUN in 2014 and took a screenwriting class his freshman year, and he set his mind to learning to direct as well. In spring 2017, he played the lead role of Usnavi in the Department of Theatre’s production of “In the Heights” at The Soraya.\n“My freshman year I just really learned, ‘Your voice matters,’” he said. “I’m very grateful for the experiences I had there. It was definitely one of those parts of my life where I felt very lost, and then CSUN really helped me find what I wanted and where I wanted to go.”\nZaragoza also had honed his acting chops in high school. At 15, he joined Native Voices at the Autry, an equity theatre company at the Autry Museum of the American West that develops and produces works by Native artists. Zaragoza’s role in the Native Voices show “Off the Rails” led him to eventually taking a three-year break from CSUN, as the show was selected for the Oregon Shakespeare Festival.\nReturn to CSUN\nHe returned to CSUN in August 2020, joining an unfamiliar cohort of classmates on Zoom.\nHe was one of three producers on the senior film project “This Is Their Land,” written and directed by classmate Michael O’Leary ’21 (Cinema and Television Arts – Film). The film is about the Modoc leader known as Captain Jack, and his tense peace negotiations with the U.S. Army in his ancestral homeland in Northern California and Southern Oregon, during the Modoc War of 1872-73.\nZaragoza filled a wide range of roles on the project, including helping to ensure a respectful telling of the story. He helped with casting, making connections with the descendants of the Modoc people depicted in the film, and finding a translator who could translate much of the script into the traditional Mukluk language.\nZaragoza also has a small role in the film. His father, who has starred on Broadway and appeared in many movies and TV shows — including “Yellowstone” and an episode of “Ghosts” in which he plays Sass’s father — also appears in the short film.\n“This Is Their Land” has been screened at festivals and also will get its pandemic-delayed CSUN celebration, at the CTVA 31st Senior Film Showcase (2021 Redux) on May 3.\nZaragoza said he hopes to one day start a production company with friends he made at CSUN.\n“There’s just really talented people that came out of that program,” Zaragoza said. “I’m very grateful for the program and all the friends I made from it.”\n\n\n\n\n\n\n American Indian Student Association, American Indian Studies, American Indian Studies Program, Cinema and Television Arts, CSUN American Indian Studies, Department of Cinema and Television Arts, Featured\n\n\nSubscribe\n\n\n\n\n\n\n\n\nRelated Posts:\n\n\n\nCSUN Success Story: How Malachia Hoover’s Time as a Matador Put Her on the Path to Saving Lives\n\n\nStudying Away – Get to Know the International and Exchange Student Center\n\n\nNew Tech and a Sense of Community: CSUN’s Assistive Technology Conference Celebrates 38 Years\n\n\nCSUN to host multimedia performance that explores climate change\n\n\nTribal Leader, Philanthropist and Acclaimed Author to Receive Honorary Doctorates from CSUN\n\n\n\n \n\n\n← Tribal Leader, Philanthropist and Acclaimed Author to Receive Honorary Doctorates from CSUN\nCSUN to host multimedia performance that explores climate change →\n\n\n\n\n Top Stories\n\n\n\nFeatured Tag\n\n\n\n\n\n ‘Ghosts’ Stories: On a Hit TV Show, CSUN Alum Uses His Voice\non April 26, 2023in Alumni, Arts and Culture\n\n\n Tribal Leader, Philanthropist and Acclaimed Author to Receive Honorary Doctorates from CSUN\non April 25, 2023in Alumni, Community, CSU News, CSUN Events, Education, Faculty and Staff News, Graduation Ceremony, Honors & Awards, Media Releases, University News\n\n\n CSUN Breaks Ground on Autodesk Technology Engagement Center, a Project with National Impact\non April 24, 2023in Donor Profile, Giving\n\n\n\n\n \n\n\nCSU Resources CSU Leader\nCSYouCSU News\n\nTopicsArts and Culture\nAthletics\nBusiness\nCommunity\nCSU News\nEducation\nFaculty and Staff News\nHealth and Fitness\nMedia Releases\nPolitics and Society\nScience and Technology\n CSUN in the News\n\nCalifornia State University Northridge President Dr. Erika D. Beck: Five Things You Need To Be A Highly Effective Leader During Uncertain & Turbulent Times\n\nDealers at CSUN’s Electric Car Show\n\n\nWhat is critical race theory? Professor Theresa Montaño explains\n\n\n\n\n Athletics\nFive athletes from Crook County High School ink letters of intent\n\n\n\nSeveral area standouts make college choices\n\nUSC WOMEN MAINTAIN TOP SPOT UNANIMOUSLY IN CWPA WEEK 13 POLLS\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nGet the full  experience\n\nSubscribe Today\n\n\n\n\n\n\n\nSubscribe:\nRSS\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\nCalifornia State University, Northridge\nUniversity Advancement\nMarketing and Communications\n\t\t\t\t\t18111 Nordhoff Street, Northridge, CA 91330\n\t\t\t\t\tPhone: (818) 677-2130 / Contact Us\n\n\nContact Page Owner\nUniversity Policies\nAcrobat Reader\n\n\nCalifornia State University\nEmergency Information\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "http://www.csun.edu",
        "https://www.csun.edu/webmail/",
        "http://www.csun.edu/atoz/",
        "https://mynorthridge.csun.edu/psc/PANRPRD/EMPLOYEE/EMPL/c/NRPA_CSUN_APPS.NR_PEOPLESRCH_CMP.GBL/?&",
        "http://www.csun.edu/calendar/",
        "http://www.csun.edu/accessibility/",
        "#header",
        "https://csunshinetoday.csun.edu/",
        "https://csunshinetoday.csun.edu/",
        "#navigation",
        "https://csunshinetoday.csun.edu/feed/",
        "http://csuntoday.csun.edu/",
        "http://csuntoday.csun.edu/tag/featured/",
        "http://csuntoday.csun.edu/category/csun-leaders/",
        "http://csuntoday.csun.edu/category/university-news/",
        "https://csunshinetoday.csun.edu/for-the-media/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/",
        "https://csunshinetoday.csun.edu/category/csu-news/",
        "https://csunshinetoday.csun.edu/category/alumni/",
        "https://csunshinetoday.csun.edu/category/arts-and-culture/",
        "https://nlltribe.com/about-us-before-import/",
        "https://www.youtube.com/watch?v=2I1lGJ2MUA4",
        "https://www.youtube.com/watch?v=5m2naiB563k",
        "https://www.youtube.com/watch?v=UYWFqKmVW94",
        "https://csunshinetoday.csun.edu/arts-and-culture/csun-showcase-throws-spotlight-on-hollywoods-future-filmmakers/",
        "https://csunshinetoday.csun.edu/tag/american-indian-student-association/",
        "https://csunshinetoday.csun.edu/tag/american-indian-studies/",
        "https://csunshinetoday.csun.edu/tag/american-indian-studies-program/",
        "https://csunshinetoday.csun.edu/tag/cinema-and-television-arts/",
        "https://csunshinetoday.csun.edu/tag/csun-american-indian-studies/",
        "https://csunshinetoday.csun.edu/tag/department-of-cinema-and-television-arts/",
        "https://csunshinetoday.csun.edu/tag/featured/",
        "https://csunshinetoday.csun.edu/feed/",
        "http://www.twitter.com/csunorthridge",
        "http://www.facebook.com/calstatenorthridge",
        "http://www.youtube.com/calstatenorthridge",
        "https://csunshinetoday.csun.edu/science-and-technology/csun-success-story-how-malachia-hoovers-time-as-a-matador-put-her-on-the-path-to-saving-lives/",
        "https://csunshinetoday.csun.edu/arts-and-culture/studying-away-get-to-know-the-international-and-exchange-student-center/",
        "https://csunshinetoday.csun.edu/community/new-tech-and-a-sense-of-community-csuns-assistive-technology-conference-celebrates-38-years/",
        "https://csunshinetoday.csun.edu/arts-and-culture/csun-to-host-multimedia-performance-that-explores-climate-change/",
        "https://csunshinetoday.csun.edu/university-news/tribal-leader-philanthropist-and-acclaimed-author-to-receive-honorary-doctorates-from-csun/",
        "https://csunshinetoday.csun.edu/university-news/tribal-leader-philanthropist-and-acclaimed-author-to-receive-honorary-doctorates-from-csun/",
        "https://csunshinetoday.csun.edu/arts-and-culture/csun-to-host-multimedia-performance-that-explores-climate-change/",
        "#tab-featured_tag_tab",
        "https://csunshinetoday.csun.edu/arts-and-culture/ghosts-stories-on-a-hit-tv-show-csun-alum-uses-his-voice/",
        "https://csunshinetoday.csun.edu/arts-and-culture/ghosts-stories-on-a-hit-tv-show-csun-alum-uses-his-voice/",
        "https://csunshinetoday.csun.edu/category/alumni/",
        "https://csunshinetoday.csun.edu/category/arts-and-culture/",
        "https://csunshinetoday.csun.edu/university-news/tribal-leader-philanthropist-and-acclaimed-author-to-receive-honorary-doctorates-from-csun/",
        "https://csunshinetoday.csun.edu/university-news/tribal-leader-philanthropist-and-acclaimed-author-to-receive-honorary-doctorates-from-csun/",
        "https://csunshinetoday.csun.edu/category/alumni/",
        "https://csunshinetoday.csun.edu/category/community/",
        "https://csunshinetoday.csun.edu/category/csu-news/",
        "https://csunshinetoday.csun.edu/category/csun-events/",
        "https://csunshinetoday.csun.edu/category/education/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/",
        "https://csunshinetoday.csun.edu/category/graduation-ceremony/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/honors-awards/",
        "https://csunshinetoday.csun.edu/category/media-releases/",
        "https://csunshinetoday.csun.edu/category/university-news/",
        "https://csunshinetoday.csun.edu/giving/csun-breaks-ground-on-autodesk-technology-engagement-center-a-project-with-national-impact/",
        "https://csunshinetoday.csun.edu/giving/csun-breaks-ground-on-autodesk-technology-engagement-center-a-project-with-national-impact/",
        "https://csunshinetoday.csun.edu/category/donor-profile/",
        "https://csunshinetoday.csun.edu/category/giving/",
        "http://www.csun.edu/node/11001/subscribe-csun-shine-weekly-0",
        "http://www.calstate.edu/csuleader/",
        "http://www.calstate.edu/executive/communications/index.shtml",
        "http://csunshinetoday.csun.edu/category/csu-news/",
        "https://csunshinetoday.csun.edu/category/arts-and-culture/",
        "https://csunshinetoday.csun.edu/category/athletics/",
        "https://csunshinetoday.csun.edu/category/business/",
        "https://csunshinetoday.csun.edu/category/community/",
        "https://csunshinetoday.csun.edu/category/csu-news/",
        "https://csunshinetoday.csun.edu/category/education/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/",
        "https://csunshinetoday.csun.edu/category/health-and-fitness/",
        "https://csunshinetoday.csun.edu/category/media-releases/",
        "https://csunshinetoday.csun.edu/category/politics-and-society/",
        "https://csunshinetoday.csun.edu/category/science-and-technology/",
        "https://www.csun.edu/advancement/clips",
        "https://www.csun.edu/node/402101",
        "https://www.csun.edu/node/402109",
        "https://www.csun.edu/node/402030",
        "https://www.csun.edu/advancement/clips/8511/Athletics",
        "https://www.csun.edu/node/402097",
        "https://www.csun.edu/node/402087",
        "https://www.csun.edu/node/402034",
        "http://www.twitter.com/csunorthridge",
        "http://www.facebook.com/calstatenorthridge",
        "http://www.youtube.com/calstatenorthridge",
        "http://localhost:8888/csunnews",
        "https://csunshinetoday.csun.edu/feed/",
        "http://www.csun.edu/contact/",
        "mailto:csuntoday@csun.edu",
        "http://www-admn.csun.edu/vp/policies/",
        "http://get.adobe.com/reader/",
        "http://www.calstate.edu/",
        "http://www-admn.csun.edu/publicsafety/emergency/"
    ]
}