{
    "title": "Custom CSS, front page fun, Gutenberg outside of WordPress – Weekend Edition #251 - Gutenberg Times",
    "body": "\nSkip to the content\n\n\n\n\n\n\n\n\nMenu\nClose\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\nHome\nNews\nPodcast: Gutenberg Changelog\nLive Q & A Archive\nTestimonials\nAbout UsShow sub menu\n\nContact Us\nSponsors\n\n\n\n\n\nSearch For…\n\n\nSearch\n \n\n\n\n\nTwitter\nYouTube\nmastodon\n\n\n\n\n\n\n\n\nGutenberg Times\nCurating news and community voices about the WordPress Block Editor, codenamed Gutenberg\n\n\nTwitter\nYouTube\nmastodon\n\n\nSearch\n \n\nMenu\n\n\n\n\n\n\n\n\n\n\n\nSearch For…\n \nSearch\n\n\nClose\n\n \n\n\n\n\n\n\n\n\n\nCustom CSS, front page fun, Gutenberg outside of WordPress – Weekend Edition #251\n\n\n\n \n\n\n\n\nHowdy, \nAlthough, I found great content for you  and I was co-leading the Gutenberg plugin release, it felt like a quiet week. No family drama, no moving stress. Nowadays, I cherish the quiet moments, when I can sit and read a book, that’s not technical in nature. Or just sit with loved once and chat about life, or go for a walk along the Rhine. Or take a stroll through Tinguely Museum. What are your moments of quiet, you cherish, and you don’t have enough of? \nMéta-Harmonie II – Tinguely Museum\nThis will all change again next week, I am confident. 🤷🏻‍♀️\nHow was your week? \nHopefully, you can take a quiet moment for reading through this newsletter. Enjoy\nYours, 💕Birgit\n\n\nTable of Contents\nDeveloping Gutenberg and WordPressPlugins, Themes, and Tools for #nocode site builders and ownersTheme Development for Full Site Editing and BlocksBuilding Blocks and Tools for the Block editor. \n\n\nDeveloping Gutenberg and WordPress\nThis week, Gutenberg 15.6 was released. Nick Diego and I were leading the release and published the release post: What’s new in Gutenberg 15.6? (19 April). We highlighted \n\nDetails block, experimental\nSpacer Block gets spacing presets\nStyle variations in browse mode\n\nSarah Gooding also reported Gutenberg 15.6 Introduces Experimental Details Block and Command Center for Site Editor. \nNick Diego and I also recorded the Gutenberg Changelog episode 82 together and discussed not only the latest release but also what’s in the works, like revisions for Global Styles, or a Pattern creator. It was a great pleasure speaking with Nick again on the podcast. The episode 82 will arrive at your favorite podcast app over the weekend. \n“Daily doses Nick Diego”\n\n🎙️  New episode:  Gutenberg Changelog #82 – Gutenberg 15.6 and proposed schedule for WordPress 6.3 with Birgit Pauli-Haack and special guest Nick Diego\n\nA new call for testing is available for you! In FSE Program Testing Call #21: Front Page Fun, Anne McCarthy invites you to create and modify the front page of a site utilizing patterns that are available on a pre-built site, thanks to the InstaWP service. Share your experience on the post by May 8th, 2023. \nPlugins, Themes, and Tools for #nocode site builders and owners\nWes Theron posted a video on Building a page with only patterns. In this demo, he used a variety of patterns to create a Services Page. Patterns allow you to add beautifully designed, ready-to-go layouts to any WordPress site with a simple insert or copy/paste.\n\nJason Adams, announced GiveWP’S  Block based: Visual Donation Form Builder in Beta. We discussed in an earlier edition that GiveWP is rebuilding their powerful Donation plugin with a block first mindset. The revamp started off with the WordPress own components and scripts to build the interface, and the GiveWP team augmented it with custom code where necessary.  The Visual donation Form Builder is the first product to come from this effort. More info is also available on YouTube\nIf you work at an agency that helps their nonprofits fundraise using the GiveWP plugin, this beta test is for you. Furthermore, if you work at a nonprofit organization and are responsible for fundraising and building campaign related forms for your website, this beta test is for you. It gives you an early insight into what coming to GiveWP with its 3.0 version, and also a better feel for what will be possible with the new form builder that isn’t available right now. \n\nMunir Kamal released his AI Writer on Gutenberg Hub Shop –  plugin that integrates ChatGPT into the Gutenberg canvas. Your writing prompt is return with content, and then you can also ask for some rewrites, translate into various languages. You would need an OpenAI API key to enable the plugin, after you paid and installed the plugin. \n\nAlexandra Yap, Stackable wrote a tutorial on How to Use Countdown Timers for Marketing Campaigns. “Countdown timers in web design are digital timers that display the remaining time until a particular event or deadline. In this article, we’ll discuss how you can use countdown timers to boost your marketing campaigns.” she wrote. Congratulations to Benjamin Intal and his team to passing the milestone of 80,000 active installations of their plugin Stackable. \n\nThere are now 282 Block Themes in the WordPress repository. Here are three you could test. \n\nAbisko by Anders Noren, also mentioned on WPTavern\nSpectra One by Brainstorm Force, developers also of the classic Astra theme, also reviewed by Jamie Marsland, PootlePress\nCTLG by Automattic, specifically designed for creating lists, directories, and catalogs\n\n\nWhat’s the difference between a block theme and a classic theme? Jamie Marsland explains it in a few minutes in this video WordPress Block Themes vs Classic Themes: A Beginners Guide\nTheme Development for Full Site Editing and Blocks\nJustin Tadlock wrote tutorial on how to work with Per-block CSS with theme.json. “theme.json supports enough CSS features to cover most common styles. But it cannot reasonably cover every scenario and still have a matching design tool in the editor UI, which is an important consideration. If the interface covered every possibility, the user experience would suffer.” Tadlock wrote. He also answers the question, why not add everything to a style.css and be done with it. Learn how to add custom CSS per block. Tadlock also added a few thoughts on pitfalls, and has some tips and tricks for you. \n\n “Keeping up with Gutenberg – Index 2022” A chronological list of the WordPress Make Blog posts from various teams involved in Gutenberg development: Design, Theme Review Team, Core Editor, Core JS, Core CSS, Test and Meta team from Jan. 2021 on. Updated by yours truly.  The index 2020 is here\n\nBuilding Blocks and Tools for the Block editor. \nNathan Wrigley talked to Steve Brunner and Timothy Jacobs,  both founders of a SaaS app called Engine Awesome in the latest WP Jukebox podcast: #72 – Steve Bruner and Timothy Jacobs on Using Gutenberg Outside of WordPress. They discussed Gutenberg, but not how you might expect. It’s Gutenberg outside of WordPress, but Gutenberg nonetheless.\n\nThe recording of the Developer Hours: Introduction to the Interactivity API with Michal Czaplinski is now available on WordPressTV. It featured a live product demo of the Interactivity API.  Michal is one of the developers on the team that brought the Interactivity API to fruition. Following the demo, Michal answered attendees’ questions. \n\nRyan Welcher uploaded the recording of his 3rd edition of “Bring me your Issues” series to YouTube. First he gave an overview of the Gutenberg 15.5 release and the showed how to create a custom external template for APIs for the create-block scaffolding tool. \nThe latter was also a topic of a Gutenberg Times Live Q & A with Grzegorz Ziolkowski and Fabian Kägy a couple of years ago, with demos and additional background: Tooling: Using Create-Block Scaffolding and 3rd Party Templates\n\nAjay D’Souza showed you in his post WordPress block development: Building multiple blocks, how to use the create-block scaffolding tool to add blocks to your plugin. \n\nNeed a plugin .zip from Gutenberg’s master branch?Gutenberg Times provides daily build for testing and review. Have you been using it? Hit reply and let me know.\n\n\nQuestions? Suggestions? Ideas? Don’t hesitate to send them via email or send me a message on WordPress Slack or Twitter @bph. \nFor questions to be answered on the Gutenberg Changelog, send them to changelog@gutenbergtimes.com\n\n\nFeatured Image: Ypiyush22 Lego blocks lying on floor closeup – found on Wikimedia. \n\nDon’t want to miss the next Weekend Edition? \nType in your Email address to subscribe.SubscribeWe hate spam, too and won’t give your email address to anyone except Mailchimp to send out our Weekend EditionThanks for subscribing.\n\n\nRelated Posts\n\n\n\n6.2 Live Demo, 20-Year anniversary, Intrinsic design HTML Tag Processor, #WCAsia – Weekend Edition #244\n\n\n\n\nGetting started with block themes, playground, create-block tool and Block Data API—Weekend Edition #252\nShare\n\n\n\n\n\n\t\t\t\t\t\t\t\tPublished April 22, 2023 \n\n\t\t\t\t\t\t\t\tBy Birgit Pauli-Haack \n\n\t\t\t\t\t\t\t\tPosted in Block Plugins, Full-Site Editing, Site Editor, Updates, Weekend Edition \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\t\t\t\t\t\t\t\tAll Women-release squad for 6.4 , Grid Layout , Pattern for front-page designs and more – Weekend edition #250\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n \n\n\n\n\t\t\t\t\t\t\t\tGetting started with block themes, playground, create-block tool and Block Data API—Weekend Edition #252\t\t\t\t\t\t\t\n\n\n\n\n\n\n\nLeave a Reply\t\t\t\t\tCancel reply\n\n\n\n\n\n\n\n\n\n\nThis site uses Akismet to reduce spam. Learn how your comment data is processed. \n\n\n\n\n\n\n© 2023 Gutenberg Times\n\n\t\t\t\t\t\t\tTheme by Anders Norén \n\nTwitter\nYouTube\nmastodon\n\n\n\nBy using this website, you agree to our Privacy Policy× \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#site-content",
        "#",
        "#",
        "/",
        "https://gutenbergtimes.com/news/",
        "/podcast",
        "https://gutenbergtimes.com/live-q-a-archive/",
        "https://gutenbergtimes.com/testimonials/",
        "https://gutenbergtimes.com/about-us/",
        "#",
        "https://gutenbergtimes.com/contact-us/",
        "https://gutenbergtimes.com/category/sponsors/",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "https://gutenbergtimes.com/",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "#",
        "#",
        "#",
        "https://www.tinguely.ch/en.html",
        "https://www.tinguely.ch/en.html",
        "#0-word-press-release-information",
        "#0-p",
        "#2-word-press-6-0-1-and-6-1-scheduled",
        "#3-building-themes-for-fse-and-word-press",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#details-block-experimental",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#spacer-block-gets-spacing-presets",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#style-variations-in-browse-mode",
        "https://wptavern.com/gutenberg-15-6-introduces-experimental-details-block-and-command-center-for-site-editor",
        "https://gutenbergtimes.com/podcast/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3/",
        "https://make.wordpress.org/test/2023/04/17/fse-program-testing-call-21-front-page-fun/",
        "https://instawp.com/",
        "https://wordpress.tv/2023/04/18/building-a-page-with-only-patterns/",
        "https://twitter.com/jasontheadams",
        "https://givewp.com/visual-donation-form-builder-beta/",
        "https://www.youtube.com/watch?v=paRW3BWsdgw",
        "https://shop.gutenberghub.com/ai-writer/",
        "https://wpstackable.com/blog/how-to-use-countdown-timers-for-marketing-campaigns/",
        "https://twitter.com/bfintal",
        "https://wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://wordpress.org/themes/tags/full-site-editing/",
        "https://wordpress.org/themes/abisko/",
        "https://wptavern.com/anders-noren-releases-abisko-a-new-free-wordpress-theme-with-30-block-patterns",
        "https://wordpress.org/themes/spectra-one/",
        "https://www.youtube.com/watch?v=PNIeW9QQIc4",
        "https://wordpress.org/themes/ctlg/",
        "https://www.youtube.com/watch?v=dZ1kruAnQso&t=1s",
        "https://developer.wordpress.org/news/2023/04/per-block-css-with-theme-json/",
        "https://make.wordpress.org/core/handbook/references/keeping-up-with-gutenberg-index/",
        "https://make.wordpress.org/core/handbook/references/keeping-up-with-gutenberg-index/keeping-up-with-gutenberg-index-2020/",
        "https://engineawesome.com/",
        "https://wptavern.com/podcast/72-steve-bruner-and-timothy-jacobs-on-using-gutenberg-outside-of-wordpress",
        "https://wordpress.tv/2023/04/18/developer-hours-introduction-to-the-interactivity-api/",
        "https://twitter.com/c_z_a_p_l_a",
        "https://www.youtube.com/watch?v=7qalDqYnFRA",
        "https://gutenbergtimes.com/tooling-using-create-block-scaffolding-and-3rd-party-templates/",
        "https://twitter.com/ajaydsouza",
        "https://webberzone.com/blog/wordpress-block-development-building-multiple-blocks/",
        "https://gutenbergtimes.com/need-a-zip-from-master/",
        "mailto:pauli@gutenbergtimes.com",
        "http://gutenbergtimes.com/podcast",
        "mailto:changelog@gutenbergtimes.com",
        "https://commons.wikimedia.org/wiki/File:Lego_blocks.jpg",
        "https://gutenbergtimes.com/6-2-live-demo-20-year-anniversary-intrinsic-design-html-tag-processor-wcasia-weekend-edition-244/",
        "https://gutenbergtimes.com/6-2-live-demo-20-year-anniversary-intrinsic-design-html-tag-processor-wcasia-weekend-edition-244/",
        "https://gutenbergtimes.com/getting-started-with-block-themes-playground-create-block-tool-and-block-data-api-weekend-edition-252/",
        "https://gutenbergtimes.com/getting-started-with-block-themes-playground-create-block-tool-and-block-data-api-weekend-edition-252/",
        "https://gutenbergtimes.com/custom-css-front-page-fun-gutenberg-outside-of-wordpress-weekend-edition-251/",
        "https://gutenbergtimes.com/author/admin/",
        "https://gutenbergtimes.com/category/block-plugins/",
        "https://gutenbergtimes.com/category/full-site-editing/",
        "https://gutenbergtimes.com/category/site-editor/",
        "https://gutenbergtimes.com/category/updates/",
        "https://gutenbergtimes.com/category/weekend-edition/",
        "https://gutenbergtimes.com/all-women-release-squad-for-6-4-grid-layout-pattern-for-front-page-designs-and-more-weekend-edition-250/",
        "https://gutenbergtimes.com/getting-started-with-block-themes-playground-create-block-tool-and-block-data-api-weekend-edition-252/",
        "/custom-css-front-page-fun-gutenberg-outside-of-wordpress-weekend-edition-251/#respond",
        "https://akismet.com/privacy/",
        "https://gutenbergtimes.com",
        "https://www.andersnoren.se",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "https://gutenbergtimes.com/privacy-policy/",
        "#",
        "#"
    ]
}