{
    "title": "Mission Statement - About USC",
    "body": "\n\n\n\nShow Navigation\nSkip to Content\n\nUniversity of Southern California\nAbout USC\nFacts and Figures\nAdministration\nFaculty Honors\nHistory\nPolicies and Core Documents\n\n\n\n\nSearch for:\n\n\nSearch\n\n\n\n\n\nMission Statement\nThe Role and Mission of the University of Southern California\nThe central mission of the University of Southern California is the development of human beings and society as a whole through the cultivation and enrichment of the human mind and spirit. The principal means by which our mission is accomplished are teaching, research, artistic creation, professional practice and selected forms of public service.\nOur first priority as faculty and staff is the education of our students, from freshmen to postdoctorals, through a broad array of academic, professional, extracurricular and athletic programs of the first rank. The integration of liberal and professional learning is one of USC’s special strengths. We strive constantly for excellence in teaching knowledge and skills to our students, while at the same time helping them to acquire wisdom and insight, love of truth and beauty, moral discernment, understanding of self, and respect and appreciation for others.\nResearch of the highest quality by our faculty and students is fundamental to our mission. USC is one of a very small number of premier academic institutions in which research and teaching are inextricably intertwined, and on which the nation depends for a steady stream of new knowledge, art, and technology. Our faculty are not simply teachers of the works of others, but active contributors to what is taught, thought and practiced throughout the world.\nUSC is pluralistic, welcoming outstanding men and women of every race, creed and background. We are a global institution in a global center, attracting more international students over the years than any other American university. And we are private, unfettered by political control, strongly committed to academic freedom, and proud of our entrepreneurial heritage.\nAn extraordinary closeness and willingness to help one another are evident among USC students, alumni, faculty, and staff; indeed, for those within its compass the Trojan Family is a genuinely supportive community. Alumni, trustees, volunteers and friends of USC are essential to this family tradition, providing generous financial support, participating in university governance, and assisting students at every turn.\nIn our surrounding neighborhoods and around the globe, USC provides public leadership and public service in such diverse fields as health care, economic development, social welfare, scientific research, public policy and the arts. We also serve the public interest by being the largest private employer in the city of Los Angeles, as well as the city’s largest export industry in the private sector.\nUSC has played a major role in the development of Southern California for more than a century, and plays an increasingly important role in the development of the nation and the world. We expect to continue to play these roles for many centuries to come. Thus our planning, commitments and fiscal policies are directed toward building quality and excellence in the long term.\nAdopted by the USC Board of Trustees, February 1993\nPrintable Version\n\n\n\n\n\n\n\nUSC Communications / Notice of Non-Discrimination / Privacy Notice \n\n\n\n\n\n\n\n",
    "links": [
        "#topnav",
        "#content-main",
        "//www.usc.edu/",
        "https://about.usc.edu/",
        "https://about.usc.edu/facts/",
        "https://about.usc.edu/administration/",
        "https://www.provost.usc.edu/faculty-distinctions/",
        "https://about.usc.edu/history/",
        "https://about.usc.edu/policies/",
        "https://customsitesmedia.usc.edu/wp-content/uploads/sites/25/2018/07/15210242/University-Role-and-Mission-2018.pdf",
        "mailto:ucomm@usc.edu",
        "https://eeotix.usc.edu/notice-of-non-discrimination/",
        "https://www.usc.edu/privacy-notice"
    ]
}