{
    "title": "CSUSB creates pathways to social mobility\n | CSUSB News | CSUSB",
    "body": "\n\n\n\n\nSkip banner navigation\nSkip to main content\n\n\n\nClose Navigation Screen\n\n\n\n\n\n\n\n\n\nLogin to  myCoyote \n\n\n\nView the Campus  Directory \n\n\n\nCSUSB  Library \n\n\n\nCSUSB  Maps and Directions \n\n\n\nCSUSB  Palm Desert Campus \n\n\n\n Make a Gift to CSUSB \n\n\n\n\n\n\n\n\n\n\n\nCSUSB Admissions - Global Site Navigation \n\n\n                        \n             Admissions Overview - Global Site Navigation \n\n\n                        \n             Apply to CSUSB - Global Site Navigation \n\n\n                        \n             After I'm Admitted - Global Site Navigation \n\n\n                        \n             First-year Students - Global Site Navigation \n\n\n                        \n             Transfer - Global Site Navigation \n\n\n                        \n             International Students - Global Site Navigation \n\n\n                        \n             English Language Program - Global Site Navigation \n\n\n                        \n             Undocumented Student Center - Global Site Navigation \n\n\n                        \n             Osher Lifelong Learners - Global Site Navigation \n\n\n                        \n             Military Veterans/Dependents - Global Site Navigation \n\n\n                        \n             Financial Aid & Scholarships - Global Site Navigation \n\n\n                        \n             Student Financial Services - Global Site Navigation \n\n\n                        \n             Summer Session - Global Site Navigation \n\n\n\n\n                                \n                 Academics - Global Site Navigation \n\n\n                        \n             Academic Calendar - Global Site Navigation \n\n\n                        \n             Academic Advising  - Global Site Navigation \n\n\n                        \n             Degrees & Programs - Global Site Navigation \n\n\n                        \n             Colleges & Departments - Global Site Navigation \n\n\n                        \n             Course Catalog / Bulletin - Global Site Navigation \n\n\n                        \n             Class Schedule - Global Site Navigation \n\n\n                        \n             Online Programs - Global Site Navigation \n\n\n                        \n             Academic Success and Undergraduate Advising - Global Site Navigation \n\n\n                        \n             Graduate Studies - Global Site Navigation \n\n\n                        \n             Office of the Registrar - Global Site Navigation \n\n\n                        \n             Academic & Support Resources - Global Site Navigation \n\n\n                        \n             Academic Research - Global Site Navigation \n\n\n                        \n             Graduation Initiative 2025 - Global Site Navigation \n\n\n\n\n\nCSUSB Athletics               \n\n\n                            \n               Men's Sports             \n\n\n\nMen's Sports Baseball           \n\n\n\nMen's Sports Basketball           \n\n\n\nMen's Sports Golf           \n\n\n\nMen's Sports Soccer           \n\n\n\n\n                            \n               Women's Sports             \n\n\n\nWomen's Sports Softball           \n\n\n\nWomen's Sports Cheer & Dance           \n\n\n\nWomen's Sports Track & Field           \n\n\n\nWomen's Sports Cross Country           \n\n\n\nWomen's Sports Volleyball           \n\n\n\nWomen's Sports Soccer           \n\n\n\nWomen's Sports Basketball           \n\n\n\n\n\n\n                                \n                 Campus Life - Global Site Navigation \n\n\n                        \n             Events Calendar - Global Site Navigation \n\n\n                        \n             Get Involved - Global Site Navigation \n\n\n                        \n             Student Services - Global Site Navigation \n\n\n                        \n             Recreation & Wellness - Global Site Navigation \n\n\n                        \n             Student Health & Safety - Global Site Navigation \n\n\n                        \n             Housing & Dining - Global Site Navigation \n\n\n                        \n             Music & Arts - Global Site Navigation \n\n\n                        \n             Student Employment - Global Site Navigation \n\n\n                        \n             Campus Safety & Emergency Info - Global Site Navigation \n\n\n                        \n             Palm Desert Campus Life - Global Site Navigation \n\n\n\n\n                                \n                 About CSUSB - Global Site Navigation \n\n\n                        \n             Inside CSUSB - Global Site Navigation \n\n\n                        \n             COVID-19           \n\n\n                        \n             Campus Map - Global Site Navigation \n\n\n                        \n             President's Office - Global Site Navigation \n\n\n                        \n             Shared Governance - Global Site Navigation \n\n\n                        \n             Strategic Plan 2023-2028 - Global Site Navigation \n\n\n                        \n             Administrative Divisions - Global Site Navigation \n\n\n                        \n             Organizational Chart - Global Site Navigation \n\n\n                        \n             Strategic Communication - Global Site Navigation \n\n\n                        \n             Mission, Vision & Core Values - Global Site Navigation \n\n\n                        \n             Accreditation           \n\n\n                        \n             Assessment           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSite Header Region\n\n\n\n\n\n\nCSUSB Home\n\n \n\n\n\nWe Define the Future\n\n \n\n\n\n\n\n\n\n\nLogin to  myCoyote \n\n\n\nView the Campus  Directory \n\n\n\nCSUSB  Library \n\n\n\nCSUSB  Maps and Directions \n\n\n\nCSUSB  Palm Desert Campus \n\n\n\n Make a Gift to CSUSB \n\n\n\n\n\n\n\n\nSearch CSUSB\n\n\nSearch CSUSB \n\n\n\n\n\n\n\nCSUSB Main Menu\n\n\n\n\n\n\nPage Header\n\n\n\n\n\n\nInside CSUSB home\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nNews\n\n\n\n\nFor the Media\n\n\n\n\nCSUSB Magazine \n\n\n\n\nAlert\n\n\n\n\n\n\nToggle Inside Search Panel\n\n\n\n\n\nSearch Inside CSUSB\n\n\nSearch Inside\n\n\n\n\n\n\n\nMain Content Region\n\n\n\nCSUSB creates pathways to social mobility\n\n\n\n\n\n\n\n\n\nMedia Inquiries\n\nJoe Gutierrez | CSUSB Office of Strategic Communication | (951) 236-4522 | joeg@csusb.edu\n\n\n\n\n\nCSUSB creates pathways to social mobility\n\n\nThe university is ranked No. 6 in the nation among more than 1,500 universities on the annual 2021 Social Mobility Index (SMI) published by CollegeNET.\n\nPublished February 8, 2022\n\n\n\n\n\n\nGraduates express their accomplishments on their mortar boards. CSUSB is one of the top universities in the nation in enrolling students from low-income backgrounds and graduating them into good-paying jobs, according to CollegeNET.\n\n\n\n\n\n\n\n\nCal State San Bernardino was recently ranked No. 6 in the nation among more than 1,500 universities on the annual 2021 Social Mobility Index (SMI) published by CollegeNET, rising from the No. 7 spot in 2020 and the No. 39 spot in 2015. \nThe ranking further bolsters CSUSB’s recent recognition by U.S. News & World Report as one of the best universities in the western region of the U.S.\nThe SMI benchmarks four-year U.S. colleges and universities according to how effectively they enroll students from low-income backgrounds and graduate them into good-paying jobs. \nThe methodology calculates five factors, including the cost of attending the university, economic background of the students, graduation rates, early career net salaries and the institution’s endowment. Data collected for the rankings is gathered from the U.S. Department of Education’s College Scorecard and the Integrated Postsecondary Educational Data System.\nDemographic Background and the SMI\nEighty-one percent of CSUSB’s undergraduates are the first in their families to attend college, 73 percent are underrepresented minorities and 57 percent qualify as low income, according to the university’s Office of Institutional Research & Analytics. \n“This ranking confirms our commitment to student learning and success, which drive our mission,” said CSUSB President Tomás D. Morales. “Our faculty and staff are dedicated to the intellectual development of our students, many of whom are the first in their families to attend college, through outstanding academic and co-curricular opportunities, to ensure they thrive and contribute to the greater community after graduation.”\n\n\n\n\n\n\n\n\n\n\n\nStephanie Garibo-Alday\n\n\n\nStephanie Garibo-Alday, ’19 BA sociology, was one such student. Today she continues to enrich CSUSB and the community at large. A first-generation college student, she immigrated to the U.S. from Mexico with her family at age 1 and faced numerous challenges. The family struggled to make ends meet and spoke only Spanish.   \n“I started to learn English in elementary school. It was difficult because I was only able to communicate with the Spanish-speaking students,” Garibo-Alday said. “I decided to spend my recess with the school librarian, Ms. Green. She helped me learn how to read and speak English.” \nThat spirit of determination followed her throughout her CSUSB undergraduate experience, as she discovered a wealth of resources, programs and support services available, honing in on those specifically tailored to low-income, first-generation undocumented students. \nHer hard-won efforts were recently acknowledged by Assembly Majority Leader Eloise Gómez Reyes (D-San Bernardino) when she was named one of the 30 under 30 award recipients, an honor that recognizes community activism, business, health, education, art and social entrepreneurship. \nGaribo-Alday is now an advisor in CSUSB’s Undocumented Student Success Center and coordinator for the Inland Empire Fellowship Program. She is also pursuing a master’s degree in student development and college counseling at Azusa Pacific University. \nGaribo-Alday’s experiences illustrate the challenges faced by many CSUSB undergraduate students from low-income backgrounds who have defied the odds and graduated to find good-paying jobs.\nAlumni Salaries and the SMI\nAccording to the California State University (CSU) website, for CSUSB alumni with undergraduate degrees who graduated between 2000 and 2015, the median income two years after graduation was $41,992; five years after graduation, $56,769; after 10 years, $68,780; and after 15 years, $85,134. \nThe recent SMI data show the median early career salary today for a CSUSB graduate is $44,500, which Garibo-Alday says aligns with her experience.\nCommitment to Student Success and Social Mobility\nAccording to the CollegeNET website, a high SMI ranking means that a college is contributing in a responsible way to solving the dangerous problem of declining economic mobility in our country.\n“Social mobility truly defines Cal State San Bernardino as an institution and we are very proud of it,” said Shari McMahan, provost and vice president for Academic Affairs. “CSUSB’s extraordinary rise in the rankings from No. 39 in 2015 to No. 6 in 2021 can be attributed to a number of factors, including our goals for academic excellence and student success as defined in the university’s strategic plan.”  \nThose goals and strategies include services such as pre-college programs, advising and academic services, career and student success resources and a variety of robust programs to involve students in the college experience. \nAccording to Paz Olivérez, vice president for Student Affairs, “CSUSB has a number of centers and programs that contribute to student success by cultivating engagement and a sense of belonging at the university, which are particularly important for students of color and/or of historically underserved groups.”  \nGaribo-Alday credits several of these programs for motivating her to succeed as an undergraduate, including the Educational Opportunity Program (EOP). “My mentors, Iveth Diaz and Fernando Villalpando, were there to support me and motivate me when I did not believe in myself,” she said. “They pushed me to graduate and to continue my education.” \nThe EOP provides comprehensive student support services, such as outreach and admission, summer transitional experience, orientation, academic advising, financial aid guidance, mentoring, tutoring, graduate school preparation and comprehensive counseling and wellness services, to historically low-income and underrepresented students. Services are tailored or enhanced depending on specific students’ needs.\nEOP Director Veronica Ramirez Amerson said the program admits 325 new undergraduate students per admissions cycle/academic year, and serves between 1,100 and 1,300 EOP students per semester. The program also conducts outreach and recruitment in the community at high schools, community colleges and other agencies that serve the EOP’s specific populations. \n“Since its inception in 1969, the Educational Opportunity Program has worked diligently to improve the regions' and state’s educational outcomes for thousands of low-income, disadvantaged youth by providing access to higher education and comprehensive student support services from point of entry through to graduation,” Ramirez Amerson said. “Many of our EOP alumni have gone on to become professional leaders and contributing members of our communities, and through their educational and personal achievements, continue to break the cycle of intergenerational poverty.”  \nIn addition to the EOP, Garibo-Alday attributes her success to the guidance and support provided by the Undocumented Student Success Center, where she began working before she graduated in 2019. “They helped me with anything I needed,” she said.\nDalia Hernandez, interim director of the center, says “The USSC provides much needed resources and support to our undocumented, DACAmented and multi-status students and community,” she said. “The USSC is a safe space for community building, resources, information sharing and student/staff/allies/community empowerment.”\nThe USSC served approximately 704 individuals during the 2020-2021 academic year, including undergraduate, graduate, K-12 students and the community at large, Hernandez said. \n“Services are tailored to individual student needs. However, general services may include AB540 affidavit support, California Dream Act Application (CADAA) completion assistance, scholarship and fellowship assistance and support, referrals to CARECEN legal services and informational workshops,” among other services, she added. \nStudent Debt and the SMI\nTuition for a full-time undergraduate resident student in fall 2021 was $3,509. According to the SMI data, the average debt of CSUSB graduates is $15,375. \nGaribo-Alday said that as an incoming first-year student, she received the Kiwanis Scholarship and the Inland Empire Scholarship Fund awarded through CSUSB’s Association of Latino Faculty, Staff and Students. “Thankfully, I did not have to take out student loans,” she said. “My family supported me financially while I was pursuing my undergraduate degree, and I was able to pay my tuition with [funding through] the California Dream Act.”\nGaribo-Alday also worked part-time in the Division of University Advancement, where she described the staff as supporting her “any way they could.” She was also an intern for the Undocumented Student Success Center and the OSHER Adult Re-Entry Center. ​\nGaribo-Alday says she was fortunate to find a job in her chosen career field, higher education before graduating. “My mentors and students inspire me – I have a passion for education,” she says. She also believes college should be affordable and accessible for all students, adding “Students sometimes are unaware of the resources (CSUSB) offers to help them succeed.”\n\n\n\n\n\n\n\n\nMore: \n\n\nSocial Mobility Index\n\n\nSMI\n\n\nranking\n\n\nCollegeNET\n\n\nTomás D. Morales\n\n\nShari McMahan\n\n\nAcademic Affairs\n\n\nStephanie Garibo-Alday\n\n\nalumni\n\n\nsociology\n\n\nCollege of Social and Behavioral Sciences\n\n\nVeronica Ramirez Amerson\n\n\nEducational Opportunity Program\n\n\nEOP\n\n\nUndocumented Student Success Center\n\n\nDalia Hernandez\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMore News\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 3, 2020\n\t\t\t\t\t\tCSUSB ranked top ten in the nation for social mobility \n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 23, 2019\n\t\t\t\t\t\tCSUSB ranked top ten in the nation for social mobility \n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOctober 25, 2018\n\t\t\t\t\t\tCSUSB among the best in the nation for upward mobility\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\nView All News\n\n\n\n\n\n\n\n\n\n\nFooter Region\n\n\n\nCSUSB\n\n\nCalifornia State University, San Bernardino\n5500 University Parkway\nSan Bernardino, CA 92407\n+1 (909) 537-5000\n\n\n\n\n\nFollow Us\n\n\n\n\n\n CSUSB's Facebook\n\n\n\n\n\n CSUSB's Twitter\n\n\n\n\n\n CSUSB's YouTube\n\n\n\n\n\n CSUSB's Instagram\n\n\n\n\n\n CSUSB's LinkedIn\n\n\n\n\n\n CSUSB's Social Media\n\n\n\n\n\n\n\n\nAlso of InterestCSUSB assistant professor to explore social...San Bernardino University NewsPublic University in San Bernardino News Clips \n\n\n\n\n\n\n\n\n\nColumn 1 \n\n\n\n\nLogin\n\n\n\n\nmyCoyote\n  Login\n\n\n\n\nCanvas\n\n\n\n\nStudent Email\n  Login\n\n\n\n\nFaculty & Staff Email\n  Login\n\n\n\n\nCSUSB  \nDrupal Login\n\n\n\n\n\n\nOf Interest to...\n\n\n\n\nFuture Students\n  Interests\n\n\n\n\nCurrent Students\n   Interests\n\n\n\n\nFaculty & Staff\n  Interests\n\n\n\n\nFull-Time Faculty\n  Interests\n\n\n\n\nPart-Time Faculty\n  Interests\n\n\n\n\nCommunity & Visitors\n  Interests\n\n\n\n\nAlumni & Friends\n  Interests\n\n\n\n\nUniversity Partners\n  Interests\n\n\n\n\nMilitary/Veterans\n  Interests\n\n\n\n\n\n\n\n\nColumn 2 \n\n\n\n\nEmployment\n\n\n\n\nCSUSB \nJob Listings\n - CSUSB\n\n\n\n\nFaculty Jobs\n  - CSUSB\n\n\n\n\nCareer Center\n  - CSUSB\n\n\n\n\nHuman Resources\n  - CSUSB\n\n\n\n\nStudent Employment\n  - CSUSB\n\n\n\n\n\n\nResources\n\n\n\n\nContact\n  CSUSB\n\n\n\n\nClery Act\n\n\n\n\nAnnual Safety Reports\n  - CSUSB\n\n\n\n\nTitle IX Notice\n  - CSUSB\n\n\n\n\nDisclosure of Consumer Information\n  - CSUSB\n\n\n\n\n\n\n\n\nColumn 3 \n\n\n\n\nCampus Services\n\n\n\n\nAcademic Advising\n  - CSUSB\n\n\n\n\nHousing & Residential Life\n  - CSUSB\n\n\n\n\nOmbuds Services\n  - CSUSB\n\n\n\n\nParking\n  - CSUSB\n\n\n\n\nPolice\n  - CSUSB\n\n\n\n\nPsychological Counseling\n  - CSUSB\n\n\n\n\nServices to Students with Disabilities\n  - CSUSB\n\n\n\n\nStudent Health Center\n  - CSUSB\n\n\n\n\nTechnology Support\n\n\n\n\nTranscripts\n  - CSUSB\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccessibility\n\n\n\n\nPrivacy and Security\n\n\n\n\nNon-Discrimination Notice\n\n\n\n\nWebsite Copyright/DMCA Policy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page-header",
        "#main-content",
        "https://my.csusb.edu",
        "https://www.csusb.edu/campus-directory",
        "https://csusb.edu/library",
        "https://map.csusb.edu",
        "https://www.csusb.edu/pdc",
        "https://www.csusb.edu/advancement/development/how-give/make-a-gift",
        "https://www.csusb.edu/admissions",
        "https://www.csusb.edu/admissions-overview",
        "https://www.csusb.edu/admissions/apply-csusb",
        "https://www.csusb.edu/admissions/admitted-students/next-steps",
        "https://www.csusb.edu/admissions/apply-csusb/first-year-students",
        "https://www.csusb.edu/admissions/apply-csusb/transfer-students",
        "https://www.csusb.edu/international-education",
        "https://www.csusb.edu/international-education/programs/english-language-program",
        "https://www.csusb.edu/undocumented-student-success-center",
        "https://www.csusb.edu/olli",
        "https://www.csusb.edu/veterans",
        "https://www.csusb.edu/financial-aid",
        "https://www.csusb.edu/student-financial-services",
        "https://www.csusb.edu/summer",
        "https://www.csusb.edu/academics",
        "https://www.csusb.edu/academic-programs/academic-calendars",
        "https://www.csusb.edu/advising",
        "http://bulletin.csusb.edu/programs-az/",
        "https://www.csusb.edu/colleges-and-academic-departments",
        "https://bulletin.csusb.edu/",
        "https://www.csusb.edu/class-schedule",
        "https://www.csusb.edu/academics/online-programs-csusb",
        "/academic-success-and-undergraduate-advising",
        "https://www.csusb.edu/graduate-studies",
        "https://www.csusb.edu/registrar",
        "https://www.csusb.edu/academic-support-resources",
        "https://www.csusb.edu/academic-research",
        "https://www.csusb.edu/graduation-initiative-2025",
        "https://www.csusbathletics.com/",
        "https://www.csusbathletics.com/index.aspx?path=baseball",
        "https://www.csusbathletics.com/index.aspx?path=mbball",
        "https://www.csusbathletics.com/index.aspx?path=mgolf",
        "https://www.csusbathletics.com/index.aspx?path=msoc",
        "https://www.csusbathletics.com/index.aspx?path=softball",
        "https://www.csusbathletics.com/sports/2008/1/23/GEN_0123081553.aspx",
        "https://www.csusbathletics.com/index.aspx?path=wtrack",
        "https://www.csusbathletics.com/index.aspx?path=wcross",
        "https://www.csusbathletics.com/index.aspx?path=wvball",
        "https://www.csusbathletics.com/index.aspx?path=wsoc",
        "https://www.csusbathletics.com/index.aspx?path=wbball",
        "https://www.csusb.edu/campus-life",
        "https://www.csusb.edu/events",
        "https://www.csusb.edu/student-affairs/campus-programs-and-resources/getting-involved",
        "/student-affairs/leadership-team/assistant-vice-president-student-services",
        "https://www.csusb.edu/recreation-wellness",
        "https://www.csusb.edu/campus-life#student-health-and-safety",
        "https://www.csusb.edu/campus-life#housing-and-dining",
        "https://www.csusb.edu/campus-life#music-and-arts",
        "https://www.csusb.edu/human-resources/student-employment",
        "https://www.csusb.edu/advancement/strategic-communication/emergency-communication",
        "https://www.csusb.edu/pdc/student-life",
        "https://www.csusb.edu/about-csusb",
        "https://www.csusb.edu/inside",
        "https://www.csusb.edu/covid-19",
        "https://map.csusb.edu/",
        "https://www.csusb.edu/presidents-office",
        "https://www.csusb.edu/shared-governance",
        "https://www.csusb.edu/strategic-plan",
        "https://www.csusb.edu/administrative-divisions",
        "https://www.csusb.edu/sites/default/files/upload/file/University_Organization_Chart.pdf",
        "https://www.csusb.edu/advancement/strategic-communication",
        "https://www.csusb.edu/node/142646",
        "https://www.csusb.edu/academic-programs/accreditation/wasc-accreditation",
        "https://www.csusb.edu/assessment-capability-collaborative",
        "/",
        "https://my.csusb.edu",
        "https://www.csusb.edu/campus-directory",
        "https://csusb.edu/library",
        "https://map.csusb.edu",
        "https://www.csusb.edu/pdc",
        "https://www.csusb.edu/advancement/development/how-give/make-a-gift",
        "/inside",
        "/inside/news",
        "/inside/media",
        "http://magazine.csusb.edu",
        "/inside/alert",
        "mailto:joeg@csusb.edu",
        "https://www.addtoany.com/share#url=https%3A%2F%2Fwww.csusb.edu%2Finside%2Farticle%2F552731%2Fcsusb-creates-pathways-social-mobility&title=CSUSB%20creates%20pathways%20to%20social%20mobility",
        "https://www.socialmobilityindex.org/",
        "https://www.csusb.edu/inside/article/548777/us-news-world-report-ranks-csusb-among-best-west",
        "https://www.csusb.edu/sites/default/files/Fall%202021%20QuickFacts_0.pdf",
        "https://www.csusb.edu/inside/article/551173/csusb-alumni-and-students-honored-assemblymember-reyes-30-under-30-event",
        "https://tableau.calstate.edu/views/dashboardv_live/LaborMarketOutcomes?iframeSizedToWindow=true&:embed=y&:showAppBanner=false&:display_count=no&:showVizHome=no",
        "https://www.csusb.edu/sites/default/files/upload/file/CSUSB%20Strategic%20Plan%202015-2020.pdf",
        "https://www.csusb.edu/student-affairs/student-success-educational-equity/pre-college-programs",
        "https://www.csusb.edu/advising-academic-services",
        "https://www.csusb.edu/career-center",
        "https://www.csusb.edu/sites/default/files/upload/file/Student_Resources_Accessible%20%28Color%29.pdf",
        "https://www.csusb.edu/student-engagement",
        "https://www.csusb.edu/student-affairs",
        "https://www.csusb.edu/student-affairs/assessment/impact-model/assessment-plan",
        "https://www.calstate.edu/attend/student-services/eop",
        "https://www.csusb.edu/undocumented-student-success-center",
        "https://www.csusb.edu/student-financial-services/tuition-and-fees/academic-year-2021-2022",
        "https://www.csusb.edu/advancement",
        "https://www.csusb.edu/career-center/students-alumni/internships",
        "https://www.csusb.edu/smsu/resources/osher-adult-re-entry-center",
        "/inside/tags/13486",
        "/inside/tags/37505",
        "/inside/tags/23046",
        "/inside/tags/13496",
        "/inside/tags/22401",
        "/inside/tags/1986",
        "/inside/tags/2451",
        "/inside/tags/44224",
        "/inside/tags/2681",
        "/inside/tags/3511",
        "/inside/tags/1991",
        "/inside/tags/44225",
        "/inside/tags/10191",
        "/inside/tags/24941",
        "/inside/tags/4021",
        "/inside/tags/8606",
        "/inside/article/536673/csusb-ranked-top-ten-nation-social-mobility",
        "/inside/article/515902/csusb-ranked-top-ten-nation-social-mobility",
        "/inside/article/447726/csusb-among-best-nation-upward-mobility",
        "/inside/news",
        "tel:19095375000",
        "https://www.facebook.com/CSUSB",
        "https://www.twitter.com/csusbnews",
        "https://www.youtube.com/csusb",
        "https://instagram.com/csusb",
        "https://www.linkedin.com/school/california-state-university-san-bernardino/",
        "https://www.csusb.edu/advancement/strategic-communication/social-media-csusb",
        "https://www.csusb.edu/inside/article/555544/csusb-assistant-professor-explore-social-media-visiting-scholar-harvard",
        "https://www.csusb.edu/inside/news",
        "https://www.csusb.edu/inside/news-clips",
        "https://my.csusb.edu/",
        "https://csusb.instructure.com/login/saml",
        "http://mail.coyote.csusb.edu/",
        "http://mail.csusb.edu",
        "/cas",
        "https://www.csusb.edu/future-students",
        "https://www.csusb.edu/current-students",
        "https://www.csusb.edu/faculty-staff",
        "https://www.csusb.edu/faculty-resource-directory-ft",
        "https://www.csusb.edu/faculty-resource-directory-pt",
        "https://www.csusb.edu/community-visitors",
        "https://www.csusb.edu/alumni-friends",
        "https://www.csusb.edu/advancement/philanthropy/corporate-foundation-philanthropy",
        "https://www.csusb.edu/veterans",
        "https://www.csusb.edu/human-resources/talent-acquisition/job-opportunities",
        "https://careers.csusb.edu/en-us/filter/?job-mail-subscribe-privacy=agree&search-keyword=&category=unit%203%20-%20cfa%20-%20california%20faculty%20association",
        "https://www.csusb.edu/career-center",
        "https://www.csusb.edu/human-resources",
        "https://www.csusb.edu/human-resources/student-employment",
        "https://www.csusb.edu/about-csusb/contact-csusb",
        "https://www.csusb.edu/clery-act",
        "https://www.csusb.edu/sites/default/files/2022_CSUSB_Annual_Security_Report_0.pdf",
        "https://www.csusb.edu/institutional-equity-compliance/resources/title-ix-notice-non-discrimination-basis-gender-or-sex",
        "https://www.csusb.edu/registrar/disclosure-consumer-information",
        "https://www.csusb.edu/advising",
        "https://www.csusb.edu/housing",
        "https://www.csusb.edu/ombuds",
        "https://www.csusb.edu/parking",
        "https://www.csusb.edu/police",
        "https://www.csusb.edu/caps",
        "https://www.csusb.edu/ssd",
        "https://www.csusb.edu/student-health-center",
        "https://www.csusb.edu/its",
        "https://www.csusb.edu/registrar/records/request-csusb-transcript",
        "https://www.csusb.edu/ats/accessibility",
        "https://www.csusb.edu/about-csusb/privacy-and-security-notice",
        "https://www.csusb.edu/institutional-equity-compliance/resources/title-ix-notice-non-discrimination-basis-gender-or-sex",
        "https://www.csusb.edu/its/security/reporting/copyrightdmca-notice-and-procedure"
    ]
}