{
    "title": "Preparing for the Next Women & Nonbinary Release Squad – Make WordPress Core",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Core\n\n\nTickets\nComponents\nHandbook\nBrowse Source\nTrac Timeline\nCreate a New Ticket\n \n\n\n\nHide welcome box\n\n\n\n\nWelcome!\nThe WordPress coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. development team builds WordPress! Follow this site for general updates, status reports, and the occasional code debate. There’s lots of ways to contribute:\nFound a bugbug A bug is an error or unexpected result. Performance improvements, code optimization, and are considered enhancements, not defects. After feature freeze, only bugs are dealt with, with regressions (adverse changes from the previous version) being the highest priority.? Create a ticket in the bug tracker.\nWant to contribute? Get started quickly with tickets marked as good first bugs for new contributors or join a bug scrub. There’s more on the reports page, like patches needing testing, and on feature projects page.\nOther questions? Here is a detailed handbook for contributors, complete with tutorials.\n\n\nCommunication\nCore uses Slack for real-time communication. Contributors live all over the world, so there are discussions happening at all hours of the day.\nCore development meetings are every Wednesday at 20:00 UTC in the #core channel on Slack. Anyone can join and participate or listen in!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nJosepha\n\n6:08 pm on April 7, 2023 \n\n\n\nTags: 6-3 ( 8 ), 6-3-release-leads, 6-4, planning ( 23 )   \n\t\t\t\t\n\nPreparing for the Next Women & Nonbinary Release Squad\n\n\nNow that we’ve shipped WordPress 6.2 “Dolphy,” it’s time for a little planning for the other major releases this year. Volunteers are needed for the WordPress 6.3 squad (release target mid-July), especially those willing to dedicate time toward mentoring the next round of squad members. I would like to propose that WordPress 6.4 be run entirely by a women and nonbinary squad, a reprise of the historic WordPress 5.6 release, “Simone”, and training cohorts offered during 6.3 are an excellent opportunity for new contributors to prepare for the 6.4 release.\nImportant Note: I short-hand the release to “women and nonbinary” for easy referencing in our day-to-day collaboration, but the release squad will be open to anyone who identifies as a woman, nonbinary, or gender-expansive. All contributions are welcome as always, regardless of how you identify or what groups you feel part of. 🙂 \nWhat’s the Goal?\nThe primary goal of any release cycle is to ship a stable and enhanced version of the WordPress CMS that ships in scope and on time. The release date for WordPress 6.4 is tentatively slated for November, with the exact dates determined as the 6.3 timeline and the 6.4 release squad is confirmed.\nHaving a release squad comprised of folx we don’t typically see in technology also has a goal of increasing the number of underrepresented people who have experience maintaining, managing, and shipping software in an open sourceOpen Source Open Source denotes software for which the original source code is made freely available and may be redistributed and modified.  Open Source **must be** delivered via a licensing model, see GPL. project. All contributions to the release and release process are welcome.\nWhat’s the Plan?\nI would like to repeat the process we used leading up to WordPress 5.6, with some slight modifications. The WordPress 5.6 release squad had the opportunity to learn the major releasemajor release A release, identified by the first two numbers (3.6), which is the focus of a full release cycle and feature development. WordPress uses decimaling count for major release versions, so 2.8, 2.9, 3.0, and 3.1 are sequential and comparable in scope. cycle process by acting as understudies to the folx that lead the WordPress 5.5 release. The 5.6 squad was able to progressively level up their skills by watching how the 5.5 squad worked, assisting on things while guided by 5.5 leads, and finally leading a minor releaseMinor Release A set of releases or versions having the same minor version number may be collectively referred to as .x , for example version 5.2.x to refer to versions 5.2, 5.2.1, 5.2.3, and all other versions in the 5.2 (five dot two) branch of that software. Minor Releases often make improvements to existing features and functionality. with assistance where needed.\nPrepare and Plan\nGather nominations for the 6.4 team and ensure the 6.3 and 6.4 release timing works for each. Participation in 6.3 is optional, but it has been successful when others tried the process before leading the process.\nConfirm volunteers’ alignment to release squad roles.\nIdentify additional volunteers for any remaining release squad roles.\nGather mentors for each release squad group.\n\nJoin Release 6.3\nJoin meetings, triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors. sessions, etc., and ask questions in the public #6-3-release-leads channel to feel comfortable heading into the 6.4 release.\n\nNavigate Release 6.3.x\nCollaborate with the 6.3 release squad to navigate a point releaseMinor Release A set of releases or versions having the same minor version number may be collectively referred to as .x , for example version 5.2.x to refer to versions 5.2, 5.2.1, 5.2.3, and all other versions in the 5.2 (five dot two) branch of that software. Minor Releases often make improvements to existing features and functionality. and ask every question.\n\nDrive Release 6.4\nDrive the release while collaborating with some established women and nonbinary contributors as well as the 6.3 mentors.\n\nHow Can You Help?\nIf you would like to learn more about what participating in a release this way would mean (or want to volunteer right away!), please leave a comment letting me know. You can also feel free to DM me or any of these original supporters of WP5.6: @francina @jeffpaul @desrosj. We’re interested to hear from:\nAnyone who wants to be a part of the WP6.4 release process.\nAnyone who wants to be a mentor leading up to or during WP6.4\nAnyone who has questions about how this will work. 🙂\nProps to the following editors and co-creators of this post: @jeffpaul @cbringmann @daisyo @ironprogrammer @bph @desrosj @priethor\n#6-3, #6-4, #planningShare this:TwitterFacebookLogin to Reply\n\n\n\n\n\n\n\n\n\n\n\n\nTammie Lister\n\n6:28 pm on April 7, 2023 \n\n\n\n\nI am happy to help; I can offer support as a mentor and be a part of the release squad.\n\n\n\n\n\n\n\n\nCathi Bosco\n\n6:50 pm on April 7, 2023 \n\n\n\n\nHey! I might be available to support this time too. Going to check with some of our teams to see if others are interested and available as well.  WooHoo!!!\n\n\n\n\n\n\n\n\nCathi Bosco\n\n11:48 am on April 19, 2023 \n\n\n\n\nDesign, UXUX User experience Research, Marketing, Communications…. these are areas, roles I can contribute through.\n\n\n\n\n\n\n\n\n\n\nCorina Lozano\n\n6:53 pm on April 7, 2023 \n\n\n\n\nHi, I would love to help in any way that I can!\nI have been looking to get more involved in WP. I can be contacted through the slackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. group. Thanks.\n\n\n\n\n\n\n\n\nOlga Gleckler\n\n6:56 pm on April 7, 2023 \n\n\n\n\nI hope to be part of the 6.3 release squad. I have in mind several tickets I believe are interesting and important to go live in version 6.3.\n\n\n\n\n\n\n\n\nJeffrey Paul\n\n8:57 pm on April 7, 2023 \n\n\n\n\nAs always, I’m excited by this effort, offer my support however helpful, and will find ways to assist the group on this as best I can!\n\n\n\n\n\n\n\n\nJb Audras\n\n9:21 pm on April 7, 2023 \n\n\n\n\nSounds great, I love it!\nAlso, it would be great to onboard as many new people as possible!\nAnd from as many parts of the world as possible, too!\nI will do my best to help the 6.4 team whenever I can. I would be glad to help onboarding a newcomer during 6.3 on CoreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. tech, Triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors. or any other role.\n\n\n\n\n\n\n\n\nallisonplus\n\n9:27 pm on April 7, 2023 \n\n\n\n\nI’d be interested in learning more about being a part of the release squad/process.\n\n\n\n\n\n\n\n\nMachatine Augusto\n\n10:54 pm on April 7, 2023 \n\n\n\n\nHello!\nI’d love to help out in the  WP6.4 release process.\n\n\n\n\n\n\n\n\nmarybaum\n\n12:08 am on April 8, 2023 \n\n\n\n\nI’m all in — on 6.3 and 6.4.\n\n\n\n\n\n\n\n\nAhmed Chaion\n\n7:32 am on April 9, 2023 \n\n\n\n\nHappy to help out for the 6.3 release and help guide/mentor the 6.4 release squad. Please count me in ✋\n\n\n\n\n\n\n\n\nMuhammad Yeasin\n\n5:52 am on April 10, 2023 \n\n\n\n\nI would love to get involved. Appreciate the guidance and mentorship from the experts.\n\n\n\n\n\n\n\n\nAkshaya Rane\n\n9:06 am on April 10, 2023 \n\n\n\n\nI would like to be part of the release squad/process & want to learn more from experts.\n\n\n\n\n\n\n\n\nDavid Baumwald\n\n3:40 pm on April 10, 2023 \n\n\n\n\nHappy to help support Release Coordinators, Techs, or Triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors..\n\n\n\n\n\n\n\n\nTonya Mork\n\n6:24 pm on April 10, 2023 \n\n\n\n\nAre you considering raising your hand to join the 6.4 all women and nonbinary release? Are you feeling nervous (maybe even overwhelmed) about joining?\nLet me share my personal experience. \nBefore joining the 5.6 Release Squad, I had not contributed to the project. I had no idea how the release cycle worked or where to start. Yup, I was a contributing noob.  But with mentoring, I was well supported in my onboarding. And you will be too! The experience was and still is incredible!\n@chanthaboune I’m raising my hand for 6.3 and 6.4 as a (a) mentor (happily ready to onboard and support new release squad members) and/or (b) release squad member (possibly as CoreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. Tech Lead or whatever role best serves the project).\n\n\n\n\n\n\n\n\nfindmeapk123\n\n6:43 pm on April 10, 2023 \n\n\n\n\ni have been working on my websites and i really would love to be a part of this discussion and get as much knowledge as i can get for 6.3 and 6.4\n\n\n\n\n\n\n\n\nBrian Alexander\n\n7:23 pm on April 10, 2023 \n\n\n\n\nI would be happy to help mentor/support new squad members on the test and triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors. side of things 🙌🏻\n\n\n\n\n\n\n\n\nannezazu\n\n12:22 am on April 11, 2023 \n\n\n\n\nHappy to help with either and would love to ensure new folks are able to join since I have been lucky enough to be a part of a number of releases over the last few years.\n\n\n\n\n\n\n\n\nMeagan Hanes\n\n4:57 am on April 11, 2023 \n\n\n\n\nHappy to be involved in this as a mentor!\n\n\n\n\n\n\n\n\nMike Schroder\n\n8:50 am on April 11, 2023 \n\n\n\n\nHi! This is so exciting.\nI would love to help either as a mentor, or as a member of the release squad for 6.4.\nOpen to doing so in whichever role would be most helpful.\nIn the past, during releases, I’ve been the equivalent of coordinator / lead, co-tech lead, and coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. media lead. I’ve also helped out with triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors., and this would be really fun to do again.\n\n\n\n\n\n\n\n\nEstela Rueda\n\n8:57 am on April 11, 2023 \n\n\n\n\nHappy to be part of the squad for both 6.3 and 6.4\n\n\n\n\n\n\n\n\nFredde Battel\n\n9:55 am on April 11, 2023 \n\n\n\n\nHello ! I would like to know more about the process too. I have never contributed to a release before. I will do my best if I can be part of both 6.3 and 6.4.\n\n\n\n\n\n\n\n\narielmsehr\n\n6:56 pm on April 11, 2023 \n\n\n\n\nI’d love to be a part of the next release!\n\n\n\n\n\n\n\n\nBirgit Pauli-Haack\n\n11:48 am on April 12, 2023 \n\n\n\n\nI’d be happy to take part in 6.4 for docs  or triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors. squad, depending on the role I might have on the 6.3 releae. I’d be happy to be a mentor for docs release team\n\n\n\n\n\n\n\n\nLaura Byrne\n\n7:32 pm on April 12, 2023 \n\n\n\n\nI would love to be a part of this. Documentation is probably my most natural area since I don’t code.\n\n\n\n\n\n\n\n\nMichelle Frechette\n\n7:39 pm on April 12, 2023 \n\n\n\n\nPut me in, coach. Wherever I’m most useful.\n\n\n\n\n\n\n\n\nEbonie Butler\n\n7:54 pm on April 12, 2023 \n\n\n\n\nWould love to be involved with the release squad!\n\n\n\n\n\n\n\n\nTiffany Bridge\n\n8:12 pm on April 12, 2023 \n\n\n\n\nHappy to pitch in!\n\n\n\n\n\n\n\n\nMichele Butcher-Jones\n\n8:40 pm on April 12, 2023 \n\n\n\n\nI definitely DO want to do this again! I’m happy to be with docs/review again or if there is another place in needed.\n\n\n\n\n\n\n\n\nJamie VanRaalte\n\n8:41 pm on April 12, 2023 \n\n\n\n\nI might be interested. At least learning more about the process for sure!\n\n\n\n\n\n\n\n\nDee Teal\n\n9:20 pm on April 12, 2023 \n\n\n\n\nI’m available and keen too! In whatever capacity, coach or player 🙂\n\n\n\n\n\n\n\n\nCourtney Robertson\n\n11:01 pm on April 12, 2023 \n\n\n\n\nI would like to ride-along in 6.3 and be mentored by someone who has been some form of lead previously, as we are working toward Training team having a release leadRelease Lead The community member ultimately responsible for the Release. role for 6.4.\n\n\n\n\n\n\n\n\nNyasha\n\n11:31 pm on April 12, 2023 \n\n\n\n\nI’d love to help! 😁\n\n\n\n\n\n\n\n\nJessica Lyschik\n\n9:28 am on April 13, 2023 \n\n\n\n\nI was part of the 5.6 release squad and would love to do this again for 6.4! Would also happy to join 6.3 alongside a mentor to get back into it again.\n\n\n\n\n\n\n\n\nLori Berkowitz\n\n12:40 pm on April 13, 2023 \n\n\n\n\nI would like to know more about contributing.\n\n\n\n\n\n\n\n\nSé Reed\n\n2:31 pm on April 13, 2023 \n\n\n\n\nI am super interested in participating in this! Coding would be neat, but it would be a heavy lift for my dev skills (even with AI). \nMy strongest and easiest-to-contribute skills are Marcomms, and I’ve helped adjacently with release Marcomms occasionally in the past. I will be adjacent support anyway as a marketing team repTeam Rep A Team Rep is a person who represents the Make WordPress team to the rest of the project, make sure issues are raised and addressed as needed, and coordinates cross-team efforts., as with 6.2, but I would be happy to assist more directly in 6.3 leading up to 6.4, and would really love to be an official 6.4 contrib.\n\n\n\n\n\n\n\n\nFemy Praseeth\n\n3:23 pm on April 13, 2023 \n\n\n\n\nHappy to be part of the docs squad for 6.3 and 6.4 for the end-user docs\n\n\n\n\n\n\n\n\n\n\nElmaStudio\n\n8:03 am on April 14, 2023 \n\n\n\n\nAmazing, I would love to be part of it.\n\n\n\n\n\n\n\n\nMeher Bala\n\n10:35 am on April 14, 2023 \n\n\n\n\nIt was wonderful being a part of 5.6 and would like to be a part of the 6.3 and 6.4 release squad as well.\n\n\n\n\n\n\n\n\nNick Diego\n\n7:48 pm on April 14, 2023 \n\n\n\n\nSuch a great initiative! I would be happy to be a mentor for anyone interested in the Editor Triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors. Lead role.\n\n\n\n\n\n\n\n\nAnne-Mieke Bovelett\n\n4:10 am on April 15, 2023 \n\n\n\n\nI’d love to be part of this!\n\n\n\n\n\n\n\n\nPooja Derashri\n\n5:43 am on April 15, 2023 \n\n\n\n\nHappy to be part of the squad for both 6.3 and 6.4\n\n\n\n\n\n\n\n\nDJ\n\n4:47 pm on April 15, 2023 \n\n\n\n\nI would love to contribute to 6.3 and 6.4! My strengths would be in testing and docs, but I’m happy to fill any role that’s needed.\n\n\n\n\n\n\n\n\nBirgit Olzem\n\n12:11 pm on April 16, 2023 \n\n\n\n\nI‘d love to be part of it with mentorship. 6.3 & 6.4 in whatever role I can provide the best I can.\n\n\n\n\n\n\n\n\nKatie Ayres\n\n6:02 pm on April 16, 2023 \n\n\n\n\nI’d love to be a part of 6.3 and 6.4!  I am a complete noob to WordPress contributing and don’t know where to start.  I am a longtime seasoned software developer who dove into WordPress development about 2 years ago and still getting used to the ecosystem.  Would love mentorship into the process of contributing.\n\n\n\n\n\n\n\n\nWinstina\n\n10:06 pm on April 17, 2023 \n\n\n\n\nIt would be a pleasure to mentor a squad member on the documentation team.\n\n\n\n\n\n\n\n\nIsabel Brison\n\n12:33 am on April 18, 2023 \n\n\n\n\nI commented on the 6.3 post already but doubling up here: I’d love to mentor folks in the editor tech area!\n\n\n\n\n\n\n\n\njyolsna\n\n6:51 am on April 18, 2023 \n\n\n\n\nLooks exciting! I would love to contribute.\n\n\n\n\n\n\n\n\nSiobhan\n\n5:37 pm on April 18, 2023 \n\n\n\n\nI’d love to volunteer to be involved. I’ve been contributing to WordPress for over a decade, but have never been involved in a release squad and am keen to learn the ropes. I work as a developer on GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ Mobile (sponsored by Automattic) and would be interested in the editor tech or triagetriage The act of evaluating and sorting bug reports, in order to decide priority, severity, and other factors. roles.\n\n\n\n\n\n\n\n\nDevan Ferguson\n\n10:37 pm on April 18, 2023 \n\n\n\n\nI’m curious to learn more about contributing and the process. I’ve been looking for a good way to get involved with WordPress, and what better opportunity!\n\n\n\n\n\n\n\n\nEmily Leffler Schulman\n\n1:34 pm on April 19, 2023 \n\n\n\n\nGreat idea! I’d love to volunteer to train during the 6.3 release and contribute in the 6.4 release.\n\n\n\n\n\n\n\n\nJonathan Desrosiers\n\n1:45 pm on April 19, 2023 \n\n\n\n\nI’ve discussed this privately with @chanthaboune (and I’m mentioned in the post above), but to express it publicly: I’m 100% on board and excited to see this happen again to celebrate our community and make it more diverse.\nI won’t look to take on an official title on the release squad for 6.3 (and of course not 6.4), but I am fully available to help with any mentoring and support needed for anyone interested in participating!\n\n\n\n\n\n\n\n\njaimieolmstead\n\n3:42 pm on April 19, 2023 \n\n\n\n\nHi friends! I’m looking to get more involved as someone with a non-development skillset in the community. I’m interested in learning more about what opportunities there are on this front and how I can contribute to the next release!\n\n\n\n\n\n\n\n\nLinnea Huxford\n\n3:45 pm on April 19, 2023 \n\n\n\n\nHello! I am interested in contributing too!  Thanks for this great opportunity.\n\n\n\n\n\n\n\n\nNicole Furlan\n\n3:47 pm on April 19, 2023 \n\n\n\n\nHello! I’ve been wanting to make my first coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. contribution for quite some time and I’m very interested in getting involved with this! 🙂\n\n\n\n\n\n\n\n\njessicagoddard\n\n3:51 pm on April 19, 2023 \n\n\n\n\nLove this idea and would love to be involved. 🙂\n\n\n\n\n\n\n\n\nSarah Norris\n\n5:50 pm on April 19, 2023 \n\n\n\n\nI’d love to be involved, especially with the 6.4 release! I’m happy to help as a mentor and/or as part of the release squad. I’m most comfortable with the editor and themes.\n\n\n\n\n\n\n\n\nMushrit Shabnam\n\n10:25 am on April 21, 2023 \n\n\n\n\nI am interested to contribute to 6.3 and 6.4 release. Happy to help with documentation team and also open to other opportunities.\n\n\n\n\n\n\n\n\nNomad Skateboarding\n\n10:17 pm on April 21, 2023 \n\n\n\n\nLeaving a message of support for this effort and everyone involved! So stoked!\n\n\n\n\n\n\n\n\nFrancesca Marano\n\n3:39 pm on April 24, 2023 \n\n\n\n\nCount me in. I can drive or mentor 🙂\n\n\n\n\n\n\n\n\nSonia\n\n9:31 pm on April 24, 2023 \n\n\n\n\nI’d love to be a part of the 6.4 release squad.\n\n\n\n\n\n\n\n\nKaitlin Bolling\n\n8:56 pm on April 25, 2023 \n\n\n\n\nCount me in – I’d love to be involved in the release squad, and help contribute to 6.3 and 6.4!\n\n\n\n\n\n\n\n\npbwebd\n\n8:02 am on May 1, 2023 \n\n\n\n\nIf this is still something being monitored, I’d be interested in learning more about how to contribute.\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nPost navigation\n← Dev Chat Summary, April 5, 2023 Editor chat summary: Wednesday, 5th April 2023 →\n\n\n\n\n\n\n\n\nSearch\n\n\n\nEmail Updates\n\n\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 5,560 other subscribers\t\t\t\t\n\nRecent UpdatesRecent CommentsNo RepliesRecent UpdatesRecent CommentsNo RepliesCurrent Release The current release in progress is WordPress 6.3.\nPlanned future releases are listed on the Project Roadmap.\nFeature projects not tied to specific releases can be found on the Features page.\n\nRegular ChatsNote: All chats happen on Slack.\n\n\n\nWeekly Developer Meetings: Wednesday 20:00 UTC in #core\n\n\nAbout the Dev Chat\n\n\nAgendas | Summaries\n\n\n\n\n\nAPAC Triage Sessions Tuesday 5:00 UTC alternating between #core and #core-editor\n\n\nJavaScript Weekly Chat Tuesday 14:00 UTC in #core-js\n\n\nPerformance Weekly Chat Tuesday 15:00 UTC in #core-performance\n\n\nMultisite Weekly Chat Tuesday 17:00 UTC in #core-multisite\n\n\nREST API Weekly Chat Thursday 18:00 UTC in #core-restapi\n\n\nEditor Weekly Chat Wednesday 14:00 UTC in #core-editor\n\n\nNew Contributors Chat Wednesday 19:00 UTC in #core\n\n\nImages/Media Weekly Chat Thursday 15:00 UTC in #core-media\n\n\nCSS Weekly Chat Thursday 21:00 UTC in #core-css\n\n\nCustomize Weekly Chat Monday 19:00 UTC in #core-customize\n\n\n\n\nSee all meetings → \nRecent Posts and Comments\n\n\n\t\t\tTeam Pledges\n\t\t\n\n1853 people have pledged time to contribute to Core Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F07%2Fpreparing-for-the-next-women-nonbinary-release-squad%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/core/reports/",
        "https://make.wordpress.org/core/components/",
        "https://make.wordpress.org/core/handbook/",
        "https://core.trac.wordpress.org/browser",
        "https://core.trac.wordpress.org/timeline",
        "https://login.wordpress.org/?redirect_to=https://core.trac.wordpress.org/newticket",
        "https://wordpress.org/support/bb-login.php?redirect_to=https://core.trac.wordpress.org/newticket",
        "https://core.trac.wordpress.org/tickets/good-first-bugs",
        "https://make.wordpress.org/core/handbook/testing/bug-gardening/",
        "https://make.wordpress.org/core/reports/",
        "https://core.trac.wordpress.org/tickets/needs-testing",
        "https://make.wordpress.org/core/features/",
        "https://make.wordpress.org/core/handbook/",
        "https://make.wordpress.org/chat/",
        "http://time.is/2000_in_UTC",
        "https://wordpress.slack.com/messages/core/",
        "https://make.wordpress.org/chat/",
        "https://profiles.wordpress.org/chanthaboune/",
        "https://profiles.wordpress.org/chanthaboune/",
        "https://make.wordpress.org/core/tag/6-3/",
        "https://make.wordpress.org/core/tag/planning/",
        "https://wordpress.org/news/2020/12/simone/",
        "https://wordpress.org/news/2020/12/simone/",
        "https://make.wordpress.org/core/tag/6-3-release-leads/",
        "https://profiles.wordpress.org/francina/",
        "https://profiles.wordpress.org/jeffpaul/",
        "https://profiles.wordpress.org/desrosj/",
        "https://profiles.wordpress.org/jeffpaul/",
        "https://profiles.wordpress.org/cbringmann/",
        "https://profiles.wordpress.org/daisyo/",
        "https://profiles.wordpress.org/ironprogrammer/",
        "https://profiles.wordpress.org/bph/",
        "https://profiles.wordpress.org/desrosj/",
        "https://profiles.wordpress.org/priethor/",
        "https://make.wordpress.org/core/tag/6-3/",
        "https://make.wordpress.org/core/tag/6-4/",
        "https://make.wordpress.org/core/tag/planning/",
        "https://make.wordpress.org/core/2023/04/07/preparing-for-the-next-women-nonbinary-release-squad/?share=twitter",
        "https://make.wordpress.org/core/2023/04/07/preparing-for-the-next-women-nonbinary-release-squad/?share=facebook",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F07%2Fpreparing-for-the-next-women-nonbinary-release-squad%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/karmatosed/",
        "https://profiles.wordpress.org/cathibosco1/",
        "https://profiles.wordpress.org/cathibosco1/",
        "https://profiles.wordpress.org/gettechdone/",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://profiles.wordpress.org/oglekler/",
        "https://profiles.wordpress.org/jeffpaul/",
        "https://profiles.wordpress.org/audrasjb/",
        "https://profiles.wordpress.org/allisonplus/",
        "https://profiles.wordpress.org/machatine/",
        "https://profiles.wordpress.org/marybaum/",
        "https://profiles.wordpress.org/chaion07/",
        "https://profiles.wordpress.org/thisisyeasin/",
        "https://profiles.wordpress.org/akshayar/",
        "https://profiles.wordpress.org/davidbaumwald/",
        "https://profiles.wordpress.org/hellofromtonya/",
        "https://profiles.wordpress.org/chanthaboune/",
        "https://profiles.wordpress.org/findmeapk123/",
        "https://profiles.wordpress.org/ironprogrammer/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/meaganhanes/",
        "https://profiles.wordpress.org/mikeschroder/",
        "https://profiles.wordpress.org/estelaris/",
        "https://profiles.wordpress.org/battelfred/",
        "https://profiles.wordpress.org/arielmsehr/",
        "https://profiles.wordpress.org/bph/",
        "https://profiles.wordpress.org/newyorkerlaura/",
        "https://profiles.wordpress.org/michelleames/",
        "https://profiles.wordpress.org/metalandcoffee/",
        "https://profiles.wordpress.org/baxbridge/",
        "https://profiles.wordpress.org/m_butcher/",
        "https://profiles.wordpress.org/codente/",
        "https://profiles.wordpress.org/thewebprincess/",
        "https://profiles.wordpress.org/courane01/",
        "https://profiles.wordpress.org/ngreennc/",
        "https://profiles.wordpress.org/luminuu/",
        "https://profiles.wordpress.org/bmonster99/",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://profiles.wordpress.org/femkreations/",
        "https://profiles.wordpress.org/elmastudio/",
        "https://profiles.wordpress.org/meher/",
        "https://profiles.wordpress.org/ndiego/",
        "https://profiles.wordpress.org/annebovelett/",
        "https://profiles.wordpress.org/webtechpooja/",
        "https://profiles.wordpress.org/itsjustdj/",
        "https://profiles.wordpress.org/coachbirgit/",
        "https://profiles.wordpress.org/1happyplace/",
        "https://profiles.wordpress.org/planningwrite/",
        "https://profiles.wordpress.org/isabel_brison/",
        "https://make.wordpress.org/core/2023/04/14/wordpress-6-3-planning-proposal-call-for-volunteers/#comment-44713",
        "https://profiles.wordpress.org/jyolsna/",
        "https://profiles.wordpress.org/siobhyb/",
        "https://wordpress.org/gutenberg/",
        "https://profiles.wordpress.org/68kheart/",
        "https://profiles.wordpress.org/emilyatmobtown/",
        "https://profiles.wordpress.org/desrosj/",
        "https://profiles.wordpress.org/chanthaboune/",
        "https://profiles.wordpress.org/jaimieolmstead/",
        "https://profiles.wordpress.org/linsoftware/",
        "https://profiles.wordpress.org/nicolefurlan/",
        "https://profiles.wordpress.org/jessicagoddard/",
        "https://profiles.wordpress.org/mikachan/",
        "https://profiles.wordpress.org/611shabnam/",
        "https://profiles.wordpress.org/nomadskateboarding/",
        "https://profiles.wordpress.org/francina/",
        "https://profiles.wordpress.org/nudge/",
        "https://profiles.wordpress.org/kaitlin414/",
        "https://profiles.wordpress.org/pbwebd/",
        "/core/2023/04/07/preparing-for-the-next-women-nonbinary-release-squad/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F07%2Fpreparing-for-the-next-women-nonbinary-release-squad%2F&locale=en_US",
        "https://akismet.com/privacy/",
        "https://make.wordpress.org/core/2023/04/06/dev-chat-summary-april-5-2023/",
        "https://make.wordpress.org/core/2023/04/10/editor-chat-summary-wednesday-5th-april-2023/",
        "#",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/core/?o2_recent_comments=1",
        "https://make.wordpress.org/core/?replies=none",
        "https://make.wordpress.org/core/6-3/",
        "https://wordpress.org/about/roadmap/",
        "https://make.wordpress.org/core/features/",
        "https://make.wordpress.org/chat/",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T2000",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "http://make.wordpress.org/core/weekly-developer-chats/",
        "http://make.wordpress.org/core/tag/agenda",
        "http://make.wordpress.org/core/tag/summary",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T0500",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "https://wordpress.slack.com/archives/C02QB2JS7",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1400",
        "https://wordpress.slack.com/archives/C5UNMSU4R",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1500",
        "https://wordpress.slack.com/archives/C02KGN5K076",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1700",
        "https://wordpress.slack.com/archives/C03BVB47S",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T1800",
        "https://wordpress.slack.com/archives/C02RQC26G",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T1400",
        "https://wordpress.slack.com/archives/C02QB2JS7",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T1900",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T1500",
        "https://wordpress.slack.com/archives/C02SX62S6",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T2100",
        "https://wordpress.slack.com/archives/CQ7V4966Q",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230508T1900",
        "https://wordpress.slack.com/archives/C0381N237",
        "https://make.wordpress.org/meetings/",
        "https://make.wordpress.org/core/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}