{
    "title": "Imagining what’s possible in lifelong learning: Six insights from Stanford scholars at ASU+GSV • Stanford Accelerator for Learning",
    "body": "\n\n\n\n\n\n\n\n\n\n (link is external)\n\n\n\n\n\n\n\nLink to home page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nOur Work\n\nDigital Learners\nEarly Childhood Learning and Development\nLearning Differences and the Future of Special Education\nUnder Resourced and Marginalized Learners\nWorkforce Learners\n\n\nStories\nEvents\nGet Involved\n\nDigital Learning Design Challenge\nEdTech Affiliates\nFaculty Affiliates\nGiving\nLearning Partners\n\n\nAbout Us\n\nVision and Mission\nWhy Learning\nOur Team\n\n\n\n\n\nOpen mobile menu\n\n\n\n\n\n\n\n\nFriday, April 21st 2023\n    Event\n  \n\nImagining what’s possible in lifelong learning: Six insights from Stanford scholars at ASU+GSV\nAn annual conference on education innovation and technology, the ASU+GSV summit draws startup founders, edtech CEOs, investors, policymakers, and foundations from over 130 countries. \n\nby Isabel Sacks\n\n\n\n\n\n\n\n\n\n\n\n\nshare\n\ncopy linkemail\n\n\nfacebook\n\n\ntwitterpinterest \n\n\n\nAt a packed lunch during the 2023 ASU+GSV summit, Bill Gates reflected on his work leading the Bill and Melinda Gates Foundation, where he said making an impact at scale in global health was “relatively easy” compared with scaling impact in education. The most crucial puzzle piece, he said: figuring out what really works in order to be able to replicate it.\nAn annual conference on education innovation and technology, the ASU+GSV summit draws startup founders, edtech CEOs, investors, policymakers, and foundations from over 130 countries. Since its founding in 2010, it has exploded in size alongside the edtech sector itself, becoming a key meeting place for the education innovation community. The 2023 speaker lineup included former U.S. Education Secretary Arne Duncan, Sheryl Sandberg of Lean In, Sal Khan of Khan Academy, Wendy Kopp of Teach for All, and even Elmo of Sesame Street.\nThe voice of academic research at the event has, in the past, been limited. However, at this year’s gathering, which took place in San Diego from April 17-19, more than a dozen Stanford scholars spoke to audiences who rarely turn to academia for guidance. Dan Schwartz, the I. James Quillen Dean of Stanford Graduate School of Education (GSE), the Nomellini & Olivier Professor of Educational Technology, and the Halper Family Faculty Director of the Stanford Accelerator for Learning, gave a keynote the first day on StageX, the largest platform of the conference, where Bill Gates spoke just 24 hours later. \nDan Schwartz gave a keynote address on StageX at ASU+GSV on April 17.\nThe unprecedented spotlight on academia at the conference this year reflected a fundamental shift in the edtech ecosystem. Since the pandemic, where edtech became a stop-gap measure for millions of learners, edtech companies and school districts alike have increasingly realized the need for world-class research to back up proposed solutions and evaluate the impact of new interventions. What’s more, new technologies, the growing volume of data collected about learners, and advances in brain science make the role of research ever more critical for innovators. \nSome key takeaways from Stanford scholars, who spoke on a multitude of topics:\n\nArtificial intelligence will have a drastic impact on the skills workers need, and we need to be prepared. At a panel on the impact of AI on education and the workforce, Emma Brunskill, an associate professor of computer science at Stanford, argued for the need to upskill and retrain workers rather than relying on temporary fixes. “We shouldn’t fool ourselves into thinking that [the rise of AI] is necessarily going to be positive for everyone,” she said. “The U.S. has generally had a dismal record of retraining people after jobs become outsourced, but it doesn’t have to be like that.” GSE Professor Mitchell Stevens shared this cautious optimism, noting that this new organization of labor will “create enormous human capacity in future years that we have yet to script.” Schwartz echoed their thoughts in his keynote address, suggesting educators rethink conceptualizations of “mastery” and predicting that many types of mastery our society currently values will soon be obsolete.\nHigh-quality tutoring is one of the most effective educational interventions we have – but we need both humans and technology for it to work. In a standing-room-only session, GSE Professor Susanna Loeb, a faculty lead at the Stanford Accelerator for Learning, spoke alongside school district superintendents on the value of high-impact tutoring. The most important factors in effective tutoring, she said, are (1) the tutor has data on specific areas where the student needs support, (2) the tutor has high-quality materials and training, and (3) there is a positive, trusting relationship between the tutor and student. New technologies, including AI, can make the first and second elements much easier – but they will never be able to replace human adults in the relational piece, which is crucial to student engagement and motivation.\nTechnology can be a highly effective way to scale support for learners who have been excluded from education and the workforce. Jodi Anderson, Jr., MA ‘22, and Jason Spyres each earned degrees from Stanford after being incarcerated, and went on to launch innovative companies that provide opportunities they wished they had had. Anderson – who founded Rézme, a platform that connects job seekers who have criminal records to education and employment opportunities, counseling services, and more – started the company with support from the Digital Learning Design Challenge, a student program offered by the Stanford Accelerator for Learning. Spyres’ company, Training All People (TAP), builds simulations for low-wage workers to visualize new possibilities and move into middle-class vocational careers.\nGreater investment in early learning must be an urgent priority. Isabelle Hau, executive director of the Stanford Accelerator for Learning, moderated a panel on early childhood education challenges and opportunities. Hau emphasized that although 90% of the brain develops by age five, early childhood education has remarkably little investment from government, investors, and philanthropists. The panelists agreed that not only does this age group need greater investment in research and technology, but early childhood educators need to be paid more, not less, than their counterparts working with older learners. Hau cited the 2022 launch of the Stanford Center on Early Childhood, led by Philip Fisher, the Excellence in Learning Professor at the Graduate School of Education, as one example of an investment in this area.\nExperiential learning takes different forms. Stanford was able to send 60 students to the event through an ASU+GSV-funded program – an opportunity that provided the students with a unique experiential opportunity to learn and connect with education entrepreneurs, innovators and leaders in the field.\nCollaboration among researchers, school leaders, entrepreneurs, policymakers, and funders is critical for the greatest impact. “We’re at an inflection point in what we can do in learning,” said Schwartz, acknowledging that historically, universities haven’t been on the cutting edge. “Our specialty is long-term, slow, foundational research that eventually changes the world – but we’re not always the best at rapid response.” Citing a multitude of recent research innovations on learning from across Stanford, he emphasized the importance of universities retaining their strength in foundational research while building greater capacity to be nimble, and called for deeper connections between the Stanford Accelerator for Learning and the diverse stakeholders in the room. “One kind of partner we really need is partners to help us scale,” he said. “We need you, and that’s why I’m here. Because you’re the experts in scale.”\n\nSusanna Loeb spoke alongside current and former district superintendents on high-impact tutoring.\nIn addition to the speakers listed above, Sean Reardon, the Professor of Poverty and Inequality in Education at the GSE, joined a panel on recovery from pandemic learning loss, and Dora Demszky, an assistant professor in education data science at the GSE, spoke on AI and the future of higher education. Entrepreneurs-in-residence Sergio Monsalve, Chris Thomas and Joy Chen also participated in panels on building global edtech from Latin America, scaling solutions in emerging markets, and the future of Chinese edtech, respectively.\n\n\n\n\n\nRelated stories\n\n\n\n\n\nLink to Learning summit draws global leaders in education research, policy and technology\n\n\n\nOctober 5th, 2022\nEvent\n\nLearning summit draws global leaders in education research, policy and technology \nThe 2022 Stanford Accelerator for Learning Summit with the Yidan Prize Foundation focused on equitable learning opportunities, early childhood education, and learning differences. \n\n\n\nread\n\n\n\n\n\n\n\n\n\n\nStay connected\nJoin our email community to get updates delivered right to your inbox.\n\n\n\n\n\nBoobytrap Label\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n |  Accelerator for Learning\n\n\n485 Lasuen Mall\nStanford, CA 94305\nUnited States\nContact us\n\nVisit Stanford Accelerator for Learning on facebook\n\n\nVisit Stanford Accelerator for Learning on instagram\n\n\nVisit Stanford Accelerator for Learning on twitter\n\n\n\n\n\n\nNavigation\nWork\nStories\nEvents\nGet Involved\nAbout Us\nJob Openings\nStanford Long Range Vision\n\n\n\nStanford Partners\nGraduate School of Business\nSchool of Earth, Energy and Environmental Sciences\nGraduate School of Education\nSchool of Engineering\nSchool of Humanities and Sciences\nSchool of Law\nSchool of Medicine\n\n\nAccess\n\n\nLogin\n\n\n\n\n\n\n\n\n\n\nLink to Stanford website\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      Stanford Home\n      (link is external)\n\n\n\n\n      Maps & Directions\n      (link is external)\n\n\n\n\n      Search Stanford\n      (link is external)\n\n\n\n\n      Emergency Info\n      (link is external)\n\n\n\n\n\n\n      Terms of Use\n      (link is external)\n\n\n\n\n      Privacy\n      (link is external)\n\n\n\n\n      Copyright\n      (link is external)\n\n\n\n\n      Trademarks\n      (link is external)\n\n\n\n\n      Non-Discrimination\n      (link is external)\n\n\n\n\n      Accessibility\n      (link is external)\n\n\n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n",
    "links": [
        "https://stanford.edu",
        "https://acceleratelearning.stanford.edu/",
        "https://acceleratelearning.stanford.edu/our-work/",
        "https://acceleratelearning.stanford.edu/our-work/digital-learning/",
        "https://acceleratelearning.stanford.edu/our-work/early-childhood/",
        "https://acceleratelearning.stanford.edu/our-work/learning-differences/",
        "https://acceleratelearning.stanford.edu/our-work/under-resourced-and-marginalized-learners/",
        "https://acceleratelearning.stanford.edu/our-work/workforce-learners/",
        "https://acceleratelearning.stanford.edu/stories/",
        "https://acceleratelearning.stanford.edu/events/",
        "https://acceleratelearning.stanford.edu/get-involved/",
        "https://acceleratelearning.stanford.edu/get-involved/digital-learning-design-challenge/",
        "https://acceleratelearning.stanford.edu/get-involved/edtech-affiliate-program/",
        "https://acceleratelearning.stanford.edu/get-involved/faculty-affiliates/",
        "https://acceleratelearning.stanford.edu/get-involved/giving/",
        "https://acceleratelearning.stanford.edu/get-involved/learning-partners/",
        "https://acceleratelearning.stanford.edu/about-us/",
        "/about-us/#vision",
        "/about-us/#about-us",
        "/about-us/#leadership",
        "#mobile-nav",
        "#share",
        "mailto:?subject=Check out: Imagining what’s possible in lifelong learning: Six insights from Stanford scholars at ASU+GSV from Stanford Accelerator for Learning&body=An annual conference on education innovation and technology, the ASU+GSV summit draws startup founders, edtech CEOs, investors, policymakers, and foundations from over 130 countries. %0D%0Dhttps://acceleratelearning.stanford.edu/story/stanford-at-asugsv/",
        "https://www.facebook.com/dialog/feed?app_id=184683071273&link=https://acceleratelearning.stanford.edu/story/stanford-at-asugsv/&picture=&name=&caption=%20&description=&redirect_uri=http%3A%2F%2Fwww.facebook.com%2F&display=popup",
        "http://twitter.com/intent/tweet?text=https://acceleratelearning.stanford.edu/story/stanford-at-asugsv/",
        "http://pinterest.com/pin/create/button/?url=https://acceleratelearning.stanford.edu/story/stanford-at-asugsv/&media=&",
        "https://www.asugsvsummit.com/",
        "https://www.edsurge.com/news/2022-06-03-edtech-should-be-more-evidence-driven",
        "https://www.edsurge.com/news/2022-06-23-schools-are-looking-for-evidence-from-their-edtech-are-companies-ready-to-provide-it",
        "https://cs.stanford.edu/people/ebrun/",
        "https://ed.stanford.edu/faculty/stevens4",
        "https://ed.stanford.edu/faculty/sloeb",
        "https://ed.stanford.edu/about/community/jodi-anderson-jr",
        "https://news.stanford.edu/report/2021/02/04/transfer-student-forging-new-life-path-stanford/",
        "https://www.rezme.app/",
        "https://www.tap3d.com/",
        "https://earlychildhood.stanford.edu/",
        "https://ed.stanford.edu/faculty/seanreardon",
        "https://ed.stanford.edu/faculty/ddemszky",
        "https://acceleratelearning.stanford.edu/story/learning-summit/",
        "mailto:info@stanford.edu",
        "http://facebook.com",
        "https://instagram.com",
        "https://twitter.com",
        "https://acceleratelearning.stanford.edu/our-work/",
        "https://acceleratelearning.stanford.edu/stories/",
        "https://acceleratelearning.stanford.edu/events/",
        "https://acceleratelearning.stanford.edu/get-involved/",
        "https://acceleratelearning.stanford.edu/about-us/",
        "https://transforminglearning.stanford.edu/get-involved/join-our-team/",
        "https://ourvision.stanford.edu/",
        "https://gsb.stanford.edu/",
        "https://earth.stanford.edu/",
        "https://ed.stanford.edu/",
        "https://engineering.stanford.edu/",
        "https://humsci.stanford.edu/",
        "https://law.stanford.edu/",
        "http://med.stanford.edu/",
        "/login",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}