{
    "title": "1.5.4 Ownership and Use of Stanford Trademarks and Images | Administrative Guide",
    "body": "\n\n        Skip to main content\n      \n\n        Skip to secondary navigation\n      \n\n\nStanford University(link is external)\n\n\n\n\n\n\n\n\nStanford\n\n \nAdministrative Guide\n\n\n\n\n\nSearch this site\n\nSubmit Search\n\n\nMenu\nHomeChapters1. Guiding Policies and Principles2. Human Resources3. Financial Administration4. Giving to Stanford5. Purchasing and Payments6. Computing7. Health and Safety8. Services9. Organization Charts10. Student Employment and Assistantships11. Global ActivitiesAbout the GuideChange Request GuidelinesFrequently Asked QuestionsContactWhat's New\n\n\n\n\n\n\n\n\n\nBreadcrumb\n\n\nHome\n\n\nChapters\n\n\n1. Guiding Policies and Principles\n\n\n1.5 Conflict of Interest\n\n\n                  1.5.4 Ownership and Use of Stanford Trademarks and Images\n              \n\n\n\n\n\n\n\n\n1.5.4 Ownership and Use of Stanford Trademarks and Images\n\n\n\n\n\n\nTraversal links for 1.5.4 Ownership and Use of Stanford Trademarks and Images\n\n\n‹ Previous\n\n\nNext ›\n\n\n\n\n\n\n\n\n\nSkip to main content\n\nSecondary Navigation\n\n            1. Guiding Policies and Principles\n                      \n            1.1 University Code of Conduct\n                      \n            1.2 University Organization\n                      \n            1.3 Academic Governance\n                      \n            1.4 Academic and Business Relationships With Third Parties\n                      \n            1.5 Conflict of Interest\n                      \n            1.5.1 Political, Campaign and Lobbying Activities\n                      \n            1.5.2 Staff Policy on Conflict of Commitment and Interest\n                      \n            1.5.3 Unrelated Business Activity\n                      \n            1.5.4 Ownership and Use of Stanford Trademarks and Images\n                      \n            1.5.5 Ownership of Documents\n                      \n            1.6 Privacy Policies\n                      \n            1.7 Harassment & Discrimination\n                      \n            1.8 Protection of Minors\n                      \n            1.9 Signature and Financial Approval Authority\n                      \n            2. Human Resources\n                      \n            3. Financial Administration\n                      \n            4. Giving to Stanford\n                      \n            5. Purchasing and Payments\n                      \n            6. Computing\n                      \n            7. Health and Safety\n                      \n            8. Services\n                      \n            9. Organization Charts\n                      \n            10. Student Employment and Assistantships\n                      \n            11. Global Activities\n                      \n\n\n\n\n\nAuthority\nThis Guide Memo was approved by the President.\n\n\n\n\nLast Updated\nJuly 25, 2017\n\n\n\n\nPrint\n\n\nFormerly Known As Policy Number: 15.5\nThis Guide Memo establishes the policies governing use of Stanford's registered trademarks, as well as the use of unregistered names, seals, logos, emblems, images, symbols and slogans that are representative of Stanford (together referred to herein as \"Marks\").\nApplicability:\nThis Guide Memo applies to all uses of Stanford's Marks.\n1. Marks\nStanford’s Marks are owned by Stanford and they are a valuable university asset.  Faculty, students, staff and alumni share in the benefits associated with the Marks, and therefore also share responsibilities to ensure correct use.  Stanford’s Trademark Licensing Office at trademarks@stanford.edu is to be consulted with any questions about Stanford’s Marks and their use.  \na. Registered Marks\nA partial list of Stanford’s registered Marks includes, but is not limited to:\nThe word “Stanford”\nThe Block \"S\" with tree emblem\nThe Stanford University seal\nThe Office of the General Counsel maintains a complete list of registered Marks.\nb. Unregistered Marks\nA partial list of Stanford’s unregistered Marks includes, but is not limited to:\nThe word “Cardinal”\n“Farm” or “The Farm”\nThe phrase “Fear the Tree”\nBlock “S” without tree emblem\nTrademark Licensing maintains a complete list of unregistered Marks.\nc. Buildings and Landmarks\nAll buildings and landmarks that are generally recognizable as being located on Stanford’s campus or associated with Stanford are considered to be Marks. These images include, but are not limited to:\nHoover Tower\nMemorial Church\nPalm Drive\nThe Oval\nThe Main Quad\nMemorial Courtyard\nBing Concert Hall\nCantor Arts Center\nStanford Stadium\nThe Engineering Quad\nThe Knight Management Center\n2. Authority\nThe President has delegated authority for approving use of Stanford's Marks as follows:\na. Provost\nFor use in connection with educational, research and athletics activities (including courseware and related materials developed for teaching at Stanford) and for special events.\nb. Vice President for Business Affairs and Chief Financial Officer\nFor use by manufacturers of merchandise and products, in connection with Stanford’s business activities, and by vendors (including promotional use). Only the Vice President for Business Affairs and Chief Financial Officer may grant permission for use of Stanford's Marks on merchandise and products. \nc. Dean of the School of Medicine\nFor use in connection with Stanford Medicine’s activities. \nd. Vice President for University Communications\nFor use in film, video, print and digital media, including the University's web pages. \ne. General Counsel\nFor use in connection with legal affairs.\nAuthority for approving all other uses of Stanford’s Marks remains with the President.\nThese individuals, or their delegates, will collaborate on situations that fall within the scope of authority of more than one office in order to ensure a consistent application of this policy.\n3. Use of Marks\na. General\nStanford’s Marks may only be used by Stanford faculty, staff, students, and alumni as provided in this policy and for no other purposes. Stanford faculty and staff include only those individuals who meet the criteria listed in Sections 1 through 11 of Administrative Guide Memo 2.2.1: Definitions. Students include only individuals currently enrolled in a degree-granting program at Stanford. Alumni include only individuals who have completed at least three quarters of a degree-granting program at Stanford. No other individuals or entities may use Stanford’s Marks without the permission of an individual listed in Section 2, above, or their delegate.  \nb. Faculty and Staff\nStanford faculty and staff may only use Stanford’s Marks in connection with Stanford departments, institutes, events, programs, projects, activities, publications and products that are officially sponsored or sanctioned by Stanford.\nWhen a faculty or staff member is involved in activities that are not officially sponsored or sanctioned by Stanford (such as independent consulting, outside business activities, civic and volunteer work, and publications), use of Stanford's name and marks is limited to identification of the individual’s Stanford affiliation (e.g., Jane Smith, Professor of History, Stanford University). Stanford’s seal and other emblems may not be used. \nThe Trademark Licensing Office (trademarks@stanford.edu) is to be consulted before using Stanford’s Marks on any product, in a book title, in the name of any non-Stanford business or activity, or in the name of a course or program that is not owned by Stanford. \nFaculty and staff members may not grant permission for use of Stanford’s Marks to individuals and entities outside of Stanford without consultation with the Office of the Vice President for Business Affairs and Chief Financial Officer (trademarks@stanford.edu), which will then consult with the appropriate individual with delegated authority as specified in Section 2, above. This prohibition includes granting permission to (a) vendors and others in a business relationship with Stanford, (b) research sponsors, (c) donors, and (d) industrial affiliate program members.  \nAll use of Stanford’s Marks in film, video, print and digital media (including in press releases) must comply with this Administrative Guide, as well as the policies established by University Communications (brandmanager@stanford.edu). \nThis policy is not intended to limit use of the Stanford’s Marks in situations that fall within the normal scope of Stanford’s activities as a residential academic institution, as a research institution and as an employer. In these instances, Stanford's Marks may be used in accordance with the review processes established by schools, departments, centers and programs so long as the uses approved are consistent with the policies included in this Administrative Guide. \nc. Students and Alumni\nStudents and alumni may only use Stanford’s Marks as described below:\nStudents and alumni may use Stanford’s name, but no other Marks, to identify their attendance at and degrees from Stanford on resumes and on digital channels such as personal web sites and social media.  \nUndergraduate and graduate students may use Stanford’s name and the Block S with tree emblem on business cards which identify their student status. The approved business card format is included in the Identity Toolkit. Alumni may not use Stanford Marks on business cards. \nStudents and alumni may use Stanford’s Marks in connection with the University-sanctioned activities of student and alumni groups that have received and maintain official ASSU or Stanford Alumni Association recognition, respectively. When the Marks are used in these instances, it must be clear that the activity is either a student activity or an alumni activity, and not a University activity.  \nOnly recognized student and alumni groups may produce merchandise that incorporates Stanford Marks. Such merchandise may only be produced in connection with University-sanctioned activities and must comply with all policies and procedures established by the Trademark Licensing Office for licensed product. \nd. Additional Considerations\nUse of Stanford’s Marks must comply with the following:\nIn all situations, use of Marks by an authorized individual or entity must be consistent with Stanford’s academic and research mission and its reputation for excellence.  \nAll uses of Stanford’s Marks must comply with applicable policies and guidelines, including those included in the Trademark Licensing website, the Identity Toolkit, the Name Use Guidelines, and all other policies and guidelines listed in Section 8, below. \nAll uses of Stanford’s Marks must carry proper trademark designations, as established by the Office of the General Counsel and specified on the Trademark Licensing website. This includes ® on registered marks and TM on unregistered Marks when required. \nStanford’s Marks may never be altered or combined with another organization’s name or logo without permission from Stanford’s President, Provost or other individual with delegated authority under Section 2, above.\n4. Prohibited Use of Marks\nThe following uses of Stanford’s Marks are not permitted, except as otherwise authorized by (a) this policy, (b) the Name Use Guidelines, (c) other published guidelines or (d) Stanford’s President, Provost or other individual with delegated authority under Section 2, above:\nBy non-Stanford individuals and entities. This includes, but is not limited to, vendors, technology licensees, research funders, donors, industrial affiliate program members, collaborators, partners and guest speakers. \nIn a manner that endorses or implies endorsement of (a) a non-Stanford entity, or (b) the programs, products or services of a non-Stanford entity. \nBy faculty, staff, students, alumni or others in association with any commercial activity or outside venture. \nIn situations which will negatively impact Stanford’s reputation, or which may have the potential to impact negatively Stanford’s reputation. Such situations include, but are not limited to, use of Marks in connection with materials which (i) violate any law or regulation, (ii) have the potential to offend a person or group on the basis of gender, ethnic origin, religion, race, disability or sexual orientation, (iii) could be considered to be pornographic, or (iv) could be considered to be defamatory. \nIn connection with partisan political activities. See Administrative Guide Memo 1.5.1: Political, Campaign and Lobbying Activities.\nInvolvement by individual faculty, staff, students, or alumni in a non-Stanford activity is not a sufficient basis for indicating University sponsorship or endorsement and Marks may not be used in connection with such activities.\n5. Trademark Licensing Program\nAll merchandise bearing any Marks must be produced by a licensed vendor and be approved by Stanford’s Trademark Licensing Office. The Trademark Licensing Office will issue or approve all licenses, issue guidelines governing the production, sale and other distribution of licensed merchandise, and manage Stanford’s trademark licensing program. All merchandise produced for sale (including items that are sold to cover the cost of production) will be royalty-bearing at the rate established by the Trademark Licensing Office. Only items that are produced for internal use by Stanford, and are not offered for re-sale, are not royalty-bearing. Net proceeds from Stanford’s trademark licensing program royalties are used to support undergraduate financial aid and the Department of Athletics and Physical Education. \n6. Registrations\na. Domain Names\nDomain names that incorporate the words \"Stanford\" or \"Cardinal\" may only be registered in the name of the Board of Trustees of Stanford University and may only be used in connection with activities that are officially sponsored or sanctioned by Stanford.\nb. Marks\nTrademarks for the University may only be registered in the name of The Board of Trustees of Leland Stanford Junior University and may only be used in connection with activities that are officially sponsored or sanctioned by Stanford. The Office of the General Counsel is responsible for registration of all trademarks for the University.\n7. Enforcement of Rights\nThe University will actively protect its Marks from improper or misleading use by individuals or organizations not associated with Stanford and will ensure that use of Marks by Stanford faculty, students, staff, alumni, schools, departments, institutes, centers and programs conforms to all applicable policies and guidelines. The Office of the General Counsel is responsible for enforcement of Stanford's Marks.\n8. Further Information\nAdditional information can be found by contacting the offices listed below:\nQuestions about use of Stanford’s Marks on merchandise or about Stanford’s Trademark Licensing Program should be directed to the Trademark Licensing Office at trademarks@stanford.edu.\nQuestions about use of Stanford’s Marks by vendors, business partners, research and other sponsors, industrial affiliates, foundations and other non-Stanford enterprises should be directed to the Trademark Licensing Office at trademarks@stanford.edu.\nQuestions about use of Stanford’s Marks in connection with Stanford’s educational and research activities should be directed to the Office of the Provost at provost@stanford.edu.\nQuestions about use of Stanford’s Marks for promotional or marketing purposes, in the media, or in digital communications, should be directed to University Communications at brandmanager@stanford.edu.\nQuestions about use of Stanford’s Marks by donors should be directed to the Office of Development at giving.to.stanford@stanford.edu.\nQuestions about use of Stanford Medicine emblems and branding should be directed to the Office of the Dean of the School of Medicine at sombranding@stanford.edu.\nQuestions about use of Stanford Health Care emblems and branding should be directed to brand@stanfordhealthcare.org.\nQuestions about use of Stanford Children’s Health emblems and branding should be directed to marketing@stanfordchildrens.org, and additional information can be found online: http://www.stanfordchildrens.org/en/about/brand.\nQuestions concerning registration of internet domain names should be directed to Web Communications at webcom@stanford.edu.\nQuestions about trademark registrations and enforcement of Stanford’s Marks should be directed to the Office of the General Counsel at trademarkenforcement@stanford.edu.\nAll other questions about use of Stanford's Marks should be directed to the Office of the Vice President for Business Affairs and Chief Financial Officer at trademarks@stanford.edu, which will help identify the correct person or office.\nMisuse of Stanford’s Marks by non-Stanford entities should be reported to the Office of the General Counsel at trademarkenforcement@stanford.edu.\n9. Related Policies and Resources\nThe following policies and resources include related information:\nhttps://trademarks.stanford.edu/name-use-guidelines: Additional guidelines for use of Stanford’s Marks by faculty, staff, students, alumni and third parties \nhttps://ucomm.stanford.edu/policies/film-photo-video-requests/: Use of Marks in connection with photographs or film \nhttps://ucomm.stanford.edu/policies/namerequest/: Requests to use Marks in advertisements, marketing materials, press releases, movies or television:\nhttps://ucomm.stanford.edu/policies/url-name-policy/: Use of Marks in three-part Internet host names within the Stanford.EDU domain\nhttps://ucomm.stanford.edu/policies/social-media-guidelines/: Use of Marks in social media\nhttp://trademarks.stanford.edu: Information on Stanford’s Trademark Licensing Program\nResearch Policy Handbook Chapter 9:  Use of Marks in connection with Stanford intellectual property\nAdministrative Guide 1.4.1: Use of Marks in connection with academic and business relationships with third parties\nAdministrative Guide 1.5.1: Use of Marks in connection with political, campaign and lobbying activities \nAdministrative Guide 8.2: Use of Marks in connection with events and conferences\nhttps://identity.stanford.edu/: Stanford University Design Guidelines and Identity Toolkit\nhttp://med.stanford.edu/identity.html: Stanford Medicine Design Guidelines and Identity Toolkit\n\n\n\n\n\n\n\n\n\n\n\n\n\nTraversal links for 1.5.4 Ownership and Use of Stanford Trademarks and Images\n\n\n‹ Previous\n\n\nNext ›\n\n\n\n\n\nRelated Policies\n\n\n\n\n\n\n\n1.5.1 Political, Campaign and Lobbying Activities\n\n\n\nIn the limited circumstances where individuals must speak or act on behalf of the University regarding political issues, they must do so in accordance with the provisions of this Guide Memo.\n\n\n\n\n\n\n\n\n\n1.4.1 Academic and Business Relationships With Third Parties\n\n\n\nFrom time to time, the University enters into agreements with various independent entities that may result in an ongoing business or academic relationship with the University. For example, entities with current relationships include Howard Hughes\n\n\n\n\n\n\n\n\n\n8.2.1 University Events\n\n\n\nThis Guide Memo summarizes policy on University events held on University property. More detailed information is located at the Office of Special Events & Protocol.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQuestions about the Guide?\n\nContact the Administrative Guide editor in University Human Resources:\nCardinal Hall, 5th Floor, Mail Code 8443\nRedwood City, CA 94063 United States\nEmail: guide-editor@lists.stanford.edu\nIf you are a policy owner or designee and need to update a policy, send email to: guide-editor@lists.stanford.edu with your request. If you are ready to request a policy update or housekeeping update for a specific Guide Memo, please refer to the Change Request Guidelines page.\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n \nAdministrative Guide\n\n\n\n\n\nAddress\n\nUniversity Human Resources\n505 Broadway\nCardinal Hall, 5th Floor, Mail Code 8443\nRedwood City, CA 94063\nUnited States\n\n\n\n\nPolicy Chapters\n\n\n1. Guiding Policies and Principles\n\n\n2. Human Resources\n\n\n3. Financial Administration\n\n\n4. Giving to Stanford\n\n\n5. Purchasing and Payments\n\n\n6. Computing\n\n\n7. Health and Safety\n\n\n8. Services\n\n\n9. Organization Charts\n\n\n10. Student Employment and Assistantships\n\n\n11. Global Activities\n\n\n\n\nRelated Resources\n\n\nCardinal at Work website\n\n\nFaculty Handbook\n\n\nFinancial Gateway\n\n\nGraduate Academic Policies and Procedures Handbook\n\n\nHR at Stanford\n\n\nPostdoctoral Scholar Handbook\n\n\nResearch Policy Handbook\n\n\nUndergraduate Academic Policies\n\n\nStanford Safety, Security and Fire Report\n\n\nStanford Today\n\n\nAcademic Staff-Teaching and Other Teaching Staff Handbook\n\n\n\n\n\nWebsite Feedback\nYour feedback about the Administrative Guide website will be carefully reviewed.\nSubmit your feedback\n\n\n\n\n\n\n\nStanfordUniversity\n\n\n\n\nStanford Home(link is external)\n\nMaps & Directions(link is external)\n\nSearch Stanford(link is external)\n\nEmergency Info(link is external)\n\n\n\nTerms of Use(link is external)\n\nPrivacy(link is external)\n\nCopyright(link is external)\n\nTrademarks(link is external)\n\nNon-Discrimination(link is external)\n\nAccessibility(link is external)\n\n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n \n\n\n  Back to Top\n\n\n\n\n",
    "links": [
        "#main-content",
        "#secondary-navigation",
        "https://stanford.edu",
        "https://adminguide.stanford.edu/",
        "/",
        "/chapters",
        "/chapters/guiding-policies-and-principles",
        "/chapters/human-resources",
        "/chapters/financial-administration",
        "/chapters/giving-stanford",
        "/chapters/purchasing-and-payments",
        "/chapters/computing",
        "/chapters/health-and-safety",
        "/chapters/services",
        "/chapters/organization-charts",
        "/chapters/student-employment-and-assistantships",
        "/chapters/global-activities",
        "/about-guide",
        "/about-guide/change-request-guidelines",
        "/frequently-asked-questions",
        "/about-guide/contact",
        "/whats-new",
        "/",
        "/chapters",
        "/chapters/guiding-policies-and-principles",
        "/chapters/guiding-policies-and-principles/conflict-interest",
        "/chapters/guiding-policies-and-principles/conflict-interest/unrelated-business-activity",
        "/chapters/guiding-policies-and-principles/conflict-interest/ownership-documents",
        "#main-content",
        "/chapters/guiding-policies-and-principles",
        "/chapters/guiding-policies-and-principles/university-code-conduct",
        "/chapters/guiding-policies-and-principles/university-organization",
        "/chapters/guiding-policies-and-principles/academic-governance",
        "/chapters/guiding-policies-and-principles/academic-and-business-relationships-third-parties",
        "/chapters/guiding-policies-and-principles/conflict-interest",
        "/chapters/guiding-policies-and-principles/conflict-interest/political-campaign-and-lobbying",
        "/chapters/guiding-policies-and-principles/conflict-interest/staff-policy-conflict-commitment-and",
        "/chapters/guiding-policies-and-principles/conflict-interest/unrelated-business-activity",
        "/chapters/guiding-policies-and-principles/conflict-interest/ownership-and-use-stanford-trademarks",
        "/chapters/guiding-policies-and-principles/conflict-interest/ownership-documents",
        "/chapters/guiding-policies-and-principles/privacy-policies",
        "/chapters/guiding-policies-and-principles/harassment-discrimination",
        "/chapters/guiding-policies-and-principles/protection-minors",
        "/chapters/guiding-policies-and-principles/signature-and-financial-approval-authority",
        "/chapters/human-resources",
        "/chapters/financial-administration",
        "/chapters/giving-stanford",
        "/chapters/purchasing-and-payments",
        "/chapters/computing",
        "/chapters/health-and-safety",
        "/chapters/services",
        "/chapters/organization-charts",
        "/chapters/student-employment-and-assistantships",
        "/chapters/global-activities",
        "/node/547/printable/print",
        "mailto:trademarks@stanford.edu",
        "https://adminguide.stanford.edu/chapter-2/subchapter-2/policy-2-2-1",
        "mailto:trademarks@stanford.edu",
        "mailto:trademarks@stanford.edu",
        "mailto:brandmanager@stanford.edu",
        "https://identity.stanford.edu/print/stationery/",
        "https://trademarks.stanford.edu/",
        "http://identity.stanford.edu",
        "https://trademarks.stanford.edu/name-use-guidelines",
        "https://trademarks.stanford.edu/name-use-guidelines",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-1",
        "mailto:trademarks@stanford.edu",
        "mailto:trademarks@stanford.edu",
        "mailto:provost@stanford.edu",
        "mailto:brandmanager@stanford.edu",
        "mailto:giving.to.stanford@stanford.edu",
        "mailto:sombranding@stanford.edu",
        "mailto:brand@stanfordhealthcare.org",
        "mailto:marketing@stanfordchildrens.org",
        "http://www.stanfordchildrens.org/en/about/brand",
        "mailto:webcom@stanford.edu",
        "mailto:trademarkenforcement@stanford.edu",
        "mailto:trademarks@stanford.edu",
        "mailto:trademarkenforcement@stanford.edu",
        "https://trademarks.stanford.edu/name-use-guidelines",
        "https://ucomm.stanford.edu/policies/film-photo-video-requests/",
        "https://ucomm.stanford.edu/policies/namerequest/",
        "https://ucomm.stanford.edu/policies/url-name-policy/",
        "https://ucomm.stanford.edu/policies/social-media-guidelines/",
        "http://trademarks.stanford.edu",
        "http://doresearch.stanford.edu/policies/research-policy-handbook/intellectual-property",
        "https://adminguide.stanford.edu/1-4-1",
        "https://adminguide.stanford.edu/1-5-1",
        "https://identity.stanford.edu/",
        "http://med.stanford.edu/identity.html",
        "/chapters/guiding-policies-and-principles/conflict-interest/unrelated-business-activity",
        "/chapters/guiding-policies-and-principles/conflict-interest/ownership-documents",
        "/chapters/guiding-policies-and-principles/conflict-interest/political-campaign-and-lobbying",
        "/chapters/guiding-policies-and-principles/academic-and-business-relationships-third-parties/academic",
        "/chapters/services/events-and-conferences/university-events",
        "mailto:guide-editor@lists.stanford.edu",
        "mailto:guide-editor@lists.stanford.edu",
        "/about-guide/change-request-guidelines",
        "/chapters/guiding-policies-and-principles",
        "/chapters/human-resources",
        "/chapters/financial-administration",
        "/chapters/giving-stanford",
        "/chapters/purchasing-and-payments",
        "/chapters/computing",
        "/chapters/health-and-safety",
        "/chapters/services",
        "/chapters/organization-charts",
        "/chapters/student-employment-and-assistantships",
        "/chapters/global-activities",
        "http://cardinalatwork.stanford.edu/",
        "http://facultyhandbook.stanford.edu/",
        "https://fingate.stanford.edu",
        "http://gap.stanford.edu/",
        "http://hr.stanford.edu/",
        "http://postdocs.stanford.edu/handbook/",
        "http://doresearch.stanford.edu/policies/",
        "https://advising.stanford.edu/current-students/academic-policy",
        "https://police.stanford.edu/security-report.html",
        "https://news.stanford.edu/today/",
        "https://astotshandbook.stanford.edu/",
        "mailto:guide-editor@lists.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://bulletin.stanford.edu/pages/c7vDgeOuJIfpZe8GKmW3/",
        "https://www.stanford.edu/site/accessibility"
    ]
}