{
    "title": "Stanford Dining addresses climate change one bite at a time - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nJanuary 13, 2023 Stanford Dining, Hospitality & Auxiliaries reducing emissions from food purchases Residential & Dining Enterprise’s (R&DE) Stanford Dining, Hospitality & Auxiliaries is a leader in piloting indirect emissions reductions in partnership with the university’s Scope 3 Emissions Program. It has set a goal to reduce its emissions from food purchases by 25 percent from its 2019 baseline by 2030. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Chelcey Adami\n\nHelping to address climate change can be costly, daunting, and, at times, tasty.\n\nFormer student Kana Cummings shows off a meal at the Florence Moore Hall salad bar in March 2022. (Image credit: Sous Chef Alice Pyo, Stanford Residential & Dining Enterprise)\n\nResidential & Dining Enterprise’s (R&DE) Stanford Dining, Hospitality & Auxiliaries aims to reduce its emissions from food purchases by 25 percent from its 2019 baseline by 2030. To do so, Stanford Dining is increasing the use of sustainable seafood, legumes, nuts, seeds, and grains while reducing the amount of beef, poultry, pork, dairy, and egg purchases to develop delicious meals in the dining halls with input from students.\n“There’s a large desire among a lot of students to take action, to do something positive about climate change,” said Sophie Egan, director of the R&DE Stanford Food Institute and Sustainable Food Systems. “It feels really empowering to help make a positive impact on the climate and with their own actions by selecting those meal options that happen to be better for them and better for the planet.”\nEgan is co-director of the Menus of Change University Research Collaborative, a global network of colleges and universities that use campus dining halls as living laboratories to advance healthy, sustainable, delicious food choices using evidence-based research, education, and innovation. Stanford’s R&DE and the Stanford Prevention Research Center co-founded the collaborative with the Culinary Institute of America.\nStanford Dining, Hospitality & Auxiliaries is not only a pilot division on campus for the university’s Scope 3 Emissions Program but also modeling methods that may be adopted by others outside the university.\n“It can really be a beacon of what’s possible,” Egan said. “And we take that responsibility very seriously and also really lean into it from a research, learning, education, and innovation perspective, especially with this overarching campuswide urgency to confront the climate emergency.”\nScope 3 emissions\nAs the biggest contributor to total emissions, Scope 3 emissions – indirect emissions generated by things such as growing and transporting food, travel, investments, and producing purchased goods – are seen as the “next frontier” for the field, according to Egan.\n“So far no one – not even the biggest tech companies, the biggest food companies – has figured it out completely,” she said. “It’s really a prime moment for the global food service community to learn from each other about the challenges, what’s working, and what’s not. We hope to inspire others but also to help provide a roadmap so that we don’t lose any time, because the climate science is clear: We have no time to wait, and we don’t want folks to feel like they’re reinventing the wheel or just going at it alone.”\nIn 2020, the Board of Trustees passed a resolution calling for the university to eliminate its Scope 3 emissions by 2050, and the Faculty Senate later urged the university to revise the target to 2040 while encouraging the campus community to accelerate efforts to reduce emissions in their own lives.\nStanford’s Scope 3 Emissions Program was launched in 2021 to address all the indirect emissions that are influenced by the university’s operations but not directly emitted by the university, explained Program Manager Moira Zbella. Many of those are related to goods or services procured by Stanford, areas where the university spends capital, and how employees and students travel to and from campus.\nFood purchases fall under the umbrella of “purchased goods and services,” the highest impact category among Scope 3 emissions at Stanford. This category accounts for the embodied carbon in the goods Stanford purchases, including emissions from raw material extraction, manufacturing, and transportation.\n“We’ve been really lucky to have R&DE leadership, both in terms of execution and thought leadership, to help push the needle in the food category and set a model for how we might look to both measure and reduce emissions for other types of purchases,” Zbella said.\nStanford Dining, Hospitality & Auxiliaries had already started tracking its food-related emissions through the Menus of Change University Research Collaborative (MCURC) in 2017. Between 2019 and 2021, the MCURC saw a collective 11 percent decrease in pounds of carbon emissions per pound of food – the equivalent of avoiding 45,000 roundtrip cross-country flights.\nIn the first year of Stanford’s Scope 3 Emissions Program, it focused on finding ways to measure emissions from business travel, student travel, fuel and energy-related activities, and waste, which includes food packaging. The program also created a website where it publishes research white papers on Scope 3 emissions categories, which detail the methodologies being used to measure those emissions in order to facilitate scope 3 emissions accounting for other organizations. An advisory committee comprised of faculty and senior staff members also helps prioritize ways to reduce emissions on campus.\nNow in its second year, the program continues to work on identifying or expanding reduction opportunities in the four areas targeted, while also making progress in the remaining areas: campus construction, purchased goods and services, employee commuting, and campus leases.\nCreative strategies\n“Sustainability is a core value for R&DE and it is a part of every aspect of R&DE operations,” said Shirley Everett, senior associate vice provost for R&DE and senior advisor to the provost on equity and inclusion. “Our leadership in the Scope 3 Emissions Program and our work with partners on campus and in organizations like the MCURC are tangible ways we offer our expertise and engage with the campus community to address the critical issue of climate change.”\n\nHerbed Persian cucumber salad with heirloom tomatoes and roasted garlic. (Image credit: Keith Uyeda, Stanford Residential & Dining Enterprise)\n\n“It’s such a daunting topic, and food is an often overlooked, yet incredibly impactful tool for reducing climate change impacts, that each of us can actually do something about on a daily basis,” Egan said.\nThis means shifting diets to be more plant-forward, Egan said. “It does not mean trying to make everyone become vegan or vegetarian. It means shifting the emphasis from the meat-centric diet that’s common in the U.S.”\nStanford Dining, Hospitality & Auxiliaries has released the Food Choice Architecture Playbook, which outlines how it will reach its emissions reduction target through strategic shifts while ensuring culinary excellence, as well as student satisfaction, wellness, inclusive diets, and a wide array of choices from diverse global cuisines, many of which are already plant-forward.\nThat translates to options such as blended burgers – in which mushrooms are mixed into the meat to not only reduce the percentage of meat but also enhance the burger’s flavor – or increasing beans, legumes, and nuts in dishes.\n“All of those ingredients have high protein content but certainly much lower greenhouse gas emissions,” Zbella said. “There are some great strategies that Stanford Dining, Hospitality & Auxiliaries has used to creatively reduce meat and dairy while not fully taking them off the menu.”\nAnother option is the “Protein Flip,” in which meat is used as a dish’s garnish or flavor agent, instead of the main show.\nTo ensure these dishes are meeting diners’ expectations in the dining halls, students regularly provide feedback to Stanford Dining through the Student Menu Innovation Committee – a collaboration of students working with the executive chef team – and Tasting Tables, in which Flavor Lab chefs provide students with tastings of new menu items, unfamiliar produce, and new products.\n“Our chefs continuously develop new recipes that inspire students to eat more plants, while also looking at frequency, rotation, dish format, and other strategies in that toolkit,” Egan said.\nMutual benefits\nThe work is not only in the food itself but also in the sourcing. In some cases, the menu may not look very different in content, but changes have been made in the vendors used, tying into broader Scope 3 goals around purchasing behavior.\n“Addressing Scope 3 emissions really offers an opportunity for mutual benefit from collaboration with industry and beyond Stanford’s walls,” Zbella said.\nCreating menus is also driven by cost, labor, seasonality, allergens, inclusivity, cultural holidays, and more, Egan said. One of the core pillars of R&DE Stanford Dining Hospitality & Auxiliaries’ One Plate, One Planet sustainable food program is embracing systems thinking, upstream thinking, and minimizing unintended consequences. For example, some peer institutions learned that reducing emissions through a food purchasing shift inadvertently increased the use of refined sugar and white flour – an unhealthy shift.\n“We really value partnership and collaboration to inform our work,” Egan said. “We work with faculty across campus on living laboratory research to test different approaches before we actually make the change. We also collaborate industry-wide and on a regional basis.”\nThe Scope 3 Emissions Program and R&DE both aim to influence outside organizations as well. “It is not just about the work we do as an individual organization, but how we work collectively to reduce our climate impact,” said Eric Montell, assistant vice provost of Stanford Dining, Hospitality & Auxiliaries. “Our goal is to partner with other leading universities, researchers, students, and organizations to effectively combat this climate crisis.”\nR&DE Stanford Dining, Hospitality & Auxiliaries and the Scope 3 Emissions Program recently published a thought-leadership paper on how to select emissions factors for food purchases, which can help institutions identify a rigorous and transferable methodology for accurate carbon footprinting that can be maintained over time. Egan said it’s exciting when she gets calls or emails from other universities and companies that have reviewed Stanford’s Food Waste Prevention Playbook or the Food Choice Architecture Playbook.\n“The actions that we take and the research that we partner on with R&DE can not only set an example for other purchases at Stanford, but also for others trying to do the same work,” Zbella added.\n\n\n\n\n\n\n\n\n\n\n\n\nStanford News\nSustainability\nCampus Life\nEco/sustainable Practices\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D10458",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/01/APPROVED-Kana-Cummings-with-salad-.jpg",
        "https://rde.stanford.edu/",
        "https://www.moccollaborative.org/",
        "https://prevention.stanford.edu/",
        "https://news.stanford.edu/2020/06/12/trustees-commit-accelerating-transition-to-net-zero-greenhouse-gas-emissions/",
        "https://news.stanford.edu/2020/11/05/faculty-senate-urges-action-sustainability/",
        "https://sustainable.stanford.edu/campus-action/energy-climate/scope-3-emissions",
        "https://news.stanford.edu/2021/08/20/reducing-campus-emissions-focus-new-stanford-program/",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/01/APPROVED-2022-03-SD-Food-Concept-Photo-Shoot-4.jpg",
        "https://rde.stanford.edu/sites/default/files/Dining/PDF/Food%20Choice%20Architecture%20Playbook%202.0.pdf",
        "https://www.ciaprochef.com/MOC/ProteinFlip.pdf/",
        "https://rde.stanford.edu/dining/stanford-flavor-lab",
        "https://rde.stanford.edu/dining/one-plate-one-planet",
        "https://sustainable.stanford.edu/sites/default/files/Emission%20Factor%20Set%20Selection_%20Food%20Purchases_Public.pdf",
        "https://rde.stanford.edu/sites/default/files/Dining/PDF/Stanford%20Dining%20Food%20Waste%20Prevention%20Playbook.pdf",
        "https://rde.stanford.edu/sites/default/files/Dining/PDF/Food%20Choice%20Architecture%20Playbook%202.0.pdf",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/content-partner/university-communications/sustainability/",
        "https://news.stanford.edu/report/topic/campus-life/",
        "https://news.stanford.edu/report/topic/eco-sustainable-practices/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D10458",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}