{
    "title": "\n\t\tConsumer Information Disclosures | Chapman University\n\n\n\t",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\t\t\t\tSome of the content on this website requires JavaScript to be enabled in your web browser to function as\n\t\t\t\tintended. This includes, but is not limited to: navigation, video, image galleries, etc. While the\n\t\t\t\twebsite is\n\t\t\t\tstill usable without JavaScript, it should be enabled to enjoy the full interactive experience.\n\t\t\t\n\n\n\n\n    Skip to main content \n\n\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n \n\n\n\n\n\n\n        Chapman University Logo\n      \n\n\nClose Off-Canvas Menu\n\n\n\n\n\n\n\n\nConsumer Information Disclosures\nChapman Menu\n\n\n\n\nConsumer Information Disclosures\n\n\n\n\n\n\nChapman Menu\nconsumer-information-disclosures Menu\n\n\n\n\nAbout\n\n\nBack\n\nAbout Overview\n\n\nMaps & Directions\n\n\nVisit Chapman\n\n\nFacts and Ranking\n\n\nLeadership\n\n\nDiversity and Inclusion\n\n\nCampus Services\n\n\nConnect\n\n\n\n\nAcademics\n\n\nBack\n\nAcademics Overview\n\n\nDegrees & Programs\n\n\nSchools & Colleges\n\n\nAcademic Calendar\n\n\nFaculty Directory\n\n\nLibraries\n\n\nCourse Catalogs\n\n\nInternational Studies\n\n\n\n\nAdmission\n\n\nBack\n\nUndergraduate Admission\n\n\nUndergraduate Application\n\n\nGraduate Admission\n\n\nGraduate Application\n\n\nAffordability\n\n\nFinancial Aid Calculator\n\n\nTours and Visits\n\n\n\n\nAlumni\n\n\nBack\n\nAlumni Overview\n\n\n\n\nArts\n\n\nBack\nArts\n\nArts at Chapman Overview\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser Archives\n\n\nCollege of Performing Arts Events\n\n\nEscalette Permanent Collection of Art\n\n\nGuggenheim Gallery\n\n\nHilbert Museum of California Art\n\n\nMusco Center for the Arts\n\n\n\n\nCampus Life\n\n\nBack\nCampus Life\n\nCampus Life Overview\n\n\nAthletics\n\n\nDiversity and Inclusion\n\n\nEvents\n\n\nFish Interfaith Center\n\n\nHealth and Wellness\n\n\nResidence Life\n\n\nStudent Life\n\n\n\n\nResearch\n\n\nBack\n\nResearch Overview\n\n\nSponsored Projects Services\n\n\nResearch Integrity\n\n\nInstitutes and Centers\n\n\nCenter for Undergraduate Excellence\n\n\nIndustry Alliances and Commercialization\n\n\n\n\nSupport \n\n\nBack\n\nSupport Chapman Overview\n\n\nGet Involved\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n                                                        Alumni \n                        \n\n\n\n                                                        Community\n                        \n\n\n\n                                                        Faculty & Staff\n                        \n\n\n\n                                                        Industry Partners\n                        \n\n\n\n                                                        Parents & Family\n                        \n\n\n\n                                                        Students\n                        \n\n\n\n\n\n\n\n\n\n                                        Visit\n                    \n\n\n\n                                        Apply\n                    \n\n\n\n                                        Give\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Visit\n                    \n\n\n\n\n\n                    Apply\n                    \n\n\n\n\n\n                    Give\n                    \n\n\n\n\n\n\n\n\n\nInfo For\n            \n\n\n\n\n\n\n\n\nAlumni \n\n\n\n\nCommunity\n\n\n\n\nFaculty & Staff\n\n\n\n\nIndustry Partners\n\n\n\n\nParents & Family\n\n\n\n\nStudents\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\ncanva icon\nCanvas\n\n\n\n\n\n\n\n\n\n\nHandshake (career portal)\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty and staff)\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\n\n\n\n\n\n\n\n\nAbout Overview\n\n\n\n\nMaps & Directions\n\n\n\n\nVisit Chapman\n\n\n\n\nFacts and Ranking\n\n\n\n\nLeadership\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nCampus Services\n\n\n\n\nConnect\n\n\n\n\n\n\n\n\n\nAcademics\n\n\n\n\n\n\n\n\n\nAcademics Overview\n\n\n\n\nDegrees & Programs\n\n\n\n\nSchools & Colleges\n\n\n\n\nAcademic Calendar\n\n\n\n\nFaculty Directory\n\n\n\n\nLibraries\n\n\n\n\nCourse Catalogs\n\n\n\n\nInternational Studies\n\n\n\n\n\n\n\n\n\nAdmission\n\n\n\n\n\n\n\n\n\nUndergraduate Admission\n\n\n\n\nUndergraduate Application\n\n\n\n\nGraduate Admission\n\n\n\n\nGraduate Application\n\n\n\n\nAffordability\n\n\n\n\nFinancial Aid Calculator\n\n\n\n\nTours and Visits\n\n\n\n\n\n\n\n\n\nAlumni\n\n\n\n\n\n\n\n\n\nAlumni Overview\n\n\n\n\n\n\n\n\n\nArts\n\n\n\n\n\n\n\n\n\nArts at Chapman Overview\n\n\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser Archives\n\n\n\n\nCollege of Performing Arts Events\n\n\n\n\nEscalette Permanent Collection of Art\n\n\n\n\nGuggenheim Gallery\n\n\n\n\nHilbert Museum of California Art\n\n\n\n\nMusco Center for the Arts\n\n\n\n\n\n\n\n\n\nCampus Life\n\n\n\n\n\n\n\n\n\nCampus Life Overview\n\n\n\n\nAthletics\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nEvents\n\n\n\n\nFish Interfaith Center\n\n\n\n\nHealth and Wellness\n\n\n\n\nResidence Life\n\n\n\n\nStudent Life\n\n\n\n\n\n\n\n\n\nResearch\n\n\n\n\n\n\n\n\n\nResearch Overview\n\n\n\n\nSponsored Projects Services\n\n\n\n\nResearch Integrity\n\n\n\n\nInstitutes and Centers\n\n\n\n\nCenter for Undergraduate Excellence\n\n\n\n\nIndustry Alliances and Commercialization\n\n\n\n\n\n\n\n\n\nSupport \n\n\n\n\n\n\n\n\n\nSupport Chapman Overview\n\n\n\n\nGet Involved\n\n\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nÂ»\n    Your Right to Know - Consumer Information\n\n\n\nIntroduction\nConsumer disclosures provide students and families information on a range of topics including general information, the University’s facilities, campus safety and financial aid information.\nCARES Act Information\nChapman University received emergency grants for students funded by the federal government’s Coronavirus Aid, Relief, and Economic Security (CARES) Act. These funds were available to students with expenses directly related to the disruption of campus operations due to the coronavirus pandemic. Some students received funding related to the closure of campus housing and other known expenses. Read Chapman's CARES Act Memo.\n Institutional Portion Form for the quarter ending 9/30/20\nInstitutional Portion Form for the quarter ending 6/30/21\nInstitutional Portion Form for the quarter ending 9/30/21\nInstitutional Portion Form for the quarter ending 12/31/21\nInstitutional and Student Portion Form for the quarter ending 12/31/22\nInstitutional and Student Portion Form for the quarter ending 3/31/23\nCRRSAA: Higher Education Emergency Relief Fund (HEERF II)\nAmerican Rescue Plan (ARP): Higher Education Emergency Relief Fund (HEERF III)\nNavigation\nThe page has been divided into distinct sections. Each tab provides a summary description of the disclosure as well as helpful links to more information. The following sections are:\n\nGeneral Institutional Information\nInformation for Students\nFinancial Aid\nStudent Outcomes\nHealth and Safety\nAdditional Resources\n\nIf you’d like a paper copy of each disclosure, visit the Additional Resources section at the end.\n\n\n\nGeneral Institutional Information\n\n\nToggle Section\n\n\n\n\n\n                                                Admission to Chapman University\n\n                                                \n\nStudents interested in learning more about admission eligibility requirements, application filing periods, deadlines and the application process can visit the Office of Admission and select the appropriate student level and student group.\nStudents interested in learning more about admission to the Fowler School of Law can visit the Law School Office of Admission.\nNotice to Undergraduate Students: In addition the standard application requirements, some departments may require additional application materials. \nThe Office of Admission can be reached via email at admit@chapman.edu or by calling (714) 997-6711 or (888) CU-APPLY.\n\n\n\n\n\n\n                                                Athletic Participation Rates and Financial Support Data\n\n                                                \n\nEquity in Athletics Disclosure Act (EADA)\nThis annual disclosure provides information on the number and gender of full-time undergraduates participating in the intercollegiate athletic competitions and on each team. Also included is information on coaches, coach salaries, and the revenues and expenses associated with each sport.\nA paper copy of the report is available upon request.\nChapman University is a member of NCAA Division III, a division that does not offer athletics-based financial aid but provides a well-rounded collegiate experience that involves a balance of rigorous academics, competitive athletics, and the opportunity to pursue a multitude of other co-curricular and extra-curricular opportunities offered.\nEADA 2021-2022 Report (PDF)\nEADA 2020-2021 Report (PDF)\nEADA 2019-2020 Report (PDF)\nEADA 2018-19 Report (PDF)\nEADA 2017-18 Report (PDF)\nEADA 2016-17 Report (PDF)\nMore information about athletics at the University can be found on the Chapman Athletics website.\n\n\n\n\n\n\n                                                College Navigator\n\n                                                \n\nThe College Navigator is provided by the U.S. Department of Education Institute of Education Sciences and is designed to assist students in choosing the college or university that is right for them.  In addition to searching for and viewing profiles of Universities across the country, the College Navigator website features additional resources designed to assist students as they prepare for college.  All colleges and universities receiving federal financial aid are required to contribute data to the College Navigator.\nPlease visit College Navigator and search for Chapman University to view our profile.\n\n\n\n\n\n\n                                                Faculty Personnel\n\n                                                \n\nThe faculty members of Chapman University are listed online in the faculty directory:\nChapman University Faculty\n\n\n\n\n\n\n                                                Immigration Requirements for Licensure\n\n                                                \n\n                                        At Chapman University, if a student is required to have a professional or commercial license from a local, state or federal government agency in order to engage in an occupation for which the University may be training them, they must meet the immigration requirements of the Personal Responsibility and Work Opportunity Reconciliation Act to achieve licensure.\n                \n\n\n\n\n\n                                                Institutional Information for Chapman\n\n                                                \n\nThe Chapman University Website and University Catalog provides a wealth useful and easily accessible information.View the University Catalog, including archives of previous catalogs.\nOther Useful Information\n\nAcademic Programs\nUniversity Accreditation Information\nOffice of Career and Professional Development\nDisability Services\nStudent Business Services including Tuition Refund Schedule\nCenter for Global Education / Studying Abroad\nTuition and Fees\n\n\n\n\n\n\n\n                                                Instructional Facilities\n\n                                                \n\nChapman University's Orange Campus and Fowler School of Law are located in the city of Orange, California just steps away from the Orange Plaza Historic District.\nVisiting Campus\nGuided Campus Walking Tours\nInteractive Campus Map and PDF Map\nChapman University Fowler School of Law Admission Office and Viewbook\nThe Harry and Diane Rinker Health Science campus is home to Chapman University's School of Pharmacy and several graduate health science programs in the Crean College of Health and Behavioral Sciences. The Rinker Health Science campus is ideally situated in Irvine, California where students can pursue research and internships with renowned pharmaceutical companies, healthcare organizations, and facilities right in their own backyard. \nRead more about Rinker Health Science Campus\nAdditionally, Chapman University is committed to providing support services to achieve equal access to the education experience. Disability Services (DS) approves and coordinates accommodations and services for students with disabilities at Chapman to help students acquire skills essential to achieve academic and personal success. \nRead more about Disabilities Services\n \n\n\n\n\n\n\n                                                Mission Statement\n\n                                                \n\nChapman University's mission is to provide personalized education of distinction that leads to inquiring, ethical and productive lives as global citizens. Chapman University's mission and campus reflect our commitment to the Four Pillars: Intellectual, Physical, Social and Spiritual.\n\n\n\n\n\n\n                                                Fowler School of Law & ABA Required Disclosures\n\n                                                \n\n                                        View additional ABA Required Disclosure Information related specifically to the Chapman University Fowler School of Law.\n\n\n\n\n\n\n\n\n\nInformation for Students\n\n\nToggle Section\n\n\n\n\n\n                                                Constitution Day\n\n                                                \n\nEvery year, on or around September 17, the University celebrates the founding document of the United States of America: The U.S. Constitution. It is important to note that activities are open to all students.\n2022-2023\n\nSeptember 16, 2022 – The Student Union celebrated National Constitution Day with “Cookies, Crafts, and Constitutions.” The event included constitution-themed crafts, a US Constitution Trivia game, a special musical playlist, and cookies. Pocket constitutions were distributed along with American flags to all students who stopped by the table. The Global Citizens Wall’s “Question of the Week” asked students to write about the various ways the constitution is interpreted. Dean Price recorded a video for the Student Union’s social media channel promoting the event.\n\n2021-2022\n\nSeptember 17 – Civic Engagement hosted an information table in Attallah Piazza and distributed pocket-sized constitutions and shared information from the National Constitution Center and facilitated several interactive activities to help students learn/think more about the constitution. The Global Citizens Wall question focused on a topic related to the U.S. Constitution.\n\nCivic Engagement promoted two events:\n\nSeptember 15 - Canceled on Campus: GenZ Students on Challenges to Free Expression (https://bipartisanpolicy.org/event/canceled-on-campus/)\nNational Constitution Day Conversation\n\n\n\n\n\n2020-2021\n\nSeptember 17 – Civic Engagement held an Instagram Live event featuring students discussing various aspects of the Bill of rights.\n\n2019-2020\n\nSeptember 17 – Students can learn more about the U.S. Constitution and take pocket-sized constitutions by visiting the Civic Engagement Initiatives table in the Attallah Piazza between 10:00am and 1:00pm.  The Global Citizens Wall question will also focus on a topic related to the U.S. Constitution.\n\n2018-2019\n\nSeptember 17 – Students can learn more about the U.S. Constitution and take pocket-sized constitutions by visiting the Civic Engagement Initiatives table in the Attallah Piazza during the lunch hours.  The Global Citizens Wall question will also focus on a constitutional topic.\n\n2017-2018\n\nSeptember 18: As part of our Constitution Day celebration, Civic Engagement is hosting a civil rights tour of Old Towne Orange revisiting sites and stories of Latinx segregation. A portion of the tour will include information regarding Mendez v. Westminster, a case that helped pave the way to the landmark Supreme Court decision Brown v. Board of Education seven years later.\nSeptember 23: Commemorate the 230th anniversary of the signing of the U.S. Constitution with a panel discussions addressing current threats to the constitutional system sponsored by The Claremont Institute at Fowler School of Law.\n\n2016-2017\n\nSeptember 17: The Fowler School of Law is celebrating Constitution Day with an all-day workshop and series of speakers and panels.\nSeptember 14: The Office of Civic Engagement Initiatives will be distributing pocket-sized Constitutions at the annual Student Involvement Fair.  Students will also notice posters on lawn-stakes throughout campus highlighting Constitutional Amendments and offering questions for reflection.\n\n2015-2016\n\nSeptember 17: The Fowler School of Law celebrated Constitution Day with a panel of speakers.  Students, Faculty and Staff in attendance received cupcakes and pocket Constitutions.\n\n2014-2015\n\nSeptember 17: A celebration of the 227th anniversary of the Constitution was held in Atallah Piazza with information about the Constitution and the Founding Fathers distributed.  Students received a pocket copy of the Constitution.\n\nStudents can learn more about Constitution Day by visiting these websites:\n\nChapman University Civic Engagement\nThe National Archives\nThe Library of Congress\nThe U.S. Senate Constitution Day Resources\n\n\n\n\n\n\n\n                                                Copyright Infringement\n\n                                                \n\nThe purpose of this section is to establish uniform policies and campus-wide procedures that assure campus compliance with all state and federal laws applying to copyrighted material.\nLegal Affairs and Student Conduct communicate regularly to combat copyright infringement.\nResources:\n\nAnnual Copyright Compliance Memo to Chapman Community\nComputer and Network Acceptable Use Policy\nDigital Millennium Copyright Act\n\n\n\n\n\n\n\n                                                Housing - Residential Life\n\n                                                \n\nThe Office of Residential Life and First Year Experience assists students with both on and off campus housing and provides a variety of services to students and their families. Students and families may wish to review several resources related to Residential Life:\nAnnual Crime Awareness & Security Report and Annual Fire Safety Report (Clery Act) (PDF)\nPublic Safety Crime Alert Bulletins\nChapman University Conduct Code\nChapman University's Guide to Moving into the Residence Halls\nHousing Emergencies\nServices in the Residence Halls\nThe Office of Residential Life and First Year Experience can be contacted at (714) 997-6603 or via email at reslife@chapman.edu\n\n\n\n\n\n\n                                                Student Activities\n\n                                                \n\nWith the goal of removing the phrase, \"I'm bored\" from a student's vocabulary, Chapman University fosters robust opportunities for involvement that serve to enhance students' college experience.\nTo learn more about opportunities for involvement and student resources, please feel free to explore these areas:\n Student Life\nCampus Life\nResidential Life and First Year Experience\nStudent Government\nGreek Life\nCivic Engagement\nStudent Leadership Opportunities\nFitness and Wellness Programs\nFor more information about student engagement, activities and well-being, please visit the Chapman University Student Affairs Website and the Dean of Students Website.\n\n\n\n\n\n\n                                                Textbook Information\n\n                                                \n\nStudents and guests may view required, recommended and supplemental course materials schedule for a given class via the Campus Bookstore Online. By clicking on the department, course number and section the following information is available: textbook title, the International Standards Book Number (ISBN), and the price for the book if purchased new or used (if available) or is utilized as a rental (if available) for required and recommended textbooks and supplemental materials.\nStudents are not required to buy their textbooks from the University Book Store.\nThe University Bookstore can be reached at (714) 997-6718.\n\n\n\n\n\n\n                                                Transfer of Credit Information\n\n                                                \n\nChapman University's General Transfer Credit Policies are indicated below. Additional important information about transfer of credit is available on the Registrar's Office's Transfer Credit Policies and Guidelines Webpage.\n\n\nOnly credit from regionally accredited institutions is evaluated for transferability.\n\n\nCredit is given for baccalaureate courses excluding preparatory level, technical, vocational, professional, and work experience/co-op credits.\n\n\nMinimum grade of C-.\n\n\nA maximum of 70 semester credits of community college credit will be applied toward the bachelor's degree.\n\n\nNo limit is placed on the number of transferable credits from regionally accredited four-year colleges or universities. A student, however, must meet all the credit, grade, and residence requirements as stated in the Undergraduate Degree Requirements section of the current Chapman University catalog.\n\n\nNo internship or practicum credit is accepted in transfer.\n\n\nIndependent Study and special topics credit in transfer are not automatically accepted. Materials detailing the content studied may be submitted for credit consideration.\n\n\nCoursework may not duplicate or overlap other course credits.\n\n\nCSU transferability does not guarantee the course will be transferable to Chapman.\n\n\n\n\n\n\n\n\n                                                Voter Registration\n\n                                                \n\nThe Secretary of State's Office has worked with colleges from across California to develop a system that can be used by each campus to give students the opportunity to register to vote. Please visit RegisterToVote.ca.gov to easily access an online voter registration application to register in California.  To register in a different state, visit chapman.turbovote.org to be directed to the necessary registration forms.  \nIn addition to this convenient resource, voter registration cards are available in the Bhathal Student Services main lobby and at the Student Union Information Desk.\nFor more information on ways to become more engaged with elections, such as serving as a poll worker, please contact the Orange County Registrar of Voters.\nAdditional Resources:\n\nCU at the Booths\nChapman University Civic Engagement\n\n\n\n\n\n\n\n                                                Withdrawal from the Institution\n\n                                                \n\nUndergraduate Students are considered withdrawn from the Chapman University if:\n\n\nThe student drops all courses in which they are enrolled during a semester.\n\n\nAfter completing a semester the student does not return for the subsequent semester.\n\n\nUndergraduate students who plan to return after interrupting their enrollment at Chapman University must review the Interrupted Enrollment policy.\nCurrent Undergraduate students who are uncertain whether or not to withdraw from the university are strongly urged to contact the campus Dean of Students prior to withdrawing. Graduate students should contact the Provost's Office.\nGraduate Students are considered withdrawn from the Chapman University if:\n\nThe student drops all courses in which they are enrolled during a semester.\nThe student does not return after more than one semester of non-attendance.\n\nWith the exception of Law students, the University Registrar is the Official withdrawal office.  Students wishing to withdraw should contact the Registrar to complete the withdraw process.\nLaw students should contact the Associate Dean for Student Affairs and Administration.\nGraduate students who plan to return after interrupting their enrollment for more than one semester must review the Leave of Absence policy.\nView additional information about the University's withdrawal policy.\nIt is important for students to understand that withdrawing from the university before the end of the term may impact your financial aid offer, even if you are only offered student loans.  Information about withdrawing from the University and its impact on financial aid can be found in the Financial Aid Information Guide.\nStudents enrolled in the Fowler School of Law should consult section 4.1.7 of the Student Handbook available online (pdf) for specifics about withdrawal as a Law student.\n\n\n\n\n\n\n\n\n\nFinancial Aid\n\n\nToggle Section\n\n\n\n\n\n                                                Costs and Consumer Information\n\n                                                \n\nChapman University and the U.S. Department of Education provide several resources to assist students and families in calculating the cost of attendance. Please note that, once enrolled, each student will receive a personalized bill from the Student Business Services Office detailing all charges for the term.\nCost of Attendance for Undergraduate Students\nCost of Attendance for Graduate Students\nChapman University's Net Cost Calculator\nChapman University's Tuition and Fee Schedule\nChapman University's College Scorecard\nCollege Navigator\nStudents and families with questions about Cost of Attendance should contact the Financial Aid Office. Undergraduate Students: (714) 997-6741; Graduate and Law Students: (714) 628-2730.\n\n\n\n\n\n\n                                                Family Educational Rights and Privacy Act (FERPA)\n\n                                                \n\nChapman University is committed to the protection and confidentiality of student educational records, adhering closely to the guidelines established by the Family Educational Rights and Privacy Act - a federal legislation established to regulate access and maintenance of student educational records.\nChapman University's FERPA Policy\nU.S. Department of Education FERPA Guide\nChapman University's Annual Notification to Students\nSpecial information for students studying abroad\nFor more information about FERPA, or to obtain a paper copy of this policy, please contact the Office of the Registrar at (714) 997-6701.\n\n\n\n\n\n\n                                                Federal Student and Parent Loan NSLDS Disclosure\n\n                                                \n\nStudents and parents who borrow through a Federal Loan program including the PLUS Loan, Grad PLUS, Perkins Loan and Direct Loan programs will have information about your loans will be submitted to the National Student Loan Data System (NSLDS). Information in NSLDS is accessible to schools, lenders, and guarantors for specific purposes as authorized by ED.\nBorrowers can access their own information via NSLDS for Student Access.\n\n\n\n\n\n\n                                                Financial Aid Office Code of Conduct\n\n                                                \n\nBoth the Undergraduate and Graduate Financial Aid Offices believe in and maintain a commitment to the National Association of Student Financial Aid Administrator's Code of Conduct.\n1. No action will be taken by financial aid staff that is for their personal benefit or could be perceived to be a conflict of interest.\n\nEmployees within the financial aid office will not award aid to themselves or their immediate family members. Staff will reserve this task to an institutionally designated person, to avoid the appearance of a conflict of interest.\nIf a preferred lender list is provided, it will be compiled without prejudice and for the sole benefit of the students attending the institution. The information included about lenders and loan terms will be transparent, complete, and accurate. The complete process through which preferred lenders are selected will be fully and publicly disclosed. Borrowers will not be auto-assigned to any particular lender.\nA borrower's choice of a lender will not be denied, impeded, or unnecessarily delayed by the institution, even if that lender is not included on the institution's preferred lender list.\nNo amount of cash, gift, or benefit in excess of a de minimis amount shall be accepted by a financial aid staff member from any financial aid applicant (or his/her family), or from any entity doing business with or seeking to do business with the institution (including service on advisory committees or boards beyond reimbursement for reasonable expenses directly associated with such service).\n\n2. Information provided by the financial aid office is accurate, unbiased, and does not reflect preference arising from actual or potential personal gain.\n3. Institutional award notifications and/or other institutionally provided materials shall include the following:\n\nA breakdown of individual components of the institution's Cost of Attendance, designating all potential billable charges.\nClear identification of each award, indicating the type of aid, i.e. gift aid (grant, scholarship), work, or loan.\nStandard terminology and definitions, using NASFAA's glossary of award letter terms.\nRenewal requirements for each award.\n\n4. All required consumer information is displayed in a prominent location on the institutional website(s) and in any printed materials, easily identified and found, and labeled as \"Consumer Information.\"\n5. Financial aid professionals will disclose to their institution any involvement, interest in, or potential conflict of interest with any entity with which the institution has a business relationship.\n\n\n\n\n\n\n                                                Financial Aid Office Statement of Ethical Principles\n\n                                                \n\nBoth the Undergraduate and Graduate Financial Aid Offices believe in and maintain a commitment to the National Association of Student Financial Aid Administrator's Statement of Ethical Principles.\nFinancial aid administrators shall:\nAdvocate for students \n\nRemain aware of issues affecting students and continually advocate for their interests at the institutional, state and federal levels.\nSupport federal, state and institutional efforts to encourage students, as early as the elementary grades, to aspire to and plan for education beyond high school. \n\nManifest the highest level of integrity \n\nCommit to the highest level of ethical behavior and refrain from conflict of interest or the perception thereof.\nDeal with others honestly and fairly, abiding by our commitments and always acting in a manner that merits the trust and confidence others have placed in us.\nProtect the privacy of individual student financial records.\nPromote the free expression of ideas and opinions, and foster respect for diverse viewpoints within the profession.\n\nSupport student access and success \n\nCommit to removing financial barriers for those who want to pursue postsecondary learning and support each student admitted to our institution.\nWithout charge, assist students in applying for financial aid funds.\nProvide services and apply principles that do not discriminate on the basis of race, gender, ethnicity, sexual orientation, religion, disability, age, or economic status.\nUnderstand the need for financial education and commit to educate students and families on how to responsibly manage expenses and debt.\n\nComply with federal and state laws \n\nAdhere to all applicable laws and regulations governing federal, state, and institutional financial aid programs.\nActively participate in ongoing professional development and continuing education programs to ensure ample understanding of statutes, regulations, and best practices governing the financial aid programs.\nEncourage colleagues to participate in the financial aid professional associations available to them at the state, regional, or national level and offer assistance to other aid professionals as needed.\n\nStrive for transparency and clarity  \n\nProvide our students and parents with the information they need to make good decisions about attending and paying for college.\nEducate students and families through quality information that is consumer-tested when possible. This includes (but is not limited to) transparency and full disclosure on award notices.\nEnsure equity by applying all need-analysis formulas consistently across the institution's full population of student financial aid applicants.\nInform institutions, students, and parents of any changes in financial aid programs that could affect their student aid eligibility.\n\nProtect the privacy of financial aid applicants \n\nEnsure that student and parent private information provided to the financial aid office by financial aid applicants is protected in accordance with all state and federal statutes and regulations, including FERPA and the Higher Education Act, Section 483(a)(3)(E) (20 U.S.C. 1090).\nProtect the information on the FAFSA from inappropriate use by ensuring that this information is only used for the application, award, and administration of aid awarded under Title IV of the Higher Education Act, state aid, or aid awarded by eligible institutions.\n\n\n\n\n\n\n\n                                                Financial Assistance\n\n                                                \n\nThis disclosure provides information on all available federal, state, local, private, and institutional financial need-based and non-need-based assistance programs.\nFinancial Assistance Available to Students\n\nChapman University Grants and Scholarships\nFederal and State Grants and Scholarships\nFederal Loans including the Perkins Loan\n\nPlease note: As of September 30, 2015, the Perkins Loan Program is no longer available. However, some students may still qualify for the loan. The Financial Aid Office will continue to award students who still qualify for the Perkins Loan.\n\n\nInstitutional Loan\nFederal Work Study\nScholarship Opportunities\n\nFinancial Aid Planning Resources\n\nFinancial Aid Information Guide: A complete source for information about applying for and maintaining financial aid eligibility.\nHow to Apply for Financial Aid\nCost of Attendance\nNet Cost Calculator\nSatisfactory Academic Progress: Select \"Non-Year Specific\"\nWithdrawal Policy\n\nIn addition, students are encouraged to contact the Financial Aid Office to determine how their award and/or SAP status may be impacted by withdrawing from classes.\n\n\n\nDirect Loan Entrance and Exit Counseling\nEntrance Counseling is required before a student's Direct Loan will be disbursed on their account.  In some cases, a Parent may be required by the Department of Education to complete Entrance Counseling before the PLUS Loan will disburse.  Entrance Counseling may be completed online at www.studentloans.gov.\nExit Counseling: Information About Federal Loan Exit Counseling is available on the Financial Aid website with more detailed information including information about repayment plans available at www.studentloans.gov.\nPlease contact the Undergraduate Financial Aid Office at (714) 997-6741 or the Graduate Financial Aid Office at (714) 628-2730 should you have questions.\n\n\n\n\n\n\n                                                Loan Repayment Example\n\n                                                \n\nThere are many tools available to assist students in determining which repayment plan is best and what payments may look like with each of the available options.\nThe U.S. Department of Education offers a comprehensive Loan Repayment Estimator.\nAs an example, a student who borrows $3,500 in subsidized Direct Loan with an interest rate of 3.76% will be paying $50 per month under the standard repayment plan.  Additional examples are below:\nPlan Summary\n\n\nPlan Name\nStandard Months\nActual Months\nMonthly Payment\nTotal Repaid\n\n\nStandard\n120\n80\n$50\n$3,968\n\n\nGraduated\n120\n120\n$20-$59\n$4,388\n\n\n\nUnder the Standard repayment plan, the final payment, month 80, would be less than $10. Months 1-79 would have monthly payments of $50.\n\n\n\n\n\n\n                                                Private Education Loan Self-Certification Form\n\n                                                \n\nStudents and parents borrowing through a private or alternative loan program may be required to complete and submit to the lender a copy of the Private Education Loan Self-Certification Form. This form asks basic demographic and financial aid information of the application which the lender may choose to access electronically instead of via the paper form. Should you need assistance completing this form, please contact the Undergraduate Financial Aid Office or the Graduate Financial Aid Office in person. Forms are available in the office as well.\n\n\n\n\n\n\n\n\n\nStudent Outcomes\n\n\nToggle Section\n\n\n\n\n\n                                                Required Reports: Completion/Graduation and Continuation/Retention Rates\n\n                                                \n\nThe Office of Institutional Research has created a Datamart to provide the community with the accurate data about the University and its enrollment.\nReports that may be of particular interest to prospective students and families include:\nCompletion/Graduation Rates\nContinuation/Retention Rates\nStudent Headcount and Required Reports \nDiversity\nJob Placement for Graduates\n \n\n\n\n\n\n\n                                                Teacher Preparation Programs\n\n                                                \n\nChapman University offers multiple teacher preparation programs that prepare students in becoming credentialed teachers.\nTitle II Reports for passage rates of license examination completers\nChapman University complies with all federal government reporting requirements pursuant to Section 207 of the Higher Education Act Title II passed by congress in 1998. The Commission on Teacher Credentialing requires a link to the most current year passing rates of the license examination according to AB 2086. Please see the Annual Report Card on CA-TPP 2019-2020(PDF) data and scroll to Appendix A Pass Rate by Assessment to review Chapman University's program pass rates.  The 2015-16 Report Card on California Teacher Preparation Programs - Excel Data Files are available on the CTC Title II webpage.\nLast updated: September 2022\n\n\n\n\n\n\n\n\n\nHealth and Safety\n\n\nToggle Section\n\n\n\n\n\n                                                Annual Crime Awareness & Security Report (ASR) & Annual Fire Safety Report (Clery)\n\n                                                \n\nAnnual Security & Fire Safety Report (ASR)\nEvery year, Chapman releases a security report prepared by the Department of Public Safety in cooperation with Residence Life, Student Life, and the judicial affairs staff, along with information provided by the Orange Police Department, Anaheim Police Department and Irvine Police Department.  \nThe report includes:\n\nCrime statistics\nInstitutional policies concerning campus security, alcohol and drug use, crime prevention report of crimes, sexual assault, fire safety and other matters\nAn annual notification of the report\n\nThe full text of this report can be obtained a number of ways:\n\nHard Copy: At the Department of Public Safety located at One University Drive, Orange, CA 92866 or by calling (714)-997-6763\nThrough the website: The Public Safety website provides more information about the report and other statistics\nPDF: Annual Security Report (ASR) with annual notification (PDF) - 2019\nPDF: Annual Security and Fire Safety Report - 2020\nPDF: Annual Security and Fire Safety Report - 2021\nPDF: Annual Security and Fire Safety Report - 2022\n\n \nFire Safety\n Chapman’s Public Safety department publishes an annual fire safety report, including policies and procedures for on-campus student housing. There are a few ways to access this information:\n\nOnline: Under the “Fire Statistics” heading\nPDF: In the Annual Security Report (linked above)\n\nFor additional resources on fire safety, view the Fire Safety and Policy Information\n\n\n\n\n\n\n                                                Campus Security Personnel\n\n                                                \n\nThe Department provides a variety of public safety functions and related services as well as ongoing programs in safety (R.A.D. – Rape Aggression Defense), disaster, crime and fire prevention on and around the campus community.\nAdditional information about the Department of Public Safety and their staff may be found on their website.\nChapman University Department of Public Safety can be reached at (714) 997-6763.\n\n\n\n\n\n\n                                                Discrimination, Harassment and Retaliation\n\n                                                \n\nAt Chapman University, all students, faculty and staff have the right to an inclusive learning and work environment where all individuals are treated with dignity and respect.\nMore information about Chapman University's Discrimination, Harassment and Retaliation policy including the complaint procedure and information about Title IX can be found on the Human Resources website.\n\n\n\n\n\n\n                                                Drug and Alcohol Prevention\n\n                                                \n\nChapman University is in compliance with Title 34 CFR 86 which requires notice to all students, faculty and employees concerning its drug and alcohol abuse prevention program. The Drug-Free Schools and Communities Act Amendments of 1989 require that institutions of higher education certify that they have adopted and implemented a drug and alcohol prevention program as a condition of receiving funding under any federal program. The Secretary of Education has, as required by the Amendments, issued regulations to enforce the law. These regulations, are known as the “Drug Free Schools and Campuses”.\nResources:\n\nAlcohol Awareness – Online Training for Employees\nAlcohol and Other Drug Information – Resources and Statistics for Students and Families\nStudent Conduct Policies Related to Alcohol and Drugs\nDrug Free Schools and Communities Act Biennial Review 2018-2019 & 2019-2020 (PDF)\nDrug Free Schools + Communities Act Policy\n\nIn addition, Human Resources publishes a Staff Handbook outlining in 2.11.8 information about substance abuse in compliance with the Drug-Free Workplace Act and the Drug Free Schools and Communities Act.\n\n\n\n\n\n\n                                                Drug Violations and Consequences\n\n                                                \n\nA state or federal drug conviction can disqualify a student from receiving financial aid. Financial aid recipients are only held accountable for convictions that occurred during a period of enrollment.\nThe period of financial aid ineligibility for a drug possession or sale conviction is as follows:\nFor possession of illegal drugs\n\nFirst offense: one year from date of conviction\nSecond offense: two years from date of conviction\nThree or more offenses: indefinite period\n\nFor sale of illegal drugs (including conspiring to sell drugs)\n\nFirst offense: two years from date of conviction\nSecond offense: permanent ineligibility\n\nIf a student is convicted of both possessing and selling illegal drugs, he or she will be disqualified for the longer period of ineligibility.\nResources:\n\nAlcohol and Other Drug Information – Resources and Statistics for Students and Families\nStudent Conduct Policies Related to Alcohol and Drugs\nDrug Free Schools and Communities Act Biennial Review\n\nPlease note: A conviction that was reversed, set aside, or removed from the student's record doesn't count, nor do juvenile convictions, unless the student was tried as an adult.\n\n\n\n\n\n\n                                                Emergency Management\n\n                                                \n\nCampus guides and resources regarding immediate emergency response and evaluation procedures\nQuestions? Please contact the Public Safety Department at (714) 997-6763.\n\n\n\n\n\n\n                                                Health Center\n\n                                                \n\nThe Chapman Student Health Center is located at the corner of Sycamore and Glassell and provides students with first aid care, care for acute illness, health maintenance including immunizations and testing and health screenings.\nThe Health Center is open Monday through Friday 8:30 a.m. to 4:30 p.m. Walk-In hours are 8:30 a.m. - 12 p.m. during regular semesters.\nAn appointment is usually needed to see the doctor or gynecological nurse practitioners. Please call to schedule an appointment with a health care provider. Appointments are needed in the afternoons. Doctors' hours vary according to their availability.\nPlease note: All students are required to submit the Health Record Form. This form is available online and is maintained by the Chapman Student Health Center. Students will not be allowed to register for classes if they have not completed and submitted this form.\nCall 911 for any life threatening emergency\nMore information about the Chapman Student Health Center and services provided as well as the required Health Record Form can be found on the Chapman Student Health Center website.\n\n\n\n\n\n\n                                                Identity Theft\n\n                                                \n\nIn accordance with federal regulations, the Chapman University Undergraduate and Graduate Financial Aid Offices have systems in place to identify and resolve discrepancies in information received from different sources including the use of false identities. Suspected violators will be referred to the Inspector General of the U.S. Department of Education.\n\n\n\n\n\n\n                                                Immunization\n\n                                                \n\nChapman University requires the following immunizations:\n\nMeasles, Mumps and Rubella (MMR)\nTetanus\n\nStudent Health Services will put a hold on student's who have health forms that indicate they are not up-to-date on the required immunizations. For questions or more information about required immunizations or student holds relating to health records, please contact  Student Health Services at (714) 997-6851.\n\n\n\n\n\n\n                                                 Information Security\n\n                                                \n\nThe Chapman University Information Security Program is managed by the Information Security Office. The program ensures the security and confidentiality of information and aims to protect the University against any anticipated threats to the security or integrity of such information and against unauthorized access to or use of information that could result in substantial harm or inconvenience to any customer, faculty, staff or student.\nKey components of the Chapman information security program are:• Audit committee responsibilities for oversight• Identification and assessment of the risks that may threaten customer information• Written programs, policies, procedures, and standards to control risks through prevention (including security awareness training), monitoring, and response controls.• Security-related oversight of service provider arrangements• Adjustments to the program on a continuing basis for changes in technology, the sensitivity of customer information, internal or external threats to information, and the University’s business arrangements.\nVisit our Information Security website.\n\n\n\n\n\n\n                                                Missing Student Notification\n\n                                                \n\nConsistent with the Higher Education Act of 2008 (HEOA), Chapman University has adopted the following policy and protocols regarding the investigation of and response to reports that a student’s whereabouts are unknown.\nHow to Report\nChapman University takes student safety very seriously. To this end, individuals having reason to believe that a student has been missing should immediately notify the Chapman University Department of Public Safety at 714-997-6763.\nThese reports may also be made to Residence Life and First Year Experience in the Davis Community Center or the Dean of Students Office in Argyros Forum 101. If the missing person report is made to staff or organizations other than Chapman University Department of Public Safety, the entity must contact Public Safety immediately.\nA student residing in on-campus housing is determined to be missing when the Chapman University Department of Public Safety or other law enforcement agency determines that:\n\nThe student has been missing for more than 24 hours without any known reason,\nThe reported information is credible, and\nThe circumstances warrant officially declaring the student to be missing.\n\nUnless there is evidence to the contrary, a student residing in on-campus housing will not necessarily be considered missing if the student provided information about their intended whereabouts to the Residence Life and First Year Experience or if the student is absent during recognized University holidays or breaks.\nA student may be considered to be missing if his or her absence is contrary to their usual pattern of behavior and/or if unusual circumstances may have caused the absence. Such circumstances may include, but not be limited to, a report or suspicion that the missing student may be the victim of foul play, has expressed suicidal thoughts, is under the influence of alcohol or other drugs, is in danger, or has been with persons who may endanger the student’s welfare.\nContact Procedures\nAll enrolled students at Chapman University, regardless of their living circumstances, should designate a Confidential Contact.\nA Confidential Contact is an individual(s) that the student prefers Chapman University officials contact in the event that the student is determined to be missing for a period of more than 24 hours. The information provided for the Confidential Contact is confidential and accessible only to authorized campus officials. The contact information may not be disclosed to any party except to law enforcement personnel in furtherance of an official missing person investigation. The University suggests that students notify their Confidential Contacts that they have been designated as such.\nAll enrolled students at Chapman University living on campus are required to designate a Confidential Contact during the housing application process. It is suggested that students living off campus also designate a Confidential Contact. Every student (resident and non-resident) has a student account on PeopleSoft where they may designate contact information for their selected Confidential Contact. Students should update their personal information at the beginning of each academic year. Students are solely responsible for the accuracy of the information provided and updating the information when needed.\nIn the event that the missing student is under the age of 18 and is not emancipated, the custodial parent or guardian on the student’s file at the time that the underage student is determined to be missing will also be contacted within 24 hours in addition to the student’s Confidential Contact. If at any time for any reason the custody or guardianship of the student changes during his or her time at the University, the student must update their records immediately.\nWhen a Report is Made\nWhen a report is received that a student’s whereabouts are unknown, Chapman may employ such steps as are appropriate in determining the student’s whereabouts; these step may include some or all of the following:\n\nCheck of the student’s campus residence.\nAttempt to contact the student via phone or internet.\nInterview roommates or other students, as appropriate, to gather additional information about the student’s location and recent activities.\nAccess the student’s class schedule and try to contact them in class.\nInvestigate the students’ ID card usage to determine which room the student last used their ID card to enter and when they last used their ID card to purchase food on campus.\nShould the above measures be unsuccessful in locating the student, the university shall deem the student as “missing” and within 24 hours notify appropriate law enforcement agencies and the student’s Confidential Contact.\n\nWhen Public Safety makes a determination that a student who is the subject of a missing person report has been missing for more than 24 hours and has not returned to the campus, the Department of Public Safety will initiate the emergency contact procedures in accordance with the student’s Confidential Contact designation and will also notify local law enforcement that has jurisdiction in the area the student went missing. This will be done within 24 hours, regardless of whether or not the student had a Confidential Contact, is above the age of 18 or is an emancipated minor.\nAdditionally, Public Safety may release a photo of the missing student as a tool to assist in locating the individual and may seek information and/or assistance from a variety of campus resources during the course of the investigation.\nPolicy updated July 2016.\n\n\n\n\n\n\n                                                State Law Violation Complaint Procedure\n\n                                                \n\nAn individual may contact the Bureau for Private Postsecondary Education for review of a complaint.\nCalifornia Bureau of Private Postsecondary Education\n2535 Capitol Oaks Drive, Suite 400Sacramento, CA 95833\nPhone: (916) 431‐6924Fax: (916) 263-­1897\nbppe@dca.ca.gov\n\n\n\n\n\n\n                                                Title IX - Prohibiting Sexual Harassment and Sexual Violence\n\n                                                \n\nIn accordance with Title IX of the Education Amendments of 1972, Chapman University prohibits gender and sex-based discrimination in academic, educational, co-curricular, and athletic programs and activities. Title IX protects all people regardless of their gender or gender identity from sexual harassment and sexual violence, which are forms of sex discrimination.\nThe policies regarding Title IX related matters are part of the University’s Harassment and Discrimination policy and the Student Conduct Code which are accessible through the University website.  The University also has a webpage that is inclusive of Title IX related policies, reporting processes, resources, and programs.\nChapman’s Annual Security report can be found on the Public Safety website under \"Statistics\".\nThe University has designated a Title IX Coordinator to oversee the implementation of Title IX, including the administrative responsibility of reviewing Title IX complaints. Inquiries concerning the application of Title IX to university programs and activities may be referred to: Colleen Wood, Assistant Vice President and Associate Dean of Students, Title IX Coordinator.\n\n\n\n\n\n\n\n\n\nAdditional Resources\n\n\nToggle Section\n\n\n\n\n\n                                                General Consumer Information Contacts\n\n                                                \n\nIn addition to the sections of this webpage, individual sections may direct students, employees and others to specific Chapman University webpages. Paper copies of all disclosures and additional information can be coordinated by requesting them from the specific Departments or by requesting them from either the Director of Undergraduate Financial Aid or the Director of Graduate Financial Aid.\n\n\n\n\n\n\n                                                Notice of Required Disclosures\n\n                                                \n\nThe Higher Education Act of 1965 (HEA)—along with amendments by the Higher Education Opportunity Act of 2008 (HEOA)—includes many disclosure and reporting requirements intended to assist current and prospective students and their families in accessing information about higher education institutions.\nOfficial disclosure and reporting requirements can be found in:\n\nU.S. Code: Title 20, Education, Chapter 28 – Higher Education Resources and Student Assistance\nU.S. Code: Title 20, Education, Chapter 31 – General Provisions Concerning Education\nHigher Education Opportunity Act of 2008 (Public Law 110-315)\nU.S. Code of Federal Regulations, Chapter 34, Part 668.41 - Student Assistance General Provisions\n\nThese disclosures will be regularly updated on this webpage and available to obtain via paper copy. Federal regulations also mandate that a notice be provided to enrolled students on an annual basis as well as to all prospective students.\n \n\n\n\n\n\nUpdated: November 15, 2022\n\n\n\n\n\n\n\n\nConsumer Information Disclosures\n\n\n\n\n\n\n\n\n\n\n\n\n Contact Us   Maps & Directions    Emergency \n\n\n\nOrange Campus\nOne University Drive  Orange, CA 92866   (714) 997-6815\n\nRinker Health Science Campus\n9401 Jeronimo Road  Irvine, CA 92618 \n\n\n\nGet Started\n\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment\n\n\n\nDiscover\n\nSchools and Colleges\nPrograms at Chapman\nEvents at Chapman\nNewsroom\nDirectory\n\n\n\n\nSupport\n\nReport Concern or Incident\nAccessibility Feedback\nWebsite Feedback\nDisability Services\nConsumer Disclosures\nPrivacy Policy\nTitle IX\n\n\n\n Chapman Logo                                               \n© 2022 Chapman University           \n\n\n Back to top    \n\n\n\n\n\n/_featured/Default.xml\nDefault\nDefault\nDo Not Show\nDo Not Show\n\n\n\n",
    "links": [
        "#main",
        "../index.aspx",
        "index.aspx",
        "../about/index.aspx",
        "../about/maps-directions/index.aspx",
        "../about/visit/index.aspx",
        "../about/facts-and-rankings/index.aspx",
        "../about/our-family/leadership/index.aspx",
        "../diversity/index.aspx",
        "../campus-services/index.aspx",
        "../about/connect/index.aspx",
        "../academics/index.aspx",
        "../academics/degrees-and-programs.aspx",
        "../academics/schools-colleges.aspx",
        "../academics/academic-calendar.aspx",
        "../our-faculty/index.aspx",
        "../academics/libraries/index.aspx",
        "https://catalog.chapman.edu",
        "../international-studies/index.aspx",
        "../admission/undergraduate/index.aspx",
        "../admission/undergraduate/how-to-apply/index.aspx",
        "../admission/graduate/index.aspx",
        "../admission/graduate/apply/how-to-apply.aspx",
        "../admission/undergraduate/financing/index.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://go.chapman.edu/portal/visit",
        "../alumni/index.aspx",
        "../arts/index.aspx",
        "../arts/index.aspx",
        "https://blogs.chapman.edu/huell-howser-archives/",
        "https://events.chapman.edu/?view=list&group_id=21",
        "../arts/escalette-collection.aspx",
        "../wilkinson/art/gallery/index.aspx",
        "https://www.hilbertmuseum.com/#california-art=",
        "https://muscocenter.org/Online/default.asp",
        "../campus-life/index.aspx",
        "../campus-life/index.aspx",
        "http://www.chapmanathletics.com/landing/index",
        "../diversity/index.aspx",
        "https://events.chapman.edu/",
        "../campus-life/fish-interfaith-center/index.aspx",
        "../health-and-wellness/index.aspx",
        "../students/services/housing-and-residence/index.aspx",
        "../students/life/index.aspx",
        "../research/index.aspx",
        "../research/sponsored-projects-services/index.aspx",
        "../research/integrity/index.aspx",
        "../research/institutes-and-centers/index.aspx",
        "../research/center-for-undergraduate-excellence/index.aspx",
        "../research/industry-alliances-commercialization/index.aspx",
        "../support-chapman/index.aspx",
        "../support-chapman/get-involved/index.aspx",
        "../support-chapman/contact-us.aspx",
        "../alumni/index.aspx",
        "../campus-services/community-relations/index.aspx",
        "/https://working.chapman.edu/",
        "../industry-partners/index.aspx",
        "../families/index.aspx",
        "../students/index.aspx",
        "../about/visit/index.aspx",
        "../admission/index.aspx",
        "https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "../index.aspx",
        "../index.aspx",
        "../about/visit/index.aspx",
        "../admission/index.aspx",
        "https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "../alumni/index.aspx",
        "../campus-services/community-relations/index.aspx",
        "https://working.chapman.edu/",
        "../industry-partners/index.aspx",
        "../families/index.aspx",
        "../students/index.aspx",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "../campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu/",
        "https://working.chapman.edu/",
        "../about/index.aspx",
        "../about/maps-directions/index.aspx",
        "../about/visit/index.aspx",
        "../about/facts-and-rankings/index.aspx",
        "../about/our-family/leadership/index.aspx",
        "../diversity/index.aspx",
        "../campus-services/index.aspx",
        "../about/connect/index.aspx",
        "../academics/index.aspx",
        "../academics/degrees-and-programs.aspx",
        "../academics/schools-colleges.aspx",
        "../academics/academic-calendar.aspx",
        "../our-faculty/index.aspx",
        "../academics/libraries/index.aspx",
        "https://catalog.chapman.edu",
        "../international-studies/index.aspx",
        "../admission/undergraduate/index.aspx",
        "../admission/undergraduate/how-to-apply/index.aspx",
        "../admission/graduate/index.aspx",
        "../admission/graduate/apply/how-to-apply.aspx",
        "../admission/undergraduate/financing/index.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://go.chapman.edu/portal/visit",
        "../alumni/index.aspx",
        "../arts/index.aspx",
        "https://blogs.chapman.edu/huell-howser-archives/",
        "https://events.chapman.edu/?view=list&group_id=21",
        "../arts/escalette-collection.aspx",
        "../wilkinson/art/gallery/index.aspx",
        "https://www.hilbertmuseum.com/#california-art=",
        "https://muscocenter.org/Online/default.asp",
        "../campus-life/index.aspx",
        "http://www.chapmanathletics.com/landing/index",
        "../diversity/index.aspx",
        "https://events.chapman.edu/",
        "../campus-life/fish-interfaith-center/index.aspx",
        "../health-and-wellness/index.aspx",
        "../students/services/housing-and-residence/index.aspx",
        "../students/life/index.aspx",
        "../research/index.aspx",
        "../research/sponsored-projects-services/index.aspx",
        "../research/integrity/index.aspx",
        "../research/institutes-and-centers/index.aspx",
        "../research/center-for-undergraduate-excellence/index.aspx",
        "../research/industry-alliances-commercialization/index.aspx",
        "../support-chapman/index.aspx",
        "../support-chapman/get-involved/index.aspx",
        "../support-chapman/contact-us.aspx",
        "/",
        "_files/2-3-20-cares-act-disclosure-v2-1.pdf",
        "_files/chapman-university-heerf-quarterly-reporting-10272020-qtr-end-09302020.pdf",
        "_files/chapman-university-crrsaa-quarterly-report-q2-2021.pdf",
        "_files/09302021.updated-heerf.pdf",
        "_files/00116400_heerf_q42021_01102022-003.pdf",
        "_files/09302021.updated-heerf.pdf",
        "_files/1-institutional-portion-form-for-the-quarter-ending-12-31-22-revised-from-final-12-31-21.pdf",
        "_files/2-institutional-portion-form-for-the-quarter-ending-1-31-23-revised-from-final-04-10-23.pdf",
        "_files/063021.updated-heerf.pdf",
        "_files/arp-higher-education-emergency-relief-fund-heerf-iii.pdf",
        "../admission/index.aspx",
        "../law/admission/index.aspx",
        "../admission/undergraduate/how-to-apply/index.aspx",
        "../admission/undergraduate/how-to-apply/creative-supplement.aspx",
        "mailto:admit@chapman.edu",
        "_files/eada_chapmanuniv2022.pdf",
        "_files/eada_chapmanuniv2021.pdf",
        "_files/eada-2019.pdf",
        "_files/eada-2018.pdf",
        "_files/EADA_Data2015.pdf",
        "_files/EADA-2017.pdf",
        "http://www.chapmanathletics.com/landing/index",
        "http://nces.ed.gov/collegenavigator/",
        "../our-faculty/index.aspx",
        "http://www.acf.hhs.gov/css/resource/the-personal-responsibility-and-work-opportunity-reconcilliation-act",
        "../academics/course-catalogs/index.aspx",
        "../academics/learning-at-chapman/index.aspx",
        "../about/facts-and-rankings/accreditations.aspx",
        "../campus-services/career-professional-development/index.aspx",
        "../students/health-and-safety/disability-services/index.aspx",
        "../students/tuition-and-aid/SBS/index.aspx",
        "../students/tuition-and-aid/SBS/tuition-withdrawal-policy/index.aspx",
        "../international-studies/center-for-global-education/study-abroad-programs/index.aspx",
        "../students/tuition-and-aid/SBS/tuition-and-services/index.aspx",
        "../about/visit/index.aspx",
        "../admission/undergraduate/visit/campus-visits/index.aspx",
        "../about/maps-directions/index.aspx",
        "../law/admission/index.aspx",
        "../about/our-home/rinker-campus/index.aspx",
        "../students/health-and-safety/disability-services/index.aspx",
        "../law/admission/aba-disclosures.aspx",
        "_files/constitutionday_2022_belloflyer.pdf",
        "https://bipartisanpolicy.org/event/canceled-on-campus/",
        "../students/life/civic-engagement/index.aspx",
        "http://www.archives.gov/education/lessons/constitution-day/",
        "http://www.loc.gov/teachers/classroommaterials/lessons/#topic190",
        "https://www.senate.gov/artandhistory/history/common/generic/September_ConstitutionDay.htm",
        "_files/9-17-2020-copyright-compliance-memo.pdf",
        "../campus-services/information-systems/policies-and-procedures/acceptable-use-policy.aspx",
        "../campus-services/information-systems/security/dmca.aspx",
        "../campus-services/public-safety/_files/Clery-Annual-Security-Report.pdf",
        "../campus-services/public-safety/bulletins.aspx",
        "../students/policies-forms/student-conduct/index.aspx",
        "../students/services/housing-and-residence/forms-and-resources/resources/moving-in.aspx",
        "../students/services/housing-and-residence/forms-and-resources/resources/emergencies.aspx",
        "../students/services/housing-and-residence/forms-and-resources/resources/services.aspx",
        "../students/services/housing-and-residence/index.aspx",
        "mailto:reslife@chapman.edu",
        "../students/life/index.aspx",
        "../campus-life/index.aspx",
        "../students/services/housing-and-residence/index.aspx",
        "../students/life/student-government/index.aspx",
        "../students/life/greek-life/index.aspx",
        "../students/life/civic-engagement/index.aspx",
        "../students/life/leadership-opportunities/index.aspx",
        "../students/life/wellness-and-recreation/index.aspx",
        "../students/dean-of-students/index.aspx",
        "http://www.bkstr.com/chapmanstore/home",
        "http://www.bkstr.com/chapmanstore/home",
        "../students/academic-resources/registrar/student-services/transfer-credit-policies-and-guidelines.aspx",
        "https://nam03.safelinks.protection.outlook.com/?url=http%3A%2F%2Fregistertovote.ca.gov%2F&data=02%7C01%7Cicustu03%40chapman.edu%7Cb6867ade092d4a6ec19408d7404edfad%7C809929af2d2545bf9837089eb9cfbd01%7C1%7C0%7C637048579816131918&sdata=jE%2BDRfhO5TEFu%2FhKfa8Pnm1PDDVXpw5vMTU%2Fser1%2FrA%3D&reserved=0",
        "https://chapman.turbovote.org/",
        "https://www.ocvote.com/",
        "../students/life/civic-engagement/cubooths.aspx",
        "../students/life/civic-engagement/index.aspx",
        "../students/academic-resources/registrar/student-services/interrupted-enrollment.aspx",
        "../students/academic-resources/registrar/student-services/withdrawal.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/info-guide.aspx",
        "../law/student-resources/registering-classes/student-handbook.aspx",
        "../students/tuition-and-aid/SBS/index.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/cost-of-attendance.aspx",
        "../students/tuition-and-aid/financial-aid/graduate/cost-of-attendance.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "../students/tuition-and-aid/SBS/tuition-and-services/index.aspx",
        "https://collegescorecard.ed.gov/school/?111948-Chapman-University",
        "http://nces.ed.gov/collegenavigator/",
        "../students/academic-resources/registrar/student-services/privacy-rights-ferpa/index.aspx",
        "http://www2.ed.gov/policy/gen/guid/fpco/ferpa/index.html",
        "../students/academic-resources/registrar/student-services/privacy-rights-ferpa/ferpa-guidelines.aspx",
        "../international-studies/center-for-global-education/parents/ferpa.aspx",
        "../students/academic-resources/registrar/index.aspx",
        "https://nsldsfap.ed.gov/login",
        "http://www.nasfaa.org/Code_of_Conduct",
        "http://www.nasfaa.org/WorkArea/linkit.aspx?LinkIdentifier=id&ItemID=18975",
        "http://www.nasfaa.org/Statement_of_Ethical_Principles",
        "../students/tuition-and-aid/financial-aid/undergraduate/scholarships-and-grants/institutional-awards.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/scholarships-and-grants/federal-and-state-grants.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/loans/direct-loans/index.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/loans/institutional.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/federal-work-study.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/scholarships-and-grants/outside-scholarships.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/forms/index.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/faqs.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/cost-of-attendance.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/undergraduate/satisfactory-academic-progress.aspx",
        "../students/academic-resources/registrar/student-services/withdrawal.aspx",
        "https://studentloans.gov/myDirectLoan/index.action",
        "../students/tuition-and-aid/financial-aid/undergraduate/loans/direct-loans/fed-loan-exit-counseling.aspx",
        "../students/tuition-and-aid/financial-aid/undergraduate/loans/direct-loans/index.aspx",
        "https://studentloans.gov/myDirectLoan/index.action",
        "https://studentaid.gov/loan-simulator/",
        "_files/072716PrivateEducationLoanApplicantSelfCertificationForm.pdf",
        "https://webfarm.chapman.edu/datamart-reports/graduation-rates.asp",
        "https://webfarm.chapman.edu/datamart-reports/retention-rates.asp",
        "https://webfarm.chapman.edu/datamart-reports/student-headcount.asp",
        "https://webfarm.chapman.edu/datamart-reports/student-headcount.asp?r=e",
        "../campus-services/institutional-research/_files/info guides/infoguide.2021.pdf",
        "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=200920100AB2086",
        "https://www.ctc.ca.gov/docs/default-source/commission/reports/titleii-2019-2020-annualrprt.pdf?sfvrsn=e17d25b1_4",
        "https://www.ctc.ca.gov/educator-prep/title2",
        "https://www.chapman.edu/campus-services/public-safety/clery-act.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/_files/2017-asr-with-memo.pdf",
        "_files/2020.clery-annual-security-report-6.pdf",
        "_files/clery-annual-security-report-2021.pdf",
        "../campus-services/institutional-compliance-and-internal-audit/_files/clery-annual-security-report-2022.pdf",
        "../campus-services/public-safety/_files/Clery-Annual-Security-Report.pdf",
        "https://www.chapman.edu/campus-services/fire-safety/policies/index.aspx",
        "../campus-services/public-safety/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/index.aspx",
        "../faculty-staff/risk-management/online-training-request-form.aspx",
        "../students/health-and-safety/peer/alcohol-and-drugs.aspx",
        "https://www.chapman.edu/students/policies-forms/student-conduct/conduct-code.aspx#Alcoholic%20Beverages#Alcoholic Beverages",
        "../students/policies-forms/student-conduct/biennial-review-2020.pdf",
        "http://www.ecfr.gov/cgi-bin/text-idx?tpl=/ecfrbrowse/Title34/34cfr86_main_02.tpl",
        "../students/health-and-safety/peer/alcohol-and-drugs.aspx",
        "https://www.chapman.edu/students/policies-forms/student-conduct/conduct-code.aspx#Alcoholic%20Beverages#Alcoholic Beverages",
        "../students/policies-forms/student-conduct/biennial-review-2020.pdf",
        "../emergency/index.aspx",
        "../students/health-and-safety/health-services/index.aspx",
        "../campus-services/information-systems/security/index.aspx",
        "https://www.bppe.ca.gov/forms_pubs/complaint.pdf",
        "mailto:bppe@dca.ca.gov",
        "https://www.chapman.edu/students/health-and-safety/title-ix/student-policy-on-sexual-harassment-prohibited-by-title-ix.pdf",
        "https://www.chapman.edu/students/policies-forms/student-conduct/_files/pdfs/student-conduct-code-master.pdf",
        "https://www.chapman.edu/",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "../campus-services/public-safety/clery-act.aspx",
        "/campus-services/public-safety/_files/2015-ASR.pdf",
        "http://www.gpo.gov/fdsys/pkg/USCODE-2008-title20/html/USCODE-2008-title20-chap28.htm",
        "http://www.gpo.gov/fdsys/pkg/USCODE-2008-title20/html/USCODE-2008-title20-chap31.htm",
        "https://www.gpo.gov/fdsys/pkg/PLAW-110publ315/pdf/PLAW-110publ315.pdf",
        "https://www.govinfo.gov/content/pkg/CFR-2011-title34-vol3/pdf/CFR-2011-title34-vol3-sec668-41.pdf#seqnum668.41",
        "index.aspx",
        "../about/connect/index.aspx",
        "../about/maps-directions/index.aspx",
        "../emergency/index.aspx",
        "https://www.google.com/maps/place/Chapman+University/@33.7931305,-117.8543282,17z/data=!3m1!4b1!4m5!3m4!1s0x80dcd9e1d9d6e8ef:0x6ebb27c51b72a8ec!8m2!3d33.7931305!4d-117.8521395?hl=en",
        "tel:+1714-997-6815",
        "https://www.google.com/maps/place/Chapman+University+Rinker+Health+Science+Campus/@33.650635,-117.7203547,17z/data=!4m13!1m7!3m6!1s0x80dce81715a0d84b:0x8fe3dc2fce1c83da!2s9401+Jeronimo+Rd,+Irvine,+CA+92618!3b1!8m2!3d33.650635!4d-117.718166!3m4!1s0x80dcde16796ddc25:0xb4afb4199eff4db8!8m2!3d33.6506535!4d-117.7181062?hl=en",
        "../about/visit/index.aspx",
        "../students/tuition-and-aid/index.aspx",
        "../admission/undergraduate/how-to-apply/index.aspx",
        "../faculty-staff/human-resources/jobs/index.aspx",
        "../academics/schools-colleges.aspx",
        "../academics/degrees-and-programs.aspx",
        "https://events.chapman.edu/",
        "https://news.chapman.edu/",
        "../directory/index.aspx",
        "../reporting/index.aspx",
        "../accessibility/feedback-form.aspx",
        "../website-feedback-form.aspx",
        "../students/health-and-safety/disability-services/index.aspx",
        "index.aspx",
        "../campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "../students/health-and-safety/title-ix/index.aspx",
        "/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu"
    ]
}