{
    "title": "Huell Howser Archives at Chapman University",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nVideo Archives\nVisitor Information\nTerms of Use\nSupport\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVideo Archives\nVisitor Information\nTerms of Use\nSupport\n \n\n\n\n\n\n\n\n\n\n\nHuell Howser ArchivesVideo Archives\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCalifornia’s Gold Exhibit and Huell Howser Archives\nThe joy that the late TV legend Huell Howser shared with generations of Californians infuses a new permanent exhibit, sponsored by the Automobile Club of Southern California, housed in Chapman University’s Leatherby Libraries. The exhibit includes images, text, and artifacts, which outline Howser’s career and legacy in California.\n\n\n\nThe Video Archives\nDid you know? The Huell Howser video archives is an online repository for Huell Howser’s programs. Learn how to find your favorite episodes here and visit the video archives by pressing the button below.\nFor users experiencing video player issues, this is caused by a web browser cache issue. Fixes for this issue includes using a different web browser, resetting browser cache, or using a private/incognito mode. Instructions on how to reset browser cache or use a private browser in the following links:\nResetting browser cache: https://its.uiowa.edu/support/article/719\nPrivate browsing: https://balsamiq.com/support/faqs/privatebrowsing/\n\nPlease note: Chapman University and the Huell Howser Archives DO NOT produce, sell, or distribute physical and digital copies of the Huell Howser Video Archives. To view an episode, please visit the online video archives.\n \nView the Video Archives\n\n\n\nPlan Your Visit\nContact us for information regarding visiting the exhibit or conducting research in the archives. Walk-in visits are self-guided tours and do not need appointments. For a guided tour with our archives staff, please make an appointment during our appointment hours (see below). Please book guided tours at least two weeks in advance. The exhibit space is small; about the size of one classroom. Most visits will take approximately 40-60 minutes. Research visits are by appointment and scheduled on a case-by-case basis.\nHours, walk-in:\nMonday – Friday, 10:00 AM – 5:00 PM\n\nGuided tours, by appointment only:\nMonday – Friday, 1:00 PM – 5:00 PM\nClosed Saturday and Sunday\n\nArchives Phone: (714) 532-7780\nArchives Email: calgold@chapman.edu\nFor visitors to the exhibit and archives:\n\nIn accordance with Chapman University’s COVID-19 guidelines, face masks are no longer required to enter the exhibit, but are recommended. Those who are personally at high-risk, or in contact with high-risk individuals, or who are more comfortable wearing a mask should continue to do so.\nTotal number of visitors inside the exhibit must not exceed 10 people at any given time, due to the small exhibit space.\nFor any group larger than 20 people, they will be divided into smaller groups and will be rotated in and out of the exhibit. The group(s) waiting for their turn may visit the other public areas of the library or campus until it is their tour time.\n\nPlease visit CU Safely Back to stay up-to-date with Chapman University’s most current COVID-19 guidelines.\n\n\n\n\n\n\n\nExhibit and Archives Parking\nFor important information on parking, including city street restrictions, please visit Chapman University’s Visitor Parking. The following are campus parking locations with varying availability throughout the day:\n\nAnderson Parking Structure – 300 E. Walnut Avenue — Limited Availability All Day\nBarrera Parking Structure – 200 W. Sycamore Avenue — Limited Availability All Day\nCypress Lot – 400 N. Cypress — Available All Day\nMarion Knott Studios Lot – 283 N. Cypress Street — Available All Day\n\nThe Event Parking Map indicates parking locations in reference to the main campus grounds. The California’s Gold Exhibit and Huell Howser Archives are located in the Leatherby Libraries, south of the Anderson Parking Structure (marked “AN”).\nFor further information, please call Parking Services at (714) 997-6560, (714) 997-6543, or email parking@chapman.edu. If it is after hours or the weekend, please contact Public Safety Dispatch for assistance at (714) 997-6763.\n\n\n\nSupporting California’s Gold\nHuell Howser brought warmth and generosity into this world through his life and work, creating a legacy that will continue to delight and educate generations. To support the legacy of Huell Howser’s life and work, donations can be made to one of these two funds: California’s Gold Scholarship Endowment and California’s Gold Collection Endowment\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University © 2022\n \n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#back-to-top",
        "https://blogs.chapman.edu/huell-howser-archives/",
        "https://blogs.chapman.edu/huell-howser-archives/archives/",
        "https://blogs.chapman.edu/huell-howser-archives/visit/",
        "https://blogs.chapman.edu/huell-howser-archives/terms-of-use/",
        "https://secure.touchnet.com/C27377_ustores/web/classic/product_detail.jsp?PRODUCTID=102&SINGLESTORE=true",
        "#",
        "https://blogs.chapman.edu/huell-howser-archives/archives/",
        "https://blogs.chapman.edu/huell-howser-archives/visit/",
        "https://blogs.chapman.edu/huell-howser-archives/terms-of-use/",
        "https://secure.touchnet.com/C27377_ustores/web/classic/product_detail.jsp?PRODUCTID=102&SINGLESTORE=true",
        "/huell-howser-archives/archives/",
        "https://blogs-staging.chapman.edu/huell-howser-archives/2013/06/25/how-to-use-the-huell-howser-archive/",
        "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fits.uiowa.edu%2Fsupport%2Farticle%2F719&data=04%7C01%7Cencarnac%40chapman.edu%7C8114eaa0a98645677fb808da215989e2%7C809929af2d2545bf9837089eb9cfbd01%7C1%7C0%7C637858965705433259%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000&sdata=HDh5VW0KIq16x3vH%2BJ12mvLvFvpWFrUw6OR8V1z%2FRh4%3D&reserved=0",
        "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fbalsamiq.com%2Fsupport%2Ffaqs%2Fprivatebrowsing%2F&data=04%7C01%7Cencarnac%40chapman.edu%7C8114eaa0a98645677fb808da215989e2%7C809929af2d2545bf9837089eb9cfbd01%7C1%7C0%7C637858965705433259%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000&sdata=jYc2buxdQmZyxeAnA%2BDC1mYjB1%2Fr%2BDoZwOVprCOxP18%3D&reserved=0",
        "/huell-howser-archives/archives/",
        "mailto:calgold@chapman.edu",
        "https://cusafelyback.chapman.edu/#visitor",
        "https://www.chapman.edu/campus-services/parking-services/visitor-parking.aspx",
        "https://www.chapman.edu/about/_files/maps-and-directions/current-maps/all-parking-map.pdf",
        "mailto:parking@chapman.edu",
        "https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=78&SINGLESTORE=true",
        "https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=102&SINGLESTORE=true"
    ]
}