{
    "title": "A better, faster tool for saving water on farms | Stanford News",
    "body": "\n\n\n\n \n \n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\nSearch form\n\n\n\nSearch term\n\n\n\n\n\n\nHome\nFind Stories\nFor Journalists\nContact\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 27, 2023 When to water? Researchers develop new tool for optimizing irrigation A new tool for designing and managing irrigation for farms advances the implementation of smart agriculture, an approach that leverages data and modern technologies to boost crop yields while conserving natural resources. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Adam Hadhazy\n\nStanford researchers have designed an irrigation optimization tool that could help farmers slash water use.\n\nWhile traditional drip irrigation waters based on general standards and assumptions, smart systems for drip irrigation water crops when and where they need it most. (Image credit: Getty Images)\n\nThe tool rapidly estimates water loss from soils due to “evapotranspiration,” a process that involves the evaporation of water into the atmosphere and the uptake of water by plants. Compared to state-of-the-art ways of getting such evapotranspiration estimates, the new Stanford modeling tool works 100 times faster while maintaining high levels of accuracy.\nIn practice, the tool could dramatically reduce the time needed to devise strategic, efficient irrigation schedules that best position watering and sensing equipment across entire farms. On a narrower, field-by-field basis, the tool could even crunch data fast enough to adjust irrigation on the fly, in near real time, as weather conditions change.\n“Evapotranspiration is a critical piece of information for designing efficient irrigation systems,” said Weiyu Li, a PhD candidate in energy science and engineering and lead author of a study describing the findings in Water Resources Research. Li is a Siebel Scholar in the class of 2023 and is currently the first and only recipient at Stanford Doerr School of Sustainability.\nOverall, the research is a step forward for smart agriculture, which leverages the power of modern technologies and approaches such as big data and the Internet of Things to boost crop yields while conserving natural resources.\n“With this study, we’re helping to deliver on the promise of smart agriculture to continue sustainably feeding billions of people worldwide and preserving our planet for future generations,” said senior study author Daniel Tartakovsky, a professor of energy science and engineering who is also Li’s advisor.\nSimple vertical, complex horizontal\nConventional accounting for evapotranspiration has relied on what researchers call the vertical-flow assumption. In this modeling approach, the water applied during irrigation is treated as only moving straight down into the soil. The fact that the water can (and does) flow in horizontal directions is ignored. Given that smart agriculture requires processing significant amounts of data, the vertical-flow assumption has been used as a sort of computational shortcut. The approach is sufficient for some irrigation modeling needs but the results it gives can be vastly improved upon, Li said.\n\n\nWith this study, we’re helping to deliver on the promise of smart agriculture to sustainably continue feeding billions of people worldwide and preserving our planet for future generations.\n—Daniel Tartakovsky\nProfessor of Energy Science and Engineering\n\n\nFor truly smart agriculture, particularly via “drip irrigation,” the vertical-flow assumption is inadequate, Li explained. As its name implies, drip irrigation involves administering water both slowly and precisely to plants’ root zones where the water can be absorbed with minimal evaporative loss. Drip irrigation is primarily deployed in arid regions – across much of California for instance – where conventional irrigation techniques that inundate fields lead to egregious water consumption.\nSmart agriculture systems also optimize timing. They water a plant only when it’s needed, depending on factors such as weather and the plant’s stage of growth. “Historically, irrigation has largely been divorced from the plant’s needs at a given moment,” Tartakovsky said. “Drip irrigation, informed by smart agriculture practices, bucks that trend.”\nPart of the challenge of smart ag, then, is knowing where to best position moisture sensors and drippers. While existing designs are reliant on approximations and assumptions, this tool aims to provide that guidance based on real-world and nearly real-time conditions.\nBetter algorithms\nTo develop the tool, Li and Tartakovsky turned to algorithms to improve data crunching and yield quality results. For the new study, the researchers brought together two algorithms known as an enhanced Kalman filter and maximum likelihood estimation. The algorithms start with predictions based on available measured data, then reduce uncertainties based on subsequent measurements.\n“We plug real data measurements of soil moisture and root water uptake into our model, which improves our understanding of the overall physical system and the algorithm’s performance,” Li said. “Our study is the first to combine this kind of algorithmic approach and apply it to drip irrigation.”\nTo test the accuracy and efficiency of their approach, the Stanford researchers simulated a plot of land measuring approximately 5 by 33 feet in width – roughly the equivalent of a short row of planted crops.\nUsing the new modeling tool, calculating a precise estimate of the evapotranspiration rate for the test plot of land only took about 10 minutes. If an enhanced Kalman filter alone was used, as other recent studies have demonstrated, the computational time would have run on the order of 100 times longer, or about 1,000 minutes. That chunk of time equates to nearly 17 hours, and thus is not actionable for timely smart agriculture. “In comparison, an irrigation optimization system based on our modeling tool could be responsive in near-real time to changing conditions,” Li said.\nWhen considering the goal of optimizing the upfront design of drip irrigation systems for an entire farm, which can encompass thousands of acres, the computational time required becomes downright prohibitive. “You can start to see why irrigation system designers have relied on the simplified vertical-flow method when faced with major installation projects,” Li said.\nLooking ahead, the Stanford researchers plan to see how well their modeling tool works in real-world settings when deployed on a working farm. “We next want to perform a ‘field’ test, literally,” Tartakovsky said. “We look forward to honing our approach further with all the variables presented by real sensors, real drippers, real crops, and real weather.”\n\nTartakovsky is also a member of Stanford Bio-X and the Wu Tsai Human Performance Alliance.\nLi is also a Siebel Scholar in energy science, class of 2023.\nThis work was funded by the Air Force Office of Scientific Research and the National Science Foundation.\nTo read all stories about Stanford science, subscribe to the biweekly Stanford Science Digest.\n\n\n\n\n\n\n\n\n\n\n\n\nMedia Contacts\nDaniel Tartakovsky, Stanford Doerr School of Sustainability: tartakovsky@stanford.edu\nWeiyu Li, Stanford Doerr School of Sustainability: weiyuli@stanford.edu\nDanielle Torrent Tucker, Stanford Doerr School of Sustainability: (650) 497-9541; dttucker@stanford.edu\n\n\n\nResearch\nScience & Technology\nSustainability\nWater\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nScience & Technology\nBanking on nature\nThe Natural Capital Project is working with development banks and 10 pilot countries to put the environment at the forefront of policy and investment decisions.\n \n\n\n\n\n\n \nLaw & Policy\nBeyond the room where it happened\nYou may have given little thought to the role Native Americans played in the creation of the U.S. Constitution. But SLS scholars argue that Native people profoundly shaped the conversation.\n \n\n\n\n\n\n \nMedicine\nWhy won’t people take their statins?\nStanford Medicine researchers used AI to analyze online discussions related to the life-saving cholesterol drug and found a troubling amount of negativity and misinformation.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Report\nTo receive Stanford news daily,\nsubscribe to Stanford Report.\n\n\nFor Journalists\n\nPress Releases\nMedia Contacts\nStanford Experts\n\n\n\nSee Also\n\nContact Stanford News\nFaculty / Staff Resources \n\n\n\n\nEvents\n\nEvents calendar\n\n\n\nStanford News is a publication of Stanford University Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/find-stories/",
        "https://news.stanford.edu/for-journalists/",
        "https://news.stanford.edu/contact/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D47314",
        "https://news.stanford.edu/wp-content/uploads/2023/04/GettyImages-1319625630.jpg",
        "https://tartakovsky.stanford.edu/people/weiyu-li",
        "https://ese.stanford.edu/",
        "https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2023WR034535",
        "https://www.siebelscholars.com/scholar-profile/3687/",
        "https://profiles.stanford.edu/daniel-tartakovsky",
        "https://biox.stanford.edu/",
        "https://humanperformance.stanford.edu/",
        "https://www.siebelscholars.com/",
        "https://stanford.us5.list-manage.com/subscribe?u=a8e6569da943904e9ac369cde&id=ed7e4827fe",
        "mailto:tartakovsky@stanford.edu",
        "mailto:weiyuli@stanford.edu",
        "mailto:dttucker@stanford.edu",
        "https://news.stanford.edu/section/research/",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/topic/sustainability/",
        "https://news.stanford.edu/topic/water/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D47314",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://news.stanford.edu/section/science-technology/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://news.stanford.edu/section/law-policy/",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://scopeblog.stanford.edu/2023/04/25/ai-helps-gauge-patients-attitude-toward-cholesterol-drugs/",
        "https://news.stanford.edu/section/medicine/",
        "https://scopeblog.stanford.edu/2023/04/25/ai-helps-gauge-patients-attitude-toward-cholesterol-drugs/",
        "/report/subscribe/",
        "/press-releases/",
        "/contact/media-contacts/",
        "/experts/",
        "/contact/",
        "http://ucomm.stanford.edu/facstaff/",
        "http://events.stanford.edu/",
        "https://ucomm.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}