{
    "title": "\n\t\tPost-Baccalaureate Certificate in Communication Sciences and Disorders | Crean College of Health and Behavioral Sciences | Chapman University\n\n\n\t",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\t\t\t\tSome of the content on this website requires JavaScript to be enabled in your web browser to function as\n\t\t\t\tintended. This includes, but is not limited to: navigation, video, image galleries, etc. While the\n\t\t\t\twebsite is\n\t\t\t\tstill usable without JavaScript, it should be enabled to enjoy the full interactive experience.\n\t\t\t\n\n\n\n\n    Skip to main content \n\n\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n                Chapman University Logo\n              \n\n\nClose Off-Canvas Menu\n\n\n\n\n\n\n\n\nChapman Menu\n\n\n\n\nAbout\n\n\nBack\n\nAbout Overview\n\n\nMaps & Directions\n\n\nVisit Chapman\n\n\nFacts and Ranking\n\n\nLeadership\n\n\nDiversity and\n                        Inclusion\n\n\nCampus Services\n\n\nConnect\n\n\n\n\nAcademics\n\n\nBack\n\nAcademics Overview\n\n\nDegrees & Programs\n\n\nSchools & Colleges\n\n\nAcademic Calendar\n\n\nFaculty Directory\n\n\nLibraries\n\n\nCourse Catalogs\n\n\nInternational Studies\n\n\n\n\nAdmission\n\n\nBack\n\nAdmission Overview\n\n\nUndergraduate Admission\n\n\nUndergraduate Application\n\n\nGraduate Admission\n\n\nGraduate Application\n\n\nAffordability\n\n\nFinancial Aid\n                        Calculator\n\n\nTours and Visits\n\n\n\n\nAlumni\n\n\nBack\nAlumni\n\nAlumni Overview\n\n\nGet Involved\n\n\nCareer Support\n\n\n\n\nArts\n\n\nBack\nArts\n\nArts at Chapman Overview\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser\n                        Archives\n\n\nCollege of Performing Arts Events\n\n\nEscalette Permanent Collection of Art\n\n\nGuggenheim Gallery\n\n\nHilbert Museum of California Art\n\n\nMusco Center for the Arts\n\n\n\n\nCampus Life\n\n\nBack\nCampus Life\n\nCampus Life Overview\n\n\nAthletics\n\n\nDiversity and Inclusion\n\n\nEvents\n\n\nFish Interfaith Center\n\n\nHealth and Wellness\n\n\nResidence Life\n\n\nStudent Life\n\n\n\n\nResearch\n\n\nBack\n\nResearch Overview\n\n\nSponsored Projects Services\n\n\nResearch Integrity\n\n\nInstitutes and Centers\n\n\nCenter for Undergraduate\n                        Excellence\n\n\nIndustry Alliances and\n                        Commercialization\n\n\n\n\nSupport \n\n\nBack\n\nSupport Chapman Overview\n\n\nGet Involved\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n                          Alumni\n                        \n\n\n\n                          Community\n                        \n\n\n\n                          Faculty & Staff\n                        \n\n\n\n                          Industry Partners\n                        \n\n\n\n                          Parents & Family\n                        \n\n\n\n                          Students\n                        \n\n\n\n\n\n\n\n\n\n                          Visit\n                        \n\n\n\n                          Apply\n                        \n\n\n\n                          Give\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Visit\n              \n\n\n\n                Apply\n              \n\n\n\n                Give\n              \n\n\n\n\n\n\n\n\nInfo For\n              \n\n\n\n\n\n\n\n\nAlumni \n\n\n\n\nCommunity\n\n\n\n\n\nFaculty & Staff\n\n\n\n\nIndustry Partners\n\n\n\n\nParents & Family\n\n\n\n\nStudents\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nÃ\u0097\n\n\n\n\n\n\n\nsearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Custom Search \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncanva icon\nCanvas\n\n\n\n\n\n\n\n\n\n\nHandshake (career portal)\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Self-Service (my.chapman)\n\n\n\n\n\nWorking@Chapman (faculty and staff)\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\n\n\n\n\n\n\n\n\nAbout Overview\n\n\n\n\nMaps & Directions\n\n\n\n\nVisit Chapman\n\n\n\n\nFacts and Ranking\n\n\n\n\nLeadership\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nCampus Services\n\n\n\n\nConnect\n\n\n\n\n\n\n\n\n\nAcademics\n\n\n\n\n\n\n\n\n\nAcademics Overview\n\n\n\n\nDegrees & Programs\n\n\n\n\nSchools & Colleges\n\n\n\n\nAcademic Calendar\n\n\n\n\nFaculty Directory\n\n\n\n\nLibraries\n\n\n\n\nCourse Catalogs\n\n\n\n\nInternational Studies\n\n\n\n\n\n\n\n\n\nAdmission\n\n\n\n\n\n\n\n\n\nAdmission Overview\n\n\n\n\nUndergraduate Admission\n\n\n\n\nUndergraduate Application\n\n\n\n\nGraduate Admission\n\n\n\n\nGraduate Application\n\n\n\n\nAffordability\n\n\n\n\nFinancial Aid Calculator\n\n\n\n\nTours and Visits\n\n\n\n\n\n\n\n\n\nAlumni\n\n\n\n\n\n\n\n\n\nAlumni Overview\n\n\n\n\nGet Involved\n\n\n\n\nCareer Support\n\n\n\n\n\n\n\n\n\nArts\n\n\n\n\n\n\n\n\n\nArts at Chapman Overview\n\n\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser Archives\n\n\n\n\nCollege of Performing Arts Events\n\n\n\n\nEscalette Permanent Collection of Art\n\n\n\n\nGuggenheim Gallery\n\n\n\n\nHilbert Museum of California Art\n\n\n\n\nMusco Center for the Arts\n\n\n\n\n\n\n\n\n\nCampus Life\n\n\n\n\n\n\n\n\n\nCampus Life Overview\n\n\n\n\nAthletics\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nEvents\n\n\n\n\nFish Interfaith Center\n\n\n\n\nHealth and Wellness\n\n\n\n\nResidence Life\n\n\n\n\nStudent Life\n\n\n\n\n\n\n\n\n\nResearch\n\n\n\n\n\n\n\n\n\nResearch Overview\n\n\n\n\nSponsored Projects Services\n\n\n\n\nResearch Integrity\n\n\n\n\nInstitutes and Centers\n\n\n\n\nCenter for Undergraduate Excellence\n\n\n\n\nIndustry Alliances and Commercialization\n\n\n\n\n\n\n\n\n\nSupport \n\n\n\n\n\n\n\n\n\nSupport Chapman Overview\n\n\n\n\nGet Involved\n\n\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrean College of Health and Behavioral Sciences\n\n\n\nAcademic Programs\n\n\nAdvising\n\n\nFaculty and Student Research\n\n\nFaculty Directory\n\n\nCrean College Leadership Council\n\n\nCenters of Excellence\n\n\nContact Us\n\n\nSupport Crean\n\n\nResearch Centers\n\n\nOffice of the Dean\n\n\nCareer Services\n\n\nCrean College Parent Advisory Council (PAC)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nÂ»\n    Communication Sciences and Disorders Post-Baccalaureate Certificate Program\n\n\n\nThe Post-Baccalaureate Certificate Program in Communication Sciences and Disorders (CSD), an Extended Education program, is offered through Chapman University's Crean College of Health and Behavioral Sciences. This is an accelerated 10-month program, designed for students who have completed an undergraduate degree and need to complete the pre-requisites (leveling courses) necessary to apply for a masters degree program in CSD at Chapman University or another institution. This Post-Baccalaureate CSD program is essential for students who do not have a bachelor’s degree in Speech Language Pathology, Communication Disorders, or similar.Application for the Post-Bacc CSD Fall 2023 Cohort opens January 4th, 2023. The application deadline is June 30th, 2023, 11:59 PST. Applications submitted after this date will be reviewed on a case-by-case basis. Application for the Post-Bacc CSD Spring 2024 cohort opens July 14th, 2023. The application deadline is December 1st, 2023, 11:59pm PST. Applications submitted after this date will be reviewed on a case-by-case basis. Please do not let the deadline keep you from submitting your application as it is always possible for spots to become available.\n\n\n\n\n\n\nToggle Section\n\n\n\n\n\n                                                Program at a Glance\n\n                                            \n\n\nA cohort model with entry in the spring and fall (January, August start)\n30-unit program; 10 courses completed in 10 months\nFriday evening and Saturday classes\nGround classes held at Chapman University in Orange, CA\nStudents receive a Post-Baccalaureate CSD Certificate upon successful completion\n\n\n\n\n\n\n\n                                                Post-Bacc CSD Schedule\n\n                                            \n\nFall 2022 Cohort (In Progress)Term 1: August 26, 2022 - October 15, 2022 Term 2: October 28, 2022 - December 17, 2022 Term 3: January 27, 2023 - March 18, 2023 Term 4: March 31, 2023 - May 20, 2023 Term 5: June 2, 2023 - July 22, 2023There are no Post-Bacc CSD classes held during the University's Interterm session. Term 3 begins January 27, 2023.\nSpring 2022 Cohort (In Progress)Term 1: January 28, 2022 - March 19, 2022Term 2: April 1, 2022 - May 21, 2022 Term 3: June 3, 2022 - July 23, 2022 Term 4: August 26, 2022 - October 15, 2022Term 5: October 28, 2022 - December 17, 2022There are no Post-Bacc CSD classes held during the University's Summer II session. Term 4 begins August 26, 2022.\nFall 2021 Cohort (In Progress)Term 1: August 27, 2021 - October 16, 2021 Term 2: October 29, 2021 - December 18, 2021 Term 3: January 28, 2022 - March 19, 2022 Term 4: April 1, 2022 - May 21, 2022 Term 5: June 3, 2022 - July 23, 2022There are no Post-Bacc CSD classes held during the University's Interterm session. Term 3 begins January 28, 2022.Spring 2021 Cohort (In Progress)Term 1: January 29, 2021 - March 20, 2021 Term 2: April 2, 2021 - May 22, 2021 Term 3: June 4, 2021 - July 24, 2021 Term 4: August 27, 2021 - October 16, 2021Term 5: October 29, 2021 - December 18, 2021There are no Post-Bacc CSD classes held during the University's Summer II session. Term 4 begins August 27, 2021.\n\n\n\n\n\n\n                                                Overview of Courses\n\n                                            \n\nOverview of the Post-Baccalaureate Communication Sciences & Disorders courses. Two courses will be taught each term.\nTerm 1 CSDX 9001 - Overview of Communication Disorders CSDX 9002 - Phonetics  Term 2 CSDX 9003 - Introduction to Speech Sound Disorders and Phonology CSDX 9004 - Anatomy and Physiology of Speech, Swallowing, Hearing  Term 3 CSDX 9005 - Introduction to Child Language Acquisition and Development CSDX 9006 - Clinical Methods and Procedures  Term 4 CSDX 9007 - Speech Science CSDX 9008 - Neurology and Neurogenic Disorders  Term 5 CSDX 9019 - Audiology, Audiometry, and (Re)habilitation CSDX 9020 - Voice and Fluency  *Credits are professional development only, specific to Post-Baccalaureate Certificate Program and do not carry academic degree credit. A transcript of program courses and credits are obtainable.\n\n\n\n\n\n\n                                                Course Descriptions\n\n                                            \n\nCSDX 9001 Overview of Communication Disorders (3 units) This course provides students with an overview of speech, language, swallowing, and hearing disorders. In this required introductory course, students will gain a foundational knowledge of communication and swallowing disorders. The profession of speech-language pathology and audiology will also be covered.\nCSDX 9002 Phonetics (3 units) This introductory course will provide a basic foundation for the phonetic structure of the English language and its dialects and derivations. The class will provide a practical knowledge for the clinical application of transcription of the international phonetic alphabet.\nCSDX 9003 Introduction to Speech Sound Disorders and Phonology (3 units) This course is an introduction to phonology and its typical development and theories. Instruction will cover the etiology of speech sound disorders including cultural/linguistic diversity factors, speech analysis and the differences between phonemic vs. phonetic disorders.\nCSDX 9004 Anatomy and Physiology of Speech, Swallowing, Hearing (3 units) This is a foundational course that provides an introduction to the anatomical structures and neurology of the human communication and swallowing system and the physiology of related movement.\nCSDX 9005 Introduction to Child Language Acquisition and Development (3 units) This introduction to language acquisition includes the components of language, (the physical, social and cognitive bases); theories of how language develops and its evolution from infancy through childhood. Specific language impairment and language disorders in pre-schoolers through school-age children will be discussed briefly.\nCSDX 9006 Clinical Methods and Procedures (3 units) An introduction to the processes, settings, and issues involved in clinical practice in speech, hearing, and language disorders.\nCSDX 9007 Speech Science (3 units) This introductory course provides the student with foundational knowledge for the structure and function of neuro-muscular systems used in respiration, phonation, resonation, articulation and the fundamentals of sound production and transmission applied to speech. We will explore the articulatory and acoustic correlates of phonological features. Also, some of the systematic variation in speech sounds that form the basis for phonological structure will be described. An in-depth investigation into the sound system of a language using computer technology will take place.\nCSDX 9008 Neurology and Neurogenic Disorders (3 units) This is an introductory course that provides the foundational information on neurogenic communication and swallowing disorders. An overview of neuroanatomy, neurological disorders and their causation will be presented.\nCSDX 9019 Audiology, Audiometry, and Aural (Re)habilitation (3 units) This introductory course will lay the foundation for the study of audiology, audiometrics, and aural rehabilitation. Study of physics of sound, anatomy and physiology of the ear, and measurement of perception of sound and a survey of causes of hearing impairment and habilitation procedures will be covered. Theory and methods of habilitation of hearing-impaired adults and children, including screening and assessment of hearing, (re)habilitation management, speech-reading, and amplification with individual hearing aids and auditory training.\nCSDX 9020 Voice and Fluency (3 units) This introductory course will provide foundational information for voice and fluency disorders. The disorders’ etiology, characteristics, clinical assessment and intervention will be discussed.\n\n\n\n\n\n\n                                                Admission\n\n                                            \n\nApplication Process\nSubmit an online application. The application portal will instruct on how supporting documents can be submitted.\nAdmission Requirements\n\nUndergraduate degree from an accredited college or university, with a major in field other than Speech Language Pathology (SLP), Communication Disorders, or related field.\nMinimum 3.0 GPA as recorded on your final bachelor’s degree transcript. 3.0 GPA must be met at the time of application submission.* Transcripts with a GPA below 3.0 will NOT be reviewed.\n\nThose with a GPA less than 3.0 will NOT be considered. \n\n\nResume\nObservation of a SLP in a therapeutic setting (school, clinic, and/or medical setting).** Submit SLP name, location, and brief summary of your experience. Observation must be done within the last six months.\n\nDue to COVID-19, a virtual observation of a SLP will be accepted at this time. Applicants may also observe a SLP through YouTube. Please write about what you observed and how this observation helped you make an informed decision to apply into this program.\nObservation must be with a SLP. Observation of a SLP-A will not be accepted.\n\n\nAn essay to express your reasons to enroll in our Post-Baccalaureate CSD Program. Essay to include your personal and career goals and how will Chapman University’s Post-Bacc CSD program will help reach those goals. Double-spaced, 12 font, and 2-4 pages in length.\nTwo letters of recommendation, from an academic and professional source.\nPlease submit your official final transcript with your undergraduate degree posted. Transcripts can be sent electronically to admtranscript@chapman.edu or mailed to:\n\nChapman UniversityOffice of Graduate AdmissionsOne University DriveOrange, CA 92866\n\n\nIn-person interview by invitation only\n\nDue to COVID, virtual interviews will be held until further notice\n\n\n\nEnrollment Deposit\nUpon admittance, a $500 non-refundable enrollment deposit is required to hold your position in the Post-Baccalaureate CSD Certificate program. This amount will be applied toward tuition.\n*GPA eligibility for this program is based on your final GPA posted on your bachelor’s degree. Post-bachelor’s degree work will not be considered and cannot be calculated into your minimum required GPA for this Post-Bacc CSD program. Minimum GPA requirement for this program is 3.0. Applicants with an undergrad GPA under 3.0 will not be reviewed. A 3.0 GPA must be met at the time your application submission. Exceptions cannot be made to this policy.\n**SLP observation requirement is for the applicant's benefit; to make an informed decision on their intent to apply to Chapman University’s Post-Baccalaureate CSD Program. No minimum amount of hours are required. SLP signature is not required. These observations are independent of Chapman University.\n\n\n\n\n\n\n                                                Tuition & Fees\n\n                                            \n\nFall 2021/Spring 2022 TuitionPost-Bacc CSD Tuition Rate $400/per credit Post-Bacc CSD Total Tuition $12,000\n*Tuition amount is for the Post-Bac CSD Certificate Program only. Books, parking, and personal items are not included in this amount.\nParking FeePart-time parking fee for the 2021/2022 academic year is $0 (subject to change). For more information, visit the Parking Registration website.\nEnrollment Deposit A $500 non-refundable enrollment deposit is required to hold your position in the Post-Baccalaureate CSD Certificate program. Upon enrollment of classes, this amount will apply toward tuition.\n\n\n\n\n\n\n                                                Financing Your Education\n\n                                            \n\nThe Post-Baccalaureate CSD Program consists of Extended Education classes, therefore students in this program are not eligible for Federal Financial Aid. A FAFSA application is not applicable for students in this program. \nPlease use this direct link for your Sallie Mae Smart Option Loan: \nhttps://www.salliemae.com/sosl/00116499 \nPlease note the following when completing your Sallie Mae Smart Option Loan:\n\nSchool: Chapman University Extended Education (00116499)\nProgram Description: Career Training (Professional training or certificate courses)\nAcademic Loan Period: Start/End dates of program\nAnticipated Graduation/Completion: Last day of program\nGrade Level: Certificate/Continuing Ed\nCourse of Study: Continuing Education\nMajor: Continuing Education\nEnrollment Status: Full-Time\n\nSallie Mae Parent Only loan gives a parent or any creditworthy individual another option for financing college expenses for their student. Please visit the Parent Loan website for more details.\nHOW MUCH DO I BORROW? To determine a loan amount for your Sallie Mae Smart Option Loan, noted below are the maximum allowable amounts for expenditures that may be included in your total loan amount. Please note the maximum allowable amounts maybe be more or less than your own personal needs. These are maximum allowable amounts, so you may choose to borrow a loan amount lower than indicated.Note: Loans approved by other lenders cannot be certified by the University.\n\n2021/2022 Post-Bacc CSD Academic Year\n\n\n\nITEM\nAMOUNT\n\n\n\n\nTuition\n$12,000\n\n\nBooks\n$2,100\n\n\nTransportation\n$2,500\n\n\nPersonal\n$1,900\n\n\nTOTAL (MAX)\n$18,500\n\n\n\n\n\n\n\n\n\n                                                Drop & Withdrawal Policy\n\n                                            \n\nThe tuition refunding deadlines for the Post-Baccalaureate CSD program differ from the University. Each student is responsible for knowing and understanding these deadlines. Refund Policy: 100% refund prior to the start of the first class; 80% refund up through the 10th calendar day of the term. No refund after the 10th calendar day. Drops and withdrawals are based term by term.\nEnrollment DepositEnrollment deposits are non-refundable and are credited toward tuition.\nStudents admitted to the Post-Bac CSD program must receive a \"B-\" grade or better in each course to continue in the program.\n\n\n\n\n\n\n                                                Post-Bacc CSD Lecturers\n\n                                            \n\nMary Ellen Hood, M.S. CCC-SLP hood@chapman.edu Courses: CSDX 9001BiographyMs. Hood has an M.S. in Communicative Disorders from the University of Redlands. She is the former Executive Director, Clinical Services of the Newport Therapy Center from 1993-2010 where she directed and managed four clinics and personnel in various community settings (clinic, hospital, schools). She is a licensed and clinically certified speech language pathologist and holds a California state license. She has been the recipient of the Outstanding Achievement Award from CASHA-District 8 in 2009. Ms. Hood has a wealth of clinical experiences as well as previous teaching experience in Master’s programs in Communication Sciences and Disorders at other local universities. Ms. Hood has been instrumental in the development of the syllabi and background work for this post-bacc program and will be providing some administrative oversight for this certificate program.\nKathleen Wohlgemuth, M.A., CCC-SLP wohlgemu@chapman.edu Course: CSDX 9002BiographyMs. Wohlgemuth has an M.A. in Communicative Disorders from California State University, Fullerton. She is a licensed and clinically certified speech language pathologist and holds a California state license. Her professional experience includes: member of the brain injury rehabilitation team, panel member–cleft palate team for Memorial Hospital Medical Center, Long Beach. She has worked as a program specialist, speech-language pathologist and DHH coordinator for Anaheim Union High School District. Ms. Wohlgemuth is a part-time faculty/lecturer for California State University, Fullerton’s Department of Human Communication Studies.\nBelinda Daughrity, Ph.D., CCC-SLPbewillia@chapman.eduCourses: CSDX 9002, CSDX 9003 BiographyBelinda Daughrity earned her M.A. in Speech Language Pathology and Audiology from New York University and her Ph.D. in Education with a specialization in Human Development and Psychology from University of California Los Angeles. She is certified and research trained in the Autism Diagnostic Observation Schedule – 2 (ADOS-2), the gold standard in autism diagnosis and classification. She works as a bilingual speech-language pathologist at Los Angeles Speech and Language Therapy Center, Inc. where she specializes in comprehensive evaluations and autism spectrum disorders. She directs the Pre-Social Skills program for children with autism with minimally verbal to phrase level speech, as well as the newly developed augmentative communication social skills program for nonverbal children using a variety of high and low tech communication systems. Dr. Daughrity is a member of the American Speech and Language Hearing Association (ASHA) and regularly presents at conferences.\nMarcy B. Fox, SLPD, CCC-SLPmafox@chapman.eduCourses: CSDX 9003, CSDX 9006Marcy B. Fox earned her MA in Communicative Disorders from California State University, Fullerton and earned her SLPD in Speech Language Pathology from Loma Linda University, Summer 2018. Dr. Fox is a Speech Language Pathologist for the Whittier Area Cooperative Special Education Program (WACSEP) providing comprehensive speech and language evaluations for pre-school aged children. She conducts Individualized Education Program (IEP) meetings and has established relationships between general education and special education teachers, deaf and hard of hearing teachers, occupational therapists and program specialists. Prior to WACSEP, Dr. Fox has worked for El Rancho USD and Los Nietos School Districts providing therapy to preschool thru middle-school aged students in general education, Learning Handicapped classes and Severely Handicapped classes, and students with severe language disorders. In April 2014 and November 2015, Dr. Fox received the ASHA Award for Continuing Education (ACE Award). She is a member for the American Speech-Language-Hearing Association (ASHA); affiliate of Special Interest Group 1-Language Learning and Education and an affiliate of Special Interest Group 16- School-Based Issues. She is also a member of the California Speech-Language-Hearing Association (CSHA).\nTherese Cooper, M.A., CCC-SLP  thcooper@chapman.edu Courses: CSDX 9004 Mrs. Therese Cooper has an M.A. in Communication Disorders from Whittier College. She is a licensed and clinically certified speech language pathologist and holds a California state license. Her professional experience includes working in the psychiatric center at College Hospital of Cerritos, transitional living center/head injury program/vocational rehab at Casa Colina in Pomona, various skilled nursing facilities and acute hospitals in Orange County, assisted living facilities, and private practice. Her current primary focus is Dysphagia, cognitive deficits, neurological disorders, Alzheimer’s and dementia in the geriatric population. She also supervises CFY’s and advanced clinic graduate students. Therese Cooper has a wealth of clinical experience as well as previous teaching experience in Neurology and Neurogenic Disorders, and Anatomy and Physiology of Speech, Swallowing and Hearing.\nCindy Wineinger, M.S., CCC-SLP  wineinge@chapman.edu Course: CSDX 9005BiographyMs. Wineinger has a M.S. in Communicative Disorders from the University of Redlands. She is a Professor in the Department of Communicative Disorders at the University of Redlands where she has been teaching upper division and graduate courses in Communication Disorders since 1988. She is also the Executive Director of Academic Networks in Anaheim since 2003. Ms. Wineinger is a licensed and clinically certified speech language pathologist and holds a California state license. She has various clinical experiences with University of California FOR OC Kids Neurodevelopmental Center in Orange, CA; private practice in family-centered therapy home programs for young children with Autism and individual therapy through the Providence Speech and Hearing Center in Orange. She has also supervised graduate and undergraduate clinicians. Ms. Wineinger is also involved in scholarly/professional presentations.\nLeann Schouten, ClinScD, CCC-SLPschouten@chapman.eduCourses: CSDX-9006, CSDX-9019 (Co-taught with Dr. Maria Abramson)BiographyLeann Schouten is the owner of Jump and Schout Therapy, a multidisciplinary private practice in Brea, CA. Leann is PROMPT certified and has additional training in the areas of apraxia, autism, child language, hearing impairments, Lindamood-Bell LIPS and Visualizing and Verbalizing. Continuing education training has been completed in the areas of auditory processing, Dichotic Interaural Intensity Difference (DIID), Social Thinking, cochlear implants just to name a few. In her practice she provides a multidisciplinary collaboration with occupational therapist, physical therapist, and ABA providers. She earned her MS degree in Communication Disorders from CSU Northridge, and BA degree in Communication Disorders and Sciences from CSU Northridge. Leann is currently a Regional Center of Orange County service provider and is a member of the American Speech Language Hearing Association (ASHA), the California Speech Language Association (CSHA), the Autism Society of America (ASA), the Medical Speech-Language Pathology Council of California (MSCC), and the American Academy of Private Practice in Speech Pathology and Audiology (AAPPSPA). In addition, Leann holds a current Nonpublic School Agency (NPA) certification through the state of California.\nJennifer Rosales, M.S., CCC-SLPeven@chapman.eduCourse: CSDX-9008Biography Jennifer Rosales earned her MS in Speech Language Pathology from the University of Redlands. She is a Certified Speech Language Pathologist with extensive work in a medical center and has a strong emphasis in Aphasia. Skilled in providing evaluations, treatment and alternative methods of communication for voice, speech, fluency, language and/or swallowing disorders. Jennifer has contributed much of her time to specialty areas. She is the Chair of the Collaborate Delivery Council, at St. Jude Medical Center, lead SLP for a weekly aphasia group for adults, lead SLP for a weekly language lab for children, and a lead SLP for a weekly social skills group for children. Jennifer is also an affiliate of the National Aphasia Association and a member of the CSHA District 8 Advisory Committee.\nMaria Abramson, Au. D., CCC-A, FAAA mabramso@chapman.edu Course: CSDX-9019 (Co-taught with Leann Schouten)BiographyDr. Abramson has a Doctor of Audiology degree from A.T. Still University, Arizona School of Health Sciences. She is a licensed and a clinically certified audiologist (CCC-A) with American Speech-Language-Hearing Association and with the state of California Board of Medical Quality Assurance. She also is a Fellow in the American Academy of Audiology. With more than thirty years of experience, Dr. Abramson provides audiologic services to adults and children throughout Orange County. She is also on staff at seven hospitals with extensive experience in hearing assessments for adults. Dr. Abramson has received the Outstanding Achievement Award from CSHA (2001) for Pediatric Hearing Aid Fitting. She is the author of the diagnostic and therapeutic Basic Auditory Training (BAT) Program.\nLisa LaSalle, Ph.D., CCC-SLP Lasalle@chapman.eduCourses: CSDX-9007, CSDX-9020Biography Dr. Lisa LaSalle is an ASHA-certified speech-language pathologist with specialty training in stuttering and fluency disorders. She earned her Master’s degree from University of Virginia in 1986 and her Ph.D. from Syracuse University in 1993. Dr. LaSalle has taught in graduate programs in Communication Sciences and Disorders full-time and as an adjunct professor for twenty years and is currently a full-time Professor at University of Redlands. Her research interests have focused on individuals who stutter, concomitant disorders associated with stuttering and a fluency disorder known as cluttering. Dr. LaSalle has co-authored papers in Journal of Fluency Disorders, Journal of Speech Language Hearing Research and other journals. She is currently mentoring students on a research project aimed at better understanding the relationships between language, phonology, and fluency among normally fluent two- to four-year-olds.\n\n\n\n\n\n\n                                                MS in Communication Sciences and Disorders \n\n                                            \n\nChapman University's MS CSD program is offered through the Department of Communication Sciences & Disorders at the Rinker Campus in Irvine, CA\n\n\nThe Master of Science graduate degree in Communication Sciences and Disorders is conferred one day a year, August 1.\nCohort model with entry each fall.\nA 63-unit program designed to be completed in two years (including summer terms), which includes a total of 14 units practicum.\nRequired 400 hours of supervised practicum in a variety of education and healthcare settings.Visit the MS CSD website for more information.\n\n\n\n\n\n\n\n\n                                                FAQs\n\n                                            \n\nQ: What is the minimum GPA required for the Post-Bacc CSD program? A: Applicants must have a minimum undergrad GPA of 3.0. This minimum GPA must be met at the time of your application submission. There is no exception to this policy. The GPA recorded on your final bachelor’s degree transcript determines an applicant’s qualification. We feel it would be a disservice to the applicant if we accept below the requirement because graduate programs in Communication Sciences are very competitive. Qualifying GPA will not include post-undergrad grades/coursework.\nQ: Can I work full-time and attend the Post Bacc CSD cohort program? A: Students may choose to work full-time. The program is intensive, so it is up to the student to decide if a full-time work schedule and the Post-Bacc CSD program is manageable.\nQ: I have taken a couple of the courses at another university. Can I transfer these courses? A: No. Our Post-Bacc CSD Program is a cohort program. All students must successfully complete all 10 courses to receive a certificate.\nQ: I just need to take one of the courses you offer. How can I register? A: We do not offer these courses individually.  Q: Is the total amount of tuition due in full before the program begins? A: No. Our program, structured in five-terms (two courses per term), will register students term by term. Payment for each term is due in full before the term begins. We provide a payment schedule.\nQ: Can I apply for financial aid? A: Federal Financial Aid is not available for Post-Baccalaureate students enrolled through an Extended Education program.\nQ: How can I finance my tuition? A: Private loan options are available for this program. Please review the “Financing Your Education” tab on our website.\nQ: Are GRE scores required? A: For Chapman University’s Post-Bacc CSD program, GRE scores are not required.\nQ: Do I complete the CSDCAS application? A: No. The CSDCAS application is the application for the master’s program.\nQ: On the online application, do I mark part-time or full-time? A: Full-time.\nQ: I have not attended school in quite some time and do not have current connections to provide a recommendation letter from an academic resource. A: Have you volunteered? On the other hand, have you taken a workshop? A supervisor who knows your academic work ethics and/or interest in this program would be an eligible resource.\nQ: Does Chapman University guarantee me spot in the Chapman’s MS CSD program, after I successfully complete the Post-Bacc CSD program with Chapman University? A: No. Successful completion of the Post-Bacc CSD program, does not guarantee admission into Chapman’s CSD graduate program.\nQ: Will my Post-Bacc CSD Certificate from Chapman University, make me eligible to apply to a master’s Communication Sciences and Disorders program at any university? A: Yes.\nQ: Can I apply to graduate school before I finish the program? A: Yes, you may apply, but consider what will make you a strong contender because graduate programs are highly competitive. This is also dependent upon timing of your completion of the Post-Bacc CSD program.\nQ: What makes this Post-Bacc program different from other programs? A: Faculty have real world experience and bring an interesting, insightful, and helpful perspective to the program. Students can assure enrollment of classes and completion of the program in 10 months. This is cohort style model; students begin and end the program together. Classes are Friday evenings and Saturdays.\nQ: How many students per class? A: Average class size is 25-30.\nQ: What is the format of these classes? A: Lecture model with in-class activities and guest lecturers.\nQ: I am almost done with my undergrad coursework. Can I still apply to Chapman's Post-Bacc CSD program? A: You may apply while finishing your undergrad classes. However, completion of all undergrad coursework is required prior to the start of this program. If admitted into the Post-Bacc CSD program, you will receive a \"conditional approval\" until official transcripts are received.\n\n\n\n\n\n\n\n\n\n\nAcademic Programs\n\n\nUndergraduate Programs\n\n\nGraduate Programs\n\n\nBridge and Linkage Programs\n\n\nPost-Baccalaureate Certificate in Communication Sciences and Disorders\n\n\n\n\n\n\nRequest Information\nApply Now\n\n\n\n\nContact Us\n\nGeneral Inquiries\nAdministrative Assistant\nSarah Benz\n(714) 997-6566pbcsd@chapman.eduProgram Manager, Mary Ellen Hood, MS, CCC-SLP(714) 997-6610hood@chapman.edu\n\n\n\n\n\n\nIn The Know\n\n2020 SLP Certification Standards New standards and implementation procedures for the certificate of clinical competence in SLP. The major change is contained within ASHA’s Standard IV-A: “Applicants must demonstrate knowledge of statistics and the biological, physical and social/behavioral sciences.” Learn more about the new standards\n\n\n\n\n\n\n\n\n\nPost-Bacc CSD Virtual Information Sessions\n\n\nMay 10th - Register Here \nJune 14th - Register Here\nJuly 12th - Register Here\n \n \n\n\n\n\n\n\n\n\n\n\n\n Contact Us   Maps & Directions    Emergency \n\n\n\nOrange Campus\nOne University Drive  Orange, CA 92866   (714) 997-6815\n\nRinker Health Science Campus\n9401 Jeronimo Road  Irvine, CA 92618 \n\n\n\nGet Started\n\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment\n\n\n\nDiscover\n\nSchools and Colleges\nPrograms at Chapman\nEvents at Chapman\nNewsroom\nDirectory\n\n\n\n\nSupport\n\nReport Concern or Incident\nAccessibility Feedback\nWebsite Feedback\nDisability Services\nConsumer Disclosures\nPrivacy Policy\nTitle IX\n\n\n\n Chapman Logo                                               \n© 2022 Chapman University           \n\n\n Back to top    \n\n\n\n\n\n/_featured/Default.xml\nDefault\nDefault\nDo Not Show\nDo Not Show\n\n\n\n",
    "links": [
        "#main",
        "https://www.chapman.edu/index.aspx",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "https://www.chapman.edu/about/connect/index.aspx",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/https://catalog.chapman.edu",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/financing/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit/campus.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/https://blogs.chapman.edu/huell-howser-archives/",
        "https://www.chapman.edu/https://events.chapman.edu/?view=list&group_id=21",
        "https://www.chapman.edu/arts/escalette-collection.aspx",
        "https://www.chapman.edu/wilkinson/art/gallery/index.aspx",
        "https://www.chapman.edu/https://www.hilbertmuseum.com/#california-art=",
        "https://www.chapman.edu/https://muscocenter.org/Online/default.asp",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/http://www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/https://events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/health-and-wellness/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "https://www.chapman.edu/research/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index-bk.aspx",
        "https://www.chapman.edu/research/industry-alliances-commercialization/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/give/contact-us.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/campus-services/community-relations/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/industry-partners/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "https://www.chapman.edu/index.aspx",
        "https://www.chapman.edu/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/campus-services/community-relations/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/industry-partners/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/javascript:void(0)",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "../campus-services/information-systems/services/email/panther-mail.aspx",
        "https://my.chapman.edu/",
        "https://working.chapman.edu/",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "https://www.chapman.edu/about/connect/index.aspx",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/https://catalog.chapman.edu",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/financing/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit/campus.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/https://blogs.chapman.edu/huell-howser-archives/",
        "https://www.chapman.edu/https://events.chapman.edu/?view=list&group_id=21",
        "https://www.chapman.edu/arts/escalette-collection.aspx",
        "https://www.chapman.edu/wilkinson/art/gallery/index.aspx",
        "https://www.chapman.edu/https://www.hilbertmuseum.com/#california-art=",
        "https://www.chapman.edu/https://muscocenter.org/Online/default.asp",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/http://www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/https://events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/health-and-wellness/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "https://www.chapman.edu/research/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index-bk.aspx",
        "https://www.chapman.edu/research/industry-alliances-commercialization/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/give/contact-us.aspx",
        "/",
        "../index.aspx",
        "index.aspx",
        "../advising/index.aspx",
        "../faculty-student-research.aspx",
        "../faculty-directory.aspx",
        "../leadership-council.aspx",
        "../events-community-outreach/index.aspx",
        "../contact-us.aspx",
        "../support-crean/index.aspx",
        "../research-centers/index.aspx",
        "../office-of-the-dean.aspx",
        "../career-services/index.aspx",
        "../parent-advisory-council.aspx",
        "https://go.chapman.edu/apply/",
        "mailto:admtranscript@chapman.edu",
        "https://www.chapman.edu/campus-services/parking-services/register.aspx",
        "https://www.salliemae.com/sosl/00116499 ",
        "https://www.salliemae.com/student-loans/student-loans-for-parents/parent-loan/",
        "mailto:hood@chapman.edu",
        "mailto:wohlgemu@chapman.edu",
        "mailto:bewillia@chapman.edu",
        "mailto:mafox@chapman.edu",
        "mailto:thcooper@chapman.edu",
        "mailto:wineinge@chapman.edu",
        "mailto:schouten@chapman.edu",
        "mailto:even@chapman.edu",
        "mailto:mabramso@chapman.edu",
        "mailto:lasalle@chapman.edu",
        "graduate-programs/ms-communication-sciences-and-disorders/csd-ctc-accreditation.aspx",
        "index.aspx",
        "undergraduate-programs/index.aspx",
        "graduate-programs/index.aspx",
        "bridge-linkage-programs/index.aspx",
        "postbac-comm-science-disorders.aspx",
        "https://go.chapman.edu/register/Crean-Rinker-info",
        "https://go.chapman.edu/apply/",
        "mailto:pbcsd@chapman.eud",
        "mailto:hood@chapman.edu",
        "http://www.asha.org/Certification/2014-Speech-Language-Pathology-Certification-Standards/",
        "https://go.chapman.edu/register/?id=c19e9479-58be-46dc-9915-75fdc7a91da9%20",
        "https://go.chapman.edu/register/?id=555f0499-a87c-4446-b434-c35f7c8053e5",
        "https://go.chapman.edu/register/?id=147baa25-c927-40ab-844e-23012fd5602e",
        "../../about/connect/index.aspx",
        "../../about/maps-directions/index.aspx",
        "../../emergency/index.aspx",
        "https://www.google.com/maps/place/Chapman+University/@33.7931305,-117.8543282,17z/data=!3m1!4b1!4m5!3m4!1s0x80dcd9e1d9d6e8ef:0x6ebb27c51b72a8ec!8m2!3d33.7931305!4d-117.8521395?hl=en",
        "tel:+1714-997-6815",
        "https://www.google.com/maps/place/Chapman+University+Rinker+Health+Science+Campus/@33.650635,-117.7203547,17z/data=!4m13!1m7!3m6!1s0x80dce81715a0d84b:0x8fe3dc2fce1c83da!2s9401+Jeronimo+Rd,+Irvine,+CA+92618!3b1!8m2!3d33.650635!4d-117.718166!3m4!1s0x80dcde16796ddc25:0xb4afb4199eff4db8!8m2!3d33.6506535!4d-117.7181062?hl=en",
        "../../about/visit/index.aspx",
        "../../students/tuition-and-aid/index.aspx",
        "../../admission/undergraduate/how-to-apply/index.aspx",
        "../../faculty-staff/human-resources/jobs/index.aspx",
        "../../academics/schools-colleges.aspx",
        "../../academics/degrees-and-programs.aspx",
        "https://events.chapman.edu/",
        "https://news.chapman.edu/",
        "../../directory/index.aspx",
        "../../reporting/index.aspx",
        "../../accessibility/feedback-form.aspx",
        "../../website-feedback-form.aspx",
        "../../students/health-and-safety/disability-services/index.aspx",
        "../../consumer-information-disclosures/index.aspx",
        "../../campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "../../students/health-and-safety/title-ix/index.aspx",
        "/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu"
    ]
}