{
    "title": "Audit Services – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Audit Services\n\t\t\t    \n                            AUD Menu\n                        Show search box.Audit ServicesTypes & ProcessReports & ResourcesContact UsAudit ServicesTypes & ProcessReports & ResourcesContact Us(opens in new window)\n        Our Office\n        Location IconAudits Services\n                                                                            Kendall Hall 107\n                                                                530-898-6231Mailing Address\n                                                                            Division of Business & Finance\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0025\n                                                                    Current page:  Audit Services\n                                        \n    \t\tAudit Services\n    \tWhat We DoAudit Services promotes and supports best business practices by improving University operations. The department assesses and develops the effectiveness of risk management, internal controls, and governance processes.The Audit Services department oversees coordination of campus audits, both internal and external; monitoring the implementation of audit recommendations from the Chancellor’s Office; and developing partnerships with external auditors for special investigations of suspected fiscal irregularities.\n                        Audit Process\n                    \n                        Resources\n                    \n                        Good Business Practices\n                    Frequently Asked Questions[+] Expand All[–] Collapse AllWho will be my main point of contact for the audit process?\n                The Director of Audit and Continuous Improvement is CSU, Chico's Audit Liason.  Contact the director directly at ammilburn@csuchico.edu or the Division of Business & Finance at 530-898-6231.\n            What is the Audit Liaison’s role in the audit?The Audit Liaison is the link between the auditing body and the campus. Some of the liaison’s tasks include:Notifying the affected departments of an upcoming audit.Coordinating the completion of the initial questionnaire and request for documents.Assist in scheduling initial interviews and walkthroughs.Arranging a workspace for the auditor for on-campus fieldwork or Zoom meetings.Scheduling the entrance conference.Scheduling weekly status meetings and the informal exit conference.Facilitating the audit process during fieldwork.Work with the department being audited to respond to the Preliminary Draft report.Responds to the Incomplete Draft report with the campus’s agreed-upon changes.Work with the department being audited to submit proof of the corrective action/follow-up to close the recommendation.What if we’re late submitting our corrective action follow-up?\n                Follow-up submissions are due three weeks before each Board of Trustee’s (BOT) meeting to be processed and included in the updated matrix presented to the audit committee at the BOT meeting. If we’re late submitting the appropriate follow-up documentation that clears the finding, our campus will show as late on the matrix presented. Our President could be called to address the delay to the audit committee at the BOT meeting.\n            How can I report improper governmental activities?\n                You can learn more on the HR page about submitting a whistleblower complaint.\n            Where can I find more information about CSU internal reports for Chico State and other campuses?\n                Visit the California State University Chancellor's Office page of audit reports, to search by title, category, year or campus.\n            Division of Business & FinanceVice President for Business & FinanceZip Code: 95929-0025www.csuchico.edu/vpbfDepartmentsAudit ServicesDistribution ServicesEnvironmental Health and SafetyFacilities Management and ServicesFinancial ServicesHuman Resources Service CenterProcurement & Contract ServicesRisk ManagementStaff CouncilUniversity Budget OfficeUniversity Police\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "audit-process.shtml",
        "audit-reports.shtml",
        "https://apps.csuchico.edu/directory/Department/BA",
        "index.shtml",
        "audit-process.shtml",
        "audit-reports.shtml",
        "https://apps.csuchico.edu/directory/Department/BA",
        "tel:530-898-6231",
        "audit-process.shtml",
        "resources.shtml",
        "good-business-practices.shtml",
        "#acc-12185-1",
        "mailto:ammilburn@csuchico.edu",
        "tel:5308986231",
        "#acc-12185-2",
        "#acc-12185-3",
        "#acc-12185-4",
        "https://www.csuchico.edu/hr/eodr/whistleblower.shtml",
        "#acc-12185-5",
        "https://www.calstate.edu/csu-system/transparency-accountability/audit-reports",
        "https://www.csuchico.edu/vpbf/index.shtml",
        "index.shtml",
        "https://www.csuchico.edu/dist/index.shtml",
        "https://www.csuchico.edu/ehs/index.shtml",
        "https://www.csuchico.edu/fms/index.shtml",
        "https://www.csuchico.edu/fin/index.shtml",
        "https://www.csuchico.edu/hr/index.shtml",
        "https://www.csuchico.edu/purc/index.shtml",
        "https://www.csuchico.edu/risk/index.shtml",
        "https://www.csuchico.edu/stac/index.shtml",
        "https://www.csuchico.edu/bud/index.shtml",
        "https://www.csuchico.edu/up/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}