{
    "title": "Twitter’s $42,000-per-Month API Prices Out Nearly Everyone | WIRED",
    "body": "Skip to main contentOpen Navigation MenuMenuStory SavedTo revist this article, visit My Profile, then View saved stories.Close AlertTwitter’s $42,000-per-Month API Prices Out Nearly EveryoneBackchannelBusinessCultureGearIdeasScienceSecurityMoreChevronStory SavedTo revist this article, visit My Profile, then View saved stories.Close AlertSign InSearchSearchBackchannelBusinessCultureGearIdeasScienceSecurityPodcastsVideoArtificial IntelligenceClimateGamesNewslettersMagazineEventsWired InsiderJobsCouponsPhotograph: Tayfun Coskun/Getty ImagesChris Stokel-WalkerBusinessMar 10, 2023 12:53 PMTwitter’s $42,000-per-Month API Prices Out Nearly EveryoneTiers will start at $500,000 a year for access to 0.3 percent of the company’s tweets. Researchers say that’s too much for too little data.FacebookTwitterEmailSave StoryFacebookTwitterEmailSave StorySince Twitter launched in 2006, the company has acted as a kind of heartbeat for social media conversation. That’s partly because it’s where media people go to talk about the media, but also because it’s been willing to open up its backend to researchers. Academics have used free access to Twitter’s API, or application programming interface, in order to access data on the kinds of conversations occurring on the platform, which helps them understand what the online world is talking about.Twitter’s API is used by vast numbers of researchers. Since 2020, there have been more than 17,500 academic papers based on the platform’s data, giving strength to the argument that Twitter owner Elon Musk has long claimed, that the platform is the “de facto town square.”But new charges, included in documentation seen by WIRED, suggest that most organizations that have relied on API access to conduct research will now be priced out of using Twitter.It’s the end of a long, convoluted process. On February 2, Musk announced API access would go behind a paywall in a week. (Those producing “good” content would be exempted.) A week later, he delayed the decision to February 13. Unsurprisingly, that deadline also slipped by, as Twitter suffered a catastrophic outage. The company is now offering three levels of Enterprise Packages to its developer platform, according to a document sent by a Twitter rep to would-be academic customers in early March and passed on to WIRED. The cheapest, Small Package, gives access to 50 million tweets for $42,000 a month. Higher tiers give researchers or businesses access to larger volumes of tweets—100 million and 200 million tweets respectively—and cost $125,000 and $210,000 a month. WIRED confirmed the figures with other existing free API users, who have received emails saying that the new pricing plans will take effect within months.  “I don’t know if there’s an academic on the planet who could afford $42,000 a month for Twitter,” says Jeremy Blackburn, assistant professor at Binghamton University in New York and a member of the iDRAMA Lab, which analyzes hate speech on social media—including on Twitter. Twitter did not respond to a request for comment.For subscribers to the cheapest package, the number of rules through which they can filter data from the app’s Real Time PowerTrack API will be capped at 25,000, and the number of queries of the Full Archive Search API will be capped at 50,000. The number of Twitter handles they can analyze through the Account Activity API will also be limited to 5,000, and there will be a max of 20 requests per minute for the Engagement API Totals Endpoint, which allows researchers to see how well tweets are doing in terms of engagement.While this sounds like a substantial dataset, it only accounts for around 0.3 percent of Twitter’s monthly output, meaning it is far from being a comprehensive snapshot of activity on the platform. Twitter’s free API access gave researchers access to 1 percent of all tweets.Most PopularGearThe 5 Best Laptops for LinuxScott GilbertsonScienceInside the Secretive Life-Extension ClinicFrank SwainGearThe 13 Best Electric Bikes for Every Kind of RideAdrienne SoGearPower Up Anywhere With Our Favorite Portable ChargersSimon HillElissa M. Redmiles, a faculty member at the Max Planck Institute for Software Systems in Germany, says the new prices are eye-watering. “It’s probably outside of any academic budget I’ve ever heard of,” she says, adding that the price would put off any long-term analysis of user sentiment. “One month of Twitter data isn’t really going to work for the purposes people have,” she says.Kenneth Joseph, assistant professor at the University of Buffalo and one of the authors of a recent paper analyzing a day in the life of Twitter, says the new pricing effectively kills his career. “$42,000 is not something I can pay for a single month in any reasonable way,” says. “It totally destroys any opportunity to engage in research in this space, which I’ve in many respects built a career on.” The pricing documents were provided to WIRED by a researcher who asked for anonymity, since they are still accessing Twitter data through an existing API agreement and worry it could be terminated if they were identified. They say the new costs were “not viable for the academic community.”“No one can afford to pay that,” they say. “Even rich institutions can’t afford to pay half a million a year for a thimbleful of data.”It’s not clear whom the new pricing model is targeted at. Nir Grinberg, an assistant professor in the ​Department of Software and Information Systems Engineering at Ben-Gurion University in Israel, used to work at a startup that used Twitter’s data.“It seems like a really steep increase for a tiny amount of data. One percent of Twitter a few months ago was free. Now Twitter is offering 0.3 percent for half a million dollars [a year],” he says. “It’s just crazy. I honestly don’t know who could budget for this.”Researchers say the damage won’t just be to academic discourse. Twitter is a vital dataset for understanding how the internet works and what conversations are being had in the notional global public square.Joseph recognizes that there are other platforms he could research, but notes that Twitter’s potent combination of journalists, high-ranking politicians, and business decisionmakers makes it a vital area for research. “Twitter is a particularly special space for understanding elite discourse,” he says. “To rip that away from all of us trying to use the system to understand it is a tough pill to swallow.”Blackburn, however, says researchers will continue to find a way to scrutinize what’s happening on Twitter. “We’ve been mostly cut off from Facebook for years and we’ve continued to make progress,” he says. “It’s not like science is going to be held hostage by a guy that played himself into burning $44 billion on a website that makes no money, just so he could force all its users to read his shitposts.”Get More From WIRED📧 Get the best stories from WIRED’s iconic archive in your inbox🎧 Our new podcast wants you to Have a Nice FutureMy balls-out quest to achieve the perfect scrotumAs sea levels rise, the East Coast is also sinking Everything you need to know about ethernetThe case against momfluencersSo your kid wants to be a Twitch streamer⛺ Embrace the new season with the Gear team’s best picks for best tents, umbrellas, and robot vacuumsChris Stokel-Walker is a freelance journalist and WIRED contributor. He is the author of YouTubers: How YouTube Shook up TV and Created a New Generation of Stars, and TikTok Boom: China’s Dynamite App and the Superpower Race for Social Media. His work has also appeared in The New York Times,... Read moreTopicstwitterSocial MediadataMore from WIREDI’m Healing From the Tech Layoffs by Playing Going UnderPlaying video games to deal with reality is nothing new, but this game about being an intern in Silicon Valley is perfect if you just need a laugh.Julie FukunagaIt’s Way Too Easy to Get Google’s Bard Chatbot to LieThe company’s policy bars use of the AI chatbot to “misinform.” A study found that it readily spouted untruths on topics from Covid-19 to the war in Ukraine.Vittoria ElliottBinance and Coinbase Have Been Sucked Into a Regulatory Turf WarUS agencies are sparring over who gets to oversee the crypto industry, and companies are stuck in the middle.Joel KhaliliThe Elusive Dream of Fully Autonomous Construction VehiclesRobot excavators and other equipment held big promise for heavy equipment makers—like self-driving cars, the technology has proven difficult to perfect.Khari JohnsonGig Workers Are Being Stabbed, Stoned, and Abused in IndiaAn Uber driver was mugged. An Ola driver was beaten and left in a coma. Platform workers say tech companies are doing little to protect them.Varsha BansalAmazon Is Joining the Generative AI RaceThe ecommerce giant doesn’t have a ChatGPT rival, but it wants to sell you the tools you need to build one.Will KnightThe US Wants to Close an ‘SUV Loophole’ That Supersized CarsA new proposal from the EPA would make it less attractive for automakers to build big vehicles.Aarian MarshallTexas Could Push Tech Platforms to Censor Posts About AbortionIf passed, the proposed law would also require internet service providers to block websites that discuss access to abortion.Vittoria ElliottWIRED is where tomorrow is realized. It is the essential source of information and ideas that make sense of a world in constant transformation. The WIRED conversation illuminates how technology is changing every aspect of our lives—from culture to business, science to design. The breakthroughs and innovations that we uncover lead to new ways of thinking, new connections, and new industries.FacebookTwitterPinterestYouTubeInstagramTiktokMore From WIREDSubscribeNewslettersFAQWired StaffPress CenterCouponsEditorial StandardsBlack FridayArchiveContactAdvertiseContact UsCustomer CareJobsRSSAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesSelect international siteUnited StatesLargeChevronUKItaliaJapón",
    "links": [
        "#main-content",
        "/account/saved",
        "/",
        "/category/backchannel/",
        "/category/business/",
        "/category/culture/",
        "/category/gear/",
        "/category/ideas/",
        "/category/science/",
        "/category/security/",
        "/account/saved",
        "/auth/initiate?redirectURL=%2Fstory%2Ftwitter-data-api-prices-out-nearly-everyone%2F&source=VERSO_NAVIGATION",
        "/search/",
        "/category/backchannel/",
        "/category/business/",
        "/category/culture/",
        "/category/gear/",
        "/category/ideas/",
        "/category/science/",
        "/category/security/",
        "/podcasts/",
        "/video/",
        "https://www.wired.com/category/artificial-intelligence/",
        "https://www.wired.com/category/science/environment-climate-change/",
        "https://www.wired.com/tag/video-games/",
        "https://www.wired.com/newsletter",
        "https://www.wired.com/magazine",
        "https://re.wired.com/RE-WIRED/en",
        "/category/wiredinsider/",
        "https://jobs.wired.com/?source=navbar",
        "https://www.wired.com/coupons",
        "/author/chris-stokel-walker",
        "/category/business",
        "https://www.facebook.com/dialog/feed?&display=popup&caption=Twitter%E2%80%99s%20%2442%2C000-per-Month%20API%20Prices%20Out%20Nearly%20Everyone&app_id=719405864858490&link=https%3A%2F%2Fwww.wired.com%2Fstory%2Ftwitter-data-api-prices-out-nearly-everyone%2F%3Futm_source%3Dfacebook%26utm_medium%3Dsocial%26utm_campaign%3Donsite-share%26utm_brand%3Dwired%26utm_social-type%3Dearned",
        "https://twitter.com/intent/tweet/?url=https%3A%2F%2Fwww.wired.com%2Fstory%2Ftwitter-data-api-prices-out-nearly-everyone%2F%3Futm_source%3Dtwitter%26utm_medium%3Dsocial%26utm_campaign%3Donsite-share%26utm_brand%3Dwired%26utm_social-type%3Dearned&text=Twitter%E2%80%99s%20%2442%2C000-per-Month%20API%20Prices%20Out%20Nearly%20Everyone&via=wired",
        "mailto:?subject=Twitter%E2%80%99s%20%2442%2C000-per-Month%20API%20Prices%20Out%20Nearly%20Everyone&body=https%3A%2F%2Fwww.wired.com%2Fstory%2Ftwitter-data-api-prices-out-nearly-everyone%2F%3Futm_source%3Donsite-share%26utm_medium%3Demail%26utm_campaign%3Donsite-share%26utm_brand%3Dwired",
        "#",
        "https://www.facebook.com/dialog/feed?&display=popup&caption=Twitter%E2%80%99s%20%2442%2C000-per-Month%20API%20Prices%20Out%20Nearly%20Everyone&app_id=719405864858490&link=https%3A%2F%2Fwww.wired.com%2Fstory%2Ftwitter-data-api-prices-out-nearly-everyone%2F%3Futm_source%3Dfacebook%26utm_medium%3Dsocial%26utm_campaign%3Donsite-share%26utm_brand%3Dwired%26utm_social-type%3Dearned",
        "https://twitter.com/intent/tweet/?url=https%3A%2F%2Fwww.wired.com%2Fstory%2Ftwitter-data-api-prices-out-nearly-everyone%2F%3Futm_source%3Dtwitter%26utm_medium%3Dsocial%26utm_campaign%3Donsite-share%26utm_brand%3Dwired%26utm_social-type%3Dearned&text=Twitter%E2%80%99s%20%2442%2C000-per-Month%20API%20Prices%20Out%20Nearly%20Everyone&via=wired",
        "mailto:?subject=Twitter%E2%80%99s%20%2442%2C000-per-Month%20API%20Prices%20Out%20Nearly%20Everyone&body=https%3A%2F%2Fwww.wired.com%2Fstory%2Ftwitter-data-api-prices-out-nearly-everyone%2F%3Futm_source%3Donsite-share%26utm_medium%3Demail%26utm_campaign%3Donsite-share%26utm_brand%3Dwired",
        "#",
        "https://twitter.com/TwitterDev/status/1621026986784337922",
        "https://twitter.com/TwitterDev/status/1623467615539859456",
        "https://inews.co.uk/news/twitter-staff-concerned-over-massive-problems-with-site-and-warn-of-more-issues-to-come-2139083",
        "https://developer.twitter.com/en/docs/twitter-api/enterprise/engagement-api/overview",
        "https://arxiv.org/pdf/2301.11429.pdf",
        "https://www.wired.com/story/best-linux-laptops/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://www.wired.com/story/best-linux-laptops/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://www.wired.com/story/bioviva-gene-therapies-liz-parrish-longevity/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://www.wired.com/story/bioviva-gene-therapies-liz-parrish-longevity/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://www.wired.com/gallery/best-electric-bikes/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://www.wired.com/gallery/best-portable-chargers-power-banks/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://www.wired.com/gallery/best-portable-chargers-power-banks/#intcid=_wired-right-rail_26aff7cb-5155-4df5-98e0-c2057c9acd48_popular4-1-reranked-by-vidi",
        "https://arxiv.org/pdf/2301.11429.pdf",
        "https://www.wired.com/newsletter/classics?sourceCode=BottomStories",
        "https://www.wired.com/podcasts",
        "https://www.wired.com/podcast/have-a-nice-future/",
        "https://www.wired.com/story/my-balls-out-quest-to-achieve-the-perfect-scrotum/",
        "https://www.wired.com/story/as-sea-levels-rise-the-east-coast-is-also-sinking/",
        "https://www.wired.com/story/what-is-ethernet/",
        "https://www.wired.com/story/momfluencers-essay/",
        "https://www.wired.com/story/so-your-kid-wants-to-be-a-twitch-streamer-three-questions/",
        "https://www.wired.com/gallery/best-camping-tents/",
        "https://www.wired.com/gallery/best-umbrellas/",
        "https://www.wired.com/gallery/best-robot-vacuums/",
        "/author/chris-stokel-walker",
        "/author/chris-stokel-walker",
        "/tag/twitter/",
        "/tag/social-media/",
        "/tag/data/",
        "https://www.wired.com/story/healing-tech-layoffs-going-under-game/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/healing-tech-layoffs-going-under-game/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/its-way-too-easy-to-get-googles-bard-chatbot-to-lie/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/its-way-too-easy-to-get-googles-bard-chatbot-to-lie/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/binance-coinbase-regulatory-turf-war/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/binance-coinbase-regulatory-turf-war/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/the-elusive-dream-of-fully-autonomous-construction-vehicles/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/the-elusive-dream-of-fully-autonomous-construction-vehicles/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/india-gig-workers-violence-deadly-attacks/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/india-gig-workers-violence-deadly-attacks/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/amazon-is-joining-the-generative-ai-race/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/amazon-is-joining-the-generative-ai-race/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/the-us-wants-to-close-the-suv-loophole-that-supersized-cars/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/the-us-wants-to-close-the-suv-loophole-that-supersized-cars/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/texas-could-push-tech-platforms-to-censor-posts-about-abortion/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "https://www.wired.com/story/texas-could-push-tech-platforms-to-censor-posts-about-abortion/#intcid=_wired-bottom-recirc_58b8565f-9a87-4ddd-baec-581be695c5ad_cral2-2-reranked-by-vidi",
        "/",
        "https://www.facebook.com/wired/",
        "https://twitter.com/wired/",
        "https://pinterest.com/wired/",
        "https://www.youtube.com/user/wired/",
        "https://instagram.com/wired/",
        "https://www.tiktok.com/@wired?lang=en",
        "https://www.wired.com/subscribe/",
        "https://www.wired.com/newsletter?sourceCode=HeaderAndFooter",
        "https://www.wired.com/about/faq/",
        "https://www.wired.com/wired-staff/",
        "https://www.wired.com/about/press/",
        "https://www.wired.com/coupons",
        "https://www.wired.com/about/wired-on-background-policy/",
        "/tag/black-friday/",
        "https://archive.wired.com/t/storefront/storefront",
        "https://www.condenast.com/brands/wired",
        "https://www.wired.com/about/feedback/",
        "https://subscriptions.wired.com/pubs/N3/WIR/Register.jsp?cds_page_id=175371&amp;amp;cds_mag_code=WIR&amp;amp;id=1423757547774&amp;amp;lsid=50431012277019467&amp;amp;vid=1",
        "https://www.wired.com/about/wired-jobs/",
        "/about/rss-feeds/",
        "/about/accessibility-help/",
        "https://www.condenaststore.com/",
        "https://www.cnspotlight.com/ ",
        "https://www.condenast.com/user-agreement/",
        "http://www.condenast.com/privacy-policy#privacypolicy",
        "http://www.condenast.com/privacy-policy#privacypolicy-california",
        "http://www.condenast.com/privacy-policy#privacypolicy-optout",
        "https://www.wired.co.uk/",
        "https://www.wired.it/",
        "https://wired.jp/"
    ]
}