{
    "title": "Ghost: The Creator Economy Platform",
    "body": "\nGhost Logo\n\n\nOpen menu\n\n\nProduct\n\nFor CreatorsYouTubers, bloggers, podcasters, musicians & artists\nFor PublishersWriters, journalists, local news and new media outlets\n\n\n\n\n\n\nFor BusinessModern brands & companies with ambitious content marketingFor DevelopersSource code, documentation, guides and tutorialsExplore\nResources\n\n\n\n\n\n\n\nMarketplaceProfessional themes, custom integrations and qualified expertsStart here NewA huge library of guides, stories, interviews and tips for success\n\n\n\n\n\n\nThemesHundreds of beautifully designed publication templates\nHelp centerGet help with product features and answers to common questions.module-fourIntegrationsConnect thousands of apps and services with your websiteProduct updatesAll the latest changes and improvements to GhostExpertsGet help building your site from certified Ghost developersAbout usLearn more about the people behind the platform (We're hiring!)Pricing\n\nSign in\nGet Started — free\nGhost Logo\n\n\nClose menu\n\nFor CreatorsJoin thousands of creators using Ghost to share their work\nFor PublishersThe platform for independent publishers\n\n\n\n\n\n\nFor BusinessContent marketing for modern businessFor DevelopersSource code, documentation, guides and tutorialsExplore\nPricing\nMarketplace\nThemes\nIntegrations\nResources\nHelp center\nProduct updates\nDevelopers\nAbout usGet Started — freeExisting customer?\nSign in\n\nSearch\nESCCommon searches\n\nhow to set up my custom domain\n\nhow to install ghost\n\nlogin not working, how to reset password\n\ncloudflare setup and config\n\nhow to make a ghost theme↓↑to navigate ↵to selectJust launched: Ghost 5.0 →Turn your audience\ninto a business.Ghost is a powerful app for new-media creators to publish, share, and grow a business around their content. It comes with modern tools to build a website, publish content, send newsletters & offer paid subscriptions to members.Try Ghost completely free for 14 days →Advanced creator toolsDon’t settle for another basic profile that looks just like everyone else. Make it yours.Launch your website with a selection of beautiful free themes and tweak the design settings to perfectly match your brand and style.Go even further with hundreds of custom themes in our marketplace, or build your own completely custom design from scratch.Explore Ghost themes →\n\n\n\n\n\n\n\n\n\n\n\nAdvanced creator toolsPublish by web & email newsletter.An editor built from the ground-up for professionals. Calm by design, with advanced workflows by default. No more suffering through clumsy toolbars or drag & oops. Immerse yourself in the story with an interface that's invisible until you need it, and powerful when you do.Rich media & dynamic cards.Modern publishing requires more than just words. Expand your story with image galleries, gifs, video, audio, products, info boxes, accordion toggles, downloadable files, bookmarks, and so much more.Newsletters built-in.Deliver posts by email newsletter to your audience, so they’ll be in the loop whenever something new goes live. Segment your audience and send multiple different newsletters based on preference.Grow your audienceTransform those clicks into contacts.Until now, building an indie publication with memberships and subscriptions has been difficult and complicated.Ghost makes it easy, with native signup forms that turn anonymous views into logged-in members.Allow people to sign up for free, or purchase a paid subscription to support your work across monthly and yearly premium tiers.Hello, new friends.Run your businessManage your memberships.See who's signing up, who's paying, and what they're reading, so you can get a better understanding of your core audience.Native analytics.Understand what's working. Detailed engagement analytics for your audience so you can understand what content is getting the most attention, and who your biggest fans are.Offers & promotions.Entice new subscribers with offers and promotions to grow your business. Run a 30% discount for your first 100 subscribers, an 80%-off Black Friday sale, or a special promotion for a live event.GeckoBoardDiscourseImgurMailChimpPinterestHelpScoutBufferUnsplashAirTableVimeoDiscordSpotifyUlyssesActiveCampaignTwitterZapierStripeSlackInstagramFacebookiA WriterYouTubeFeedlyGoogle AnalyticsGitHubNetlifyLet's EncryptPlausibleChartMogulCoveUdeslyGiphyIntercomFlickrIntegrationsWill it work with my other tools?Referral programs, push notifications, social sharing, payment gateways, A/B testing, desktop editors, mobile apps, comments, notifications. Yes.Explore the integrations library →\n ARRCreator stats$25,000,000+The amount of revenue earned each year by Ghost publishers, with 0% payment fees.Ali Abdaal\n\n\n4M+ SubscribersCreators.With 3 million subscribers on YouTube, Ali Abdaal is one of the biggest productivity creators in the world using Ghost.Explore Ghost for creators →Publishers.Former Bernie Sanders campaign advisor and Oscar nominated writer of Don’t Look Up, David Sirota runs The Lever using Ghost.Explore Ghost for publishers →Businesses.Buffer run one of the most popular business blogs in the world on Ghost to help people get the most out of social media.Explore Ghost for business →Help getting started.Resources & guides.A library of resources to help you share content, grow your audience, get the most out of Ghost, and build an independent subscription business.Explore resources →Concierge migration.Let us migrate your content to Ghost from Substack, Medium, WordPress, and most other platforms — for free.Find out more →Hire an expert.Find certified professional freelancers and agencies to help you build your perfect publication.Browse directory →Developer documentation.Ghost is completely Open Source, MIT licensed, and can be run with a native Handlebars theme layer, or headless using the JSON API.RTFM here →Built to lastA product you can depend on.Ghost is open source, independent, and funded 100% by its users.No investors. No bullshit.Launch your siteLast week, 12,582 brand newpublications got started with Ghost.Today, it's your turn.Get started now — free\nGhost Logo\n\nAbout\nExplore\nCareers\nResourcesProductCreator platformTheme marketplaceIntegrationsFeature indexDevelopersHow to install GhostCore conceptsGhost hostingAPI documentationSecurity overviewSource codeResourcesGhost tutorialsResourcesNode.js CMS guideOpen Subscription PlatformsComparisonsGhost vs SubstackGhost vs WordPressGhost vs MediumGhost vs MemberfulGhost vs PatreonGhost alternatives →SupportHelp centerCommunity forumStatus  \n\n    Triangle\n  \n\n\n 99.9%\n\nTerms\nPrivacy\nContact\nGhost Foundation © 2023👋 We're hiring remotely, worldwide! Join the team that's creating the creator economy   —   See open roles →",
    "links": [
        "/",
        "/creators/",
        "/publishers/",
        "/business/",
        "/docs/",
        "/explore/",
        "/marketplace/",
        "/resources/",
        "/themes/",
        "/help/",
        "/integrations/",
        "/changelog/",
        "/experts/",
        "/about/",
        "/pricing/",
        "javascript:;",
        "https://account.ghost.org/signin/",
        "https://account.ghost.org/signup/",
        "/",
        "/creators/",
        "/publishers/",
        "/business/",
        "/docs/",
        "/explore/",
        "/pricing/",
        "/marketplace/",
        "/themes/",
        "/integrations/",
        "/resources/",
        "/help/",
        "/changelog/",
        "/docs/",
        "/about/",
        "https://account.ghost.org/signup/",
        "https://account.ghost.org/signin/",
        "/help/using-custom-domains/",
        "/docs/install/",
        "/help/change-account-details/",
        "/help/cloudflare-domain-setup/",
        "/docs/themes/",
        "https://www.algolia.com",
        "https://ghost.org/changelog/5/",
        "https://account.ghost.org/signup",
        "/themes/",
        "/integrations/geckoboard/",
        "/integrations/discourse/",
        "/integrations/imgur/",
        "/integrations/mailchimp/",
        "/integrations/pinterest/",
        "/integrations/helpscout/",
        "/integrations/buffer/",
        "/integrations/unsplash/",
        "/integrations/airtable/",
        "/integrations/vimeo/",
        "/integrations/discord/",
        "/integrations/spotify/",
        "/integrations/ulysses/",
        "/integrations/activecampaign/",
        "/integrations/twitter/",
        "/integrations/zapier/",
        "/integrations/stripe/",
        "/integrations/slack/",
        "/integrations/instagram/",
        "/integrations/facebook/",
        "/integrations/ia-writer/",
        "/integrations/youtube/",
        "/integrations/feedly/",
        "/integrations/analytics/",
        "/integrations/github/",
        "/integrations/netlify/",
        "/integrations/lets-encrypt/",
        "/integrations/plausible/",
        "/integrations/chartmogul/",
        "/integrations/cove-comments/",
        "/integrations/udesly/",
        "/integrations/giphy/",
        "/integrations/intercom/",
        "/integrations/flickr/",
        "/integrations/",
        "/creators/",
        "/publishers/",
        "/business/",
        "/resources/",
        "/docs/migration/pro/",
        "/experts/",
        "/docs/",
        "https://account.ghost.org/signup/",
        "/",
        "/about/",
        "/explore/",
        "https://careers.ghost.org/",
        "https://ghost.org/resources/",
        "/",
        "/marketplace/",
        "/integrations/",
        "/feature-index/",
        "/docs/install/",
        "/docs/",
        "/pricing/",
        "/docs/content-api/",
        "/docs/security/",
        "https://github.com/TryGhost/Ghost",
        "/tutorials/",
        "/resources/",
        "https://nodecms.guide",
        "https://opensubscriptionplatforms.com",
        "/vs/substack/",
        "/vs/wordpress/",
        "/vs/medium/",
        "/vs/memberful/",
        "/vs/patreon/",
        "/alternatives/",
        "/help/",
        "https://forum.ghost.org/",
        "https://status.ghost.org/",
        "/about/",
        "https://github.com/tryghost",
        "https://climate.stripe.com/6MNofu",
        "/terms/",
        "/privacy/",
        "/contact/",
        "/",
        "https://careers.ghost.org"
    ]
}