{
    "title": "SDSU Senate Approves Kumeyaay Land Acknowledgement Statement",
    "body": "\nSkip to Main Content\n\n\n\n\nMenu\n\nHome\nStudents\nFaculty\nCommunity\nNews\nContact\n\n\n\n\nNews & Events - September 11, 2019\n\n\nSDSU Senate approves Kumeyaay Land Acknowledgement statement\nOn September 3, the SDSU Senate passed a resolution to establish an official SDSU Kumeyaay Land Acknowledgement. Two versions (a full version and an abbreviated version) were written by Michael Miskwish (Kumeyaay):\n [Full Version] \nWe stand upon a land that carries the footsteps of millennia of Kumeyaay people. They are a people whose traditional lifeways intertwine with a worldview of earth and sky in a community of living beings. This land is part of a relationship that has nourished, healed, protected and embraced the Kumeyaay people to the present day. It is part of a world view founded in the harmony of the cycles of the sky and balance in the forces of life. For the Kumeyaay, red and black represent the balance of those forces that provide for harmony within our bodies as well as the world around us.\nAs students, faculty, staff and alumni of San Diego State University we acknowledge this legacy from the Kumeyaay. We promote this balance in life as we pursue our goals of knowledge and understanding. We find inspiration in the Kumeyaay spirit to open our minds and hearts. It is the legacy of the red and black. It is the land of the Kumeyaay.\n'eyay eâ\u0080\u0099haan My heart is good. \n[Abbreviated Version] \nFor millennia, the Kumeyaay people have been a part of this land. This land has nourished, healed, protected and embraced them for many generations in a relationship of balance and harmony. As members of the San Diego State University community we acknowledge this legacy. We promote this balance and harmony. We find inspiration from this land; the land of the Kumeyaay. \n \nFor more information about land acknowledgement, and instructions on how to use a land acknowledgement statement, check out these resources prepared by the Division of Diversity and Innovation:\nLand Acknowledgment Resources\n\nReturn to News and Events Main Page\n\n\nDepartment of American Indian Studies\n    San Diego State University\n    5500 Campanile Drive\n  San Diego, CA  92182-6036\n Office: Room 331 in the Arts and Letters Building\nPhone: 619-594-6991   |   Fax: 619-594-2646\nEmail: AmericanIndianStudies@sdsu.edu\nSubscribe to our Email List\n\n Department Chair: David Kamper (dkamper@sdsu.edu)\nUndergraduate Advisor: Margaret Field (mfield@sdsu.edu)\nAdministrative Coordinator: Kate Regan (kregan@sdsu.edu)\n\n\n\n\n\n\nAccessibility  | SDSU Digital Privacy Statement  | Document Reader\nLink Disclaimer: Any links to external websites are provided as a courtesy, and should not be construed as\n    endorsement of the content, views, services or products of the linked material.\n\n\n",
    "links": [
        "#content",
        "#navlinks",
        "/index.htm",
        "/students.htm",
        "/faculty.htm",
        "/community.htm",
        "/news.htm",
        "/contact.htm",
        "https://sacd.sdsu.edu/diversity-resources/land-acknowledgment",
        "/news.htm",
        "mailto:americanindianstudies@sdsu.edu",
        "https://goo.gl/forms/oIdZXLvbjaf5ASBg1",
        "https://securelb.imodules.com/s/997/rd16/wide.aspx?sid=997&gid=1&pgid=8169&dids=845&bledit=1&cid=17134",
        "mailto:kregan@sdsu.edu",
        "mailto:kregan@sdsu.edu",
        "https://www.instagram.com/sdsuamericanindianstudies/",
        "https://twitter.com/AISatSDSU",
        "https://www.facebook.com/sdsuAMIND",
        "https://it.sdsu.edu/accessibility",
        "https://stratcomm.sdsu.edu/digital-privacy",
        "https://ou-resources.sdsu.edu/document-viewers"
    ]
}