{
    "title": "Advance Notice of Retirement – Make WordPress Plugins",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Plugins\n\n\nHandbook\n \n\n\n\nHide welcome box\n\n\n\n\nWelcome to the official blog for the PluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party Review Team.\nThe review team acts as gate-keepers and fresh eyes on newly submitted plugins, as well as reviewing any reported security or guideline violations.\nQuick Links\nHandbook\nReporting Plugin Issues\nPlugin Developer Resources\nPlugin Directory Resources\n\n\nCommunication\nWe can be reached by email at plugins＠wordpress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/, or via the #pluginreview channel on Slack.\nWe are currently adding new team members as invite only. Please stay tuned!Login to Reply\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nIpstenu (Mika Epstein)\n\n11:00 am on March 10, 2023 \n\n\n\nTags: announcement ( 8 ), team reps ( 5 )   \n\t\t\t\t\n\nAdvance Notice of Retirement\n\n\ntl;dr: I will be stepping down from pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party reviews by 1 July, 2023.\nI will be stepping down from plugin reviews this year. I have been a part of this team for over a decade (and the rep for the majority of the time) and recognize a departure like this can be confusing, and could cause people jump to a whole lot of assumptions about the why.\nThis is a personal decision and has nothing to do with my passion for WordPress. It is a 100% personal, non-WordPress related, decision I made long ago (I told the team in July ’22). Suffice to say there is life ‘stuff’ going on and I cannot devote the time I once could to plugin reviews.\nMany people have noticed and complained, with varying degrees of empathy, about the sudden uptick in delays with reviews (be they new plugins or security related). Those delays are directly related to that ‘stuff’ going on. I simply am not available as much as I was, and out of fairness to myself and the community, it’s time for me to retire from plugins.\nWe’re trying to figure out an onboarding doc, some demo plugins to help people test, getting people in a place where they can fill in the gaps. But this is not a fast process. We’ve actually never had real onboarding (I was thrown into the fire when I stepped in), and it’s going to be a challenge get a team to the place where they have as much weird plugin knowledge and gotchas as I have from my 10 years of experience.\nThere will absolutely be a learning curve for the people who step in after me. Things will be missed, things will be confusing, and mistakes will happen. I ask everyone be kind and patient.\nI understand it became a one-woman show and I apologize for not asking for help and stepping down sooner before it became a crisis. At that point, it was impossible to set up a flag for help without causing these kinds of delays. But things like this happen out of your control, even when you plan. None of us expected the world to spiral like it did in 2019/20.\nWhat’s next for me and WordPress? Writing and managing my plugins, developing code, and being around for some questions. I won’t vanish in the night, but after a decade? I think it will be good for us all to have someone fresh in there.\nSome quick answers:\nI’m not sick or dying. \nWe don’t have an announcement of the new rep.\nWe are still working on onboarding and figuring that out.\nWe have reached out to people and they are actively being onboarded right now.\nSo again, I ask we all please be patient with all the changes coming. Once we sort out onboarding, we hope to be able to invite even more people, just like you, to the team!\n#announcement, #team-repsShare this:TwitterFacebookLogin to Reply\n\n\n\n\n\n\n\n\n\n\n\n\nTracy Levesque\n\n6:16 pm on March 10, 2023 \n\n\n\n\nThank you for all the tireless work you’ve given this project for a DECADE. ❤️\n\n\n\n\n\n\n\n\nJames Huff\n\n6:18 pm on March 10, 2023 \n\n\n\n\nThank you for all of the work you’ve done here, Mika!\nYour leadership and attention to detail have been among the best across the entire WordPress project, and I look forward to the new Plugins Team living up to your example. 🙂\n\n\n\n\n\n\n\n\nCodeBard\n\n6:21 pm on March 10, 2023 \n\n\n\n\nYou did a major contribution to Open SourceOpen Source Open Source denotes software for which the original source code is made freely available and may be redistributed and modified.  Open Source **must be** delivered via a licensing model, see GPL. and the WP community over 10 years. Thanks for all the effort. And good luck with your life stuff.\n\n\n\n\n\n\n\n\nsalvador123\n\n11:12 am on April 20, 2023 \n\n\n\n\nYes, indeed.\n\n\n\n\n\n\n\n\n\n\nAW a11n\n\n7:12 pm on March 10, 2023 \n\n\n\n\nThank you for everything Mika!\n\n\n\n\n\n\n\n\nJeffro\n\n7:20 pm on March 10, 2023 \n\n\n\n\nThank you for sacrificing so much of your time and life to the WordPress pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party directory.\n\n\n\n\n\n\n\n\nAnne-Mieke Bovelett\n\n7:20 pm on March 10, 2023 \n\n\n\n\nThank you, thank you, thank you, for your massive contribution!! ❤️ Lots of love from Germany.\n\n\n\n\n\n\n\n\nkarks88\n\n7:25 pm on March 10, 2023 \n\n\n\n\nCongratulations on a job well done and thanks for caring about WordPress!\n\n\n\n\n\n\n\n\nDavid Bisset\n\n7:27 pm on March 10, 2023 \n\n\n\n\nIf this was a sport they would be hanging your number on the wall of the stadium to retire it Mika. Thanking you for your hard work and having to put up with the small pains and accidents of some, and sadly the jerk-ness of a few others. I wish you the best going forward.\n\n\n\n\n\n\n\n\nArnan de Gans\n\n7:29 pm on March 10, 2023 \n\n\n\n\nOhno! 🙁\n\n\n\n\n\n\n\n\nChris Wiegman\n\n7:33 pm on March 10, 2023 \n\n\n\n\nThank you, Mika, for all you’ve done for WordPress over the years.\n\n\n\n\n\n\n\n\nSlava Abakumov\n\n7:33 pm on March 10, 2023 \n\n\n\n\nThank you so much for handling this hard process on your own for so long. It’s a little bit sad but it’s always worth moving forward and setting your own priorities right. Good luck.\n\n\n\n\n\n\n\n\nMichele Butcher-Jones\n\n7:36 pm on March 10, 2023 \n\n\n\n\nThank you so much for all of your time, stress, and dedication you have given to the Plugins Review Team. You are so appreciated. I would say I hope you enjoy your down time but I do not see you relaxing for long. HAHA. Can’t wait to see you again!\n\n\n\n\n\n\n\n\nmrwweb\n\n7:36 pm on March 10, 2023 \n\n\n\n\nMika, thank you for the astonishing amount of work you have done! You have had an incredible, positive impact on WordPress, and I wish you all the best in your next adventures!\n\n\n\n\n\n\n\n\nRyan Bayne\n\n7:39 pm on March 10, 2023 \n\n\n\n\nThat must have been difficult to type. I wish you well on a new chapter.\n\n\n\n\n\n\n\n\nThomas M\n\n7:42 pm on March 10, 2023 \n\n\n\n\nThank you for contributing your hard work for such a long time. As a pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party developer who received a few emails from you over many years, I can confirm that you are patient and understanding. And all that under the pressure of such a huge project. That earns you my utmost respect. I am sure that you and the plugin team will find suitable replacements.\nAll the best to you and your future projects!\n\n\n\n\n\n\n\n\nJohn James Jacoby\n\n7:49 pm on March 10, 2023 \n\n\n\n\n🫶\n\n\n\n\n\n\n\n\nCourtney Robertson\n\n8:04 pm on March 10, 2023 \n\n\n\n\nThank you Mika for all you have contributed over the years. Continue to care for yourself in this process.\n\n\n\n\n\n\n\n\nHendrik Luehrsen\n\n8:17 pm on March 10, 2023 \n\n\n\n\nI firmly believe, that you shaped this project for the better, Mika. Your contributions, advice, guidance and presence not only made WordPress and this ecosystem better, but also me as a developer and a person. \nThank you and I wish you nothing but success, peace and love in the adventures ahead! Godspeed!\n\n\n\n\n\n\n\n\ndavid wolfpaw\n\n8:19 pm on March 10, 2023 \n\n\n\n\nYou have done so much for the community, and we as a community thank you for all of your hard work!\n\n\n\n\n\n\n\n\nMike Kipruto\n\n8:26 pm on March 10, 2023 \n\n\n\n\nThank you so much, Mika, for all you’ve done for WordPress over the years.\n\n\n\n\n\n\n\n\nJeremy Herve\n\n8:51 pm on March 10, 2023 \n\n\n\n\nThanks for everything you’ve done and endured for our community in the past 10 years! The Plugins directory is such an important part of the WordPress experience, we are all lucky that you were there to help steer that ship for all this time.\nYou deserve that little rest! 🙂\nAnd of course, good luck to the folks currently going through onboarding!\n\n\n\n\n\n\n\n\nSyed Balkhi\n\n9:14 pm on March 10, 2023 \n\n\n\n\nThank you Mika for all that you have done for the community. Wish you all the best 😁\n\n\n\n\n\n\n\n\nTaco Verdonschot\n\n9:34 pm on March 10, 2023 \n\n\n\n\nThank you. Thank you for all you’ve done for WordPress. Thank you for all you’ve done for the thousands of plugins in the repository. Thank you for all you’ve done for the millions of WordPress users worldwide. WordPress wouldn’t be the same without you.\nSo, this truly is the end of an era. \nI hope the ‘stuff’ in your life will soon be better/less demanding so you can enjoy a bit of well-deserved peace and quiet. And maybe start writing your memoirs, as I’m sure you can write a whole series of books.\nAnd last but not least, thank you for being a mentor, a guide, and above all, a friend. You rock!\n\n\n\n\n\n\n\n\nramseyp\n\n10:10 pm on March 10, 2023 \n\n\n\n\nMega thank you, for all you’ve done here. The community wouldn’t be the same without the work, patience, and guidance you’ve provided.\n\n\n\n\n\n\n\n\nBeau Lebens\n\n10:30 pm on March 10, 2023 \n\n\n\n\nThank you so much for everything you’ve given in this role — you’ve always been a pleasure to work with on everything pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party-related!\n\n\n\n\n\n\n\n\nJames Collins\n\n10:35 pm on March 10, 2023 \n\n\n\n\nThank you for all of your efforts over the last decade, I (and many others clearly) really appreciate it.\n\n\n\n\n\n\n\n\nBrett Dunst\n\n11:38 pm on March 10, 2023 \n\n\n\n\nThank you, Mika!  You’ve always set a great example to follow – in your work with plugins and everywhere else 🙂  I’m glad to know you!\n\n\n\n\n\n\n\n\nKharis Sulistiyono\n\n1:33 am on March 11, 2023 \n\n\n\n\nOh, no! \nYou are truly inspirational. Thank you Mika for your hard work and dedication to WordPress community and ecosystem.\n\n\n\n\n\n\n\n\nMichael Beckwith\n\n3:45 am on March 11, 2023 \n\n\n\n\nEnjoy a very well earned retirement, and thank you for all the work over the years and if you approved any of my plugins, I appreciate you even more.\n\n\n\n\n\n\n\n\nHari Shanker R\n\n4:13 am on March 11, 2023 \n\n\n\n\nThank you for all your contributions, @ipstenu! You have contributed a lot (and I mean – A LOT) for WordPress and our community – our project simply would not be where it is today had it not been for your work. I wish you all the best for your future endeavors!\n\n\n\n\n\n\n\n\nTakayuki Miyoshi\n\n6:10 am on March 11, 2023 \n\n\n\n\nMika-san!! I can’t thank you enough for your incredible hard work for over a decade. Without you, definitely I couldn’t keep maintaining my plugins! You have been a coral reef for the WordPress plugins ecosystem.\n\n\n\n\n\n\n\n\nDavid Perez\n\n7:13 am on March 11, 2023 \n\n\n\n\nThanks for contribution all this time. That was an exceptional work.\n\n\n\n\n\n\n\n\nFARAZFRANK\n\n7:54 am on March 11, 2023 \n\n\n\n\nThanks, Mika, Your dedication, expertise, and positive attitude have been invaluable to WordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/, and we will truly miss you.\n\n\n\n\n\n\n\n\nJos Klever\n\n9:31 am on March 11, 2023 \n\n\n\n\nThank you for all your work as the pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party rep and for WordPress in general. Although I don’t have any plugins myself I’ve seen a lot of your work on the forums and on SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. that have impact on my work (maintaining websites) as well.\nWithout personal well being it”s very hard to manage this for a project like this, so you really deserve to make this step, even though I can only imagine the struggle you’ve had (or still have) to step away, leaving the responsibility to others.\nI wish you all the best!\n\n\n\n\n\n\n\n\nJeroen Rotty\n\n10:24 am on March 11, 2023 \n\n\n\n\nThank you, thank you, thank you! Thank you so much for every contribution you made to the project over all those years. You made a big difference for a lot of people, including me.\n\n\n\n\n\n\n\n\nBernhard Kau\n\n10:24 am on March 11, 2023 \n\n\n\n\nTHANK YOU! There is not a lot more to say. Your review feedback was always very valuable for me as a pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party author. All the best with what’s coming next! ❤️\n\n\n\n\n\n\n\n\nMatt Cromwell\n\n3:40 pm on March 11, 2023 \n\n\n\n\nThank you for your years of excellent service for the WP community, Mika! Thank you also for being so thoughtful about your transition and bringing on new people.\n\n\n\n\n\n\n\n\nAaronTweeton\n\n4:34 pm on March 11, 2023 \n\n\n\n\nThank you Mika for all your hard work!\n\n\n\n\n\n\n\n\nJoen A.\n\n7:14 am on March 13, 2023 \n\n\n\n\nThank you for all you’ve done 🙏\n\n\n\n\n\n\n\n\nFrancisco Torres\n\n9:13 am on March 13, 2023 \n\n\n\n\nThank you for everything, as for me you are one of the best examples of collaboration with the community, I’ve learned to improve my code because of your reviews and you deserve to step down anytime you want.\n\n\n\n\n\n\n\n\nJavier Casares\n\n10:26 am on March 13, 2023 \n\n\n\n\nThank you for many things, especially for enduring the comings and goings in the approval of many plugins, and for the notices of attention of what could happen in the future with many of them. Every so often we do not make things easy, and it has been a pleasure to cross messages with you.\nDon’t forget us! 😉\n\n\n\n\n\n\n\n\nCristiano Zanca\n\n11:14 am on March 13, 2023 \n\n\n\n\nThank You Mika for the precious work you’ve done in these 10 years!\nTaco is right: it’s an end of an era\nWe’ve been sooo lucky to have a person like you in the WordPress pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party Team for ten years!\nWordPress World, almost 50% of the WWW, is made by person like you.\nThank You and all the best positive vibes for your future activities!\n\n\n\n\n\n\n\n\nTran Ngoc Tuan Anh\n\n12:19 pm on March 13, 2023 \n\n\n\n\nThank you so much for the time and effort you spent for WordPress and for us!\n\n\n\n\n\n\n\n\nJustin Sternberg\n\n12:22 pm on March 13, 2023 \n\n\n\n\nMika, it’s been an absolute pleasure to work with you. The impact you likely had in the overall success of WordPress is pretty unfathomable.  , and the WordPress world will not be the same with you in that role. But I’m so glad you’re able to make this move.\n\n\n\n\n\n\n\n\nDan Soschin\n\n3:19 pm on March 13, 2023 \n\n\n\n\nA well-earned break. And the announcement above is such a thoughtful act. Thanks for all you have done for WordPress.\n\n\n\n\n\n\n\n\n\n\nNeah Plugins\n\n1:39 am on March 14, 2023 \n\n\n\n\nThanks for all your contributions. You have always been very approachable.\n\n\n\n\n\n\n\n\nKyle Maurer\n\n1:18 pm on March 14, 2023 \n\n\n\n\nThanks so much for all you’ve done Mika! The entire WordPress community owes you a debt of gratitude. The enormity of your contributions cannot be overstated.\nWish you all the best in your next chapter!\n\n\n\n\n\n\n\n\nVagelis\n\n11:38 pm on March 15, 2023 \n\n\n\n\nThank you so much, Mika.\n\n\n\n\n\n\n\n\nJoel James\n\n10:28 am on March 17, 2023 \n\n\n\n\nThank you for everything. All the best Mika.\n\n\n\n\n\n\n\n\nJb Audras\n\n12:07 pm on March 17, 2023 \n\n\n\n\nI’m not going to be original, but thank you for everything Mika! 💪\n\n\n\n\n\n\n\n\nbrandtoss\n\n12:18 pm on March 17, 2023 \n\n\n\n\nThank you so much for all you’ve done!\n\n\n\n\n\n\n\n\nStephen Edgar\n\n3:20 am on March 20, 2023 \n\n\n\n\nThank you Mika 💯\n\n\n\n\n\n\n\n\ndudo\n\n10:33 am on March 20, 2023 \n\n\n\n\nThank you, thank you so much, Mika!\n\n\n\n\n\n\n\n\nMahdiAli Khanusiya\n\n4:42 am on March 28, 2023 \n\n\n\n\nThank you for your hard work and dedication to the WordPress pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party review team! I understand that personal life can sometimes take priority, and I appreciate your transparency about your decision to step down. Good luck with your future endeavors! Thank you so much.\n\n\n\n\n\n\n\n\nWFSupport\n\n8:09 am on March 31, 2023 \n\n\n\n\nJust to echo what everyone else has said, thanks for working tirelessly for so long in an often thankless job.  The community as a whole is grateful for the work you have done, and WordPress is better for it as well.   I’m thankful that you’ve obviously put a lot of thought into your transition out of the role.  It should make things much smoother for someone transitioning in.  \nOn a personal note, I have very fond memories of our first interaction at WordCampWordCamp WordCamps are casual, locally-organized conferences covering everything related to WordPress. They're one of the places where the WordPress community comes together to teach one another what they’ve learned throughout the year and share the joy. Learn more. Raleigh when I finally got to put “a name with a face” and we had such a great conversation about Swedish Death metal and Saturday morning cartoons.  Seeing you from time to time at camps only cemented my respect for you and the work you have done for WordPress.   And over the last year especially you have been a welcome advocate for my own transition.  Your advice and ardent support have helped and encouraged me.  I cannot thank you enough for that.  \n<3\nMia\n\n\n\n\n\n\n\n\nMark Hood\n\n9:11 pm on April 2, 2023 \n\n\n\n\nI sincerely appreciate your perseverance in handling this challenging situation solo for a considerable period of time. Although it may be disheartening, it is imperative to progress and prioritize personal goals. I wish you the best of luck in your endeavors.\n\n\n\n\n\n\n\n\nRaushan Jaiswal\n\n4:49 am on April 20, 2023 \n\n\n\n\nThank you, Mika, for your decade-long dedication to the WordPress community as a pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party reviewer. \nPlease know that your presence in the WordPress community will be missed, but I’m glad to hear that you’ll still be around to help and answer questions. I wish you all the best in your future endeavors and hope that your next chapter is filled with joy and success.\n\n\n\n\n\n\n\n\nJulia Jack\n\n2:37 pm on April 27, 2023 \n\n\n\n\nThank you for sharing info..\n\n\n\n\n\n\n\n\nplugins.club\n\n6:48 pm on May 1, 2023 \n\n\n\n\nThat explains a lot..\n\n\nCurrently there are 395 plugins awaiting review.\nThe review queue is currently longer than normal, we apologize for the delays and ask for patience.\nThe current wait for an initial review is at least 25 days.\n\nThank you for sharing and keeping us in the loopLoop The Loop is PHP code used by WordPress to display posts. Using The Loop, WordPress processes each post to be displayed on the current page, and formats it according to how it matches specified criteria within The Loop tags. Any HTML or PHP code in the Loop will be processed on each post. https://codex.wordpress.org/The_Loop., wish you all the best in your future endeavors.\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \n\n\n\nPost navigation\n← Twitter API Changes Use of Code Generators Must Remain GPL Compatible →\n\n\n\n\n\n\n\n\nSearch\n\n\n\nEmail Updates\n\n\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 2,587 other subscribers\t\t\t\t\n\nHelp TopicsPlugin Guidelines\nDeveloper FAQ\nUsing Subversion\nUsing Plugin Assets\nHow Your Readme.txt works\nRecent UpdatesRecent CommentsNo RepliesRecent UpdatesRecent CommentsNo RepliesRecent Activity\n\n\n\t\t\tTeam Pledges\n\t\t\n\n0 people have pledged time to contribute to Plugins Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F2023%2F03%2F10%2Fadvance-notice-of-retirement%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/plugins/",
        "https://make.wordpress.org/plugins/handbook/",
        "https://make.wordpress.org/plugins/handbook",
        "https://developer.wordpress.org/plugins/wordpress-org/plugin-security/reporting-plugin-security-issues/",
        "https://developer.wordpress.org/plugins/",
        "https://developer.wordpress.org/plugins/wordpress-org/",
        "https://wordpress.org/",
        "https://wordpress.slack.com/messages/pluginreview",
        "https://make.wordpress.org/chat/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2Fwelcome%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/ipstenu/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://make.wordpress.org/plugins/tag/announcement/",
        "https://make.wordpress.org/plugins/tag/team-reps/",
        "https://make.wordpress.org/plugins/tag/announcement/",
        "https://make.wordpress.org/plugins/tag/team-reps/",
        "https://make.wordpress.org/plugins/2023/03/10/advance-notice-of-retirement/?share=twitter",
        "https://make.wordpress.org/plugins/2023/03/10/advance-notice-of-retirement/?share=facebook",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F2023%2F03%2F10%2Fadvance-notice-of-retirement%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/liljimmi/",
        "https://profiles.wordpress.org/macmanx/",
        "https://profiles.wordpress.org/codebard/",
        "https://profiles.wordpress.org/salvador123/",
        "https://profiles.wordpress.org/slash1andy/",
        "https://profiles.wordpress.org/jeffr0/",
        "https://profiles.wordpress.org/annebovelett/",
        "https://profiles.wordpress.org/karks88/",
        "https://profiles.wordpress.org/dimensionmedia/",
        "https://profiles.wordpress.org/adegans/",
        "https://profiles.wordpress.org/chriswiegman/",
        "https://profiles.wordpress.org/slaffik/",
        "https://profiles.wordpress.org/m_butcher/",
        "https://profiles.wordpress.org/mrwweb/",
        "https://profiles.wordpress.org/ryan-bayne/",
        "https://profiles.wordpress.org/webzunft/",
        "https://profiles.wordpress.org/johnjamesjacoby/",
        "https://profiles.wordpress.org/courane01/",
        "https://profiles.wordpress.org/luehrsen/",
        "https://profiles.wordpress.org/wolfpaw/",
        "https://profiles.wordpress.org/mikekipruto/",
        "https://profiles.wordpress.org/jeherve/",
        "https://profiles.wordpress.org/smub/",
        "https://profiles.wordpress.org/tacoverdo/",
        "https://profiles.wordpress.org/ramseyp/",
        "https://profiles.wordpress.org/beaulebens/",
        "https://profiles.wordpress.org/jamescollins/",
        "https://profiles.wordpress.org/brettface/",
        "https://profiles.wordpress.org/kharisblank/",
        "https://profiles.wordpress.org/tw2113/",
        "https://profiles.wordpress.org/harishanker/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://profiles.wordpress.org/takayukister/",
        "https://profiles.wordpress.org/davidperez/",
        "https://profiles.wordpress.org/farazfrank/",
        "https://wordpress.org/",
        "https://profiles.wordpress.org/josklever/",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://profiles.wordpress.org/jeroenrotty/",
        "https://profiles.wordpress.org/kau-boy/",
        "https://profiles.wordpress.org/webdevmattcrom/",
        "https://profiles.wordpress.org/aarontweeton/",
        "https://profiles.wordpress.org/joen/",
        "https://profiles.wordpress.org/frantorres/",
        "https://profiles.wordpress.org/javiercasares/",
        "https://profiles.wordpress.org/cristianozanca/",
        "https://profiles.wordpress.org/rilwis/",
        "https://profiles.wordpress.org/jtsternberg/",
        "https://profiles.wordpress.org/dansoschin/",
        "https://profiles.wordpress.org/gplsaver/",
        "https://profiles.wordpress.org/brashrebel/",
        "https://profiles.wordpress.org/eboxnet/",
        "https://profiles.wordpress.org/joelcj91/",
        "https://profiles.wordpress.org/audrasjb/",
        "https://profiles.wordpress.org/brandtoss/",
        "https://profiles.wordpress.org/netweb/",
        "https://profiles.wordpress.org/dudo/",
        "https://profiles.wordpress.org/mahdiali/",
        "https://profiles.wordpress.org/wfsupport/",
        "https://central.wordcamp.org/about/",
        "https://profiles.wordpress.org/apkwebite/",
        "https://profiles.wordpress.org/raushanchess/",
        "https://profiles.wordpress.org/julia1jack/",
        "https://profiles.wordpress.org/pluginsclub/",
        "https://codex.wordpress.org/The_Loop",
        "/plugins/2023/03/10/advance-notice-of-retirement/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F2023%2F03%2F10%2Fadvance-notice-of-retirement%2F&locale=en_US",
        "https://make.wordpress.org/plugins/2023/02/03/twitter-api-changes/",
        "https://make.wordpress.org/plugins/2023/03/21/use-of-code-generators-must-remain-gpl-compatible/",
        "#",
        "https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/",
        "https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/",
        "https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/",
        "https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/",
        "https://developer.wordpress.org/plugins/wordpress-org/how-your-readme-txt-works/",
        "https://make.wordpress.org/plugins/",
        "https://make.wordpress.org/plugins/?o2_recent_comments=1",
        "https://make.wordpress.org/plugins/?replies=none",
        "https://make.wordpress.org/plugins/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}