{
    "title": "Stackable – Page Builder Gutenberg Blocks – WordPress plugin | WordPress.org",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\n\nPlugins\n\n\n\n\nMy Favorites\nBeta Testing\nDevelopers\n\nSearch for:\n\nSearch plugins\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDownload\n\nStackable – Page Builder Gutenberg Blocks\nBy Gambit Technologies, Inc\n\n\n\n\n\n\n\n\nDetails\nReviews\n\nInstallation\n\nDevelopment\n\n\nSupport\n\n\n\n\n\nDescription\nThe Ultimate Companion to the WordPress Block Editor\nStackable is the ultimate trusted block plugin you’ve been waiting for. Build dynamic websites with our powerful yet lightweight custom WordPress blocks, ready-made designs, UI Kits, global settings, and advanced customization options all whilst boasting speedy performance. Have the confidence to easily design professional websites that stand out using a new page building experience for Gutenberg – the WordPress Block Editor.\n\nTry our live demo\n\n\nTransform Gutenberg into a Page Builder.\nStackable is the all-in-one block plugin for creating stunning websites by transforming the WordPress Block Editor into a Page Builder. Stackable has helped thousands of bloggers, merchants, marketers, designers and web development professionals make the most out of the WordPress Block Editor through fast, powerful and intuitive features.\nReady Made Templates, Block Designs and Wireframes\nEnjoy an impressive Design Library to jumpstart your designing process. Never start from scratch and design like a pro with the help of our stunning and professionally-made designs.\n\nDozens of UI Kit designs\nHundreds of ready-made block designs\nDozens of block layouts\nVarious shape separator designs\n\nPowerful Custom Blocks\nGet 41 flexible custom WordPress blocks that are feature-rich and look good out of the box, and provide a robust foundation for any website even without a single line of code.\nYou can choose which of these blocks you need, depending on your workflow. You can also disable blocks if you don’t need them.\nEssential Blocks\n– Advanced Columns Block — View Block\n– Advanced Heading Block – View Block\n– Advanced Text Block – View Block\n– Advanced Image Block\n– Icon List Block — View Block\n– Button Block — View Block\n– Icon Button Block\n– Icon Block — View Block\nSpecial Blocks\n– Horizontal Scroller Block – View Block\n– Countdown Block – View Block\n– Table of Contents Block – View Block\n– Posts Block — View Block\n– Image Box Block — View Block\n– Video Popup Block — View Block\n– Progress Circle Block — View Block\n– Progress Bar Block — View Block\n– Accordion Block — View Block\n– Map Block — View Block\n– Icon Label Block\n– Social Buttons Block\n– Card Block — View Block\n– Count Up Block — View Block\n– Number Box Block — View Block\n– Notification Block — View Block\n– Expand / Show More Block — View Block\n– Separator Block — View Block\n– Subtitle Block\n– Price Block\n– Divider Block\n– Spacer Block\nSection Blocks\n– Hero Block — View Block\n– Call to Action Block — View Block\n– Feature Block — View Block\n– Feature Grid Block — View Block\n– Pricing Box Block — View Block\n– Icon Box Block\n– Testimonial Block — View Block\n– Team Members Block — View Block\n– Blockquote Block — View Block\nPage Builder-like Design Options\nTurn the WordPress Block Editor into a page builder. Fine-tune your creations with a wide range of familiar web design options.\n\nMultiple Block Layouts\nSave Block Defaults\nCustomize block hover styles\nBlock Background and Image Color Settings\nBlock Typography Settings\nImage Shapes and Settings\nAdvanced Icon Options\nAdvanced Column and Spacing Settings\nGlobal Colors & Typography Settings\nResponsiveness\n\nLive Responsive Editing\nAbility to tweak designs for Tablet and Mobile views\nSpecify how Columns collapse in Tablet and Mobile\nHide / Show Specific Blocks on Desktop, Tablet or Mobile\nCustom Tablet and Mobile breakpoints\n\n\nCustom data-* attributes\n\nFast Page Loading Speed\nOptimize your website’s performance, and get lightning fast page loading to make your site visitors stay. Have the chance to maximize your page speed insights and achieve high Core Web Vitals and higher SEO rankings.\n\nLoads the smallest file size possible of CSS and JS files in the frontend, ~ only 7.8kb total\nAdds almost no PHP server overhead for fast page loads\nZero Bloat, no jQuery, no dependencies\nOptimized page loading with focus on Core Web Vitals\nResponsive image loading for faster browsing speeds in mobile devices\nCompatible with Optimization Plugins and use optimization techniques such as combining CSS and JS files and minification\n\nIntegrations & Compatibility\nMake your page building experience more well-rounded by using other popular tools. We’ve seamlessly integrated with these essential third-party plugins and tools:\n\nWPML\nWeglot\nBlocksy\nToolset\nFont Awesome\nGoogle Fonts\nsee our full list of integrations and compatibility\n\nPremium Features\nTake web designing to the next level. Stackable Premium helps you unlock the full potential of the WordPress Block Editor with awesome advanced features that will give you the ability to create high-end websites.\nDynamic Content (Premium)\nCreate dynamic WordPress websites that cater to the specific interests of visitors.\n\nDynamic content\nFully customize your query loops\nSite Custom Fields\nConditionally display blocks\n\nMore Integrations (Premium)\nIn premium, you get more integrations.\n\nACF\nMetabox\nJetEngine\n\nAgency Tools (Premium)\nCater to more clients effectively and efficiently with our Agency Tools, which were specially made for web design professionals.\n\nBlock CSS Customizer\nRole Manager\n\nMotion Effects (Premium)\nAdd animations that will bring your site to life and make it more visually engaging.\n\nScroll Animations\nEntrance Animations\nTransform & Transition Effects\n\nMore Blocks (Premium)\n\nLoad More Block (for the Blog Posts Block)\nPagination Block (for the Blog Posts Block)\n\n\nTry our live demo | Learn more\n\nNews Article Updates\n\nv3.7 Introducing: New Horizontal Scroller and Countdown Blocks\nv3.6 Introducing: New Progress Circle and Progress Bar Blocks\nv3.5 No Bloat & Improved Performance\nv3.4 Introducing: Map Block\nv3.3 Saving Block Defaults\nv3.2 Table of Contents Block\nv3.1 Wireframes\nv3.0 How To Shift From Version 2 to Version 3\nv2.17 Custom Attributes and Optimization\nv2.16 Clickable Containers and Pagination\nv2.15 Introducing Dynamic Content\nv2.14 Copy and Paste Block Styles\nv2.13 UI Kits, Borders & Improved Performance\nv2.12 Better User Interface and User Experience\nv2.11 Introducing Global Colors and Global Typography\nv2.10 Better Responsive Controls, Better List Block Icons and Low-Highlight Effect\nv2.9 Introducing: Live Responsive Editing\nv2.8 Introducing: Role Manager for Gutenberg\nv2.7 New Icon Block, Amazing Icons and Font Awesome Pro\nv2.6 New Advanced Blocks and Load More Blog Posts Button\nv2.5 Better Onboarding for First Time Users\nv2.4 Introducing the Advanced Columns & Grid Block\nv2.3 Introducing the Design Library and New Block Designs\nv2.2 Welcome Video, Better Separators and Auto-Block Recovery\nv2.1 Help Video Snippets and Auto-Expand Settings\nv2.0 Version 2 is Out!\n\nLearn More About Stackable – Page Builder Gutenberg Blocks & Designs\n\nRead our documentation and tutorials\nVisit our site wpstackable.com\nSubscribe to our newsletter\n\nEnjoying Stackable Blocks?\n\nJoin the Stackable Community in Facebook\nFollow us in Twitter @wpstackable\nLeave us a rating\n\n\n** Those marked with asterisks are part of Stackable Premium\n\n\nScreenshots\nResponsive Gutenberg BlocksPage Builder-like Block OptionsGlobal Settings that affect your entire sitePowerful Custom Gutenberg BlocksReady-made Design Library\n\nBlocks\nThis plugin provides 41 blocks.\n\n\n\nSubtitle\nSubtitle text that you can add custom styling to from the global settings.\n\n\n\nIcon List\nAn unordered list with icons. You can use this as a list of features or benefits.\n\n\n\nMap\nEmbedded Google Map with advanced controls.\n\n\n\nSpacer\nSometimes you just need some space.\n\n\n\nText\nStart with the building block of all page layouts.\n\n\n\nImage Box\nDisplay an image that shows more information when hovered on. Can be used as a fancy link to other pages.\n\n\n\nBlockquote\nDisplay a quote in style\n\n\n\nIcon Label\nAn Icon and Heading paired together.\n\n\n\nPricing Box\nDisplay the different pricing tiers of your business.\n\n\n\nProgress Bar\nVisualize a progress value or percentage in a bar.\n\n\n\nFeature Grid\nDisplay multiple product features or services. You can use Feature Grids one after another.\n\n\n\nCard\nDescribe a single subject in a small card. You can use this to describe your product, service or a person.\n\n\n\nProgress Circle\nVisualize a progress value or percentage in a circle.\n\n\n\nFeature\nDisplay a product feature or a service in a large area.\n\n\n\nAccordion\nA title that your visitors can toggle to view more text. Use as FAQs or multiple ones for an Accordion.\n\n\n\nCount Up\nShowcase your stats. Display how many customers you have or the number of downloads of your app.\n\n\n\nHeading\nIntroduce new sections of your content in style.\n\n\n\nTable of Contents\nAutomatically generated table of contents based on Heading blocks.\n\n\n\nCountdown\nDisplay a countdown timer on your website.\n\n\n\nDivider\nAdd a pause between your content.\n\n\n\nTeam Member\nDisplay members of your team or your office. Use multiple Team Member blocks if you have a large team.\n\n\n\nCall to Action\nA small section you can use to call the attention of your visitors. Great for calling attention to your products or deals.\n\n\n\nDesign Library\nChoose a layout or block from the Stackable Design Library.\n\n\n\nColumns / Container\nAdd a block that displays content in multiple columns. Get advanced options on how you want your columns to look.\n\n\n\nNumber Box\nDisplay steps or methods that your users will do in your service.\n\n\n\nPrice\nShow a price of a product or service with currency and a suffix styled with different weights\n\n\n\nPosts\nYour latest blog posts. Use this to showcase a few of your posts in your landing pages.\n\n\n\nIcon Box\nA small text area with an icon that can be used to summarize features or services\n\n\n\nHorizontal Scroller\nA slider that scrolls horizontally.\n\n\n\nTestimonial\nShowcase what your users say about your product or service.\n\n\n\nExpand / Show More\nDisplay a small snippet of text. Your readers can toggle it to show more information.\n\n\n\nNotification\nShow a notice to your readers. People can dismiss the notice to permanently hide it.\n\n\n\nImage\nAn image with advanced controls to make a visual statement.\n\n\n\nButton Group\nAdd a customizable button.\n\n\n\nSeparator\nA fancy separator to be placed between content.\n\n\n\nIcon\nPick an icon or upload your own SVG icon to decorate your content.\n\n\n\nVideo Popup\nDisplay a large thumbnail that your users can click to play a video full-screen. Great for introductory or tutorial videos.\n\n\n\nHero\nA large hero area. Typically used at the very top of a page.\n\n\n\nButton\nAdd a customizable button.\n\n\n\nIcon Button\nAdd a customizable button.\n\n\n\nColumn\nA single column within an advanced columns block. Get advanced options on how you want your column to look.\n\n\n\n\nInstallation\nMinimum Requirements\nYou’ll need WordPress version 5.9 or higher for this to work.\n\nFAQ\n\n\nIs Stackable Free?\n\n\nYes, Stackable is free forever.\nWe have a premium version that adds more designs and advanced features. You may want to check Stackable Premium here.\n\n\nDo I need to know how to code to use Stackable?\n\n\nNo, you don’t need to know a single line of code when using Stackable\n\n\nDo you have a live demo?\n\n\nYes, we have live demo that you can check out here.\n\n\nWhat are Blocks?\n\n\nBlocks are the new shortcodes in WordPress 5.0 / Gutenberg. They’re the basic elements that you add into your content to build your pages, like buttons, cards, videos, etc.\nStackable gives you an extensive collection of blocks that allows you to flexibly create any kind of professional landing page and front page.\n\n\nWhat are UI Kits?\n\n\nUI kits are a beautiful and cohesive collection of our block designs for budiling full sites easily. These kits offer a wide variety of web design styles and categories that allow you to kick start your design process right away\n\n\nWhat themes can I use with Stackable?\n\n\nStackable should work with any theme.\n\n\nCan I disable blocks that I do not use?\n\n\nYes, you can manage your blocks and choose what blocks to enable/disable.\n\n\nCan I use this plugin with other block plugins?\n\n\nYes! Stackable blocks play well with other blocks.\n\n\nCan I use this add-on for other page builders I’m using?\n\n\nNope. Stackable only works with Gutenberg, the new WordPress editor.\n\n\n\nReviews\n\n\n\n \n\n\n Just perfect\n\n\nnewshopdev\nApril 28, 2023\n\n\nI use stackable on my latest sites with pleasure.\n\n\n\n\n \n\n\n Great block plugin\n\n\nthecatweasel\nApril 17, 2023\n\n\nI've been using Stackable on multiple projects now and find it to be quick and stable with many customisation options for each Block. Would recommend purchasing Stackable Premium for more options and dynamic content for ACF.\n\n\n\n\n \n\n\n Stackable\n\n\nnavajamm\nApril 6, 2023\n\n\nFine plugin. Solved some issues for my site, and I have not encounter any problems so far.\n\n\n\n\n \n\n\n Stackable – Page Builder Gutenberg Blocks\n\n\nbooks95\nMarch 30, 2023\n\n\nКлаччный плагин\n\n\n\n\n \n\n\n Great Plugin\n\n\nrawrbear\nMarch 26, 2023\n\n\nIt's always up to date with the latest versions of WP in no time flat, easy to use and stable. Couldn't ask for better for free!\n\n\n\n\n \n\n\n Great Plugin\n\n\njenteck\nMarch 25, 2023\n\n\nYou're able to do everything you need for a website. Works very good. No issues\n\n\n\n\n\t\t\tRead all 380 reviews\t\t\n\nContributors & Developers\n“Stackable – Page Builder Gutenberg Blocks” is open source software. The following people have contributed to this plugin.Contributors\n\n\n \n\t\t\t\t\tBenjamin Intal\t\t\t\t\n\n\n \n\t\t\t\t\tgambitph\t\t\t\t\n\n\n \n\t\t\t\t\tFreemius\t\t\t\t\n\n\n“Stackable – Page Builder Gutenberg Blocks” has been translated into 7 locales. Thank you to the translators for their contributions.Translate “Stackable – Page Builder Gutenberg Blocks” into your language.Interested in development?Browse the code, check out the SVN repository, or subscribe to the development log by RSS.\n\nChangelog\n3.7.2\n\nNew: WordPress 6.2 compatibility\nNew: Stackable blocks now appear in the new Style Book\nNew: Stackable global settings are now available in the Site Editor / FSE\nFixed: Responsive block settings now working in the Site Editor\nFixed: Tablet styles sometimes show up in the editor when the screen is small\nFixed: Reusable blocks performance improvements\nFixed: Blocksy theme responsive breakpoints conflict\nChange: Removed v2 editor migration helper (it’s been 1.5 years since it was introduced)\n\n3.7.1\n\nFixed: Dynamic Content issue where ACF image fields sometimes did not output correctly\nFixed: Shape separators were always covering some content in some blocks #2268\nFixed: Cannot select a color for shape separator layers\nFixed: Custom roles did not appear in the Conditional Display role picker #2409\nFixed: Shape separator layer 2 options were not visible\nFixed: Block error that resulted when using a Display Condition taxonomy that was deleted\nFixed: CSS optimization post meta options are now hidden from the custom fields view\nFixed: Some strings in the Countdown block were not translated #2585\nFixed: Some JS hook tweaks #2588\n\n3.7.0\nIntroducing: New Horizontal Scroller and Countdown Blocks\n\nNew: Horizontal Scroller block #2494\nNew: Countdown block #2501\nFixed: Dynamic Content database performance, no more duplicate db calls #2569\nFixed: Some tablet and mobile styling options were being overwritten by desktop values #2571\nFixed: Right clicking on an Image block now triggers on the image itself\n\n3.6.5\n\nFixed: Possible error if the theme color palette is unavailable\n\n3.6.4\n\nNew: Inversed the behavior of the Heading’s margins (it now doesn’t use the theme’s margins by default) #2190\nFixed: Editor performance improvements #2446\nFixed: Better PHP 8.1 compatibility #2560\nFixed: Max content width doesn’t show correctly in the editor #2531\nFixed: Posts block not showing hover colors correctly in the editor #2351 #2473\n\n3.6.3\n\nNew: The Table of Contents block can now have a title #2346\nFixed: In Conditional Display, added support for named and 0 timezones #2530\nFixed: FontAwesome script loading is now delayed in the editor\nFixed: Possible error in the Accordion block’s icon #2546\nFixed: Tablet and mobile units are not being followed in the editor #2547\nFixed: Added missing translation strings #2399 #2402 #2472 #2498 (Thanks DAnn2012)\nFixed: Table of Contents block now support the Stackable v2 Heading block #2376\nFixed: Content vertical align option in the Column block doesn’t appear correctly in the editor #2408\nFixed: Using a custom SVG in the Icon block can result in it losing its colors  #2137\nFixed: Image Box block selection goes past its container in the editor #2369\nFixed: Block example show a “no blocks in the group” placeholder #2405\nFixed: Image alt now no longer gets overridden when picking images #2524\n\n3.6.2\n\nNew: (Freemius) Granular opt-out controls\nNew: (Freemius) Support for anonymous license activation\nNew: (Freemius) New opt-in screen\nNew: (Freemius) User IP is no longer sent during opt-in\nNew: (Freemius) No data is now sent when skipping the opt-in screen\nNew: (Freemius) Admin query strings no longer include a Freemius flag\nNew: (Freemius) Better PHP 8 compatibility\nFixed: Some PHP 8 warning messages with Twenty Twenty Three theme and Dynamic Content #2508 #2503\nFixed: Design Library button text label now shows properly #2486\nFixed: Possible Block error with v2 Button blocks and Blocksy #2484\n\n3.6.1\n\nNew: WordPress 6.1 compatibility\nNew: You can now change the Query String of the Posts block’s Pagination Block #2313\nNew: Added Advanced Tab > Responsive > Tablet column arrangement option ##2325\nNew: Added Advanced Tab > Responsive > Tablet and mobile column arrangement option #2361\nFixed: RankMath compatibility for the Table of Contents block #2424\nFixed: Newly created columns are not cloned correctly when using the Columns block’s Columns option #2476\nFixed: Posts block pagination could not navigate back to page 1 #2313\nFixed: Reset button on icon options now reset correctly #2329\nFixed: Copy and pasting styles on the Progress Circle and Bar blocks also copied some content #2469\nFixed: Progress Bar block percentage text can wrap around spaces #2464\nFixed: Button blocks can still be added even if they’re disabled in the admin #2305\nFixed: Possible block error when adding conditional display about dates #2477\n\n3.6.0\nIntroducing: New Progress Circle and Progress Bar Blocks\n\nNew: Progress Circle and Progress Bar Blocks\nFixed: You can now select transparent as the color for the 2nd gradient background color #2358\n\n3.5.0\nNo Bloat & Improved Performance\n\nNew: Various performance improvements\nNew: Smaller plugin filesize\nNew: New exposed window.stk API (undocumented)\nNew: Support for block theme contentSize and wideSize\nFixed: Wide and fullwidth blocks sometimes showed centered in the editor\nFixed: Column content vertical align did not show up correctly in the editor\nFixed: Some block options not showing up in the editor\nFixed: Column block’s Content Vertical Align not displaying correctly in the editor\nFixed: Icon block margin and size options not displaying correctly in the editor #2426\nFixed: Card block horizontal layout image resizing issues in tablet and mobile\nFixed: Hero block can get an error when switching layouts\nFixed: Accordion content in the editor overlapped sometimes\nFixed: Some styles did not show in the editor when changing hover states\nFixed: Some shadows flicker or get clipped in Safari #2328\nFixed: Accordions close adjacent doesn’t work with reduced motion OS setting #2352\nFixed: Custom Fields PHP warnings #2415\nFixed: Using custom SVGs with colors can sometimes cause block errors #2411\n\n3.4.5\n\nFixed: Accordion containers incorrectly collapsed when placed inside columns\n\n3.4.4\n\nFixed: This update fixes some issues which were found in v3.4.3 in the Accordion and Image box blocks\nFixed: Accordion column height issues\nFixed: Hard to select the accordion block contents\nFixed: Containers with containers inside incorrectly inherit the parent container’s size styles\nFixed: Content alignment issue in the image box block\nFixed: Content vertical align option now works correctly in the icon box block #2404\n\n3.4.3\n\nNew: Added duration option for the Count Up block #2355\nNew: Added button alignment & full-width options for the Button Group block\nChange: Remove doubled Stackable icons in the block inserter #2383\nChange: Video popup now uses YouTube’s no-cookie domain #2392\nFixed: Buttons stacking on mobile adds a margin to some buttons #2249\nFixed: Full width buttons force other non-full width buttons to wrap text\nFixed: Multiple full width buttons in a group incorrectly wrap in mobile\nFixed: Buttons with borders sometimes show a thin white border\nFixed: Typing in a global color name is slow #2339\nFixed: Resetting max width doesn’t reset content horizontal align #2338\nFixed: Icon panel doesn’t close\nFixed: Icon list block contents are also copied when copying styles #2320\nFixed: Columns & Button group blocks show “add block” panel when used in reusable blocks & in widget editor #2371\nFixed: Dynamic content button is not aligned in link inspector control #2332\nFixed: Remove highlight toolbar button for button blocks #2314\nFixed: Icon is not visible in some notification block layouts #2323\nFixed: Position “sticky” doesn’t work as intended inside columns #2212\nFixed: Global typography does not show in tablet & mobile and in FSE #2340 & #2289\nFixed: Fatal error with Freemius in edge case when blog no longer exists in multisite\nFixed: ACF & Metabox dynamic content images show blurry #2064\nFixed: ACF & Metabox added image size selector for dynamic content image fields #2064\nFixed: Added single image field type support for Metabox\nFixed: Related map block scripts now do not appear in the frontend when no map block is used #2386\n\n3.4.2\n\nFixed: Editor speed performance improvements when editing blocks\nFixed: Error when saving a page when styling some blocks with PHP 8\nFixed: Taxonomies and post types now show up in Dynamic Content if you have more than 10\nFixed: Rare block error when using the highlight text color\nFixed: Updated Freemius SDK to 2.5.0 for PHP 8.1 support\n\n3.4.1\n\nNew: JetEngine post and taxonomy meta box integration with Stackable Dynamic Content\nFixed: Icon speed improvements\nFixed: Resizing the 1st column to 33.33% can make the second column wrap\nFixed: Added missing translation text domains\nFixed: Minor UI, warning & security fixes\n\n3.4.0\nIntroducing: Map Block\n* New: Map Block\n* Fixed: Editing Default Blocks now work when the Classic Editor plugin is activated\n3.3.5\n\nNew: Updated Stackable logos to the new one\nFixed: Font family picker cannot be clicked\nFixed: Posts block sometimes do not render correctly in the frontend\nFixed: In some servers the Posts Block won’t display columns side by side\n\n3.3.4\n\nNew: Metabox plugin integration with Stackable Dynamic Content\nFixed: Margin bottom indicators won’t show up when inside a native Row Block\nFixed: Dynamic Content field dropdown gets cut when inside a popover\nFixed: Icon block styles now work correctly when used inside a Query Loop block\nFixed: Block widths now collapse as expected when used in a Row Block\n\n3.3.3\n\nNew: WordPress 6.0 compatibility\nNew: Optimized selectors when combining CSS, this results in 40% less generated CSS size!\nFixed: Possible PHP 5.6 error\nFixed: Fixed background are now correctly forced to scroll and show up in iOS devices\nFixed: Some editor optimizations\n\n3.3.2\n\nNew: You can now select multiple designs in the Design Library\nFixed: Custom breakpoints do not work with Optimize Inline CSS\nFixed: Some overriding issues with Optimize Inline CSS and responsive styles\nFixed: The dynamic content popover can get hidden behind the editor’s sides / inspector / admin menu\nFixed: The contents of text highlight and dynamic content popovers go past their bounds\nFixed: Some slider controls now show the correct slider position at default\nFixed: Accordion block now opens on Windows if ‘Show Animations on Windows’ is turned off\nFixed: Column gap option also affects Icon Label block in the editor\nFixed: Sometimes theme colors do not show up in shadows and other color pickers\nFixed: Hovering your mouse over the corner of the column size indicator makes it flicker\nFixed: Icon list block bottom margin will not conflict with theme styles\nFixed: Overflow can sometimes not be followed when there is a border radius on a block\n\n3.3.1\n\nNew: Added block list in the getting started page\nFixed: Now loads JS scripts in the footer to prevent blocking the page render\nFixed: Inline CSS Optimization sometimes made Parent Hovered style work incorrectly (if this is happening to you, update your post)\nFixed: Image Box (v2) images sometimes won’t show in Chrome\n\n3.3.0\nSaving Block Defaults\n\nNew: You can now Save Block Defaults (Check out the Block Defaults panel in the Stackable sidebar)\nNew: Inline CSS Optimization\nFixed: Issues with Block Themes such as fullwidth & options missing\nFixed: Astra compatibility, some Gutenberg options are missing and fixed spacing\nFixed: LearnDash compatibility, Inspector shows blank when navigation panel is enabled\nFixed: WordPress 5.8.x compatibility, prevents block errors\nFixed: Fullwidth buttons no longer go past their containers\nFixed: Multiple Posts block with Load More buttons now work correctly\nFixed: Responsive toggles now work in the widgets editor, you can now edit tablet and mobile styles\nFixed: Posts Block Card variation was not showing the post title\nFixed: The last column of the native Posts block wraps sometimes when Global Typography is used\nFixed: Removed alignment option of the Icon Label block\nFixed: Block inserter doesn’t appear if the last block is a text block\nFixed: Hide button overlaps with long text in the table of contents block\nFixed: Long text in table of contents block gets cut when using columns\n\n3.2.0\nTable of Contents Block\n\nNew: Table of Contents block\nFixed: Button shadows don’t show when the button has a border radius\nFixed: Added button text alignment button\nFixed: Buttons do not wrap text\nFixed: Buttons and links get followed when previewing in tablet or mobile\nFixed: Using a video background with a top/bottom separator now shows the content correctly\nFixed: Card block Horizontal layout mobile collapse issue\nFixed: Image now clickable in the image card variation in the Posts block\nFixed: When changing typography color type to gradient for the first time, the text becomes transparent\nFixed: Enqueue CodeMirror only in Gutenberg, it might interfere with other plugins that use it\nFixed: Changing the block’s HTML tag now shows the block in the correct width in the editor\nFixed: Button block popover closes when clicking edit (v2)\n\n3.1.5\n\nNew: Navigation Panel\nFixed: Missing Featured Image in the Default Posts block variation\nFixed: Content order issues in the Posts block\nFixed: Content order Posts block always shows the reset button\nFixed: A block can show an error when saving without picking a layout\nFixed: The margin bottom resizer can be visible when picking a layout\nFixed: Security fixes\n\n3.1.4\n\nFixed: Blocks with variations couldn’t be added (free only)\nFixed: Layout switcher button doesn’t show\n\n3.1.3\n\nNew: You can now change the Layout after adding a block\nNew: Added Row Gap option in Icon List block\nNew: Added Horizontal 2 layout for the Posts block (inverse of Horizontal layout)\nFixed: Editor performance improvements\nFixed: Accordion block support for some older browsers\nFixed: Featured Image bottom margin can now be changed in the Posts block\nFixed: Sometimes line-height won’t get applied to the post titles in the Posts block\nFixed: Column resizer handlers now show correctly for nested column blocks\nFixed: Text and heading blocks now appear when in Content Editing Mode\nFixed: Added center, wide and fullwidth to the Header block\nFixed: Posts block Horizontal layout doesn’t collapse correctly in mobile\nFixed: Some Posts block content go past their containers in mobile\nFixed: Using custom color pickers can close the current popover\nFixed: Using rem font size shows the font size differently in mobile\nFixed: The button appender button is now on the right side of the block\nFixed: Alignment of the top & bottom lines of the header block now work in tablet/mobile correctly if there’s a desktop alignment provided\nFixed: Multiple copy and paste notifications won’t anymore fill up the screen\nFixed: Column styles can affect inner blocks in the editor\nFixed: Jetpack form goes side-by-side in the editor\nFixed: Hitting return while editing image dimensions in the size popover opens the Media Library\n\n3.1.2\n\nNew: WordPress 5.9 compatibility & FSE compatibility\nNew: Added Overlay Colors to the Image block – now you can add solid or gradient colored overlays!\nFixed: Clicking the expand block link scrolls the screen down\nFixed: Inspector tabs went behind the visible area when scrolling down\nFixed: Clearing a text highlight color, resets the highlight type.\nFixed: Possible PHP error when a custom post used in Dynamic Content becomes unavailable\n\n3.1.1\n\nNew: Added link option to the Image Block\nNew: Added back ability to change the column order when columns collapse in mobile (premium)\nNew: Added Post Taxonomies in dynamic content (premium)\nFixed: Trigger when all display conditions are met is not triggering properly\nFixed: Entrance animation speeds and delay do not take effect correctly\nFixed: Column gap and fit columns options now work in Feature Grid block\nFixed: Display conditions: post meta & site option true & false condition now works if the value is ”\nFixed: Display conditions: Post meta & site option contains & does-not-contain condition now works if the string matched is at the start of the string\nFixed: Content Vertical Align option prevents the responsive display options from being applied\nFixed: Top and bottom lines in Heading block not left aligning\nFixed: Icon block custom CSS not showing correctly in the editor\n\n3.1.0\nIntroducing: Wireframes\n\nNew: Added Wireframes in the Design Library\nChange: Removed plugin deactivation feedback\nFixed: Block alignments not inherited properly in tablet and mobile\nFixed: Text in post block not aligning in tablet and mobile\nFixed: Shadows in the design library are cut when viewing only a few designs\n\n3.0.7\n\nFixed: Button link popover is hard to close\nFixed: Less Content Layout Shift (CLS)\nFixed: Memory usage optimization (10% memory savings)\nFixed: Aligning content in tablet doesn’t inherit correctly in mobile\nFixed: Column gap in desktop collapses columns in tablet\nFixed: Unwanted delay when icons change color on hover\nFixed: Translations are now properly applied across the plugin\n\n3.0.6\n\nNew: Dynamic Content can now be used for link titles\nNew: Added Row Gap option for the Columns block\nFixed: Design Library won’t load designs in some server configurations\nFixed: Column collapsing in tablet and mobile now takes into account the column gap\nFixed: Resizing columns is jumpy when there is a column gap\nFixed: In some themes alignfull does not work properly\nFixed: Icon Button block styles get applied to the button instead of the background\nFixed: Prevent Column block from being added as a reusable block\nFixed: Added transform panel in the Separator block\nFixed: Error when saving an Icon block while having a non-administrator role in multisite\nFixed: Load more button now gets removed properly when all posts have loaded\nFixed: Added missing translations\nFixed: Updated FontAwesome script to use CDN\nFixed: Some WordPress 5.7 and 5.6 compatibility issues\n\n3.0.5\n\nFixed: Design library infinite loading spinner and fails to load design\nFixed: PublishPress workaround – Stackable blocks won’t load\nFixed: Posts block can affect the display of other Posts block in the editor\nFixed: Posts block won’t show featured image if size is not full\nFixed: Icon list columns flexbox issue\nFixed: Accordion block affects the icon of nested accordion blocks\nFixed: Pricing box alignment in some layouts\nFixed: Notification block close button can go out of the container\nFixed: Kadence compatibility – dots added to the blog posts meta (v2 block)\nFixed: Image box can have a small white gap if the container size has fractions in its widt (v2 block)\n\n3.0.4\n\nNew: Added note at the bottom of the Style tab in some blocks about how to style inner blocks.\nNew: Added tip to open the List View\nChange: Renamed Columns block to “Columns / Container” block\nFixed: Added another failsafe in case the frontend migration doesn’t get automatically enabled when v2 blocks are present.\nFixed: Removed small gap between full width blocks in the editor so they look merged together\nFixed: Separator now preserve aspect ratio correctly in mobile\n\n3.0.3\n\nNew: Added a modal popup to help with the migration process to version 3\nNew: Shadow options can now be styled on hover\nFixed: Block widths when nested\nFixed: Column content widths sometimes didn’t apply especially when nested\nFixed: Layout styles of the Blog Posts and Card block\nFixed: The image cannot be selected some Card block layouts\nFixed: Posts Block title tag can’t be changed\nFixed: Remove unwanted bottom margin in columns\nFixed: Content Vertical Align did not apply\nFixed: Icon Label block icon gap showing incorrectly in the backend when you have multiple icon labels\nFixed: PHP warning for themes using theme.json\nFixed: Feature block horizontal layout didn’t show as horizontal\nFixed: Image Box block layouts were not aligned correctly\nFixed: Image placeholder height now shows correctly\nFixed: Blocks can be linked together if creating multiple columns at once\nFixed: Compatibility with wide/full align when Kadence blocks is enabled\nFixed: Fixed typo in the wizard text\n\n3.0.2\n\nFixed: Compatibility with some plugins when backward compatibility with v2 blocks is enabled\nFixed: Backward compatibility with v2 blocks now work with reusable blocks\nFixed: Possible too many redirects when going to the wizard\n\n3.0.1\n\nFixed: The onboarding / migration wizard sometimes did not appear\nFixed: Auto-updating to v3 doesn’t perform the migration process immediately\n\n3.0.0\nHow To Shift From Version 2 to Version 3\n\nNew: New version 3 blocks (old version 2 blocks will still be available)\nNew: Completely new way to use Stackable blocks\nNew: Now very lightweight\nNew: Advanced Columns which are immensely responsive (you can control how they collapse in tablet and mobile)\nNew: Style blocks when they’re hovered\nNew: Dyanmic Breakpoints\nNew: Stackable Custom Fields (premium)\nNew: Use Dynamic Content in images, buttons, and other content (premium)\nNew: Motion Effects (premium)\nNew: Conditionally Display blocks (premium)\nNew: A lot more\n\n2.17.1\n\nFixed: Compatibility fix with Toolset\nFixed: Turning on Optimization settings prevents global colors from working in Divider block colors\nFixed: When no aria-label is given in Image Box blocks, role=”img” is no longer added\nFixed: WordPress 5.8 compatibility issues\nFixed: Removed some attributes which should not be included when copy and pasting styles\n\n2.17.0\nCustom Attributes and Optimization\n\nNew: You can now add your own Custom Attributes in Stackable blocks\nNew: You can now opt to only load JS and CSS frontend files only in pages that use Stackable blocks\nFixed: The featured image in blog posts blocks now correctly use the image’s alt text\nFixed: JS error encountered when a global color becomes null\nFixed: Icon block’s icon alignment issue when align is set to right\nFixed: Compatibility with WP Review Pro in the blog posts block\nFixed: Possible PHP warning when encountering a block without attributes when loading Google Fonts\nFixed: Possible dynamic content PHP warning\nFixed: Block error with ACF Pro when using Wysiwyg fields from Options pages as dynamic content\nFixed: Container links should not be included when copy and pasting styles\nFixed: Increased clamped padding in tablets from 30 to 100\nFixed: Updated documentation links\nFixed: The icon’s column gap did not take effect in mobile\n\n2.16.0\nClickable Containers and Pagination\n\nNew: Containers in some blocks can now become links\nNew: Added pagination to the Blog Posts block (premium)\nChange: Increased the minimum PHP to 5.6\nFixed: Jetpack social sharing buttons won’t show up anymore in the blog posts block excerpt\nFixed: Compatibility with WP Review Pro in the blog posts block\nFixed: The Video Popup block play button can be misaligned\nFixed: Right and bottom Container paddings in tablet and mobile are interchanged\nFixed: Global colors can have an error when colors are set to null\nFixed: A vertical scrollbar can be present in the block editor\n\n2.15.3\n\nFixed: Backward compatibility with WordPress 5.6\nChange: Increased minimum compatibility of Stackable to at least WordPress 5.5.4\n\n2.15.2\n\nFixed: Constant naming issue in PHP 5.3\n\n2.15.1\n\nFixed: E_PARSE PHP warning\nFixed: Deprecated warning shown in PHP 8\n\n2.15.0\nIntroducing Dynamic Content\n\nNew: You can now add Dynamic Content to your blocks from the Dynamic Fields toolbar button (premium)\nFixed: Changed “Gutenberg plugin is active” notice message to be clearer\nFixed: Team Member block image now doesn’t grow bigger than its container\nFixed: Global color reset popover width\nFixed: Corrected custom CSS selector name in the blog post block\n\n2.14.2\n\nFixed: Added Auto Block Recovery support for reusable blocks\nFixed: Video Popup block play button SEO and accessibility issues\nFixed: Possible PHP undefined variable warning in global settings\nFixed: Image border radius now properly shows in mobile for the Feature block\nFixed: Gradient backgrounds would overlap if there’s a border in Column blocks\nFixed: Picking a global color did not visibly show as active\nFixed: Text highlight toolbar button now shows pressed state when active\nFixed: Block title and Block description spacing in some blocks didn’t get applied\nFixed: Count Up and Notification block’s icon alignment not working in tablet and mobile\nFixed: Some em units did not display as active\nFixed: Missing stretch class in Feature block\nFixed: Disabled html editing in the Accordion block\nFixed: Text of some blocks now are blank when you first add them so you can type immediately\nFixed: Get the correct color from custom properties in Icon List block icons\nFixed: Better color picker support for Neve Theme colors\nFixed: Image Box block now properly adds min-height\n\n2.14.1\n\nFixed: Compatibility adjustments for WordPress 5.7\nFixed: Advanced tab can sometimes be visible in the Styles tab\n\n2.14.0\nCopy and Paste Block Styles\n\nNew: You can now copy and paste Stackable and native block styles! (premium)\nNew: Added block previews\nFixed: Feature Grid block container image is always set to cover\nFixed: Removed inapplicable margin/padding unit in separators\nFixed: Accordion text content can be a bit blurry\nFixed: Don’t enqueue blank Google Fonts in Global Settings\nFixed: Expand block text color doesn’t apply in backend\nFixed: Icon block, title alignment in tablet and mobile did not apply\nFixed: Auto block recovery should not affect v1 blocks\nFixed: Margins of the Icon block title won’t apply\n\n2.13.4\n\nFixed: Issue with styling duplicated blocks\nFixed: Accordion block migration error\nFixed: Google Fonts possible enqueueing issue\n\n2.13.3\n\nNew: You can now select titles to use Pargraph tags instead of H1-H6\nFixed: Can’t convert reusable blocks to regular blocks\nFixed: Some inspector style conflicts\nFixed: Nested Accordion block arrows did not rotate when opened\nFixed: Feature Grid image shape for the column is now working\nFixed: Clicking on the default quote icon in the Blockquote block\n\n2.13.2\n\nFixed: Accordion SEO issue with heading levels\nFixed: Blocks didn’t re-render when some props changed\nFixed: Don’t show number spacing for some layouts\n\n2.13.1\n\nFixed: Blog posts block load more button stopped working\nFixed: Number box alignment does not apply for some layouts\n\n2.13.0\nUI Kits, Borders & Improved Performance\n\nNew: UI Kits, check the Design Library\nNew: Border options for all blocks\nNew: Inspector performance improvements\nNew: Added ID anchor tags to all blocks\nNew: Revamped getting started page\nNew: Compatibility with WordPress 5.6\nNew: Gave the Design Library window a face lift\nFixed: Blog Posts block now handle custom taxonomies in posts and pages correctly\nFixed: Blog Posts block now shows the correct number of entries when specifying post IDs\nFixed: Expand block typography can sometimes not apply in the frontend\nFixed: Blockquote block background image tint not working\nFixed: Global Settings will no longer show up when in content only editing mode\nFixed: PHP error when other plugins use the plugin_action_links filter incorrectly\nFixed: Some slider controls are stuck on the left when moving them\n\n2.12.2\n\nFixed: WordPress 5.4 compatibility\nFixed: Blocks without a layout tab would not show options when they’re first added\nFixed: Some image width options won’t respond\n\n2.12.1\n\nFixed: Blog Posts block filter wasn’t called correctly.\n\n2.12.0\nBetter User Interface and User Experience\n\nNew: You can now pick multiple categories / taxonomies in the Blog Posts block\nNew: Improved UX/UI for the block inspector and popups\nNew: Speed improvements when editing block styles\nFixed: Now easier to set left/right paddings to zero\nFixed: Compatibility issue when coming from a Stackable beta build\nFixed: Some disabled toggle buttons did not display as disabled\nFixed: Unable to reset range controls when the value has been previously changed\nFixed: Do not include post attributes when importing Blog Posts block designs\nFixed: SEO warning about duplicate id attributes\nFixed: A few CSS styling issues with some block layouts\nFixed: Some JavaScript warnings\n\n2.11.4\n\nNew: Redesigned responsive toggles to make them easier to use and discover\nNew: Added deactivation notice when the Gutenberg plugin is detected to be activated\nNew: Added settings and Go Premium links to the plugins page\nFixed: Possible error when you previously installed the beta version and updated to the released version\nFixed: Global colors can possibly show a warning if a theme has invalid colors\nFixed: Footer text was in the middle of the screen in the Stackable accounts page\n\n2.11.3\n\nFixed: Only add attribute identifiers in some native blocks if needed for Global Typography\nFixed: Partial compatibility with Gutenberg v9.1\n\n2.11.2\n\nFixed: Potential PHP warnings when generating global styles\n\n2.11.1\n\nFixed: Custom HTML block can result in invalid HTML and can cause frontend display issues\nFixed: Global colors can possibly show a warning\n\n2.11.0\nIntroducing Global Colors and Global Typography\n\nNew: Global Colors\nNew: Global Typography\nFixed: Speed improvements\nFixed: Some popup settings close right away when clicking in Firefox\nFixed: Blocksy compatibility when detecting dark colors\n\n2.10.4\n\nFixed: Some responsive font-sizes won’t apply\nFixed: Feature grid block default title tag shows as H2 in the Block Editor\n\n2.10.3\n\nFixed: Block errors in nested blocks\nFixed: PHP warning undefined index page\n\n2.10.2\n\nChange: Moved Stackable admin settings inside Settings menu\nFixed: Column blocks and other blocks that use innerBlocks do not auto-recover\nFixed: WordPress 5.4 compatibility\nFixed: Background color and image in Video Popup won’t apply\nFixed: Force removal of pseudo elements in the Blockquote block\nFixed: Kadence Theme color picker issue\nFixed: CORS error when editing in mobile or tablet if Stackable’s CSS files are located in a another domain. When it happens now, live responsive editing will just not work.\n\n2.10.1\n\nChange: Added “Other” options on the bottom of the admin settings\nFixed: Icon list text were flowing over the other lines in the editor\nFixed: Admin spinner was always visible\nFixed: Responsive hiding doesn’t show blocks on exactly 600px and 960px widths\nFixed: Load more button in Blog Posts block wasn’t centered correctly\nFixed: Typography mobile font size issue when inheriting clipped desktop values\nFixed: Group into Container was producing an error\nFixed: AdvancedToolbarControl fullwidth console warning\nFixed: Block bottom margin placeholder now correctly shows 35 instead of 0\nFixed: Images with labels can produce invalid block html output\nFixed: Console warning for alignRight when displaying block designs in the inspector\nFixed: Added aria-label “Play” in Video Popup block\nFixed: Max. Content Width option now gets inherited in tablet and mobile\nFixed: Min. Block Height option now gets inherited in tablet and mobile\nFixed: Block and column margins and paddings now get inherited in tablets\nFixed: Some styles will now get inherited in tablets also\nFixed: Block errors may appear and not auto-recover when using the Gutenberg plugin\n\n2.10.0\nBetter Responsive Controls, Better List Block Icons and Low-Highlight Effect\n\nNew: Better responsiveness controls: some tablet and mobile options do not automatically inherit desktop styles\nNew: You can now pick any icon for the Icon List block\nNew: You can now have different icons per line in the Icon List block\nNew: Additional icon options in the Icon List block\nNew: Icon size is now responsive in the Icon List block\nNew: Added low-highlight text formatting style\nNew: Now compatible with Kadence Theme global color palette\nNew: You can now select the text color for highlighted text styles\nFixed: Multisite or unfiltered HTML issue where some container styles do not reflect in the frontend\nFixed: Icon list block didn’t follow tablet and mobile column counts.\nFixed: Blog Posts Block doesn’t detect category and tag taxonomies for custom post types\nFixed: When in white label mode, the pricing tab still appears in the settings page\nFixed: Container blocks with small content widths have large paddings in mobile\n\n2.9.1\n\nFixed: Columns Block uneven columns\nFixed: PHP Rest API notice about register_rest_route used incorrectly.\nChange: Removed affiliate page\nChange: Removed main menu notification for a more unobtrusive experience\n\n2.9.0\nIntroducing: Live Responsive Editing\n\nNew: Responsive Preview and Editing!\nNew: Multi-block editing support\nNew: Improved styling for the admin settings\nNew: Complete WordPress 5.5 support\nFixed: Separator can show a thin white line sometimes\nFixed: Divider block alignment not being applied\nFixed: Column gap option not working in Icon Block\nFixed: Expand block showed wrong heading tag in the editor\nFixed: PHP Rest API notice about register_setting used incorrectly.\n\n2.8.0\nIntroducing: Role Manager for Gutenberg\n\nNew: User Role Manager (premium)\nNew: Updated URL picker\nNew: Added alt text for image using title and subtitle in Image Box block.\nFixed: Partial WordPress 5.5 compatibility\nFixed: Responsive breakpoint for hiding in desktop.\nFixed: Missing guided CSS rules for Card Block (premium).\nFixed: Only show Stackable menu for users that have the manage_options capability\nFixed: Text transform “normal” was not working as expected.\nFixed: IconButton deprecation warnings.\nFixed: Disabling the title can possibly make the Image Box block error out\nFixed: Social buttons give block errors in Team Member blocks.\n\n\n\n\nMeta\n\n\n\t\t\t\tVersion: 3.7.2 \n\n\t\t\t\tLast updated: 1 month ago \n\n\t\t\t\tActive installations: 80,000+ \n\n\t\t\t\t\tWordPress Version:\t\t\t\t\t\n\t\t\t\t\t\t6.0 or higher\t\t\t\t\t\n\n\n\t\t\t\t\tTested up to: 6.2 \n\n\t\t\t\t\tPHP Version:\t\t\t\t\t\n\t\t\t\t\t\t5.7 or higher\t\t\t\t\t\n\n\n\t\t\t\t\tLanguages: \n\t\t\t\t\t\t\tSee all 8\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\tClose\t\t\t\t\t\t\t\n\nEnglish (US), French (France), Italian, Norwegian (Bokmål), Portuguese (Brazil), Russian, Spanish (Spain), and Ukrainian.\n\nTranslate into your language \n\n\n \nTags: blocksgutenberggutenberg blockspage builderwordpress blocks\n\nAdvanced View \n\nRatings See all\n\n \n\n\n\n5 stars\n\n\n\n354\n\n\n\n\n4 stars\n\n\n\n13\n\n\n\n\n3 stars\n\n\n\n9\n\n\n\n\n2 stars\n\n\n\n1\n\n\n\n\n1 star\n\n\n\n3\n\n\n\n\nLog in to submit a review.\n\nContributors\n\n\n \n\t\t\t\t\tBenjamin Intal\t\t\t\t\n\n\n \n\t\t\t\t\tgambitph\t\t\t\t\n\n\n \n\t\t\t\t\tFreemius\t\t\t\t\n\n\nSupport Issues resolved in last two months:\n\n\n\n\n\n\t\t\t\t\t3 out of 6\t\t\t\t\n\n\nView support forum\n\n \n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fwordpress.org%2Fplugins%2Fstackable-ultimate-gutenberg-blocks%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/plugins/browse/favorites/",
        "https://wordpress.org/plugins/browse/beta/",
        "https://wordpress.org/plugins/developers/",
        "https://downloads.wordpress.org/plugin/stackable-ultimate-gutenberg-blocks.3.7.2.zip",
        "http://gambit.ph",
        "https://wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/#description",
        "https://wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/#reviews",
        "https://wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/#installation",
        "https://wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/#developers",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/",
        "https://wpstackable.com?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://demo.wpstackable.com?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/columns-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/advanced-heading-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/advanced-text-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/icon-list-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/button-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/icon-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/horizontal-scroller-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/countdown-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/table-of-contents-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog-posts-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/image-box-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/video-popup-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/progress-circle-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/progress-bar-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/accordion-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/map-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/card-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/count-up-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/number-box-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/notification-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/expand-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/separator-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/header-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/call-to-action-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/feature-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/feature-grid-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/pricing-table-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/testimonial-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/team-member-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blockquote-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/compatibility/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://demo.wpstackable.com?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-new-horizontal-scroller-and-countdown-blocks/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-new-progress-circle-and-progress-bar-blocks/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/improved-performance/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-map-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/saving-block-defaults/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/table-of-contents-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-wireframes/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/how-to-shift-from-version-2-to-version-3/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/custom-attributes-and-optimization/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/clickable-containers-and-pagination/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-dynamic-content/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/copy-and-paste-block-styles/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/ui-kits-borders/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/better-user-interface-and-user-experience/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/global-colors-and-global-typography/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/better-responsive-controls-better-list-block-icons-low-highlight-effect/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-live-responsive-editing/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-role-manager-for-gutenberg/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/new-icon-block-amazing-icons-and-font-awesome-pro/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/new-advanced-blocks-and-load-more-blog-posts-button/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/better-onboarding-for-first-time-users/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-the-advanced-columns-and-grid-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-the-design-library-and-new-block-designs/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/welcome-video-better-separators-and-auto-block-recovery/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/help-video-snippets-auto-expand-settings/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/version-2-is-out/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://docs.wpstackable.com?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "http://eepurl.com/dJY9xI",
        "https://www.facebook.com/groups/wpstackable/",
        "https://twitter.com/wpstackable",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/?rate=5#new-post",
        "https://ps.w.org/stackable-ultimate-gutenberg-blocks/assets/screenshot-1.gif?rev=2635655",
        "https://ps.w.org/stackable-ultimate-gutenberg-blocks/assets/screenshot-2.gif?rev=2635655",
        "https://ps.w.org/stackable-ultimate-gutenberg-blocks/assets/screenshot-3.gif?rev=2635655",
        "https://ps.w.org/stackable-ultimate-gutenberg-blocks/assets/screenshot-4.gif?rev=2635655",
        "https://ps.w.org/stackable-ultimate-gutenberg-blocks/assets/screenshot-5.gif?rev=2635655",
        "https://wpstackable.com/premium/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://demo.wpstackable.com?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wordpress.org/support/topic/just-perfect-632/",
        "https://profiles.wordpress.org/newshopdev/",
        "https://wordpress.org/support/topic/great-block-plugin-2/",
        "https://profiles.wordpress.org/thecatweasel/",
        "https://wordpress.org/support/topic/stackable-2/",
        "https://profiles.wordpress.org/navajamm/",
        "https://wordpress.org/support/topic/stackable-page-builder-gutenberg-blocks/",
        "https://profiles.wordpress.org/books95/",
        "https://wordpress.org/support/topic/great-plugin-36481/",
        "https://profiles.wordpress.org/rawrbear/",
        "https://wordpress.org/support/topic/great-plugin-36480/",
        "https://profiles.wordpress.org/jenteck/",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/",
        "https://profiles.wordpress.org/bfintal/",
        "https://profiles.wordpress.org/gambitph/",
        "https://profiles.wordpress.org/freemius/",
        "https://translate.wordpress.org/projects/wp-plugins/stackable-ultimate-gutenberg-blocks/contributors",
        "https://translate.wordpress.org/projects/wp-plugins/stackable-ultimate-gutenberg-blocks",
        "https://plugins.trac.wordpress.org/browser/stackable-ultimate-gutenberg-blocks/",
        "https://plugins.svn.wordpress.org/stackable-ultimate-gutenberg-blocks/",
        "https://plugins.trac.wordpress.org/log/stackable-ultimate-gutenberg-blocks/",
        "https://plugins.trac.wordpress.org/log/stackable-ultimate-gutenberg-blocks/?limit=100&mode=stop_on_copy&format=rss",
        "https://wpstackable.com/blog/introducing-new-horizontal-scroller-and-countdown-blocks/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-new-progress-circle-and-progress-bar-blocks/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/improved-performance/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-map-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/saving-block-defaults/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/table-of-contents-block/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-wireframes/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/how-to-shift-from-version-2-to-version-3/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/custom-attributes-and-optimization/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/clickable-containers-and-pagination/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-dynamic-content/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/copy-and-paste-block-styles/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/ui-kits-borders/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/better-user-interface-and-user-experience/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/global-colors-and-global-typography/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/better-responsive-controls-better-list-block-icons-low-highlight-effect/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-live-responsive-editing/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wpstackable.com/blog/introducing-role-manager-for-gutenberg/?utm_source=wp-repo&utm_campaign=readme&utm_medium=link",
        "https://wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://fr.wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://it.wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://nb.wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://br.wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://ru.wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://es.wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://uk.wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/",
        "https://translate.wordpress.org/projects/wp-plugins/stackable-ultimate-gutenberg-blocks",
        "https://wordpress.org/plugins/tags/blocks/",
        "https://wordpress.org/plugins/tags/gutenberg/",
        "https://wordpress.org/plugins/tags/gutenberg-blocks/",
        "https://wordpress.org/plugins/tags/page-builder/",
        "https://wordpress.org/plugins/tags/wordpress-blocks/",
        "https://wordpress.org/plugins/stackable-ultimate-gutenberg-blocks/advanced/",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/?filter=5",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/?filter=4",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/?filter=3",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/?filter=2",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/reviews/?filter=1",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fwordpress.org%2Fsupport%2Fplugin%2Fstackable-ultimate-gutenberg-blocks%2Freviews%2F%23new-post&locale=en_US",
        "https://profiles.wordpress.org/bfintal/",
        "https://profiles.wordpress.org/gambitph/",
        "https://profiles.wordpress.org/freemius/",
        "https://wordpress.org/support/plugin/stackable-ultimate-gutenberg-blocks/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}