{
    "title": "History - About USC",
    "body": "\n\n\n\nShow Navigation\nSkip to Content\n\nUniversity of Southern California\nAbout USC\nFacts and Figures\nAdministration\nFaculty Honors\nHistory\nPolicies and Core Documents\n\n\n\n\nSearch for:\n\n\nSearch\n\n\n\n\n\nHistory\n\nLos Angeles was a rough-and-tumble frontier town in the early 1870s, when a group of public-spirited citizens led by Judge Robert Maclay Widney first dreamed of establishing a university in the region. It took nearly a decade for this vision to become a reality, but in 1879 Widney formed a board of trustees and secured a donation of 308 lots of land from three prominent members of the community – Ozro W. Childs, a Protestant horticulturist; former California governor John G. Downey, an Irish-Catholic pharmacist and businessman; and Isaias W. Hellman, a German-Jewish banker and philanthropist. The gift provided land for a campus as well as a source of endowment, the seeds of financial support for the nascent institution.\nWhen USC first opened its doors to 53 students and 10 teachers in 1880, the “city” still lacked paved streets, electric lights, telephones and a reliable fire alarm system. Today, USC is home to more than 48,000 students and over 4,400 full-time faculty, and is located in the heart of one of the biggest metropolises in the world.\n\n \nIn this section \nHistory\nThe Era of the Founders\nGallery of USC Presidents\nUSC’s Olympic Heritage\n\nTrojan Olympic Gallery\n\n\nUSC’s Commencement History\n\nPast Speakers and Honorary Degree Recipients\nUniversity Marshal\n\n\nTradition of Support for the Armed Forces\n \n\n\n\nTimeline\n\n2020s++2021: President Carol L. Folt announces that USC will be carbon-neutral by 2025. +2021: USC wins the Pac-12 Zero Waste Challenge for the 2021 football season. It’s the university’s third victory in the league wide competition focused on diverting the waste generated at home football games from landfills to recycling or composting. ++2021: The Presidential Medallion, the university’s top honor, was awarded to all of USC’s staff, faculty and health care professionals in recognition of their extraordinary work during the COVID-19 pandemic. +2021: A record 65 USC-affiliated athletes compete at the Tokyo Olympics. They bring home 21 medals, and the golden streak continues: USC has won a gold medal in every Summer Olympics since 1912. +2021: USC hires Christopher Manning as its first chief inclusion and diversity officer. The new leadership role will build a framework that reinforces USC’s commitment to inclusion, diversity, equity, and belonging and to address ongoing challenges of discrimination and bias. +++2020: USC shifted all its classes online in response to the COVID-19 global pandemic — a monumental behind-the-scenes effort taken up by teaching experts, administrators and information technology specialists to make the transition as smooth as possible. +2020: President Carol L. Folt announced a major financial aid expansion to benefit low- and middle-income families, extending USC’s long-time commitment to need-based funding by pledging more than $30 million in additional aid annually to expand the current pool. +2010s+2019: The Lord Foundation of California, which supports faculty research and teaching at USC, receives $260 million from the sale of LORD Corp. The foundation is expected to distribute proceeds to USC in 2020, making it USC’s largest-ever gift from a named donor. The gift would be used to bolster research and studies in areas including artificial intelligence, big data, analytics, and environmental sustainability+2019: USC’s newest academic building, Iovine and Young Hall, officially opens. The 40,000-square foot, state-of-the-art facility includes a dedicated “incubator” space for Trojan alumni.++2018: The USC Marshall of School of Business announces that more than 50 percent of its full-time MBA Class of 2020 are women — this gender parity is a first for top-tier U.S. business schools.+2017: USC Dana and David Dornsife College of Letters, Arts and Sciences professor Viet Thanh Nguyen receives a MacArthur Foundation Fellowship.+2017: USC researchers provide key analysis of the data gathered annually by the county and city of Los Angeles, as part of the university’s Initiative to Eliminate Homelessness.+2017: An independent economic impact study on USC showed that the university is one of California’s strongest economic engines. The study found that USC spurs $8 billion annually in economic activity in the Los Angeles region and California.2017: The Campaign for USC reached its $6 billion goal 18 months earlier than anticipated, securing its place among the most successful campaigns in higher education. The university extends its fundraising through 2021 to support high ambitions and access for students.+2016: USC alumni Oscar De Los Santos '15 and Jung Kian Ng B.S., M.S. ME ’14 were among 32 Americans who were awarded a prestigious Rhodes Scholarship to the University of Oxford.2016: USC Annenberg School for Communication and Journalism professor Josh Kun receives a MacArthur Foundation Fellowship.+++++2016: USC's Neighborhood Academic Initiative celebrates 25 years of preparing low-income neighborhood students for admission to a college or university.+2016: For the first time ever, women outnumbered men in USC's graduate video game design program - ranked #1 by Princeton Review for game design.+2015: Professor Dana Gioia was named California Poet Laureate by Governor Jerry Brown.+2015: The George Lucas Family Foundation endows the recruitment of USC Cinematic Arts students from communities underrepresented in the entertainment industry.+2015: A gift from Rick Caruso founds the USC Tina and Rick Caruso Department of Otolaryngology – Head and Neck Surgery to support advanced research for the field.+2015: In partnership with Los Angeles policymakers and educational institutions, USC lays out the strategic groundwork for the region's biotechnology corridor. ++2014: A gift from Ronnie Chan founds the USC Mrs. T.H. Chan Division of Occupational Science and Occupational Therapy, the first naming gift ever made in the field.++2014: The USC Men's Tennis team won the university's 100th national championship.+2013: The FDA approved the Argus II retinal prosthesis system, developed by University professor Mark Humayun and his team.+2013: Keck Medicine physicians become the first to implant the FDA-approved epilepsy-controlling device, the NeuroPace RNS.2013: Campaign for USC reaches a milestone, raising $3 billion in a record-breaking 3 years.+2013: USC School of Cinematic Arts opens the new Interactive Media Building, showcasing video game design, transmedia, and world building projects.+2013: Campus health gets an upgrade as the five-story, 101,000-square-foot USC Engemann Student Health Center opens. ++2012: In 2012, the university added its sixth arts school—The USC Glorya Kaufman School of Dance.+2011: USC Dana and David Dornsife College of Letters, Arts and Sciences professor Jacob Soll receives a MacArthur Foundation Fellowship. +2011: The School of Policy, Planning, and Development is renamed the USC Sol Price School of Public Policy with a $50 million gift from the Price Family Charitable Fund.2011: With a transformative gift of $150 million from the W. M. Keck Foundation, USC's academic medical enterprise is named Keck Medicine of USC.2011: USC receives $110 million from Julie and John Mork to create the Mork Family Scholars Program — USC’s largest single gift ever for undergraduate scholarships.2011: The country’s largest public literary festival, the Los Angeles Times Festival of Books, finds a new home on USC’s University Park Campus.2011: USC receives $200 million - the largest single gift in its history to date - from Dana and David Dornsife.+2011: Elizabeth Garrett is installed as USC's first female provost.2011: University Professor and historian Kevin Starr is inducted into the California Hall of Fame.2010: USC becomes the first academic institution in the world to be designated an International Safe Community by the World Health Organization.+2010: C. L. Max Nikias becomes the 11th president of USC. 2010: The Institute of International Education’s annual Open Doors report names USC the country’s leader in international student enrollment for the ninth year in a row.+2010: USC opens its sixth international office (and fifth in Asia) in Seoul, South Korea. 2000s2009: USC Gould School of Law professor and associate dean Elyn Saks receives a MacArthur Foundation Fellowship.2009: USC's ICT and School of Social Work launch a military social work and veteran services program, the first of its kind at a research university. +2009: USC ranks number one on the list “Saviors of Our Cities: A Survey of Best College and University Civic Partnerships,\" and scores highly on others. +2008: The White House awards the 2007 National Medal of Science to Andrew Viterbi, trustee, faculty member and namesake of the USC Viterbi School.2008: USC is ranked highly in the first national “Great Colleges to Work For” poll by The Chronicle of Higher Education.  +2008: The U.S. Department of State honors USC with one of four inaugural Benjamin Franklin Awards for Public Diplomacy. +2007:  USC professor of composition Morten Lauridsen receives the National Medal of Arts.2007: USC inaugurates the Discovery Scholars and Global Scholars programs to recognize undergraduates who demonstrate original scholarship and creativity.2007: The USC Edward R. Roybal Institute for Applied Gerontology is established. 2007: The USC Levan Institute for Humanities and Ethics is created, engaging students with the humanities and a particular focus on ethics and values.+2006: USC University Professor Kevin Starr is awarded the 2006 National Humanities Medal. 2006: An analysis by Economics Research Associates reports that USC is responsible for $4 billion annually in economic activity in Los Angeles County alone. 2006: The university announces the creation of the USC U.S.-China Institute. ++2005: The Princeton Review selects USC as one of 81 “Colleges with a Conscience” based on its outstanding record of community involvement. 2004: The Board of Trustees approves the university’s new strategic plan: “USC’s Plan for Increasing Academic Excellence.\"2004: The Los Angeles City Council dubs January 21 “USC Trojans’ Day in L.A.” to honor the university’s 2003 football, women’s volleyball, and men’s water polo teams. +2003: The U.S. Department of Homeland Security selects USC as its first Homeland Security Center of Excellence.2002: At the close of the “Building on Excellence” campaign, USC has raised $2.85 billion in nine years, a record in higher education fundraising.2001: The Association of American Colleges and Universities singles USC out as one of 16 “leadership institutions.” +2001: USC sponsors its first international conference, convened in Hong Kong. +2001: USC’s Robert Zemeckis Center for Digital Arts opens as the country’s first and only fully digital filmmaking training facility. 1990s+1999: Time magazine and the Princeton Review name USC “College of the Year 2000” in recognition of its outstanding community service. 1999: USC announces its distinctive Renaissance Scholars program. ++1999: In appreciation for a $110 million gift, USC's medical school is renamed the Keck School of Medicine of USC. 1999: USC launches the Institute for Creative Technologies, a partnership between the university, the U.S. Army and the entertainment industry. +1998: The General Alumni Association becomes the USC Alumni Association and adopts a new catchphrase: “lifelong and worldwide.”1998: The schools of public administration and urban planning merge to form the USC School of Policy, Planning, and Development. 1998: Alfred Mann gives $112.5 million to establish the Alfred E. Mann Institute for Biomedical Engineering at USC. 1997: For the 1997-98 academic year, USC for the first time in its history accepts fewer than half of the students who apply as new freshmen.1996: The USC President’s Distinguished Lecture Series is inaugurated.+1995: USC launches Friends and Neighbors Service Day, an annual “volunteer blitz” that teams students and community residents to clean up local neighborhoods.1994: USC Professor George Olah wins the Nobel Prize in chemistry. The USC Good Neighbors Campaign is inaugurated.+1993: USC launches the eight-year Baccalaureate/M.D. Program, a partnership between the college and the medical school.1993: Ambassador Walter H. Annenberg gives $120 million to create the USC Annenberg Center for Communication.+1991: Steven B. Sample becomes USC’s tenth president.1990: President James H. Zumberge announces that “The Campaign for USC” has raised $641.6 million and added more than a dozen new buildings.1980s1989: The Trojans’ new bookstore debuts, with one of the largest collections of trade journals and texts in Los Angeles.1989: USC becomes the first university in the world to offer a doctorate in occupational science. 1988: USC launches the Center for Scholarly Technology and the Institute for Molecular Medicine. +1987: With the opening of a Carl’s Jr. restaurant on campus, USC becomes the first U.S. institution of higher education to own and operate a fast-food franchise.1986: The university assumes stewardship of the historic Frank Lloyd Wright-designed Freeman House in the Hollywood Hills.1986: USC launches the Freshman Seminars, which address broad topics in contemporary research and scholarship. 1984: U.S. President Ronald Reagan visits USC before officially opening the Olympic Games.1984: The XXIIIrd Olympiad comes to Los Angeles, and University Park campus is the site of the largest Olympic Village. +1983: McDonald’s Olympic Swim Stadium opens on the University Park campus.+1983: Looking ahead to the summer Olympics in 1984, USC's 1983 Homecoming celebration includes \"A Salute to USC Olympians.\"+1982: USC inaugurates the annual Academic Honors Convocation to “honor the excellence that is in our midst.”1982: USC’s pathbreaking NIBS program (Neurological, Informational and Behavioral Sciences) begins training graduate students.1981: USC's Doheny Memorial Library celebrates the acquisition of its 2 millionth volume.+1980: USC celebrates its centennial, and James H. Zumberge becomes the university’s ninth president.1970s1979: Fleetwood Mac invites the Trojan Marching Band to perform on the title song for the album “Tusk,” which becomes the band’s first platinum album. +1977: USC establishes an institute dedicated to hydrocarbon research, later named the Donald P. and Katherine B. Loker Hydrocarbon Research Institute.1977: U.S. President Ford sends USC President Hubbard an autographed $10 bill to satisfy their wager on the Rose Bowl game in which USC defeated Michigan. 1976: Gerald R. Ford, 38th president of the United States, makes a campaign visit to USC.+1976: USC’s Black Alumni Association is founded.1976: USC launches its “Toward Century II” fundraising campaign, which will bring in over $309 million in five years. 1975: The USC Davis School of Gerontology is founded, the first of its kind in the country.1974:  USC receives a National Endowment for the Humanities grant for the development of Thematic Option, the university’s innovative undergraduate honors program.1974:  The USC Mexican American Alumni Association is established.1974: Dedeaux Field opens its gates, and USC’s baseball team wins its fifth straight NCAA title — to date still an unmatched record. 1974: The USC School of Urban and Regional Planning is founded. 1973: The USC Credit Union opens its doors.1972: The USC Information Sciences Institute is founded, providing key support for the development of the Internet into a national and international system.+1972: The USC Joint Educational Project (JEP) — one of the oldest service-learning programs in the United States — is launched.1971:  USC creates the Department of Emergency Medicine — the country’s first.1971: The USC Annenberg School for Communication (renamed the USC Annenberg School for Communication and Journalism in 2009) is established.1970: The USC student body votes to assess itself a fee for a student-sponsored scholarship fund, which becomes known as the Norman Topping Student Aid Fund.+1970: Historian John R. Hubbard is elected as USC’s eighth president. President Emeritus Norman Topping is elected as USC’s second chancellor.+1960s+1968: USC launches “The Urban Semester,” a program that sends students out of the classroom and laboratory and into the city streets and halls of power.+1966: The Gamble House is deeded to the City of Pasadena in a joint agreement with the USC School of Architecture.1965: Tailback Mike Garrett wins USC’s first Heisman Trophy.+1965: The USC School of Dentistry founds its mobile dental clinic, now the oldest and most extensive self-contained facility of its kind.+1961: On May 17, President Topping announces the “Master Plan for Enterprise and Excellence in Education.” ++1960: Then U.S. senator John Fitzgerald Kennedy and Vice President Richard Milhous Nixon speak at USC.1950s1959: The USC Associates, the university’s premier academic support group, is founded.+1958: Dr. Norman Topping becomes USC’s seventh president.1957: USC's tradition of on-campus pre-game picnics begins.1955: Psychologist J.P. Guilford’s famed “Structure of Intellect” theory proposes a 3-dimensional model of intelligence instead of a single IQ score.1954: For the first time, a white steed makes an appearance at a Trojan football game, with rider Art Gontier. USC’s first Songfest is held at the Greek Theater.1953: University Avenue (today’s Trousdale Parkway) is closed to vehicular traffic, marking a major step in creating a self-contained, pedestrian-friendly campus.1952: USC’s Institute for Safety and Systems Management begins offering degree programs in safety, human factors and systems management.\n\n\n\n1952: USC launches the first doctoral program in social work in the western United States.\n\n\n\n1952: USC’s Health Sciences campus opens.1950: USC English professor and distance-learning pioneer Frank Baxter is named by Life magazine as one of America’s eight finest college professors.1940s1948: Troy Camp is founded.1947: The University Senate (reorganized as the Faculty Senate in 1973 and renamed the Academic Senate in 1992) is formed at USC.1947: A feisty stray dog, nicknamed George Tirebiter, is adopted as USC’s official student body mascot. ++1947: Fred D. Fagg Jr. becomes USC’s sixth president. 1946: KUSC goes on the air.+1945: The USC Department of Drama is founded.1945: USC establishes biokinesiology and physical therapy departments (now merged into the Division of Biokinesiology and Physical Therapy).1943: In the midst of World War II, some 2,000 military trainees add to crowded conditions on campus.1942: USC’s Department of Occupational Therapy opens as one of the first programs of its kind in the country.1941: The tradition of passing the bell between rival schools is established. +1930s+1939: USC’s Elizabeth Holmes Fisher Gallery (now called the USC Fisher Museum of Art) is dedicated.1937: Gil Kuhn becomes the first Trojan football player to be drafted into the pros.1935: President Franklin Delano Roosevelt visits the USC campus and receives an honorary doctor of laws degree.1934: USC debuts its “University of the Air,” an educational outreach program broadcast on radio.+1932: USC’s Edward L. Doheny Jr. Memorial Library is dedicated.1930: With more than 700 foreign students (10 percent of the student body), USC ranks third in the United States in international enrollment.1930: The Trojan Shrine is unveiled in celebration of USC’s 50th anniversary.1920s1929: The USC School of Public Administration opens. USC’s Department of Cinema — the country’s first filmmaking program — is established. 1927: USC confers its first Ph.D. to David Welty Lefever in the School of Education. The USC College of Engineering is formed.1924: USC establishes the country’s first school of international relations. The university holds its first formal observance of homecoming.+1923: The USC Trojans play in the first varsity football game ever held at Los Angeles Memorial Coliseum, beating Pomona College 23–7.1923: The first Rose Bowl game is played in the present Pasadena location, with USC winning against Penn State 14–3.1922: USC creates an extension division, offering afternoon and evening courses to the community in locations ranging from Glendale to San Diego.+1922: USC dental student Milo Sweet composes the music for USC’s official fight song, “Fight On,” as an entry in a Trojan Spirit contest. 1921: Rufus B. von KleinSmid becomes USC’s fifth president.+1920: The USC School of Social Work is started by Emory Bogardus. USC's College of Commerce and Business Administration opens.1910s1919: USC’s Department of Architecture, the first program of its kind in Southern California, opens.1918: Mrs. Amy Winship, a girlhood friend of Abraham Lincoln, attends USC at age 87 and is fondly nicknamed “the oldest co-ed in the world.” 1915: Emory Bogardus, later famed for research on immigration, race, and ethnicity, founds the USC sociology department.  +1915: Ten-year-old Teresa Van Grove enrolls at USC, making her the youngest Trojan.1914: The famous African-American political leader, educator and author Booker T. Washington visits the USC campus.1914: A group of international students founds the USC Cosmopolitan Club to “promote friendship” among students from Asia, Latin America and Europe. 1912: The university announces a groundbreaking course in automotive science, the first of its kind in the world.1912: The USC Faculty Wives’ Club is formed (renamed the Faculty Women’s Club in 1995). 1912: Freshman Fred Kelly ’16 becomes USC’s first Olympic gold medalist. Greek letter societies are established. +1912: Los Angeles Times sportswriter Owen R. Bird dubs USC’s spirited athletic team the “Trojans.” +1911: President William Howard Taft visits the USC campus.1910: USC organizes a centrally administered graduate program governed by a Graduate Council composed of senior faculty members.1900s1909: USC’s Department of Education opens, to attain full school status nine years later.1906: The USC Department of Physics offers coursework leading to degrees in civil and electrical engineering.1905: The Women’s Club of USC (renamed Town and Gown in 1927) is established to generate support for the university and its students.1905: The USC School of Pharmacy opens, as the first in Southern California. +1904: USC’s first Olympic athlete, Emil Breitkreutz ’06, brings home a bronze medal for the 800 meters.+1903: George Finley Bovard (brother of Marion McKinley Bovard) becomes USC’s fourth president.1902: USC’s second school newspaper, the Cardinal, is published. The monthly publication lives for a brief three numbers.1890s1897: USC begins offering courses in dentistry.1896: USC’s law school begins when a group of apprentices form a voluntary association to study under a prominent attorney. 1895: Rev. George W. White becomes USC’s third president. USC adopts cardinal and gold as its official colors. 1892: USC’s first student newspaper, a four-page weekly called The University Rostrum, appears. 1892: Dr. Joseph P. Widney (brother of Robert Maclay Widney, and first dean of the university’s medical school) becomes USC’s second president. +1880s1888: USC plays its first football game and trounces the opponent 16–0. +1885: USC receives a gift to create its first endowed faculty position, the John R. Tansey Chair in Christian Ethics. +1885: USC’s College of Medicine, the first in Southern California, is established. Eight alumni form USC’s first alumni association.+1884: USC holds its first commencement, with a graduating class of three students; a woman, Minnie Miltimore, is named class valedictorian.1884: USC’s school of music is founded.1881: USC’s first dormitory, Hodge Hall, is opened.+1880: USC formally opens, with 53 students and 10 faculty. A college of liberal arts, a university band and a debate team are established.1880: Marion McKinley Bovard is named the university’s first president, concurrently serving as professor of mental and moral philosophy and natural sciences.+1870s+1879: Judge Widney forms a board of trustees and secures a donation of 308 lots of land from three community leaders.+1871: Judge Robert Maclay Widney and other citizens in the frontier town of Los Angeles begin pursuing the idea of establishing an institution of higher education.+\n\n\n\n\nUSC Communications / Notice of Non-Discrimination / Privacy Notice \n\n\n\n\n\n\n\n",
    "links": [
        "#topnav",
        "#content-main",
        "//www.usc.edu/",
        "https://about.usc.edu/",
        "https://about.usc.edu/facts/",
        "https://about.usc.edu/administration/",
        "https://www.provost.usc.edu/faculty-distinctions/",
        "https://about.usc.edu/history/",
        "https://about.usc.edu/policies/",
        "https://about.usc.edu/history/",
        "https://about.usc.edu/history/founders/",
        "https://about.usc.edu/history/presidents/",
        "https://about.usc.edu/history/uscs-olympic-heritage/",
        "https://about.usc.edu/history/trojan-olympic-gallery/",
        "https://about.usc.edu/history/commencement/",
        "https://about.usc.edu/history/commencement/speakers-and-recipients/",
        "https://about.usc.edu/history/commencement/university-marshal/",
        "https://about.usc.edu/history/tradition-of-support-for-the-armed-forces/",
        "https://about.usc.edu/time-line/2022b/",
        "https://about.usc.edu/time-line/2022b/",
        "https://about.usc.edu/time-line/2022a/",
        "https://about.usc.edu/time-line/2022a/",
        "https://about.usc.edu/time-line/2021f/",
        "https://about.usc.edu/time-line/2021e/",
        "https://about.usc.edu/time-line/2021d/",
        "https://about.usc.edu/time-line/2021d/",
        "https://about.usc.edu/time-line/2021c/",
        "https://about.usc.edu/time-line/2021b/",
        "https://about.usc.edu/time-line/2021a/",
        "https://about.usc.edu/time-line/2020d/",
        "https://about.usc.edu/time-line/2020d/",
        "https://about.usc.edu/time-line/2020c/",
        "https://about.usc.edu/time-line/2020c/",
        "https://about.usc.edu/time-line/2020b/",
        "https://about.usc.edu/time-line/2020a/",
        "https://about.usc.edu/time-line/2019e/",
        "https://about.usc.edu/time-line/2019e/",
        "https://about.usc.edu/time-line/2019c/",
        "https://about.usc.edu/time-line/2019c/",
        "https://about.usc.edu/time-line/2019a/",
        "https://about.usc.edu/time-line/2019a/",
        "https://about.usc.edu/time-line/2018b/",
        "https://about.usc.edu/time-line/2018b/",
        "https://about.usc.edu/time-line/2017g/",
        "https://about.usc.edu/time-line/2017g/",
        "https://about.usc.edu/time-line/2017e/",
        "https://about.usc.edu/time-line/2017e/",
        "https://about.usc.edu/time-line/2017c/",
        "https://about.usc.edu/time-line/2017c/",
        "https://about.usc.edu/time-line/2016l/",
        "https://about.usc.edu/time-line/2016l/",
        "https://about.usc.edu/time-line/2016e2/",
        "https://about.usc.edu/time-line/2016e2/",
        "https://about.usc.edu/time-line/2016e/",
        "https://about.usc.edu/time-line/2016e/",
        "https://about.usc.edu/time-line/2016e-2/",
        "https://about.usc.edu/time-line/2016e-2/",
        "https://about.usc.edu/time-line/2016d2/",
        "https://about.usc.edu/time-line/2016d2/",
        "https://about.usc.edu/time-line/2016d/",
        "https://about.usc.edu/time-line/2016d/",
        "https://about.usc.edu/time-line/2016c/",
        "https://about.usc.edu/time-line/2016c/",
        "https://about.usc.edu/time-line/2015i/",
        "https://about.usc.edu/time-line/2015i/",
        "https://about.usc.edu/time-line/2015f/",
        "https://about.usc.edu/time-line/2015f/",
        "https://about.usc.edu/time-line/2015d/",
        "https://about.usc.edu/time-line/2015d/",
        "https://about.usc.edu/time-line/2015b/",
        "https://about.usc.edu/time-line/2015b/",
        "https://about.usc.edu/time-line/2014f/",
        "https://about.usc.edu/time-line/2014f/",
        "https://about.usc.edu/time-line/2014e/",
        "https://about.usc.edu/time-line/2014e/",
        "https://about.usc.edu/time-line/2014c/",
        "https://about.usc.edu/time-line/2014c/",
        "https://about.usc.edu/time-line/2014b/",
        "https://about.usc.edu/time-line/2014b/",
        "https://about.usc.edu/time-line/2014/",
        "https://about.usc.edu/time-line/2014/",
        "https://about.usc.edu/time-line/2013f-3/",
        "https://about.usc.edu/time-line/2013f-3/",
        "https://about.usc.edu/time-line/2013f/",
        "https://about.usc.edu/time-line/2013f/",
        "https://about.usc.edu/time-line/2013a/",
        "https://about.usc.edu/time-line/2013a/",
        "https://about.usc.edu/time-line/2013/",
        "https://about.usc.edu/time-line/2012d/",
        "https://about.usc.edu/time-line/2012d/",
        "https://about.usc.edu/time-line/2012-2/",
        "https://about.usc.edu/time-line/2012-2/",
        "https://about.usc.edu/time-line/2011i/",
        "https://about.usc.edu/time-line/2011a1/",
        "https://about.usc.edu/time-line/2011a1/",
        "https://about.usc.edu/time-line/2010a1/",
        "https://about.usc.edu/time-line/2010a1/",
        "https://about.usc.edu/time-line/2010a-3/",
        "https://about.usc.edu/time-line/2010a-3/",
        "https://about.usc.edu/time-line/2009a/",
        "https://about.usc.edu/time-line/2009/",
        "https://about.usc.edu/time-line/2008b/",
        "https://about.usc.edu/time-line/2008a/",
        "https://about.usc.edu/time-line/2006c1/",
        "https://about.usc.edu/time-line/2006c1/",
        "https://about.usc.edu/time-line/2006/",
        "https://about.usc.edu/time-line/2005c/",
        "https://about.usc.edu/time-line/2005c/",
        "https://about.usc.edu/time-line/2003b/",
        "https://about.usc.edu/time-line/2003b/",
        "https://about.usc.edu/time-line/2001b/",
        "https://about.usc.edu/time-line/2001a-2/",
        "https://about.usc.edu/time-line/2001a-2/",
        "https://about.usc.edu/time-line/1999c/",
        "https://about.usc.edu/time-line/1999c/",
        "https://about.usc.edu/time-line/1999a/",
        "https://about.usc.edu/time-line/1999a-2/",
        "https://about.usc.edu/time-line/1999a-2/",
        "https://about.usc.edu/time-line/2000/",
        "https://about.usc.edu/time-line/1995/",
        "https://about.usc.edu/time-line/1995/",
        "https://about.usc.edu/time-line/1994a/",
        "https://about.usc.edu/time-line/1994a/",
        "https://about.usc.edu/time-line/1991a/",
        "https://about.usc.edu/time-line/1991a/",
        "https://about.usc.edu/time-line/1988/",
        "https://about.usc.edu/time-line/1983b/",
        "https://about.usc.edu/time-line/1983b/",
        "https://about.usc.edu/time-line/1983a-2/",
        "https://about.usc.edu/time-line/1983a-2/",
        "https://about.usc.edu/time-line/1982b/",
        "https://about.usc.edu/time-line/1982b/",
        "https://about.usc.edu/time-line/1980a/",
        "https://about.usc.edu/time-line/1980a/",
        "https://about.usc.edu/time-line/1979/",
        "https://about.usc.edu/time-line/1976a-2/",
        "https://about.usc.edu/time-line/1976a-2/",
        "https://about.usc.edu/time-line/1972a-2/",
        "https://about.usc.edu/time-line/1972a-2/",
        "https://about.usc.edu/time-line/1970a/",
        "https://about.usc.edu/time-line/1970a/",
        "https://about.usc.edu/time-line/1970-2/",
        "https://about.usc.edu/time-line/1970-2/",
        "https://about.usc.edu/time-line/1968a/",
        "https://about.usc.edu/time-line/1968a/",
        "https://about.usc.edu/time-line/1966a/",
        "https://about.usc.edu/time-line/1966a/",
        "https://about.usc.edu/time-line/1965a-2/",
        "https://about.usc.edu/time-line/1965a-2/",
        "https://about.usc.edu/time-line/1961a/",
        "https://about.usc.edu/time-line/1961a/",
        "https://about.usc.edu/time-line/1961/",
        "https://about.usc.edu/time-line/1960a/",
        "https://about.usc.edu/time-line/1960a/",
        "https://about.usc.edu/time-line/1958b/",
        "https://about.usc.edu/time-line/1958b/",
        "https://about.usc.edu/time-line/1947a1/",
        "https://about.usc.edu/time-line/1947a1/",
        "https://about.usc.edu/time-line/1947a-2/",
        "https://about.usc.edu/time-line/1947a-2/",
        "https://about.usc.edu/time-line/1946-2/",
        "https://about.usc.edu/time-line/1946-2/",
        "https://about.usc.edu/time-line/1941/",
        "https://about.usc.edu/time-line/1939a/",
        "https://about.usc.edu/time-line/1939a/",
        "https://about.usc.edu/time-line/1932a/",
        "https://about.usc.edu/time-line/1932a/",
        "https://about.usc.edu/time-line/1923b/",
        "https://about.usc.edu/time-line/1923b/",
        "https://about.usc.edu/time-line/1922a/",
        "https://about.usc.edu/time-line/1922a/",
        "https://about.usc.edu/time-line/1921-2/",
        "https://about.usc.edu/time-line/1921-2/",
        "https://about.usc.edu/time-line/1915a/",
        "https://about.usc.edu/time-line/1912a-2/",
        "https://about.usc.edu/time-line/1912a-2/",
        "https://about.usc.edu/time-line/1911a/",
        "https://about.usc.edu/time-line/1911a/",
        "https://about.usc.edu/time-line/1904a/",
        "https://about.usc.edu/time-line/1904a/",
        "https://about.usc.edu/time-line/1903a/",
        "https://about.usc.edu/time-line/1903a/",
        "https://about.usc.edu/time-line/1892-2/",
        "https://about.usc.edu/time-line/1892-2/",
        "https://about.usc.edu/time-line/1888a/",
        "https://about.usc.edu/time-line/1888a/",
        "https://about.usc.edu/time-line/1885a-2/",
        "https://about.usc.edu/time-line/1885a-2/",
        "https://about.usc.edu/time-line/1884b/",
        "https://about.usc.edu/time-line/1884b/",
        "https://about.usc.edu/time-line/1880c/",
        "https://about.usc.edu/time-line/1880c/",
        "https://about.usc.edu/time-line/1880-3/",
        "https://about.usc.edu/time-line/1880-3/",
        "https://about.usc.edu/time-line/1879a/",
        "https://about.usc.edu/time-line/1879a/",
        "https://about.usc.edu/time-line/1878/",
        "https://about.usc.edu/time-line/1878/",
        "https://about.usc.edu/time-line/1870a/",
        "https://about.usc.edu/time-line/1870a/",
        "mailto:ucomm@usc.edu",
        "https://eeotix.usc.edu/notice-of-non-discrimination/",
        "https://www.usc.edu/privacy-notice"
    ]
}