{
    "title": "How can college students stay safe during the omicron surge? - CalMatters",
    "body": "\n\n \n\n\n\n\n\n\nYour must-read California news\n\n\nWe cover the biggest stories to help you stay informed. Sign up for our free newsletters.\n\n\nSIGN UP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet a digest of California news\n\n\nSign up for our free newsletters to follow the issues you care about the most.\n\n\n\n\nSIGN UP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\tClose\t\t\n\nYour nonprofit, nonpartisan state news.\nDonate\nAbout Us\n \n\n\nSearch for:\n\n\n\n \n\t\t\tSearch\t\t\n\n\n\nFacebook\nInstagram\nLinkedIn\nTwitter\nYouTube\n \nPolitics\n\nCalifornia Legislator Tracker\nVotebeat\nInside the Capitol\n\n\nJustice\n\nCalifornia Divide\nHousing\nImmigration\nLabor\n\n\nEconomy\n\nCalifornia’s Pension Crisis\nPoverty\n\n\nEducation\n\nCollege Beat\nDisaster Days\nK-12 Education\nHigher Education\n\n\nChildren and Youth\nEnvironment\n\nCalifornia Wildfires\nClimate Change\nDrought\nRising Seas\nWater\n\n\nHealth\n\nCoronavirus\nBreakdown: Mental Health\nDrug Costs\nWellness\n\n\nCommentary\n\nDan Walters\nMy Turn\nReader Reactions\n\n\nMultimedia\n\nExplainers\nData Points\nForce of Law\nGimme Shelter\nInteractives\nVideo\n\n\nNewsletter: WhatMatters\nEvents\nDONATE\nAbout Us\n\nNews and Awards\nImpact\nHow We’re Funded\nContact Us\nPolicies\nOur Team\nJobs and internships\nSponsorship\nCalMatters for Learning\n\n\n\n\n\n\n\t\t\tClose\t\t\nPolitics\n\nCalifornia Legislator Tracker\nVotebeat\nInside the Capitol\n\n\nJustice\n\nCalifornia Divide\nHousing\nImmigration\nLabor\n\n\nEconomy\n\nCalifornia’s Pension Crisis\nPoverty\n\n\nEducation\n\nCollege Beat\nDisaster Days\nK-12 Education\nHigher Education\n\n\nChildren and Youth\nEnvironment\n\nCalifornia Wildfires\nClimate Change\nDrought\nRising Seas\nWater\n\n\nHealth\n\nCoronavirus\nBreakdown: Mental Health\nDrug Costs\nWellness\n\n\nCommentary\n\nDan Walters\nMy Turn\nReader Reactions\n\n\nMultimedia\n\nExplainers\nData Points\nForce of Law\nGimme Shelter\nInteractives\nVideo\n\n\nNewsletter: WhatMatters\nEvents\nDONATE\nAbout Us\n\nNews and Awards\nImpact\nHow We’re Funded\nContact Us\nPolicies\nOur Team\nJobs and internships\nSponsorship\nCalMatters for Learning\n\n\n \n\nSkip to content\n\n\n\n\n Menu\n\n\n\n\nCalMatters\n\n\t\t\t\t\tCalifornia, explained\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\tOpen Search\t\t\n\n\n\n\n\n\nSearch for:\n\n\n\n \n\t\t\tSearch\t\t\n\n\n\n\n\nDonate\n\n Menu\n\n\n\n\n\n\nTrendingCalifornia Legislator Tracker\nCoronavirus Tracker\nStaying Sheltered\nCalifornia Drought Crisis\n \n\n\n\n\n\n\n\n\nPosted inCollege Beat \n\t\t\tHow can college students stay safe during the omicron surge? We asked four experts\t\t\n\n\n\n\nby\nSindhu Ananthavel,  Juhi Doshi,  Ryan Loyola and  Steven Vargas \nJanuary 21, 2022January 20, 2022 \nShare this: \n\n\n Students walk across campus at the California State University East Bay campus on Feb. 25, 2020. Photo by Anne Wernikoff for CalMatters\n\n\n\n\n\n\nIn summary\nWe asked four public health experts all your pressing questions about how to avoid catching omicron on campus.\n\n\nLea este artículo en español.\nWelp. Here we go again.\nFollowing record COVID-19 cases fueled by the omicron variant, many California colleges have gone remote during the first few weeks of instruction in 2022. It’s a decision made by all nine UC undergraduate campuses, most Cal State campuses, and prominent private universities like Stanford and USC. \nWhile students made it through a promising fall 2021 – with many taking in-person classes for the first time in 18 months – winter brought new stressors: the possibility of catching the new variant, having remote instruction extended indefinitely or even being sent home from campus.\n \n  \n\n“It feels like it’s out of my control and there’s nothing I can do about it,” said UC Santa Cruz junior Michael Wool. “It’s frustrating because it felt like we finally had almost what campus was like before.”\nOmicron is forcing students to adjust their preexisting notions about pandemic life. Out with the cloth masks and in with the N95s. Two marks on your vaccine card are now insufficient, as booster shots become widely available. But what exactly is safe to do on campus? And how can students best protect themselves?\nThe CalMatters College Journalism Network spoke with a panel of public health experts to get answers to all your omicron questions. (Their comments have been edited for length and clarity.)\n\nIf a university requires students to be vaccinated, boosted and masked, how much disruption to face-to-face teaching can we expect omicron to cause? \nDr. Jerika Lam, viral infection specialist, Chapman University: If we want to prevent remote learning from happening, we have to really be accountable and take precautions and protect ourselves and others, so that surge goes down. But it’s kind of like, you know, cause and effect. The effect will be remote learning if what we are doing right now is still being cavalier and just thinking that ‘Oh, this is a common cold.’\nDr. George Rutherford, epidemiologist, University of California San Francisco: I would hope we can keep (remote learning) just for the first couple of weeks, and I think that’s a realistic expectation. Hopefully it will be over after the omicron surge…That’s what the dynamics would suggest from other countries. \nDr. R. David Rebanal, assistant professor of public health, San Francisco State University: Booster requirements, along with masking are really good things — good things for public health, as well as good things for safe education environments. Campuses that have those kinds of requirements are going to do better, particularly in the spring. And so my message would be to follow those guidelines in terms of getting your vaccine or booster, continuing to wear masks in public places, and then let’s just see how it goes. \nDr. David Hardy, director of infectious diseases, Cedars-Sinai Medical Center: One of the things that we need to start doing with the pandemic is we need to start learning to live with it, as opposed to assuming that it’s all going to go away and everything is going to go back to normal. We need to move out of an emergency mindset and into a maintenance mindset, because coronavirus is probably going to be with us for several years at this point. \nStudies have shown that people who are vaccinated and boosted who get omicron, 85% of them do well. So even with the change that omicron has made, our vaccinations and boosting has held up. And if universities are truly requiring vaccinations and boosting and masking, then in-person learning can continue.\n\nOn some campuses where isolation rooms are limited, COVID-positive students are isolating in their regular dorm rooms with non-positive roommates. Is that safe? And what can roommates in this situation do to limit transmission? \nLam: Unfortunately, this is not safe for the uninfected roommates and they should take safety precautions to prevent themselves from getting infected. If the uninfected roommate is fully vaccinated and is boosted, the chance for them to get infected from their COVID-positive roommate will be much less than an uninfected roommate who is not fully vaccinated The uninfected roommate should wear a mask around the COVID-positive roommate for at least 10 days to protect themself. The dorm room should be ventilated as much as possible by opening a window or adding a fan, (and) the uninfected roommate should avoid in-person classroom learning and other activities until after they have received negative test results and remain symptom free. \nRutherford: Non-positive roommates have to leave. You can cohort people who are infected together, four people in a room who are infected, that’s not a problem. But in a single room with two other roommates you can’t limit transmission. I would test the others pretty carefully to make sure they’re uninfected before moving them out.\nRebanal: That is such a tough situation. I have a daughter who also is in college and recently this situation has come up. I think in a situation where you have nowhere else to go, the only thing you can do is to do things like stay masked, keep some distance, limit interaction with that student. Hopefully if that student is vaccinated and boosted, you’re more protected. You can open the window and that could help sort of limit the transmission. We know that this current version or strain of the virus is relentless and is very transmissible. \nHardy: I think that’s gonna be tough. Someone may be vaccinated and may be boosted, but they may have a health care concern that they may not want to necessarily make public, that makes them at more risk for progression of disease with the virus. Because we have to remember that people who have altered immune systems don’t respond to the vaccine and the booster, because it just doesn’t work for them. And because this is something that may not be necessarily public information, one really has to be careful about exposing a known COVID positive individual to anyone. If a university cannot, cannot give COVID negative a place to get away from — or I should really say COVID positive people a place to isolate, then that’s a problem. You’re creating a situation where you’re putting that negative person at risk. And that’s not fair. \n\nHow should college clubs approach holding their weekly meetings? \nLam: I would say without knowing the long term complications of COVID-19 infection, we should try to minimize getting infected. Meaning that we should try to have virtual meetings for at least the month of January until the surge flatlines or goes down. I would say just take a lot of precautions and if you don’t need to be there in person, please do it remotely for safety.\nRutherford: I think you should model what they’re doing in the classroom. So if classes are virtual, then meetings should be virtual. It depends on the size, obviously, and where they’re held. If it’s held outdoors and there are only three people, then you probably don’t need to worry about it too much.\n \n\n\n\n\nStay informed with our free newsletter that helps you hold your leaders accountable\n\n\n\n\n\n\n\n\nSIGN UP\n\n\t\t\t\tBy clicking subscribe, you agree to the Terms. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRebanal: I recognize how important it is for students to gather and to socialize.I’ve seen firsthand the mental health struggles of students who have to deal with isolation or less physical interactions with students. So college clubs play a huge role in the education and social lives of students. I think if there are ways to sort of mix things, like have a virtual model until further notice, or even gather outdoors if that’s possible — you know, we’re in California, I grew up in New York, we’re lucky enough that that is quite possible to do. And then maintaining the other things that we do, (such as) masking.\nHardy: We have the advantage in California of being able to be outdoors as much as possible. And I think that’s one advantage we should really recognize and use as a way to keep in-person meetings going, if possible. If not, then I think one needs to be cognizant of who’s vaccinated, who’s not, and who’s potentially at risk because of an immune-compromising condition. If someone decides that they do not want to come to an in-person meeting then they don’t have to. There could be a combination set up for that person to be able to join the meeting virtually, electronically. Having hybrid meetings is something that certainly is still going to be possible and still going to be done for a while. \n\nShould college students with three to five roommates be masking when interacting with each other within their home?\nLam: It depends on whether my roommates are vaccinated or not. If they’re all vaccinated, whether they’re boosted or not, they should not be masked as long as they test negative. But I would highly encourage students right now dorming in suites and maybe apartments, even in a dorm room with another roommate, to at least get tested twice a week.\nRutherford: As soon as everybody’s vaccinated and boosted, I think you treat them as family and let it go.\nRebanal:The guidelines about the households would be that you wouldn’t need to if you live together. By and large I think if you’ve don’t have any symptoms, and you don’t have any other reason to know that you’ve been exposed and you’re vaccinated, then I don’t think you would have to necessarily live in your house with a mask. \nHardy:  The public health teachings have been that if you’re in a nuclear, sort of family situation, your own little cocoon, then you don’t have to mask. What’s gonna upset that is the increased amount of testing we’re doing. Because everyone gets five tests a month from the federal government and they’re using them on a random basis. People are gonna pop up positive fairly frequently, also in the house. If you test, you’ve got to have a plan ready to go, how you’re going to handle that positive test. \nPeople get exposed to the virus in lots of different ways. Maybe one or two of the roommates out of five are not necessarily keeping themselves protected once they leave the home. The assumption is that when people leave the home, they’re masked constantly, but that may or may not be a mutual agreement that is recognized by all members of the household. I think there’s got to be some careful recognition that a group of roommates is like a family, and if they are going to not mask at home, that there are ground rules for how they’re going to interact with others outside.\nStudents sit on the lawn at UC Berkeley on March 12, 2020.  Photo by Anne Wernikoff for CalMatters\n\nWhen exactly after testing positive for COVID-19 should students get the booster shot?\nLam: Based on the current science, if the individual recently tested positive for COVID-19 infection, then that individual could get the booster vaccine once their symptoms have resolved and they have met the criteria to end isolation. For those who have received monoclonal antibodies as part of their COVID-19 treatment because they had moderate-to-severe symptoms – they will need to wait 90 days before getting the booster. \nRutherford: If they haven’t monoclonal antibodies for treatment, which probably most college students haven’t, you can get it pretty quickly. I’ve seen advice as low as five days. CDC doesn’t have any formal advice on this but I would wait probably at least a few weeks.\nRebanal: You should wait at least 10 days after your positive test, because of the isolation guidelines. I think as soon as that’s up, I think you should get a booster as soon as possible after that. \nHardy: They should’ve gotten the booster shot already done. Students are 18 and older. Boosters have been approved for people 18 and over since September last year. And so you know, people should’ve already gotten their boosters and if they haven’t, they need to get them right away. If someone’s symptomatic with COVID I wouldn’t give them the booster right then. I’d allow them to convalesce to get well and as soon as they’re well and they’re testing negative — which means they can come out of isolation — then they get the booster. \n\nMy friends aren’t boosted. Should I limit interaction with them?\nLam:  I don’t believe that isolation long term will work for anyone because we are a social community in general. I would say that for that friend who’s not boosted, that friend should be highly, strongly encouraged to get boosted because we know that immunity from vaccination does wane over time. The one dangerous caveat to all of this is that a lot of people don’t know the long term effects of infection from COVID. So even though we think Omicron is less dangerous, less virulent, I still have the virus in my body and we don’t know the consequential impact of that virus on my brain, on my heart or my vital organs, and that’s the unknown and the scary part. (So) I would still take precautions to hang out with my friend who is not boosted but will speak with (them) and ask why they haven’t gotten boosted.\nRutherford:  Yes.\nRebanal: We know that boosters have lessened the severity of those who get the virus. It doesn’t totally protect you from getting it, but you won’t get it as badly. It’s so important that we do the things we are empowered to do. It’s a tough thing, because are we talking about when someone’s already vaccinated, are we talking about someone who’s immunocompromised? That’s a different question. So in those instances you might want to template that a little bit differently.\nHardy: The people who are not boosted are much more vulnerable. Whenever someone gets ill with COVID from an exposure, they’re shedding virus more. The vaccine and the booster cut down on the length of time that someone is shedding the virus from maybe seven to 10 days down to maybe two or three days. But yeah, if someone didn’t get boosted, and they get sick, they’re more likely going to give you an exposure as well. I think in some ways, peer pressure here is a good thing. If someone’s not boosted, and people are saying, ‘Oh, that person is not coming to the party,’ that’s okay. \n\nWould you go to a dorm hangout with a handful of friends without a mask now?\nLam: Oh, definitely not. We would recommend small group gatherings, no more than six to eight people and making sure that you’re aware of their vaccination status. If it’s a gathering of 20+ people and you don’t really know their vaccination status, I would recommend to wear a mask indoors if possible, unless if you’re eating, making sure there’s ventilation in that setting. If it’s a restaurant, request for outdoor seating with heater lamps,  to make sure that there’s flow of air moving, and so that there is little risk of omicron lingering in the air for you to breathe in. \nRutherford: No. If you’re like a foursome in a room, yeah, I think that’s fine. But try not to combine. It depends on how many people, but you don’t want to dig in too deeply, and get exposed to too many people.\nRebanal: I think right now, the recommendation is to stay masked indoors until around Feb. 15, until the surge dies down. It’s better to be more cautious in using masks as much as possible during this surge.\n\nCan I go to a house party? And should I wear a mask while inside?\nLam: I would recommend out of out of safety and prudence not to go to any house parties for the month of January. It’s kind of like if you see embers glowing in the house and there is a fire in the corner,  would I go inside that house? Probably not. Because the next thing that will happen is that the fire will spread and I don’t want to be in a burning house. \nRutherford: You probably shouldn’t go to a house party, but if you are, wear a mask inside for sure.\nHardy:  A house party with people who you’re not living with within your family cocoon? You wear a mask, unless the party is outdoors. And if someone’s coughing, or someone’s having some sort of respiratory symptoms, then wear a mask even outdoors because they are potentially spreading the virus and you don’t know for sure. People may be familiar, but it doesn’t mean that they’re part of your cocoon. \n\nIs it safe to share a joint or cigarette with boosted friends? \nLam: Yeah, technically, it is safe. I mean, I know that we share drinks and we share food. And as long as a person is negative and not symptomatic, the person can share the joint with another friend who is not symptomatic and negative as well. \nRutherford: As long as no one’s infected.\nRebanal: Because there’s saliva, if you have a virus and you share almost immediately with someone, there is some level of risk, then, to transmit the virus. I think you have to take that into consideration if you’re doing that, and know that that’s a potential mode of transmission. \nI can understand the tribulation and confusion students have that is at tension with their desire to return to a more in person social setting. I think having information that lets people make the best decisions is really important.\n\n\nWe want to hear from you\n\n\n            Want to submit a guest commentary or reaction to an article we wrote? You can find our submission guidelines here. Please contact CalMatters with any commentary questions: commentary@calmatters.org\n\n\n \n\n\n\n\n\n\n“Getting accurate and incisive reporting with political analysis is critical. We need CalMatters.”\nLaurie, Danville\nFeatured CalMatters Member\n\n\n\n\nMembers make our mission possible.\n\n\n\nDonate\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nHome\nAbout Us\nDonate\nSubscribe\nSitemap\nTerms & Conditions\n \n\n\n© 2023 CalMatters.\n\n\t\t\t\t\tProudly powered by Newspack by Automattic\t\t\t\t\nPrivacy Policy \nFacebook\nInstagram\nLinkedIn\nTwitter\nYouTube\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://calmatters.org/subscribe-to-calmatters/",
        "https://calmatters.org/subscribe-to-calmatters/",
        "https://calmatters.fundjournalism.org/donate/?campaign=7015w000001ImtUAAS",
        "/about",
        "https://www.facebook.com/calmatters/",
        "https://www.instagram.com/calmatters/",
        "https://www.linkedin.com/company/calmatters/",
        "https://twitter.com/CalMatters",
        "https://www.youtube.com/channel/UCNQv9nDu2_r5zbgtUQungeA",
        "https://calmatters.org/category/politics/",
        "https://calmatters.org/legislator-tracker/home/",
        "https://calmatters.org/category/politics/votebeat/",
        "https://calmatters.org/category/politics/inside-california-capitol/",
        "https://calmatters.org/category/justice/",
        "https://calmatters.org/projects/california-divide/",
        "https://calmatters.org/category/housing/",
        "https://calmatters.org/category/immigration/",
        "https://calmatters.org/category/economy/labor/",
        "https://calmatters.org/category/economy/",
        "https://calmatters.org/category/economy/california-pension-crisis/",
        "https://calmatters.org/category/economy/poverty/",
        "https://calmatters.org/category/education/",
        "https://calmatters.org/projects/college-journalism-network/",
        "https://calmatters.org/category/education/disaster-days-school-closures-california-wildfire-guns-outage-flood/",
        "https://calmatters.org/category/education/k-12-education/",
        "https://calmatters.org/category/education/higher-education/",
        "https://calmatters.org/category/children-and-youth/",
        "https://calmatters.org/category/environment/",
        "https://calmatters.org/category/environment/california-wildfires/",
        "https://calmatters.org/category/environment/climate-change/",
        "https://calmatters.org/california-drought-water/",
        "https://calmatters.org/category/environment/rising-seas/",
        "https://calmatters.org/category/environment/water/",
        "https://calmatters.org/category/health/",
        "https://calmatters.org/category/health/coronavirus/",
        "https://calmatters.org/category/health/breakdown-mental-health/",
        "https://calmatters.org/category/health/drug-costs/",
        "https://calmatters.org/category/health/wellness/",
        "https://calmatters.org/category/commentary/",
        "https://calmatters.org/category/commentary/dan-walters/",
        "https://calmatters.org/category/commentary/my-turn/",
        "https://calmatters.org/category/commentary/reader-reactions/",
        "https://calmatters.org/category/multimedia/",
        "https://calmatters.org/category/multimedia/explainers/",
        "https://calmatters.org/category/multimedia/data-points/",
        "https://calmatters.org/projects/force-of-law-police-shootings-podcast/",
        "https://calmatters.org/category/multimedia/podcasts/gimme-shelter/",
        "https://calmatters.org/category/multimedia/interactives/",
        "https://calmatters.org/category/multimedia/video/",
        "https://calmatters.org/category/newsletters/whatmatters/",
        "https://events.calmatters.org/",
        "https://calmatters.fundjournalism.org/donate/?org_id=calmatters&campaign=701Du0000009X7mIAE",
        "https://calmatters.org/about/",
        "https://calmatters.org/about/news-and-awards/",
        "https://calmatters.org/about/impact/",
        "https://calmatters.org/about/funding/",
        "https://calmatters.org/about/contact-us/",
        "https://calmatters.org/about/policies-and-standards/",
        "https://calmatters.org/about/team/",
        "https://calmatters.org/about/jobs/",
        "https://calmatters.org/about/advertise/",
        "https://calmatters.org/forlearning/",
        "https://calmatters.org/category/politics/",
        "https://calmatters.org/legislator-tracker/home/",
        "https://calmatters.org/category/politics/votebeat/",
        "https://calmatters.org/category/politics/inside-california-capitol/",
        "https://calmatters.org/category/justice/",
        "https://calmatters.org/projects/california-divide/",
        "https://calmatters.org/category/housing/",
        "https://calmatters.org/category/immigration/",
        "https://calmatters.org/category/economy/labor/",
        "https://calmatters.org/category/economy/",
        "https://calmatters.org/category/economy/california-pension-crisis/",
        "https://calmatters.org/category/economy/poverty/",
        "https://calmatters.org/category/education/",
        "https://calmatters.org/projects/college-journalism-network/",
        "https://calmatters.org/category/education/disaster-days-school-closures-california-wildfire-guns-outage-flood/",
        "https://calmatters.org/category/education/k-12-education/",
        "https://calmatters.org/category/education/higher-education/",
        "https://calmatters.org/category/children-and-youth/",
        "https://calmatters.org/category/environment/",
        "https://calmatters.org/category/environment/california-wildfires/",
        "https://calmatters.org/category/environment/climate-change/",
        "https://calmatters.org/california-drought-water/",
        "https://calmatters.org/category/environment/rising-seas/",
        "https://calmatters.org/category/environment/water/",
        "https://calmatters.org/category/health/",
        "https://calmatters.org/category/health/coronavirus/",
        "https://calmatters.org/category/health/breakdown-mental-health/",
        "https://calmatters.org/category/health/drug-costs/",
        "https://calmatters.org/category/health/wellness/",
        "https://calmatters.org/category/commentary/",
        "https://calmatters.org/category/commentary/dan-walters/",
        "https://calmatters.org/category/commentary/my-turn/",
        "https://calmatters.org/category/commentary/reader-reactions/",
        "https://calmatters.org/category/multimedia/",
        "https://calmatters.org/category/multimedia/explainers/",
        "https://calmatters.org/category/multimedia/data-points/",
        "https://calmatters.org/projects/force-of-law-police-shootings-podcast/",
        "https://calmatters.org/category/multimedia/podcasts/gimme-shelter/",
        "https://calmatters.org/category/multimedia/interactives/",
        "https://calmatters.org/category/multimedia/video/",
        "https://calmatters.org/category/newsletters/whatmatters/",
        "https://events.calmatters.org/",
        "https://calmatters.fundjournalism.org/donate/?org_id=calmatters&campaign=701Du0000009X7mIAE",
        "https://calmatters.org/about/",
        "https://calmatters.org/about/news-and-awards/",
        "https://calmatters.org/about/impact/",
        "https://calmatters.org/about/funding/",
        "https://calmatters.org/about/contact-us/",
        "https://calmatters.org/about/policies-and-standards/",
        "https://calmatters.org/about/team/",
        "https://calmatters.org/about/jobs/",
        "https://calmatters.org/about/advertise/",
        "https://calmatters.org/forlearning/",
        "#main",
        "https://calmatters.org/",
        "https://calmatters.org/",
        "https://calmatters.fundjournalism.org/donate/?campaign=7015w000001ImtUAAS%20",
        "https://calmatters.org/legislator-tracker/home/",
        "https://calmatters.org/health/coronavirus/2020/03/california-coronavirus-by-the-numbers-cases-testing-masks-hospital-beds/",
        "https://calmatters.org/staying-sheltered/",
        "https://calmatters.org/california-drought-water/",
        "https://calmatters.org/category/education/higher-education/college-beat-higher-education/",
        "https://calmatters.org/author/sindhu-ananthavel/",
        "https://calmatters.org/author/juhi-doshi/",
        "https://calmatters.org/author/ryan-loyola/",
        "https://calmatters.org/author/steven-vargas/",
        "https://calmatters.org/calmatters-en-espanol/2022/01/como-pueden-los-estudiantes-universitarios-mantenerse-a-salvo-durante-la-oleada-de-omicron-preguntamos-a-cuatro-expertos/",
        "https://calmatters.org/health/coronavirus/2022/01/california-hospitals-predict-covid-crisis-will-last-4-6-weeks/",
        "https://calmatters.org/education/higher-education/college-beat-higher-education/2021/12/california-back-to-campus-under-covid/",
        "https://calmatters.org/about/policies-and-standards/#j-privacy-policy",
        "https://calmatters.org/submission-guidelines/",
        "mailto:commentary@calmatters.org",
        "https://calmatters.fundjournalism.org/donate/?campaign=7015w000001J3MlAAK",
        "https://calmatters.org/",
        "https://calmatters.org/about/",
        "https://calmatters.org/donate/",
        "https://calmatters.org/subscribe-to-calmatters/",
        "https://calmatters.org/sitemap/",
        "https://calmatters.org/about/policies-and-standards/#j-terms-and-conditions",
        "https://newspack.com/",
        "https://calmatters.org/privacy-policy/",
        "https://www.facebook.com/calmatters/",
        "https://www.instagram.com/calmatters/",
        "https://www.linkedin.com/company/calmatters/",
        "https://twitter.com/CalMatters",
        "https://www.youtube.com/channel/UCNQv9nDu2_r5zbgtUQungeA"
    ]
}