{
    "title": "Payment Methods – Student Financial Services – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Student Financial Services\n\t\t\t    \n                            SFIN Menu\n                        Show search box.Student Financial ServicesForms & ResourcesFormsPolicies & ProceduresHow Do I...Contact UsStudent Financial ServicesForms & ResourcesFormsPolicies & ProceduresHow Do I...Contact Us(opens in new window)Make a Payment(opens in new window)Org Chart (PDF)\n        Our Office\n        Location IconStudent Financial Services\n                                                                            Student Services Center, Room 230\n                                                                530-898-5936cash@csuchico.eduIn-Person Office Hours \n                                                                            8 a.m. – 4:45 p.m.\n                                                                \n                                                                                Monday - Friday\n                                                                     Phone Hours \n                                                                            8 a.m. – 4:45 p.m.\n                                                                \n                                                                                Monday - Friday\n                                                                    Mailing/Shipping Address\n                                                                            California State University, Chico\n                                                                \n                                                                                Student Financial Services - 0242\n                                                                \n                                                                                940 W 1st Street\n                                                                \n                                                                                Chico, CA 95929\n                                                                    SFINStudent AccountsCurrent page:  Payment Methods\n                        \n    \t\tPayment Methods\n    \tPay-By-MailYou may pay all registration, course fees, and on-campus housing installments by mail. Please send payments to the following address*:          California State University, Chico          Student Financial Services - 0242          940 W 1st Street          Chico, CA  95929*All CSU, Chico mail is delivered to a centralized campus distribution center and may require up to 48 hours of processing before final delivery to departments, including overnight parcels.  In addition, if you use the \"regular\" mailing address, for items sent through a carrier/courier service, there could be a longer delay in delivery to our office.  In order for payments to be considered on time, they must be received in Student Financial Services' Office.  Credit will not be given for mail received in the campus central distribution center.  Please plan accordingly.Make your check or money order payable to CSU, Chico. To ensure credit to the proper account, include the following information on your check or money order:Print your full legal nameChico State student ID numberDescription of what you are payingDo not mail cash.Payments in amounts greater than actual or anticipated university charges for the semester cannot be processed and will be returned.NOTE:  For a payment to be recorded in the current calendar year, it must be received in our office and applied to the student's account within the calendar year.Pay In PersonYou may also pay in person with a check, cash or Wildcat Card at Student Financial Services, Student Services Center (SSC) Room 230, during normal business hours.Payments in amounts greater than actual or anticipated university charges for the semester cannot be processed.Electronic Check PaymentsPayments for registration, tuition, and on-campus housing charges can also be made via electronic check(opens in new window). There is no fee for using this service.Payments in amounts greater than actual or anticipated university charges for the semester cannot be processed and will be returned.Credit Card PaymentsPayments are accepted for registration, tuition, and on-campus housing charges by MasterCard, Visa, American Express, or Discover using Transact SmartPay(opens in new window). Debit cards are treated the same as credit cards and will incur the service fee.The service fee for use of Transact SmartPay is 2.65%.  Payments in amounts greater than actual or anticipated university charges for the semester cannot be processed.International Payments \nStudents can now access Flywire, our international payment option, directly through their student center.    Log into your portal(opens in new window) and enter the student center.  In the student center, under the Financials section, select What I Owe, then click the Make A Payment button.  You will be taken over to our online payment platform, Transact.  In Transact, enter the amount you need/want to pay, click the make a payment button, then select International Payment as your payment method.Payments in amounts greater than actual or anticipated university charges for the semester cannot be processed and will be rejected and returned.\nDishonored Check or Electronic Check PaymentsA $20 fee will be charged for all checks or e-payments returned by your bank, for any reason. The dishonored check or e-payment plus the $20 fee must be paid with cash, cashier’s check, or money order. If the dishonored check or credit card was for payment of registration fees, the student may be disenrolled from classes.Division of Business & FinanceVice President for Business & FinanceZip Code: 95929-0025www.csuchico.edu/vpbfDepartmentsAudit ServicesDistribution ServicesEnvironmental Health and SafetyFacilities Management and ServicesFinancial ServicesHuman Resources Service CenterProcurement & Contract ServicesRisk ManagementStaff CouncilUniversity Budget OfficeUniversity Police\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "../index.shtml",
        "javascript:void(0)",
        "../index.shtml",
        "http://www.csuchico.edu/fin/resources/forms.shtml",
        "http://www.csuchico.edu/fin/resources/policies.shtml",
        "http://www.csuchico.edu/fin/resources/how.shtml",
        "https://apps.csuchico.edu/directory/department/sfin",
        "../index.shtml",
        "http://www.csuchico.edu/fin/resources/forms.shtml",
        "http://www.csuchico.edu/fin/resources/policies.shtml",
        "http://www.csuchico.edu/fin/resources/how.shtml",
        "https://apps.csuchico.edu/directory/department/sfin",
        "https://commerce.cashnet.com/chicopay",
        "https://www.csuchico.edu/vpbf/_assets/documents/org-chart-fin.pdf",
        "tel:530-898-5936",
        "mailto:cash@csuchico.edu",
        "../index.shtml",
        "index.shtml",
        "../index.shtml",
        "https://commerce.cashnet.com/chicopay",
        "https://commerce.cashnet.com/chicopay",
        "https://portal.csuchico.edu/uPortal/f/u18l1s4/normal/render.uP",
        "https://www.csuchico.edu/vpbf/index.shtml",
        "https://www.csuchico.edu/audit-services/index.shtml",
        "https://www.csuchico.edu/dist/index.shtml",
        "https://www.csuchico.edu/ehs/index.shtml",
        "https://www.csuchico.edu/fms/index.shtml",
        "https://www.csuchico.edu/fin/index.shtml",
        "https://www.csuchico.edu/hr/index.shtml",
        "https://www.csuchico.edu/purc/index.shtml",
        "https://www.csuchico.edu/risk/index.shtml",
        "https://www.csuchico.edu/stac/index.shtml",
        "https://www.csuchico.edu/bud/index.shtml",
        "https://www.csuchico.edu/up/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}