{
    "title": "Home | UC Davis Giving",
    "body": "\n\n\n\n\n      Skip to main content\n    \n\n\n\n\n\n\n\nCOVID-19 Response Learn More\n\n\n\n\n\n                    menu\n                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Give Now\n                        \n\n\n\n\nMain navigation\n\n\nWays to Give\n\n\nImpacts of Giving\n\n\nColleges, Schools and Units\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGive Day raises $3.4 million\n\nRead more\n\n\n\n\n\n\n\n\n\n\n\nThe real, lasting change that California demands and everyone deserves\n\nWe are a powerhouse in agriculture, veterinary medicine and the health sciences. Yet our impact is so much greater than the sum of our parts. Our greatness has grown to include the lives we reach and enrich, and the sustainable solutions that protect the environment, transform industry and more—from the greater Sacramento region to the global community. As we embark on a momentous campaign to bring a fuller, healthier and more resilient world within reach, we ask you to join us.\n\n\n\n\n\n\n\n\n\n\n\n1.88B\ndonated\n\n94% of our goal reached\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExpect more of every endeavor\n\n\nThe world has come to expect great things from UC Davis. We’re known for bold ideas and daring approaches. However, these endeavors are certainly not arbitrary. They’re inspired by a greater vision for the future and guided by our four campaign pillars.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSparking Innovation and Creativity\n\nAs a hub for thinkers, doers, makers and innovators, we work collaboratively across disciplines and borders to ask bigger questions, explore greater possibilities and push the boundaries of what’s possible.\n\n\n\n                    Learn more\n                \n\n\n\n\n\n\n\n\n\n\n\n\nSustaining Healthier Communities\n\nFrom clinical outreach to policy-shaping research, UC Davis is deeply committed to reversing climate change, uprooting societal injustices, and removing the barriers that stand between us and a greater future.\n\n\n\n                    Learn more\n                \n\n\n\n\n\n\n\n\n\n\n\n\nPreparing Change Makers\n\nStudents are at the center of all we do—driven scholars who dream of a brighter, healthier and more just tomorrow. They expect great things from their educations, and we’re committed to growing as many opportunities for them as possible.\n\n\n\n                    Learn more\n                \n\n\n\n\n\n\n\n\n\n\n\n\nReimagining Medicine\n\nPeople are living longer, and health care needs are changing rapidly. UC Davis is driving medical discoveries, technologies and clinical innovations that bring hope and healing to patients and families everywhere.\n\n\n\n                    Learn more\n                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExpect more from every one of us\n\n“I invite you to join UC Davis in this ambitious campaign. Together, we will redefine expectations for what a great public research university can achieve in partnership with those who share its vision for a better world.\n“Your gift will have a powerful impact—inspiring bigger ideas and bolder solutions that build stronger communities, helping people around the world lead healthier and richer lives, and shaping a brighter future for the planet we share.”\n—Chancellor Gary S. May\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExpect more from every gift\n\nThere are more unique ways to give to UC Davis than you might imagine. No matter how much you give or how often, each and every donation to the campaign makes a meaningful, lasting difference. Let’s find an option that works with your life circumstances, your financial goals and your specific philanthropic interests.\n\n\nExplore your options\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExpect more impact in every story\n\n\nDiscover how our donors' generous gifts have impacted a wide variety of fields, changing the course of what’s happening to what can and should be.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGive Day shines bright with $3.4 million raised \n\n\n\n\n\n\n\n\n\n\nFood truck offers free meals to students in need \n\n\n\n\n\n\n\nCan CRISPR cut methane emissions from cow guts? \n\n\n\n\n\n\n\nHow UC Davis is growing a tree canopy for tomorrow’s climate \n\n\n\n\n\n\n\nNew endowment will support next generation of water management leaders \n\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlugged in: Virtual Event Series\n\nGet an insider’s look into the innovative ways our university is making a positive impact on the world. \n\n\nWatch now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBig Ideas are a set of forward-thinking, interdisciplinary programs and projects that confront life’s most unjust conditions and most urgent challenges to create real global change. Supporting the four pillars of the Expect Greater Campaign, the Big Ideas maximize our collective impact as an institution for the greater good of the world.\n\n\n\n                                Learn more\n                            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy & Copyright ContentPrivacy Notice: We use technologies, such as cookies, to customize content and advertising, to provide social media features, and to analyze traffic to the site. We also share information about your use of our site with our trusted social media, advertising and analytics partners. By using this website, we will assume that you agree to the terms and conditions of our privacy policy.© The Regents of the University of California, Davis campus. All rights reserved.                                        Last Updated: Apr 25, 2023\n                \n\nFooter Menu 1Donor ResourcesFaculty & Staff Stewardship Awards ProgramCampaign VolunteersUC Davis Alumni & Affiliate Relations \n\nFooter Menu 2UC Davis FoundationDiversity, Equity & InclusionContact UsUpdate Your Contact Info \n\nFooter ContentUniversity of California, Davis \nOne Shields Avenue\nDavis, CA 95616-5270Development and Alumni Relations 530-754-4438development@ucdavis.edu \n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://www.ucdavis.edu/",
        "https://www.ucdavis.edu/coronavirus/",
        "/",
        "https://give.ucdavis.edu/Donate/YourGift/341017",
        "/ways-to-give",
        "/impacts-giving",
        "/colleges-schools-units",
        "https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "#5698",
        "/spark-innovation-and-creativity",
        "/sustain-healthier-communities",
        "/preparing-change-makers",
        "/reimagining-medicine",
        "/ways-to-give",
        "/impacts-giving/give-day-shines-bright-34-million-raised",
        "/impacts-giving/give-day-shines-bright-34-million-raised",
        "/impacts-giving/food-truck-offers-free-meals-students-need",
        "/impacts-giving/food-truck-offers-free-meals-students-need",
        "/impacts-giving/can-crispr-cut-methane-emissions-cow-guts",
        "/impacts-giving/can-crispr-cut-methane-emissions-cow-guts",
        "/impacts-giving/how-uc-davis-growing-tree-canopy-tomorrows-climate",
        "/impacts-giving/how-uc-davis-growing-tree-canopy-tomorrows-climate",
        "/impacts-giving/new-endowment-will-support-next-generation-water-management-leaders",
        "/impacts-giving/new-endowment-will-support-next-generation-water-management-leaders",
        "/impacts-giving",
        "/impacts-giving/virtual-events",
        "https://bigideas.ucdavis.edu/",
        "/",
        "/privacy-policy",
        "/resources",
        "/resources/stewardship-award-program",
        "/resources/volunteers",
        "http://alumni.ucdavis.edu",
        "/foundation",
        "https://diversity.ucdavis.edu/about",
        "/contact",
        "/update-info",
        "mailto:development@ucdavis.edu"
    ]
}