{
    "title": "Alumna Kelsie Whitmore to be first woman to play in MLB | Titan - The Digital Magazine of Cal State Fullerton",
    "body": "Some page features may require javascript to run.Skip to Content (Press Enter)A Titan Takes the FieldAlumna Kelsie Whitmore knew there would be a first woman to play Major League Baseball. Sheâ\u0080\u0099s on the road to achieving that milestone.By Taylor Arrey / Photos By Matt GushKelsie Whitmore remembers rainy days. With water dancing on windows and wind howling in the distance, she and her younger brother would create a makeshift baseball diamond in her childhood living room.Even when the game was little more than pillow bases and a handful of wiffle balls, Whitmore knew one thing for certain.Rain or shine, she was always going to play baseball.First Season as a FerryhawkWhitmore â\u0080\u009920, â\u0080\u009922 (B.S. kinesiology, M.S. instructional design and technology), a Cal State Fullerton alumna and professional baseball player, took the field in April 2022 as an outfielder and pitcher for the Staten Island FerryHawks. She made history as the first woman to play in the Atlantic League, one of four Major League Baseball partner leagues.Cal State Fullerton alumna Kelsie Whitmore took the field as an outfielder and pitcher for the Staten Island FerryHawks in April 2022, making history as the first woman to play in a Major League Baseball partner league.â\u0080\u009cI always knew that there was going to be a girl one day, and I thought, if there is one, I want to be that girl who makes it,â\u0080\u009d says the former Titan softball player.After signing with the FerryHawks, Whitmoreâ\u0080\u0099s name appeared on jerseys and in national headlines. Sharing her story with publications like the MLB Network, Sports Illustrated and The Athletic, Whitmoreâ\u0080\u0099s fan base grew tremendously. It wasnâ\u0080\u0099t long before she was autographing baseballs and interacting with fans in the stands.Kelsie Whitmore (left) said she enjoys interacting with fans and showing young girls that they belong in baseball.On the field, the two-way sensation played 86 innings in the outfield and pitched 10.1 innings.â\u0080\u009cBeing able to play with and against former major leaguers like Rusney Castillo from the Red Sox and Julio Teheran from the Tigers â\u0080\u0094 that atmosphere â\u0080\u0094 itâ\u0080\u0099s everything you work for and dream of,â\u0080\u009d shares Whitmore.In the offseason, Whitmore hits the gym and works on her mechanics, hoping to take her game to the next level.â\u0080\u009cWhen Iâ\u0080\u0099m back on the field this season, I want to come back and have people say, â\u0080\u0098This girl worked hard and came back better,â\u0080\u0099â\u0080\u009d says Whitmore.I never saw myself doing anything else.- Kelsie Whitmore â\u0080\u009920, â\u0080\u009922Field of DreamsKelsie Whitmore â\u0080\u009920, â\u0080\u009922 (B.S. kinesiology, M.S. instructional design and technology)Before she was a FerryHawk, Whitmore found a supportive community of teammates and coaches at Cal State Fullertonâ\u0080\u0099s Anderson Family Field.â\u0080\u009cCollege was the time when I really opened up as a person and as a player,â\u0080\u009d shares Whitmore. â\u0080\u009cFrom the start of my college career to when I became a senior, my relationship with my coaches continued to grow. Their support helped me open up about my hopes for the future.â\u0080\u009dSoftball head coach Kelly Ford met Whitmore at a recruiting camp in 2017 and was impressed by her drive, athleticism and shining potential.â\u0080\u009cI remember her spending time with our baseball staff,â\u0080\u009d says Ford. â\u0080\u009cAfter that, there wasnâ\u0080\u0099t a year that went by that she didnâ\u0080\u0099t participate in a camp, a USA Baseball event or training.â\u0080\u009dFrom late nights in the bullpen to networking events, Whitmore seized every opportunity for professional development at CSUF and grew as a leader and teammate.â\u0080\u009cKelsie welcomed all the freshmen with open arms and guided us,â\u0080\u009d says Alyssa Hernandez, former Titan softball player and Whitmoreâ\u0080\u0099s best friend. â\u0080\u009cShe always put others before herself and set a good example of what it means to be a Titan softball player.â\u0080\u009dFord adds that Whitmore left behind a legacy of strength, kindness and wisdom when she graduated â\u0080\u0094 a legacy that still exists today.â\u0080\u009cKelsie changed the standard of how the Titans take the field,â\u0080\u009d says Ford. â\u0080\u009cHer teammates and coaches had the utmost respect for her, and she will forever be a part of Titan softball.â\u0080\u009dBaseball Hits HomeWhitmore started playing catch with her dad when she was 6 years old. As an energetic kid who loved being outdoors, her childhood revolved around sports. She played soccer, volleyball, golf, and participated in high school track and field, but her heart always went back to baseball.â\u0080\u009cI never saw myself doing anything else,â\u0080\u009d says Whitmore.Kelsie Whitmore began playing baseball when she was 6 years old.Before joining the USA Baseball team in 2014, she played Little League and was on Temecula Valley High Schoolâ\u0080\u0099s varsity team. She also played travel baseball, where her dad doubled as her coach for several seasons. With each step, Whitmore knew that she wanted to be a professional baseball player, but she didnâ\u0080\u0099t always say it out loud.â\u0080\u009cPeople would ask me what I wanted to be when I grew up, and I knew. I knew exactly what I wanted to do, but I stopped telling people because I got shut down a lot,â\u0080\u009d says Whitmore.It took some time, but in the face of criticism, she learned to be unapologetic about her goals by surrounding herself with positivity and a healthy support system.Her dream is to sign an MLB contract with the San Diego Padres â\u0080\u0094 the team that she grew up watching.Changing the GameToday, when Whitmore takes the field, she does so with a quiet confidence that eclipses the challenges she has faced along the way.â\u0080\u009cI compared myself to men because they were my competition. I never had a body like them. I never had the build, the strength, the speed or the power, and I was so envious of that,â\u0080\u009d shares Whitmore. â\u0080\u009cI overworked myself trying to outperform the competition. What helped me overcome that was learning to love what I was given and who I was.â\u0080\u009dOutfielder Evelyn Sablan (right) and alumna Kelsie Whitmore (left) became friends while playing on the Titan softball team.Peyton Toto, a third-year Titan infielder, says that Whitmoreâ\u0080\u0099s vulnerability is reshaping the game for young athletes.â\u0080\u009cHer story has inspired a lot of girls to chase their goals. Itâ\u0080\u0099s rare that a person would keep going after being told so many times, â\u0080\u0098Women donâ\u0080\u0099t play baseballâ\u0080\u0099 or â\u0080\u0098Itâ\u0080\u0099s a menâ\u0080\u0099s sport,â\u0080\u0099â\u0080\u009d says Toto.Despite these challenges, Whitmore says sheâ\u0080\u0099s proud to be opening doors for future female MLB baseball players.â\u0080\u009cWhat sheâ\u0080\u0099s doing for young people, we are going to reap the benefits as a sports community for decades to come,â\u0080\u009d says Ford. â\u0080\u009cAs far as breaking the glass ceiling, her journey has only just begun.â\u0080\u009d Support Titan Softball:give.fullerton.edu/softballMore StoriesOnce a Titan, Always a TitanThe Secretâ\u0080\u0099s in the Hot SauceChloe the Engineer Stomps Out StereotypesRaising $270 Million: A Titan Success StoryPresidentâ\u0080\u0099s MessageThis site is maintained by Division of University AdvancementTo report problems or to comment about this site, please contact strategiccomm@fullerton.eduÂ Â |Â Â Privacy PolicyÂ© California State University, Fullerton. All Rights Reserved.Additional ResourcesEmergency InformationUniversity PoliceCSUF Accessibility Â  | Â  Feedback FormDownload Adobe Acrobat Reader Acrobat Reader Â  | Â  Download Word viewer, or download Excel viewer, or download PowerPoint viewer Microsoft ViewerPrivacy PolicyAnnual Security Report (Clery)Title IXContacts and AddressesSite IndexCampus MapCSUPresidentFramroze M. Virjee, JDVice President, University AdvancementGregory J. SaksAssociate Vice President, Strategic Communications and Brand ManagementEllen TreanorEditorialTaylor Arrey, Lynn Juliano, Valerie Orleans, Debra Cano RamosDesign and VisualsHoward Chang, Matt Gush, Robert Huskey, Robert Rodriguez, Mishu VuProductionJillian Brander, Denise Del Cid, Michael Mahi, Savannah Terrazas",
    "links": [
        "#MainContent",
        "https://give.fullerton.edu/softball",
        "/spring-summer-2023/i-am-and-always-will-be-a-titan/",
        "/spring-summer-2023/the-secrets-in-the-hot-sauce/",
        "/spring-summer-2023/chloe-the-engineer/",
        "https://titanmag.fullerton.edu/spring-summer-2023/raising-270-million/",
        "/spring-summer-2023/presidents-message/",
        "http://www.fullerton.edu/advancement",
        "mailto:strategiccomm@fullerton.edu",
        "https://www.fullerton.edu/it/iso/policy/online-privacy.php",
        "http://emergency.fullerton.edu",
        "https://police.fullerton.edu/",
        "http://www.fullerton.edu/ati",
        "http://www.fullerton.edu/ati/reportati",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/",
        "https://www.fullerton.edu/it/iso/policy/online-privacy.php",
        "https://police.fullerton.edu/jeanneclery",
        "http://www.fullerton.edu/titleix/",
        "https://www.fullerton.edu/contact.aspx",
        "https://www.fullerton.edu/a-z.aspx",
        "http://www.fullerton.edu/campusmap/",
        "https://www2.calstate.edu/"
    ]
}