{
    "title": "Organizing Diverse & Inclusive WordPress Events APAC, Fri, May 12, 2023, 9:30 PM   | Meetup",
    "body": "Skip to contentHomeLog inSign upEnglishStart a new groupChoose your locationStart a new groupEnglishLog inSign upChoose your locationOrganizing Diverse & Inclusive WordPress Events APACHosted ByJill B.DetailsA 2.5-hour interactive watch party online to learn how to create welcoming and diverse WordPress Meetups and WordCamps for your WordPress community.\nThis is not just for organizers, but anyone who wants to champion this kind of environment at official WordPress events, now or in the future.\nDo you run or attend WordPress events and notice only one type of person is attending? You’d love to see more diversity represented, but people are either not showing up — or they attend once and don’t come back. What can you do to be a good ally to foster, promote, and support diversity and an inclusive space?\nThis workshop is beneficial for all levels of Diversity and Inclusion knowledge, from complete beginners to experienced event organizers who are already incorporating good practises.\nIn this workshop, we’ll cover 5 topics:\n1. Mindset Shift: Shifting the way you think about diversity\n2. Community: How to attract and foster a diverse community\n3. Environment: Creating a welcoming environment, both in person and online\n4. Speakers and Leaders: How to encourage more people from diverse backgrounds to step up to be speakers and leaders\n5. Allyship: How to be a better ally\nYou will walk away with an action list to start making changes right away!\nWe will be watching the videos on Learn WordPress and stopping to do the exercises in the workbook PDF together.\nIn order to create a space where people can feel supported to talk through real life challenges, this watch party workshop will NOT be recorded.\nThis workshop was created by Allie Nimmons, Aurooba Ahmed, David Wolfpaw, and Jill Binder for WordCamp US 2019.\nPlease try to arrive 10 minutes early so that we can start on time.\nAfter the workshop, to help you take action and overcome challenges, there will be a follow-up discussion in the #community-events channel in the WordPress Slack a month later at the same time and day of the week.\nTestimonials:\n“I love how actionable the workshop is.”\n– Anonymous\n“I loved being with other organizers and hearing what they’ve done. The checklists in the workbook are helpful in terms of tracking what I have done and what I can still improve. I’d love to see ALL THE ORGANIZERS go through this. This felt like a great complement to other material that WordPress has about not disparaging people; the focus of the Allyship workshop was on how to be actively welcoming.”\n– Sallie Goetsch, organizer, East Bay WordPress Meetup\n“I thought I was holding inclusive events already, and this workshop showed me ways to make things even more inclusive that I hadn’t thought of before. I especially liked learning that changing just a few words can make my Meetups and WordCamps even more welcoming to more people.”\n– Shanta R. Nathwani, President & CEO, Namara Technologies Inc., Canada\n----\nPhoto credit: David Bisset at WordCamp US 2019\nPLEASE NOTE THAT YOU MUST REGISTER ON EVENTBRITE TO SAVE YOUR SPOT: https://www.eventbrite.com/e/organizing-diverse-inclusive-wordpress-events-apac-tickets-618469688487\nZoom link:\nYou will get the Zoom link on the Eventbrite confirmation page.\nWe will also send the Zoom link to you by email (up to about 15 minutes before the start of the event) and by Google Calendar (up to the day before the event).Learn WordPress Online WorkshopsSee more eventsLearn WordPress Online Workshopspublic groupOnline eventLink visible for attendeesLearn WordPress Online Workshopspublic groupSat, May 13 · 4:30 AM UTCOrganizing Diverse & Inclusive WordPress Events APACCreate your own Meetup group.Get StartedStart a new groupYour AccountSign upLog inHelpBecome an AffiliateDiscoverGroupsCalendarTopicsCitiesOnline EventsLocal GuidesMeetupAboutBlogMeetup ProCareersAppsPodcastFollow us© 2023 MeetupTerms of ServicePrivacy PolicyCookie PolicyHelp",
    "links": [
        "#main",
        "https://www.meetup.com/",
        "https://www.meetup.com/login/?returnUri=https%3A%2F%2Fwww.meetup.com%2Flearn-wordpress-online-workshops%2Fevents%2F293000310%2F",
        "https://www.meetup.com/register/?returnUri=https%3A%2F%2Fwww.meetup.com%2Flearn-wordpress-online-workshops%2Fevents%2F293000310%2F",
        "https://www.meetup.com/how-to-group-start/",
        "https://www.meetup.com/",
        "https://www.meetup.com/how-to-group-start/",
        "https://www.meetup.com/login/?returnUri=https%3A%2F%2Fwww.meetup.com%2Flearn-wordpress-online-workshops%2Fevents%2F293000310%2F",
        "https://www.meetup.com/register/?returnUri=https%3A%2F%2Fwww.meetup.com%2Flearn-wordpress-online-workshops%2Fevents%2F293000310%2F",
        "https://www.meetup.com/learn-wordpress-online-workshops/events/293000310/attendees/",
        "https://www.eventbrite.com/e/organizing-diverse-inclusive-wordpress-events-apac-tickets-618469688487",
        "https://www.meetup.com/learn-wordpress-online-workshops/events/",
        "https://www.meetup.com/learn-wordpress-online-workshops/",
        "https://www.meetup.com/learn-wordpress-online-workshops/",
        "https://www.meetup.com/how-to-group-start/",
        "https://www.meetup.com/how-to-group-start/",
        "https://www.meetup.com/register/?returnUri=https%3A%2F%2Fwww.meetup.com%2Flearn-wordpress-online-workshops%2Fevents%2F293000310%2F",
        "https://www.meetup.com/login/?returnUri=https%3A%2F%2Fwww.meetup.com%2Flearn-wordpress-online-workshops%2Fevents%2F293000310%2F",
        "https://www.meetup.com/en-US/help/",
        "https://www.meetup.com/lp/affiliate-program/",
        "https://www.meetup.com/find/?source=GROUPS",
        "https://www.meetup.com/find/?source=EVENTS",
        "https://www.meetup.com/topics/",
        "https://www.meetup.com/cities/",
        "https://www.meetup.com/find/online-events/",
        "https://www.meetup.com/blog/category/local-guides/",
        "https://www.meetup.com/about/",
        "https://www.meetup.com/blog/",
        "/lp/meetup-pro/",
        "https://www.meetup.com/careers/",
        "https://www.meetup.com/apps/",
        "https://www.meetup.com/blog/category/keep-connected-podcast/",
        "https://www.facebook.com/meetup/",
        "https://twitter.com/Meetup/",
        "https://www.youtube.com/meetup",
        "https://www.instagram.com/meetup/",
        "https://www.tiktok.com/@meetup",
        "https://play.google.com/store/apps/details?id=com.meetup&hl=en-US",
        "https://apps.apple.com/us/app/meetup/id375990038",
        "https://help.meetup.com/hc/en-us/articles/360027447252",
        "https://www.meetup.com/privacy/",
        "https://help.meetup.com/hc/en-us/articles/360046339551",
        "https://www.meetup.com/help/"
    ]
}