{
    "title": "Student Fees – University Budget Office – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        University Budget Office\n\t\t\t    \n                            BUD Menu\n                        Show search box.University Budget OfficeTransparency & ReportingUniversity Funding SourcesStudent FeesPosition ManagementResourcesContact UsUniversity Budget OfficeTransparency & ReportingUniversity Funding SourcesStudent FeesPosition ManagementResourcesContact Us(opens in new window)Budget Transfer TemplateData Warehouse Log-In(opens in new window)Org Chart (PDF)\n        Our Office\n        Location IconUniversity Budget Office\n                                                                            Kendall Hall 210\n                                                                530-898-5931budgetcfs@csuchico.eduRegular Hours\n                                                                            8 a.m.–5 p.m.\n                                                                \n                                                                                Monday–Friday\n                                                                    Mailing Address\n                                                                            University Budget Office\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0241\n                                                                    BUDCurrent page:  Student Fees\n                        \n    \t\tStudent Fees\n    \tStudent Fees consist of a systemwide State Tuition Fee and various campus mandatory fees that students must pay to enroll in the University. If you have any questions regarding your Student Account(opens in new window) or would like to pay your student fees please contact Student Financial Services(opens in new window).2023/2024 Tuition and Fees Per SemesterUnitsUndergraduateCredentialGraduate0 - 6.0 Units$2,828.00$3,095.00$3,245.006.1 + Units$4,034.00$4,493.00$4,751.00Select a fiscal year to view the CSU, Chico mandatory fees for enrollment. For an estimated moderate standard of living budget, please refer to the Chico State Cost of Attendance.Historical Student FeesTuition & Fees 2023/2024 (PDF)Tuition & Fees 2022/2023  (PDF)Tuition & Fees 2021/2022 (PDF)Tuition & Fees 2020/2021 (PDF)Tuition & Fees Fall 2019/2020 (PDF)Tuition & Fees Spring 2019 (PDF)Campus Fee Advisory Committee (CFAC)Authorized by  Executive Memorandum 11-045(opens in new window), the  Campus Fee Advisory Committee(opens in new window) (CFAC) is charged with reviewing proposals to modify existing or establish new student fees for the purpose of providing advice to the campus president. The president is responsible for consulting the committee prior to implementing changes to campus mandatory student fees. The Provost consults with CFAC in the review of student learning fee proposals and the final determination of awards given.  Fee Categories The California State University Student Fee Policy (opens in new window) (formerly EO 1102) provides the framework for the categorization, administration and reporting of student fees.The California State University, Chico Student Fees Policy(opens in new window) provides a summary of approved campus student fees. For further information, please click on the appropriate category below, or visit the CSU PolicyStat(opens in new window) website to read about the various systemwide policies.Category ICategory IICategory IIICategory IVCategory VCategory VISystemwide Mandatory Tuition Category I fees are defined as system-wide mandatory tuition and other fees that must be paid to apply to, enroll in, or attend the university, or to pay the full cost of instruction required of some students by statute.Graduate Business Professional FeePer Executive Order 1102 (PDF), Graduate Business Professional, or MBA, fees are charged on a per-unit basis for required courses in the professional master of business degree programs.Campus Guidelines for Administration of Per-Unit MBA Fee(opens in new window)Frequently Asked QuestionsCampus Mandatory FeesPer Executive Order 1102, Category II fees are defined as campus mandatory fees that must be paid to enroll in or attend the university.CSU, Chico Category II fees include:List of fees with links to further informationFEEUSE OF FEELINKS TO FURTHER INFORMATIONHealth ServicesCharged to all students, to make campus-based health services available.WellCat Health Center(opens in new window)Health FacilitiesCharged to support a health center facility.WellCat Health Center(opens in new window)Instructionally Related Activities (IRA)Ed Code 89721 - for instructionally related activities as authorized by the trustees.IRA Information(opens in new window)Materials Services and Facilities includes Student Learning Fee (SLF), Consolidated Course Fee(CCF) & ID Card FeeMandatory fee that covers various services, facilities, or materials. (Approved by EO 1049(opens in new window))Ed Code 89700 - Official CSU, Chico identification Consolidated Course Fee Guidelines (PDF)SLF Information(opens in new window)A.S. Activity FeeSupports student body organizations. Associated Students Website(opens in new window)Student Union FeeSupports the financing, construction, and operation of student body centers.Bell Memorial Union (BMU)(opens in new window)Wildcat Recreation Center (WREC)(opens in new window)Miscellaneous Course Fees (MCF) Per Executive Order 1102, Category III fees are defined as fees associated with state-supported courses.  Specifically for materials and services used in concert with the basic foundation of an academic course offering.Examples of such fees are course fees charged to provide consumable materials or services to students that supplement the basic curriculum or field trip course fees charged when basic field trips or travel are necessary.Approved Uses and Expenditure Guidelines Materials or services with a tangible benefit.Not to be charged in lieu of classroom and laboratory supplies and materials or any other supplies necessary to equip laboratory space to complement classroom course instruction.Charged only for the actual cost of the material or service being provided.Administrative charges cannot be added.Fee Request Guidelines and Submission Requirements Historical Student FeesFee TypeAmountApproved by:Materials & Services<$150Campus PresidentMaterials & Services>$150ChancellorField Trips & Travel<$3000Campus PresidentField Trips & Travel>$3000ChancellorProcess to Establish/Adjust*Please contact the University Budget Office for the Category III - Miscellaneous Course Fee Request Form and guidance on establishing or adjusting student fees.The request form consists of 3 components:\nMCF1: Course fee description and approval signatures.MCF2: Statement of projected revenues and expenses for the first 3 years of the feeMCF3: Estimated travel expenses for fees involving travel or field tripsOnce complete, the request is routed in the following order for approval:\nDepartment ChairCollege Dean/Appropriate AdministratorProvost University Budget OfficeCFAC review and recommendation to the President and Chief Financial OfficerChief Financial Officer and President approve or deny the request*EO 1049(opens in new window) established a new Category II fee at CSU, Chico that consolidated the majority of our 300 individual miscellaneous course fees.The Consolidated Course Fee Guidelines (PDF) provides an annual allocation to colleges so they have more flexibility in covering course related expenditures as well as reducing the administrative burden of managing 300 individual fees. The campus will consider proposals for individual miscellaneous course fees if they are a costly field trip, or for specialized materials/services related to a course (using $200 as a guide) that shouldn't be paid by all students.Administrative Per Executive Order 1102, Category IV fees are defined as fees, other than Category II or III fees, paid to receive materials, services or for the use of facilities provided by the university; and fees or deposits to reimburse the university for additional costs resulting from dishonored payments, late submissions, or misuse of property or as a security or guaranty.Examples of such fees are check return fees, diploma fees, lost/broken item fees, transcript fees, withdrawal fees, etc.Fee Request Guidelines and Submission RequirementsApproving AuthorityFees are approved by the President after review by the Vice President for Business and Finance.Must be authorized in writing.Fee establishments and adjustments must be reported to CFAC at the first CFAC meeting following the establishment or adjustment of the fee.Process to Establish/AdjustPlease contact the University Budget Office for the Category IV - Campus Fee Request Form and guidance on establishing or adjusting student fees.The request form consists of 2 components:\nCFR1: Fee description, details, and necessary signatures.CFR2: Fee budget of planned revenues and expenditures.Once complete, the request is routed in the following order for approval:\nDepartment ChairCollege Dean/Appropriate AdministratorProvost University Budget OfficeChief Financial Officer and President approve or deny the requestSelf Support Programs Per Executive Order 1102, Category V fees are defined as fees paid to self-support programs such as extended education, Cal State Online extended education offerings, parking, and housing including materials and service fees, user fees, fines, and deposits.  Self-support programs are defined as those not receiving state general fund appropriations; instead, fees are collected to pay the full cost of a program.  Costs of self-support instructional programs include support and development of the academic quality of the university.Examples of such fees are extended education, housing and food service, and parking fees.Fee Request Guidelines and Submission Instructions Approving AuthorityFees are approved by the President after review by the Vice President for Business and Finance.Must be authorized in writing.Fee establishments and adjustments must be reported to CFAC at the first CFAC meeting following the establishment or adjustment of the fee.Process to Establish/AdjustPlease contact the University Budget Office for the Category V - Campus Fee Request Form and guidance on establishing or adjusting student fees. The request consists of 2 components:\nCFR1: Fee description, details, and necessary signatures.CFR2: Fee budget of planned revenues and expendituresOnce complete, the request is routed in the following order for approval:\nDepartment ChairCollege Dean/Appropriate AdministratorProvost University Budget OfficeChief Financial Officer and President approve or deny the requestSystemwide Voluntary Fees Per Executive Order 1102, Category VI fees are defined as systemwide voluntary fees.  This fee category has been newly added effective Fall 2015.A current example of this fee is the Student Involvement and Representation Fee.Fees are developed, reviewed, approved, and established by the Chancellor's Office.Collection of the fee shall occur twice annually in the fall and spring academic terms.Each time the fee is assessed, students shall be provided a clear and unambiguous means to decline the payment of the fee.Current and historical system-wide tuition fee information can be found on the CSU Budget Office Fee Schedule(opens in new window). For current year Student Fees please see the Fee Index (PDF). An annual report of student fee revenue is submitted to the Chancellor's Office and the Campus Fee Advisory Committee each year. These reports can be found on our Transparency & Reporting website under Student Fees(opens in new window).Disclaimer: The CSU makes every effort to keep student costs to a minimum. Fees listed in published schedules or student accounts may need to be increased when public funding is inadequate. Therefore, CSU must reserve the right, even after fees are initially charged or initial fee payments are made, to increase or modify any listed fees. All listed fees, other than mandatory systemwide fees, are subject to change without notice, until the date when instruction for a particular semester or quarter has begun. All CSU listed fees should be regarded as estimates that are subject to change upon approval by the Board of Trustees, the Chancellor, or the Presidents, as appropriate. Changes in mandatory systemwide fees will be made in accordance with the requirements of the Working Families Student Fee Transparency and Accountability Act (Sections 66028 - 66028.6 of the Education Code).For an estimated moderate standard of living budget, please refer to the Chico State Cost of Attendance.Division of Business & FinanceVice President for Business & FinanceZip Code: 95929-0025www.csuchico.edu/vpbfDepartmentsAudit ServicesDistribution ServicesEnvironmental Health and SafetyFacilities Management and ServicesFinancial ServicesHuman Resources Service CenterProcurement & Contract ServicesRisk ManagementStaff CouncilUniversity Budget OfficeUniversity Police\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "transparency-reporting.shtml",
        "univ-fund-matrix.shtml",
        "student-fee-info.shtml",
        "position-management.shtml",
        "resources.shtml",
        "https://apps.csuchico.edu/directory/department/bud",
        "index.shtml",
        "transparency-reporting.shtml",
        "univ-fund-matrix.shtml",
        "student-fee-info.shtml",
        "position-management.shtml",
        "resources.shtml",
        "https://apps.csuchico.edu/directory/department/bud",
        "_assets/documents/other-docs/campus-user-bud-template1.xlsm",
        "https://csyou.calstate.edu/Divisions-Orgs/bus-fin/it/BI-DW/CFSDW/Pages/default.aspx",
        "https://www.csuchico.edu/vpbf/_assets/documents/org-chart-fin.pdf",
        "tel:530-898-5931",
        "mailto:budgetcfs@csuchico.edu",
        "index.shtml",
        "https://portal.csuchico.edu/uPortal/f/u16l1s4/normal/render.uP",
        "http://www.csuchico.edu/sfin/",
        "https://www.csuchico.edu/fa/cost/",
        "_assets/documents/student-fee-information/student-tuitions-2023-24.pdf",
        "_assets/documents/student-fee-information/student-tuitions-2022-23.pdf",
        "_assets/documents/student-fee-information/student-tuitions-2021-221.pdf",
        "_assets/documents/student-fee-information/student-tuitions-20-21.pdf",
        "_assets/documents/student-fee-information/student-tuitions-spring-2019-20.pdf",
        "_assets/documents/student-fee-information/updated-student-tuitions-spring-2019.pdf.pdf",
        "http://www.csuchico.edu/prs/EMs/2011/11-045.shtml",
        "https://www.csuchico.edu/cfac/index.shtml",
        "https://calstate.policystat.com/policy/7459727/latest/",
        "https://calstate.policystat.com/policy/13315994/latest/",
        "https://calstate.policystat.com/",
        "#panel1",
        "#panel2",
        "#panel3",
        "#panel4",
        "#panel5",
        "#panel6",
        "http://www.csuchico.edu/sfin/fees-tuition/graduateprofessionalbusinessprogramfeesmbafees/index.shtml",
        "https://www.csuchico.edu/sfin/student-accounts/faq.shtml",
        "https://www.csuchico.edu/healthcenter/",
        "https://www.csuchico.edu/healthcenter/",
        "http://www.csuchico.edu/ira/index.shtml",
        "https://calstate.policystat.com/policy/6590665/latest/",
        "_assets/documents/student-fee-information/consolidated-course-fee-expenditure-guidelines.pdf",
        "http://www.csuchico.edu/slf/",
        "https://as.csuchico.edu/",
        "https://www.csuchico.edu/aaspace/commonspaces/bmu/index.shtml",
        "http://www.aschico.com/wrec",
        "https://apps.csuchico.edu/directory/Department/BUD",
        "https://calstate.policystat.com/policy/6590665/latest/ ",
        "_assets/documents/student-fee-information/consolidated-course-fee-expenditure-guidelines.pdf",
        "https://apps.csuchico.edu/directory/Department/BUD",
        "https://apps.csuchico.edu/directory/Department/BUD",
        "https://www.csuchico.edu/sfin/organizations.shtml",
        "https://www2.calstate.edu/attend/paying-for-college/csu-costs/tuition-and-fees",
        "_assets/documents/cfac-reports/fee-index-22-23.pdf",
        "student-fee-info.shtml",
        "https://www.csuchico.edu/fa/cost/index.shtml",
        "https://www.csuchico.edu/vpbf/index.shtml",
        "https://www.csuchico.edu/audit-services/index.shtml",
        "https://www.csuchico.edu/dist/index.shtml",
        "https://www.csuchico.edu/ehs/index.shtml",
        "https://www.csuchico.edu/fms/index.shtml",
        "https://www.csuchico.edu/fin/index.shtml",
        "https://www.csuchico.edu/hr/index.shtml",
        "https://www.csuchico.edu/purc/index.shtml",
        "https://www.csuchico.edu/risk/index.shtml",
        "https://www.csuchico.edu/stac/index.shtml",
        "index.shtml",
        "https://www.csuchico.edu/up/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}