{
    "title": "Writer’s Voice Reading Series | Watershed Review",
    "body": "\n\n\n\n\n\n\n\nWatershed Review\nEst. 2012\n\n\n\n\nMenu\n\nSkip to content\n\nHomeAbout This Blog\nHistory\nSubmit\n\n\n\n\n\n\n\t\t\t\t\tTag Archives: Writer’s Voice Reading Series \n\n\n\nWriter’s Voice Spotlight: Lynn Freed \n\n\nLynn Freed has been described as the literary love child of Joan Didion and Fran Lebowitz. Often wry and satirical, she writes with a powerfully determined voice about women, writing, and travel. Her most recent publication, The Romance of Elsewhere (Counterpoint Press), is a collection of essays about intense wanderlust and the struggle of defining “home.” Lynn says the central question of the collection is “where or what is home?’ To which I’d have to say, nowhere.” She continues, “Which is not to say there aren’t places in which I feel at home—Greece, for instance, and the African bush. I also feel at home in the past. And yet there is also a certain liberation in being untied from the past—from the bonds of home. And a sadness, a great sadness. As you see, I’m still looking for an answer.”\nFreed grew up in Durban, South Africa, and moved to New York as a graduate student to study English Literature at Columbia University. She is Professor Emerita of English at the University of California in Davis and has published numerous, award-winning works in fiction and nonfiction. Her most recent novel is The Last Laugh (Sarah Crichton Books), about a group of older women who flee their previous lives by moving to a Greek island—something many of us have fantasized about. It delves into what freedom really entails and the dynamic complexity of friendships between women.\nOn writing, Lynn says “leaving home is perhaps the central experience of the writer’s life. The restless pursuit of a way back while remaining steadfastly at a distance — this is the enigma that informs the writer’s perspective.” By her own account she is neither fast nor disciplined as a writer. She says “I’m hard put to know which obsess me. The cult of the self? The self-promotion, selfies, self-this, self-that to which we’re all subjected? Old age? Grown children?…Something will come up, or nothing. If nothing, I’ll try not to force something onto the page.” The result is prose full of candor and wit that looks deeply at what it means to be a woman and what it means to be a writer.\nTo read more about Lynn Freed and her writing, check out this interview on The Rumpus.\nPlease join us for a thought-provoking evening with Lynn Freed this Thursday, November 1st at 7:30 pm in Zingg Recital Hall (ARTS 150). Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nWritten by Alyssa Cox\n\n \n\nOctober 29, 2018watershedcsuc CSUC, fiction, Lynn Freed, nonfiction, Writer's Voice Reading Series\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Valerie Fioravanti \n\n\nCSU, Chico Writer’s Voice reading series is proud to welcome fiction writer Valerie Fioravanti on Thursday, September 22nd.\nOne of Valerie Fioravanti’s most recently published stories is “Loud Love,” winner of the inaugural Tillie Olsen Short Story Award and published in the July 2016 issue of The Tishman Review. This story is also part of Fioravanti’s second linked collection, Bridge & Tunnel.\n“Loud Love” was a pleasure to read. The main character is a riot, endearingly imperfect and human, with a proclivity for hysterical honesty. All of the characterizations are complex and unique in a plot that keeps us engaged. The narrative tone in “Loud Love” is realistic and believable, with a tongue-in-cheek attitude that enfolds a story, not just entertaining, but meaningful as well.\nFioravanti is the author of the linked collection of short stories titled Garbage Night at the Opera, winner of the 2011 Sharat Chandra Prize for Short Fiction. Her published short stories have earned a total of six Pushcart Prize nominations and a Special Mention in Pushcart Prize XXVIII. Currently, Fioravanti lives in Sacramento, California, where she works primarily as a creative writing coach and leader of writing workshops.\nPlease join us for an exciting evening with Valerie Fioravanti, Thursday at 7:30 pm in Colusa 100B. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nBy Heather Stogsdill\n\n\n \n\nSeptember 19, 2016watershedcsuc CSUC, fiction, Valerie Fioravanti, Writer's Voice Reading Series\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Joanne Harris Allred \n\n\nChico State Writer’s Voice is proud to present poet, Joanne Harris Allred, on Thursday, April 10, 2014 at 7:30 PM in Colusa 100B. Allred is the author of three poetry collections, Whetstone, winner of the Flume Press Chapbook award, Particulate (Bear Star Press), and The Evolutionary Purpose of Heartbreak (Turning Point Books). Allred spent many years teaching in the English department at CSU, Chico, and currently lives just outside of Chico with her husband, dogs, and a few chickens.\nAllred’s work delves deeply into the human condition and explores the interconnectivity between the self and nature. Her words are a quiet meditation on living, loving, and losing. She often takes something ordinary and reveals its extraordinary essence by using metaphoric language to zero in on a specific experience or emotion. The speaker of her poems is often an observational one that acts as a guide into this meditation and connection to nature. Her poem “Plum in Early Spring,” from Whetstone, for instance, does this:\nFor three rainy weeks my plum tree\nkeeps a thousand small fists.\nThen one warm day it explodes.\nThe sweet tethered cloud blazes\nangel white, innocent of consequence,\nnot caring for how long the rain\nhas gone or if frost lurks\na few days away. The blooms don’t inquire\nhave the hives dried, will bees be out\nin time to nuzzle their open hearts.\n \nUnconcerned with plans for harvest\nthey ignore my pleas to be patient, to reflect\nbefore taking an irrevocable step.\nTrees simply answer the season’s necessity,\nunable to deny the spirit\nmoving through by drawing silly\ndistinctions between the self and soul.\nThis poem begins with the simple image of a plum tree, but as the poem progresses a parallel between what is happening to this tree and what sometimes happens with humans emerges–a sudden burst of inspiration and an urge to follow one’s desires, to be wild in spirit without stopping too long to think about it, to “simply answer to the season’s necessity.” This poem also unveils the yearning and sometimes impatience humans have to control the natural world, which cannot be contained. Even though this poem starts off simply, it makes leaps to ultimately arrive at something much larger.\nPlease join us for a lovely evening with Joanne Harris Allred, Thursday, April 10th at 7:30 pm in Colousa 100B. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nBy Kris Wheat\n\n\nApril 9, 2014watershedcsuc CSUC, Joanne Harris Allred, poetry, Writer's Voice Reading Series\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Daryl Farmer \n\n\nCSU, Chico’s Writer’s Voice is proud to present author, Daryl Farmer, Tuesday, February 25, 2014 at 7:30 PM in Colusa 110. Farmer is author of Bicycling beyond the Divide: Two Journeys into the West, which won the Barnes and Noble Discover Great New Writer’s Award and was a Colorado Book Award finalist. Along with his book, Farmer has appeared in Hayden’s Ferry Review, The Laurel Review, Quarter After Eight, and Isotope. Farmer also had a short story published recently, “Where We Land,” which ran in the Summer 2013 issue of The Whitefish Review. Currently, Farmer is a Professor at the University of Alaska Fairbanks, and teaches Creative Writing and a Film and Literature course that examines the short story in relationship to film adaptation.\nFarmer’s first book, Bicycling beyond the Divide: Two Journey’s into the West, is a beautifully woven piece of literature that seamlessly grounds its reader in time and place, allowing for us to follow him on his journey amongst the diverse population and ever changing physical and social landscapes that make up America, as well as the most difficult leg of the trip through his previous, current and projected self. But as we follow along with Farmer, we realize that part of the load he’s carrying is us, the reader, whom he’s placed on the handlebars of his Trek 520 and given us a firsthand view of the world as he sees it unfolding, opening our eyes to the world around us and forcing us to find ourselves within it:\nI looked up at the mountains now as I rode through the falling snow. The aspen trees that once covered the hillsides were gone. In their place stood condominiums packed together so tight, it was hard to tell if there were many buildings or just one, fortress-like and stretching for what seemed miles.\nWas it the world that had changed, or was it me? Now, during a time of heightened security, it was difficult to imagine that I would get away with camping on a resort town golf course. Terrorism and war. Civilian Minutemen with guns “protecting” our southern border. It was a time when a government-issued color code was used to gauge our risk, and freedom itself was being reconfigured to fit the changes. A dosage of fear was fed to us daily. Vitamin or sugar pill, who could say? The news seemed gloomy, yet in 1985 the news had been of starving children, environmental degradation, crisis in the Middle East.\nAt twenty I had feared nothing.\nFrom this brief excerpt, we see how Farmer puts the physical surroundings into perspective with brief descriptive detail, yet leaves enough room for us to fill in the scenery with our own experiences of diminished vegetation and urban sprawl within our community. He paints a vivid picture of the social climate that we reside in, while reflecting on what it was like for him and all who were there in ’85, prodding us to ask the very question he asks of himself:  “Was it the world that had changed, or was it me?”\nPlease join us for a wonderful evening with visiting author, Daryl Farmer. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, our readings are free and open to the public.\nhttp://www.darylfarmer.com/\nBy Jeremy Wallace\n\n\nFebruary 24, 2014watershedcsuc CSUC, Daryl Farmer, Writer's Voice Reading Series\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Jon Raymond \n\n\nThe Chico State Writer’s Voice is proud to present author Jon Raymond.  Raymond is the author of the novel’s Half-Life and Rain Dragon, and a collection of short stories, Livability, winner of the 2009 Ken Kesey award for fiction.  He’s also a screenwriter whose credits include Old Joy, Wendy and Lucy, Meek’s Cutoff, Night Moves, and the HBO miniseries Mildred Pierce.  He lives in Portland with his family.  Raymond’s work was described by Publishers Weekly as, “Gorgeous…Raymond reveals how close failure (and worse) lingers,” and Booklist has described his work as “delicately refined and sublimely electric.”\nYou are strongly encouraged to see Jon Raymond read his work on Thursday, Oct. 17th at 7:30 pm in Ayers 201.\n\n\nOctober 16, 2013watershedcsuc CSUC, Jon Raymond, Writer's Voice Reading Series\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Brenda Hillman \n\n\nThe Butte College Literary Events Committee and CSU, Chico’s Writer’s Voice Series are proud to present poet Brenda Hillman. Hillman will be reading from her new collection, “Seasonal Words with Letters on Fire” at the 1078 Gallery, Tuesday, October 8th at 7:30 pm.\nBorn in Tucson, Arizona in 1951, Hillman has earned degrees at Pomona College and the Iowa Writers’ Workshop. She is currently a professor of creative writing at Saint Mary’s College in Moraga, California and is the author of nine books of poetry. She has received a number of awards, including a Pushcart Prize and the Delmore Schwartz Memorial Award, as well as fellowships from the National Endowment for the Arts and the Poetry Society of America. Hillman was also a finalist for the Pulitzer Prize for her collection Bright Existence (1993) and a finalist for the National Book Critic’s Circle Award for her collection Loose Sugar (1997). Her latest collection, Seasonal Works with Letters on Fire (2013) is a nominee for the National Book Award.\nSays Publishers Weekly: “Hillman’s fast-moving, energetic, and ample 10th collection blazes with indignation . . . . It’s one page lyrics its one-page lyrics connect the origins of the Roman alphabet, children’s reading habits, topical cries against our present-day wars, the evils of genetically modified seeds, the structure of Greek tragedy (“Tiny first with hurt earth spirits/ as in Aeschylus”), prose essays on poetry and protest, daily life on a West Coast campus, and larger-scale objections to the way that human beings have treated the earth…‘Around each word you’re reading/ there spins the unknowable flame.’”\nHillman’s poetry explores the way we use and interact with both the written and spoken word.  Her poetry works to displace our familiarity with language: the same letters we use to communicate “drone strike” or “mother” on one page have, on another, been literally turned on end as she does in “Autumn Ritual With Hate Turned Sideways.” In the case of “Two Summer Aubades, After John Clare,” she reduces lines to linguistic building blocks:\n \nI.  towhee [Pipilo crissalis] wakes a human\n               \n                pp cp cp cp chp chp\npppppppppppp\ncppppcpp   cpp   cpp\n \n         (a woman tosses)\n             Gulf disaster  ster sister\n                aster    aster as   asp\n         ppp cp cp p    bp  bp BP BP\n           scree  screeeeem  we\n       we we didn’t\n         neee neeed to move so fast\n2. woman in red sweater to humminbird\n   sssssss  we  sssssss weee\nno i’m not not  sweet not\n sweeeeetie i’m not\n    something to eeeeeeat   \n \n“Two Summer Aubades, After John Clare” – http://www.youtube.com/watch?v=zgxCNYzuHxI\nThe bold poetics found within the pages of “Seasonal Works With Letters On Fire” are further expressed through Hillman’s approaches to form. Take for instance a haibun entitled “The Body Politic Loses Her Hair,” which not only does not include a haiku, it does include a 1”x3/4” image of the poet holding a protest sign embedded within the text. Or a seemingly new form: a series of double columned “galaxies” dedicated to Helen Hillman and Ruth Gander. Hillman is also a vocal environmentalist, so Mother Earth as a potential subject is easy to imagine.\n \nRinged Galaxies Work With Our Mother\nas they clean                             in skinny time\nin desert autumn                                      drip on verbena\nscraps of toast                          sorted rubber bands\nscraps of string                         saved for the least\ndid she have to                     could someone else save\nbits of matter                                could fail to rise\nask your doctor                        if cosmic fire\nis right for you                                    when you were born\nkingdom to creature                                  qui coisa\ntheir iambs                                     of those\nsome galaxies rise                        as a furnace\nneeds cleaning                                               its arcing noise\nthe mom is our sheperd                her diving down\nhummingbird baroque                   freedom you know\nmy substance                was not hid\nfrom thee                  where I was\nmade in secret                   the visible talks back\nher areas            of power   \njust need                           not to worry\nbehind the tiny pizza                      behaviors\naren’t essences              you know that\nHillman’s poetry is at once deeply activistic while at the same time capable of transmuting language into its most basic parts. In doing so, she forces her readers to reevaluate their perspectives, their “new haircuts” and their “bosses” with their “new wars.”  She has distilled the fire of our language and the fires burning in the world around us into lines, stanzas, and dedications.\nWe hope you will join us in celebrating the work of Brenda Hillman.\nBy Stan Upshaw and Danielle Fernandez\n\n\nOctober 5, 2013watershedcsuc Brenda Hillman, Butte College, CSUC, poetry, Writer's Voice Reading Series\nLeave a comment\n\n\n\n\n\n\nBlogroll\n\nDiscuss\nGet Inspired\nGet Polling\nGet Support\nLearn WordPress.com\nTheme Showcase\nWordPress Planet\nWordPress.com News\n\n\nTopics\n\nIntern Spotlight\n\nUncategorized\n\n\nUpcoming Events No upcoming events\nArchives\n\nMay 2022\nMarch 2022\nMay 2020\nOctober 2019\nMay 2019\nApril 2019\nOctober 2018\nJanuary 2018\nDecember 2017\nOctober 2017\nSeptember 2017\nApril 2017\nNovember 2016\nOctober 2016\nSeptember 2016\nDecember 2015\nOctober 2015\nSeptember 2015\nApril 2015\nMarch 2015\nFebruary 2015\nNovember 2014\nOctober 2014\nSeptember 2014\nApril 2014\nFebruary 2014\nNovember 2013\nOctober 2013\nAugust 2013\nApril 2013\nMarch 2013\nFebruary 2013\nJanuary 2013\n\n \n\nFollow me on TwitterMy Tweets \n\n\n\n\nCreate a free website or blog at WordPress.com.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\tPrivacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. \nTo find out more, including how to control cookies, see here:\n\t\t\t\t\n\t\t\tCookie Policy\t\t\n\n\n \n\n\n\nFollow\n\n\nFollowing\n\n\n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\nJoin 44 other followers\n\n\n\n\n\n\n\n \n\n\t\t\t\t\t\t\t\t\t\t\t\tSign me up\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tAlready have a WordPress.com account? Log in now. \n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\n\n Customize\n\n\n\n\nFollow\n\n\nFollowing\n\n\nSign up\nLog in\n\n\n\t\t\t\t\t\t\t\t\t\t\tReport this content\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tView site in Reader\t\t\t\t\t\t\t\t\t\t\n\n\nManage subscriptions\n\nCollapse this bar\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n",
    "links": [
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/",
        "#content",
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/about/",
        "https://watershedcsuc.wordpress.com/history/",
        "https://watershedcsuc.wordpress.com/submit/",
        "https://watershedcsuc.wordpress.com/2018/10/29/writers-voice-spotlight-lynn-freed/",
        "https://therumpus.net/2018/02/the-rumpus-interview-with-lynn-freed/",
        "https://watershedcsuc.wordpress.com/2018/10/29/writers-voice-spotlight-lynn-freed/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/fiction/",
        "https://watershedcsuc.wordpress.com/tag/lynn-freed/",
        "https://watershedcsuc.wordpress.com/tag/nonfiction/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice-reading-series/",
        "https://watershedcsuc.wordpress.com/2018/10/29/writers-voice-spotlight-lynn-freed/#respond",
        "https://watershedcsuc.wordpress.com/2016/09/19/writers-voice-spotlight-valerie-fioravanti/",
        "https://valeriefioravanti.com",
        "http://www.thetishmanreview.com/wp-content/uploads/2014/10/TTRJULY2016.compressed-2.pdf",
        "https://watershedcsuc.wordpress.com/2016/09/19/writers-voice-spotlight-valerie-fioravanti/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/fiction/",
        "https://watershedcsuc.wordpress.com/tag/valerie-fioravanti/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice-reading-series/",
        "https://watershedcsuc.wordpress.com/2016/09/19/writers-voice-spotlight-valerie-fioravanti/#respond",
        "https://watershedcsuc.wordpress.com/2014/04/09/writers-voice-spotlight-joanne-harris-allred/",
        "https://watershedcsuc.files.wordpress.com/2014/04/allred.jpg",
        "https://watershedcsuc.wordpress.com/2014/04/09/writers-voice-spotlight-joanne-harris-allred/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/joanne-harris-allred/",
        "https://watershedcsuc.wordpress.com/tag/poetry/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice-reading-series/",
        "https://watershedcsuc.wordpress.com/2014/04/09/writers-voice-spotlight-joanne-harris-allred/#respond",
        "https://watershedcsuc.wordpress.com/2014/02/24/writers-voice-spotlight-daryl-farmer/",
        "https://watershedcsuc.files.wordpress.com/2014/02/daryl_farmer_author.jpg",
        "http://www.darylfarmer.com/",
        "https://watershedcsuc.wordpress.com/2014/02/24/writers-voice-spotlight-daryl-farmer/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/daryl-farmer/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice-reading-series/",
        "https://watershedcsuc.wordpress.com/2014/02/24/writers-voice-spotlight-daryl-farmer/#respond",
        "https://watershedcsuc.wordpress.com/2013/10/16/writers-voice-spotlight-jon-raymond/",
        "https://watershedcsuc.files.wordpress.com/2013/10/raymond.jpg",
        "https://watershedcsuc.wordpress.com/2013/10/16/writers-voice-spotlight-jon-raymond/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/jon-raymond/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice-reading-series/",
        "https://watershedcsuc.wordpress.com/2013/10/16/writers-voice-spotlight-jon-raymond/#respond",
        "https://watershedcsuc.wordpress.com/2013/10/05/writers-voice-spotlight-brenda-hillman/",
        "https://watershedcsuc.files.wordpress.com/2013/10/hillman_448.jpg",
        "http://http://www.youtube.com/watch?v=zgxCNYzuHxI",
        "https://watershedcsuc.wordpress.com/2013/10/05/writers-voice-spotlight-brenda-hillman/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/brenda-hillman/",
        "https://watershedcsuc.wordpress.com/tag/butte-college/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/poetry/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice-reading-series/",
        "https://watershedcsuc.wordpress.com/2013/10/05/writers-voice-spotlight-brenda-hillman/#respond",
        "http://en.forums.wordpress.com/",
        "http://www.plinky.com/",
        "http://polldaddy.com/",
        "http://en.support.wordpress.com/",
        "http://learn.wordpress.com/",
        "http://theme.wordpress.com/",
        "http://planet.wordpress.org/",
        "http://en.blog.wordpress.com/",
        "https://watershedcsuc.wordpress.com/category/intern-spotlight/",
        "https://watershedcsuc.wordpress.com/category/uncategorized/",
        "https://watershedcsuc.wordpress.com/2022/05/",
        "https://watershedcsuc.wordpress.com/2022/03/",
        "https://watershedcsuc.wordpress.com/2020/05/",
        "https://watershedcsuc.wordpress.com/2019/10/",
        "https://watershedcsuc.wordpress.com/2019/05/",
        "https://watershedcsuc.wordpress.com/2019/04/",
        "https://watershedcsuc.wordpress.com/2018/10/",
        "https://watershedcsuc.wordpress.com/2018/01/",
        "https://watershedcsuc.wordpress.com/2017/12/",
        "https://watershedcsuc.wordpress.com/2017/10/",
        "https://watershedcsuc.wordpress.com/2017/09/",
        "https://watershedcsuc.wordpress.com/2017/04/",
        "https://watershedcsuc.wordpress.com/2016/11/",
        "https://watershedcsuc.wordpress.com/2016/10/",
        "https://watershedcsuc.wordpress.com/2016/09/",
        "https://watershedcsuc.wordpress.com/2015/12/",
        "https://watershedcsuc.wordpress.com/2015/10/",
        "https://watershedcsuc.wordpress.com/2015/09/",
        "https://watershedcsuc.wordpress.com/2015/04/",
        "https://watershedcsuc.wordpress.com/2015/03/",
        "https://watershedcsuc.wordpress.com/2015/02/",
        "https://watershedcsuc.wordpress.com/2014/11/",
        "https://watershedcsuc.wordpress.com/2014/10/",
        "https://watershedcsuc.wordpress.com/2014/09/",
        "https://watershedcsuc.wordpress.com/2014/04/",
        "https://watershedcsuc.wordpress.com/2014/02/",
        "https://watershedcsuc.wordpress.com/2013/11/",
        "https://watershedcsuc.wordpress.com/2013/10/",
        "https://watershedcsuc.wordpress.com/2013/08/",
        "https://watershedcsuc.wordpress.com/2013/04/",
        "https://watershedcsuc.wordpress.com/2013/03/",
        "https://watershedcsuc.wordpress.com/2013/02/",
        "https://watershedcsuc.wordpress.com/2013/01/",
        "https://twitter.com/466661251926335488",
        "https://wordpress.com/?ref=footer_website",
        "https://automattic.com/cookies/",
        "",
        "",
        "https://watershedcsuc.wordpress.com",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2018%2F10%2F29%2Fwriters-voice-spotlight-lynn-freed%2F&signup_flow=account",
        "https://watershedcsuc.wordpress.com",
        "https://watershedcsuc.wordpress.com/wp-admin/customize.php?url=https%3A%2F%2Fwatershedcsuc.wordpress.com%2Ftag%2Fwriters-voice-reading-series%2F",
        "",
        "",
        "https://wordpress.com/start/",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2018%2F10%2F29%2Fwriters-voice-spotlight-lynn-freed%2F&signup_flow=account",
        "http://en.wordpress.com/abuse/?report_url=https://watershedcsuc.wordpress.com",
        "https://wordpress.com/read/feeds/7518230",
        "https://subscribe.wordpress.com/",
        "",
        "#",
        "#"
    ]
}