{
    "title": "A message on graduate student unionization - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 7, 2023 A message on graduate student unionization \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\nDear members of the Stanford community,\nOn April 3, the Stanford Graduate Workers Union (SGWU) publicly launched a unionization campaign. As many of you may know, these organizing efforts follow a 2016 decision by the National Labor Relations Board that gave graduate students working as teaching or research assistants at private universities the right to unionize.\nWe recognize and greatly value the many contributions that graduate students make to Stanford’s mission of teaching and research. Stanford’s relationship with our graduate students is, first and foremost, an educational one. Stanford believes that the instructional and research activities in which PhD students engage are primarily in service of their training for the careers they will pursue after they obtain their degree, whether in academia or elsewhere. Our vibrant graduate student community across Stanford’s seven schools is also a diverse one, with distinct individual voices and perspectives. As graduate students consider their path forward, we wish to summarize the principles that will inform the university’s approach.\nFirst, the decision to unionize is a consequential one, both for current and for future graduate students. During this process, graduate students’ most important role will be to educate themselves about unionization and to exercise their right to vote. Stanford commits to providing factual information to our community through this website.\nWe encourage every graduate student to consider closely what it means to become a member of a union, what it means to engage in collective bargaining, and what it means to have their educational experience governed by a collective bargaining agreement. It is important to note that, if elected, the union will represent not only today’s graduate students, but future graduate students, who will not have the same opportunity to vote on union representation.\nSecond, this is a complex topic, on which reasonable people can disagree. As leaders of a learning community, we invite and encourage graduate students and others to engage in robust discussion of these issues. At the same time, it’s critical that individuals do not attempt to unduly influence students’ choices or their votes. Graduate students must be free to make this decision on their own.\nThird, unionization is about employment matters, not academic ones. Should graduate students vote to be represented by the SGWU, it is our strong position that academic matters, including admissions decisions, curriculum and degree requirements, organization of programs, academic standards, evaluation of academic progress, and assignment of research and teaching assistant roles, are rights that should be retained by the university.\nAs graduate students make this consequential decision, we are committed to an ongoing, open dialogue with them within the parameters that the law in this area allows. Just as we are dedicated to deepening their expertise, nurturing their creativity, and ultimately preparing them for future success, we will continue to work hard to understand, appreciate, and be responsive to the needs of our graduate students, so that we may also foster their well-being throughout their time at Stanford.\nSincerely,\nMarc Tessier-Lavigne\nPresident\nPersis Drell\nProvost\n\n\n\n\n\n\n\n\n\n\n\n\nOffice Of The President\nInstitutional News\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D11812",
        "https://www.nlrb.gov/news-outreach/news-story/board-student-assistants-covered-by-the-nlra",
        "http://gradstudentunionization.stanford.edu/",
        "https://news.stanford.edu/report/content-partner/office-of-the-president/",
        "https://news.stanford.edu/report/topic/institutional-news/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D11812",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}