{
    "title": "Facts, Mission and History | San Diego State University",
    "body": "\n\n\n\nSkip to content\n\n\n\n\nApply\nVisit\nInfo\nGive\n\n\nopensearchsubmit\nMenu\n\n\n\nopenAbout SDSU\nHistory & Mission\nLeadership\nStrategic Plan\nDiversity\nLand Acknowledgement\nContact Us\n\n\nopenNews & Events\nAll News\nCalendar\nSocial Media\n\n\nopenAcademics\nPrograms\nAcademic Support\nAcademic Calendars\nStudy Abroad\nSDSU Imperial Valley\nSDSU Global Campus\nSDSU Library\nCanvas\n\n\nopenAdmissions & Aid\nFirst-Year Students\nTransfer Students\nGraduate Students\nInternational Students\nVeterans & Service Members\nParents & Families\nCounselors\nCost of Attendance\nFinancial Aid & Scholarships\n\n\nopenLife at SDSU\nHousing\nDining\nStudent Union\nClubs & Organizations\nPerformance Groups\nAztec Recreation Center\nHealth & Well-being\nSupport & Services\nAthletics\n\n\nopenResearch & Innovation\nCenters & Institutes\nCore Facilities\nStudent Research\nEntrepreneurship\nSustainability\nResearch Foundation\nInformation for Researchers\n\n\nAlumni\n                           \t\t\t\t\t\nGive\n                           \t\t\t\t\t\n\n\n\n\nopenI am a\n\nFuture Student\nCurrent Student\nNewly Admitted Student\nParent/Guardian\nCounselor\nFaculty / Staff Member\n\n\n\n\n\nopenColleges\n\nArts and Letters\nFowler College of Business\nEducation\nEngineering\nGraduate Studies\nHealth and Human Services\nSDSU Library\nProfessional Studies and Fine Arts\nSciences\nWeber Honors College\n\n\n\nopenOther Locations\n\nSDSU Georgia\nSDSU Global Campus\nSDSU Imperial Valley\nSDSU Mission Valley\n\n\n\n\n\nApply\nVisit\nInfo\nGive\n\n\n\nyoutube\ntwitter\nfacebook\ninstagram\n\n\n\n\n\n\n\nIn this SectionSDSUAboutAboutAbout SDSUFacts, Mission and HistoryLeadershipStrategic PlanDiversityLand AcknowledgementContact UsFacts, Mission and History\nQuick Facts:\n\nFounded: 1897\nAlumni: 400,000+\nStudents (for fall 2021): 35,732\nFaculty & Staff: 6,890\nDegree Programs: 203\nNo. graduating (2020-21): approximately 10,242\nAnnual Research: >$140 million\nAthletic Teams: 17\nUndergraduate Applicants (for fall 2021): approximately 92,000\nCurrent President: Adela de la Torre\n\n\n\nMission\nThe mission of San Diego State University is to provide research-oriented, high-quality education for undergraduate and graduate students and to contribute to the solution of problems through excellence and distinction in teaching, research, and service. The university strives to impart an appreciation and broad understanding of the human experience throughout the world and the ages. This education extends to diverse cultural legacies and accomplishments in many areas, such as the arts and technology; the advancement of human thought including philosophy and science; the development of economic, political, and social institutions; and the physical and biological evolution of humans and their environment. San Diego State University pursues its mission through its many diverse departments and interdisciplinary programs in the creative and performing arts, the humanities, the sciences, and the social and behavioral sciences.\n\n\nHistory\nSan Diego State University is the oldest higher education institution in San Diego.\nSince its founding in 1897, the university has grown to become a leading public research university, and a federally-designated Hispanic-serving Institution as well as an Asian American and Native American Pacific Islander-Serving Institution (AANAPISI). Each year, SDSU provides more than 36,000 students with the opportunity to participate in an academic curriculum distinguished by direct contact with faculty and an international emphasis that prepares them for a global future.\nIn The Beginning\nServing the San Diego region has always been a core part of SDSU’s mission.\nFounded March 13, 1897, San Diego State University began as the San Diego Normal School, a training facility for elementary school teachers. Seven faculty and 91 students met in temporary quarters over a downtown drugstore before moving to a newly constructed 17-acre campus on Park Boulevard.\nThe curriculum was first limited to English, history and mathematics. Course offerings broadened rapidly under the leadership of first president, Samuel T. Black, who left his position as state superintendent of public instruction to become the new school's first president. Black served from 1898 to 1910.\nFrom 1910 to 1935, SDSU President Edward L. Hardy headed a vigorous administration that oversaw major changes to the fledgling institution. In 1921, the Normal School became San Diego State Teachers College, a four-year public institution controlled by the state Board of Education. In that same year, the two-year San Diego Junior College, forerunner of today's local community colleges, became a branch of San Diego State Teachers College. That union lasted until 1946.\n1931 Relocation\nBy the 1920s, the college was already beginning to outgrow its Park Boulevard location, and San Diegans launched a campaign to build a new campus on the city's eastern border.\nIn February 1931, students, faculty and staff moved into seven buildings surrounding a common area still known as the Main Quad.\nSDSU's new campus on Montezuma Mesa in 1930.\nFour years later, the state Legislature authorized expansion of degree programs beyond teacher education, and San Diego State Teachers College became San Diego State College. In 1935, Walter R. Hepner took the helm as SDSU president, beginning a 17-year tenure.\nThe college continued to grow over time, reaching an enrollment of more than 25,000 students during the administration of Malcolm A. Love, who served as president from 1952 to 1971. The SDSU Library is named after Love.\nThe SDSU Library is named after Malcolm A. Love, who served as SDSU president from 1952 to 1971.\nIn 1959, what is now known as SDSU Imperial Valley was founded on the original site of the first Calexico High School.\nIn 1960, San Diego State College became part of the newly created California State College system, now known as The California State University system.\nIn 1963, just months before he was assassinated, U.S. President John F. Kennedy gave the commencement address at San Diego State College. President Kennedy received the university's first honorary doctorate – also the first in the CSU system.\nU.S. President John F. Kennedy giving the 1963 SDSU Commencement address.\nIn the early 1970s, with legislative approval, San Diego State College became San Diego State University.\nLeading the university during the 1970s were Acting President Donald E. Walker (1971-1972), President Brage Golding (1972-1977), Acting President Trevor Colbourn (1977-1978) and President Thomas B. Day, whose tenure spanned 1978 to 1996.\nDay championed the teacher-scholar model for faculty and promoted research across campus. His vision led the way for new areas of exploration and an increase in research grants and contracts awarded to SDSU faculty.\nIn 1996, Stephen L. Weber became the university's seventh president, presiding over the university's significant gains in student preparation and graduation, study abroad, philanthropy, research and other areas of excellence.\nElliot Hirshman served as president of San Diego State University from 2011 to June 30, 2017 – a period in which SDSU raised its profile as a major public research university. SDSU created a new strategic plan, raised over $800 million for scholarships and new initiatives and programs, established and endowed the Susan and Stephen Weber Honors College, and built and remodeled facilities across campus.\nFormer SDSU presidents Stephen L. Weber, Elliot Hirshman and Thomas B. Day.\nSally Roush – a former senior vice president at SDSU – began her term as interim president on July 1, 2017. She is the first woman to be named president of San Diego State University.\nOn Jan. 31, it was announced that Adela de la Torre, vice chancellor for student affairs and campus diversity at University of California, Davis, would become the university's ninth president in late June 2018, and the first woman to be named permanent president of SDSU.\nUnder the charge of SDSU President Adela de la Torre came the development of SDSU Mission Valley, SDSU Imperial Valley's expansion and a new, 5-year strategic plan.\nIn her first several years as president, de la Torre is credited with leading new initiatives that leverage the university’s historic legacy to elevate the campus into a new era of excellence. Under de la Torre’s tenure, the university launched a new, 5-year strategic plan, saw record increases in philanthropy, diversified the university’s funding and auxiliary sources to balance revenue streams and expanded investments in SDSU Imperial Valley. The university also saw improvements in student retention and graduation rates and closed equity gaps across several categories through expanded investments in advising, innovative use of virtual technologies, support programs, student aid initiatives, health and well-being offerings and other efforts.\nDe la Torre led the university through its response plan during the COVID-19 pandemic, launching and sustaining SDSU Flex, a flexible repopulation, instruction and business continuity plan.\nThe purchase, groundbreaking and initial construction of SDSU Mission Valley also began under de la Torre’s tenure. A critical component of SDSU Mission Valley is the innovation district, which is important to growing the university’s already unique status as a high research-activity, community-engaged, border-connected, emerging R-1 institution.\n\n\nSDSU Today\nSan Diego State University can take pride in more than a century of achievement in education, research and service.\nLocated near the U.S.-Mexico border, SDSU is the top California State University campus for federal research support and is an active research public university in California. Students participate in transformational research, international experiences, sustainability and entrepreneurship initiatives, internships and mentoring, and have access to a diverse range of student life opportunities. SDSU, a federally-designated Hispanic-serving Institution residing on Kumeyaay land, is known for its long-standing efforts advancing diversity and inclusion, and for its Division I athletic program.\n\nWith an enrollment of more than 36,000 students, SDSU is increasingly becoming a top choice for undergraduates as evidenced by the record number of applications received each year. SDSU is consistently ranked by national organizations and publications, to include those such as Forbes, Fortune and U.S. News & World Report, for students studying abroad, its academic excellence, diversity and inclusion initiatives and academic excellence. The university is home to highly ranked graduate programs in business, engineering, public health, psychology, fine arts, biological sciences, public affairs, entrepreneurship, education and speech, language, and hearing sciences. Overall, SDSU students can choose from bachelor's degrees in 96 areas, 84 fields and 23 doctoral degrees, as well as programs at regional microsites and online programs offered no matter where they are around the globe.\nSDSU also has locations at SDSU Imperial Valley and SDSU Georgia.\nDuring the 2020-21 academic year, SDSU Imperial Valley saw expanded offerings and student support services following three years of increased investment across the campus.\nSDSU Imperial Valley offers 10 bachelor's and two master's degrees, including a nationally-acclaimed teacher education program, providing a uniquely intimate educational experience. The university offers students the advantages of small classes with convenient accessibility to a dedicated faculty and staff. Interactive videoconferencing provides students at the Calexico and Brawley sites the opportunity to participate in classes broadcast live from San Diego. Students at SDSU Imperial Valley can be involved in a rewarding campus life through its student clubs, Associated Students, guest lectures, art exhibits and musical events. The Brawley location is 24 miles north of the Calexico site.\nSDSU Georgia, a U.S. Department of State-funded program, is a representation of San Diego State University in Tbilisi, Georgia. The university offers internationally accredited Bachelor of Science programs in the fields of science, technology, engineering, and mathematics in the Republic of Georgia. \nCampus Growth and Expansion\nPerhaps the most visible evidence of SDSU's growth is in the physical additions to its San Diego campus and its continued commitment to providing a state-of-the-art learning environment for students, faculty and staff. The university has reimagined and renovated academic buildings and complexes, the library, labs and residence halls. The Engineering and Interdisciplinary Sciences Complex houses instructional areas and provides ample capacity for collaborative space and labs for interdisciplinary teams and SDSU's entrepreneurship centers.\n\nThe Conrad Prebys Aztec Student Union serves as the center of SDSU university life. It contains many sustainable and energy-efficient features and has obtained LEED-certified platinum status for both building features and operations. In addition, the Parma Payne Goodall Alumni Center welcomes alumni back to campus and provides a professional meeting and events venue for the entire San Diego region.\nIn 2020, the university broke ground on SDSU Mission Valley, which is designed as a vibrant, mixed-use, medium-density development that is transit-oriented, and expands the university’s educational, research, entrepreneurial, and technology transfer programs. SDSU Mission Valley will include transit, retail, housing, and the development of more than 80 acres of community parks and open space, including the 34-acre River Park.\n\nNotable Alumni\nBeyond accolades and campus expansion, SDSU remains, as always, most proud of its alumni family, more than 400,000 strong, including:\n\nHollywood producer and Lucasfilm president Kathleen Kennedy\nFormer Federal Trade Commission chair Timothy Muris\nFormer Air Force Chief of Staff Gen. Merrill A. \"Tony\" McPeak\nFormer San Diego Mayor Kevin Faulconer\nFormer San Diego County Supervisors:\n\nGreg Cox\nDianne Jacob\nRon Roberts\nBill Horn\n\n\nAstronaut and former Johnson Space Center director Ellen Ochoa\nCostco co-founder Jim Sinegal\nLinda A. Lang, former CEO of Jack in the Box restaurants\nRalph Rubio, founder and chairman of Rubio’s Fresh Mexican Grill.\nEntertainers:\n\nGregory Peck\nMarion Ross\nJulie Kavner\nKathy Najimy\n\n\nBaseball Hall of Famer Tony Gwynn\nFormer Major League Baseball manager Bud Black\nU.S. Open winner and former PGA tour golfer Gene Littler\nAmerica's Cup skipper Dennis Conner\nWashington Nationals pitcher Stephen Strasburg\nBasketball star Kawhi Leonard\n\nThe success of these individuals and hundreds of thousands of other SDSU alumni attest to the motivating influence of their alma mater. From modest beginnings, San Diego State University has evolved into a premier center of education, research and service.\n\n\nWelcome to SDSU\nApplyVisitGet Info\n\n\n\n\n\n\nyoutube\ntwitter\nfacebook\ninstagram\n\n\n\n\n619-594-5200\n               \t\t\t\t\t\t\t5500 Campanile Drive\n               \t\t\t\t\t\t\tSan Diego, CA 92182\n\nMaps\nParking\n\n\n\n\nCampus Directory\nEmployment\nMedia Relations\nCanvas\n\n\n\n\nGeneral Contact\nNetwork Status\nStrategic Plan\nNewsletter\n\n\n\n\n\n\nAccessibility\nDocument Readers\nDigital Privacy Statement\nCampus Safety Reports\nFeedback\n\n© 2023 San Diego State UniversityAll Rights ReservedLast Updated\nback to top\n\n\n\n\n\n\n\n\n\n\n\n\n\nLast Updated 3/4/22",
    "links": [
        "#main",
        "https://www.sdsu.edu/",
        "https://admissions.sdsu.edu/apply",
        "https://admissions.sdsu.edu/tours-events/",
        "https://enroll.sdsu.edu/register/stay-connected",
        "https://give.sdsu.edu/",
        "https://www.sdsu.edu/about/",
        "https://www.sdsu.edu/about/facts-mission-and-history.aspx",
        "https://president.sdsu.edu/leadership/senior-leadership",
        "https://www.sdsu.edu/strategic-plan/",
        "https://www.sdsu.edu/diversity.aspx",
        "https://sacd.sdsu.edu/diversity-resources/land-acknowledgment",
        "https://www.sdsu.edu/contact/",
        "https://newscenter.sdsu.edu/sdsu_newscenter/news.aspx",
        "https://newscenter.sdsu.edu/",
        "https://sacd.sdsu.edu/calendar",
        "https://communities.sdsu.edu/",
        "https://www.sdsu.edu/academics/",
        "https://www.sdsu.edu/programs/",
        "https://studentsuccess.sdsu.edu/seeing_an_advisor",
        "https://registrar.sdsu.edu/calendars/academic_calendars",
        "https://www.sdsu.edu/global-education/index.aspx",
        "https://imperialvalley.sdsu.edu/",
        "https://ces.sdsu.edu/",
        "https://library.sdsu.edu/",
        "https://canvas.sdsu.edu/",
        "https://www.sdsu.edu/admissions-aid/",
        "https://admissions.sdsu.edu/first-years/",
        "https://admissions.sdsu.edu/transfers/",
        "https://admissions.sdsu.edu/graduate/",
        "https://admissions.sdsu.edu/international/",
        "https://arweb.sdsu.edu/es/veterans/admissions.html",
        "https://admissions.sdsu.edu/parents-families/",
        "https://admissions.sdsu.edu/counselors/",
        "https://admissions.sdsu.edu/cost",
        "https://sacd.sdsu.edu/financial-aid",
        "https://www.sdsu.edu/life-at-sdsu/",
        "https://housing.sdsu.edu/",
        "https://www.eatatsdsu.com/",
        "https://as.sdsu.edu/union/",
        "https://sacd.sdsu.edu/student-life-leadership/student-organizations",
        "https://music.sdsu.edu/index.php/performing_groups",
        "https://arc.sdsu.edu/",
        "https://sacd.sdsu.edu/health-promotion",
        "https://sdsustudentresourceguide.carrd.co/",
        "https://goaztecs.com/",
        "https://www.sdsu.edu/research-innovation/",
        "https://research.sdsu.edu/centers_institutes",
        "https://research.sdsu.edu/core_facilities",
        "https://grad.sdsu.edu/",
        "https://research.sdsu.edu/entrepreneurship",
        "https://sustainable.sdsu.edu/",
        "https://foundation.sdsu.edu/",
        "https://research.sdsu.edu/research_affairs",
        "http://www.sdsualumni.org/",
        "https://give.sdsu.edu/",
        "https://admissions.sdsu.edu/",
        "https://newscenter.sdsu.edu/home/currentstudents.aspx",
        "https://admissions.sdsu.edu/admitted",
        "https://admissions.sdsu.edu/parents-families/",
        "https://admissions.sdsu.edu/counselors/",
        "https://www.sdsu.edu/faculty-staff/",
        "https://cal.sdsu.edu/",
        "https://business.sdsu.edu/",
        "https://education.sdsu.edu/",
        "https://www.engineering.sdsu.edu/",
        "https://grad.sdsu.edu/",
        "https://chhs.sdsu.edu/",
        "https://library.sdsu.edu/",
        "https://psfa.sdsu.edu/",
        "https://sciences.sdsu.edu/",
        "https://honors.sdsu.edu/",
        "https://georgia.sdsu.edu/en",
        "https://ces.sdsu.edu/",
        "https://imperialvalley.sdsu.edu/",
        "https://missionvalley.sdsu.edu/",
        "https://admissions.sdsu.edu/apply",
        "https://admissions.sdsu.edu/tours-events/",
        "https://enroll.sdsu.edu/register/stay-connected",
        "https://give.sdsu.edu/",
        "https://www.youtube.com/user/SDSUVideo",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "https://instagram.com/sandiegostateuniversity",
        "/",
        "https://www.sdsu.edu/about/",
        "/about",
        "/about/facts-mission-and-history",
        "https://president.sdsu.edu/leadership/senior-leadership",
        "/strategic-plan",
        "https://sacd.sdsu.edu/",
        "https://sacd.sdsu.edu/diversity-resources/land-acknowledgment",
        "/contact",
        "https://admissions.sdsu.edu/apply",
        "https://admissions.sdsu.edu/tours-events",
        "https://enroll.sdsu.edu/register/stay-connected",
        "https://www.sdsu.edu/",
        "https://www.youtube.com/user/SDSUVideo",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "https://instagram.com/sandiegostateuniversity",
        "tel:6195945200",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/campus/parkingtrans/permits",
        "https://directory.sdsu.edu/",
        "https://bfa.sdsu.edu/hr/jobs",
        "https://brand.sdsu.edu/stratcomm/media-relations",
        "https://canvas.sdsu.edu/",
        "https://www.sdsu.edu/contact/",
        "https://status.sdsu.edu/",
        "https://www.sdsu.edu/strategic-plan/",
        "https://www.sdsu.edu/newscenter-newsletter-signup.aspx",
        "https://accessibility.sdsu.edu/",
        "https://www.sdsu.edu/document-readers",
        "https://www.sdsu.edu/digital-privacy",
        "https://police.sdsu.edu/public-information/clery-act-compliance/annual-reports",
        "https://www.sdsu.edu/feedback",
        "https://a.cms.omniupdate.com/11/?skin=sdsu&account=prod&site=www&action=de&path=/about/facts-mission-and-history.pcf"
    ]
}