{
    "title": "\n\t\tPrivacy Policy | Chapman University\n\n\n\t",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\t\t\t\tSome of the content on this website requires JavaScript to be enabled in your web browser to function as\n\t\t\t\tintended. This includes, but is not limited to: navigation, video, image galleries, etc. While the\n\t\t\t\twebsite is\n\t\t\t\tstill usable without JavaScript, it should be enabled to enjoy the full interactive experience.\n\t\t\t\n\n\n\n\n    Skip to main content \n\n\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n                Chapman University Logo\n              \n\n\nClose Off-Canvas Menu\n\n\n\n\n\n\n\n\nChapman Menu\n\n\n\n\nAbout\n\n\nBack\n\nAbout Overview\n\n\nMaps & Directions\n\n\nVisit Chapman\n\n\nFacts and Ranking\n\n\nLeadership\n\n\nDiversity and\n                        Inclusion\n\n\nCampus Services\n\n\nConnect\n\n\n\n\nAcademics\n\n\nBack\n\nAcademics Overview\n\n\nDegrees & Programs\n\n\nSchools & Colleges\n\n\nAcademic Calendar\n\n\nFaculty Directory\n\n\nLibraries\n\n\nCourse Catalogs\n\n\nInternational Studies\n\n\n\n\nAdmission\n\n\nBack\n\nAdmission Overview\n\n\nUndergraduate Admission\n\n\nUndergraduate Application\n\n\nGraduate Admission\n\n\nGraduate Application\n\n\nAffordability\n\n\nFinancial Aid\n                        Calculator\n\n\nTours and Visits\n\n\n\n\nAlumni\n\n\nBack\nAlumni\n\nAlumni Overview\n\n\nGet Involved\n\n\nCareer Support\n\n\n\n\nArts\n\n\nBack\nArts\n\nArts at Chapman Overview\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser\n                        Archives\n\n\nCollege of Performing Arts Events\n\n\nEscalette Permanent Collection of Art\n\n\nGuggenheim Gallery\n\n\nHilbert Museum of California Art\n\n\nMusco Center for the Arts\n\n\n\n\nCampus Life\n\n\nBack\nCampus Life\n\nCampus Life Overview\n\n\nAthletics\n\n\nDiversity and Inclusion\n\n\nEvents\n\n\nFish Interfaith Center\n\n\nHealth and Wellness\n\n\nResidence Life\n\n\nStudent Life\n\n\n\n\nResearch\n\n\nBack\n\nResearch Overview\n\n\nSponsored Projects Services\n\n\nResearch Integrity\n\n\nInstitutes and Centers\n\n\nCenter for Undergraduate\n                        Excellence\n\n\nIndustry Alliances and\n                        Commercialization\n\n\n\n\nSupport \n\n\nBack\n\nSupport Chapman Overview\n\n\nGet Involved\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n                          Alumni\n                        \n\n\n\n                          Community\n                        \n\n\n\n                          Faculty & Staff\n                        \n\n\n\n                          Industry Partners\n                        \n\n\n\n                          Parents & Family\n                        \n\n\n\n                          Students\n                        \n\n\n\n\n\n\n\n\n\n                          Visit\n                        \n\n\n\n                          Apply\n                        \n\n\n\n                          Give\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Visit\n              \n\n\n\n                Apply\n              \n\n\n\n                Give\n              \n\n\n\n\n\n\n\n\nInfo For\n              \n\n\n\n\n\n\n\n\nAlumni \n\n\n\n\nCommunity\n\n\n\n\n\nFaculty & Staff\n\n\n\n\nIndustry Partners\n\n\n\n\nParents & Family\n\n\n\n\nStudents\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nÃ\u0097\n\n\n\n\n\n\n\nsearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              Custom Search \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncanva icon\nCanvas\n\n\n\n\n\n\n\n\n\n\nHandshake (career portal)\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Self-Service (my.chapman)\n\n\n\n\n\nWorking@Chapman (faculty and staff)\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\n\n\n\n\n\n\n\n\nAbout Overview\n\n\n\n\nMaps & Directions\n\n\n\n\nVisit Chapman\n\n\n\n\nFacts and Ranking\n\n\n\n\nLeadership\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nCampus Services\n\n\n\n\nConnect\n\n\n\n\n\n\n\n\n\nAcademics\n\n\n\n\n\n\n\n\n\nAcademics Overview\n\n\n\n\nDegrees & Programs\n\n\n\n\nSchools & Colleges\n\n\n\n\nAcademic Calendar\n\n\n\n\nFaculty Directory\n\n\n\n\nLibraries\n\n\n\n\nCourse Catalogs\n\n\n\n\nInternational Studies\n\n\n\n\n\n\n\n\n\nAdmission\n\n\n\n\n\n\n\n\n\nAdmission Overview\n\n\n\n\nUndergraduate Admission\n\n\n\n\nUndergraduate Application\n\n\n\n\nGraduate Admission\n\n\n\n\nGraduate Application\n\n\n\n\nAffordability\n\n\n\n\nFinancial Aid Calculator\n\n\n\n\nTours and Visits\n\n\n\n\n\n\n\n\n\nAlumni\n\n\n\n\n\n\n\n\n\nAlumni Overview\n\n\n\n\nGet Involved\n\n\n\n\nCareer Support\n\n\n\n\n\n\n\n\n\nArts\n\n\n\n\n\n\n\n\n\nArts at Chapman Overview\n\n\n\n\nCaliforniaâ\u0080\u0099s Gold Exhibit and Huell Howser Archives\n\n\n\n\nCollege of Performing Arts Events\n\n\n\n\nEscalette Permanent Collection of Art\n\n\n\n\nGuggenheim Gallery\n\n\n\n\nHilbert Museum of California Art\n\n\n\n\nMusco Center for the Arts\n\n\n\n\n\n\n\n\n\nCampus Life\n\n\n\n\n\n\n\n\n\nCampus Life Overview\n\n\n\n\nAthletics\n\n\n\n\nDiversity and Inclusion\n\n\n\n\nEvents\n\n\n\n\nFish Interfaith Center\n\n\n\n\nHealth and Wellness\n\n\n\n\nResidence Life\n\n\n\n\nStudent Life\n\n\n\n\n\n\n\n\n\nResearch\n\n\n\n\n\n\n\n\n\nResearch Overview\n\n\n\n\nSponsored Projects Services\n\n\n\n\nResearch Integrity\n\n\n\n\nInstitutes and Centers\n\n\n\n\nCenter for Undergraduate Excellence\n\n\n\n\nIndustry Alliances and Commercialization\n\n\n\n\n\n\n\n\n\nSupport \n\n\n\n\n\n\n\n\n\nSupport Chapman Overview\n\n\n\n\nGet Involved\n\n\n\n\nContact Development\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Services\n\n\n\nBudget Office\n\n\nCampus Controller\n\n\nCampus Planning and Design\n\n\nCareer and Professional Development\n\n\nCommunity Relations\n\n\nEvent Operations\n\n\nFacilities Management\n\n\nFire & Life Safety\n\n\nInformation Systems & Technology\n\n\nInstitutional Compliance and Internal Audit\n\n\nInstitutional Research and Decision Support\n\n\nLegal Affairs\n\n\nMail Services \n\n\nParking Services\n\n\nPublic Safety\n\n\nStrategic Marketing and Communications\n\n\nSustainability\n\n\nCopy Jobs\n\n\n\n\n\n\nInformation Systems & Technology\n\n\n\nEducause at Chapman\n\n\nIT - Faculty Advisory Board\n\n\nNews and Updates\n\n\nPolicies and Procedures\n\n\nResearch Computing Support\n\n\nSecurity\n\n\nServices\n\n\nSoftware\n\n\nTraining and On-Demand Videos\n\n\nWorking and Teaching Remotely\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nÂ»\n    Privacy Policy\n\n\n\nSection 1: Privacy Policy \nPOLICY STATEMENT\nThis policy describes Chapman University's data protection strategy to comply with multiple regulations, including the European Union General Data Protection Regulation (\"EU GDPR\").\nREASON FOR THE POLICY\nIn order for Chapman to educate its international and domestic students, engage in world-class research, and provide community services, it is essential and necessary, and Chapman has a lawful basis, to collect, process, use, and/or maintain the personal data of its students, employees, applicants, research subjects, and others involved in its educational, research, and community programs.  These activities include, without limitation, admission, registration, delivery of classroom and study abroad education, grades, communications, employment, applied research, development, program analysis for improvements, and records retention.\nThe EU GDPR imposes obligations on entities, like Chapman, that collect or process personal data about people in the European Union (\"EU\").  The EU GDPR applies to personal data collected or processed about anyone located in the EU, regardless of whether they are a citizen or permanent resident of an EU country.\nPOLICY\nLawful Basis for Collecting or Processing Personal Data\nChapman has a lawful basis to collect and process personal data.  Most of Chapman's collection and processing of personal data will fall under the following categories:\n\nProcessing is necessary for the purposes of the legitimate interests pursued by Chapman or by a third party.\nProcessing is necessary for the performance of a contract to which the data subject is party or in order to take steps at the request of the data subject prior to entering into a contract.\nProcessing is necessary for compliance with a legal obligation to which Chapman is subject.\nThe data subject has given consent to the processing of his or her personal data for one or more specific purposes.\n\nThere will be some instances where the collection and processing of personal data will be pursuant to other lawful bases.\nData Protection & Governance\nChapman protects all personal data and sensitive personal data that it collects or processes for a lawful basis. Any personal data and sensitive personal data collected or processed by Chapman is:\n\nProcessed lawfully, fairly, and in a transparent manner\nCollected for specified, explicit, and legitimate purposes, and not further processed in a manner that is incompatible with those purposes\nLimited to what is necessary in relation to the purposes for which they are collected and processed\nAccurate and kept up to date\nRetained only as long as necessary\nSecure\n\nSensitive Personal Data & Consent\nChapman obtains consent before it collects or processes sensitive personal data.\nIndividual Rights\nIndividual data subjects covered by this policy will be afforded the following rights:\n\ninformation about the controller collecting the data\nthe data protection officer contact information (if assigned)\nthe purposes and lawful basis of the data collection/processing\nrecipients of the personal data\nif Chapman intends to transfer personal data to another country or international organization\nthe period the personal data will be stored\nthe existence of the right to access, rectify incorrect data or erase personal data, restrict or object to processing, and the right to data portability\nthe existence of the right to withdraw consent at any time\nthe right to lodge a complaint with a supervisory authority (established in the EU)\nwhy the personal data are required, and possible consequences of the failure to provide the data\nthe existence of automated decision-making, including profiling\nif the collected data are going to be further processed for a purpose other than that for which it was collected\n\nSection 2: Chapman Privacy Practices\nChapman University Use of Personal Information\nChapman University recognizes the importance of protecting the integrity, confidentiality, and availability of personal information. Consequently, we have instituted the set of information practices and rights described below. Please note that this page offers some links to external sites, to which these privacy practices and rights do not apply.\nWhat Personal Information Does Chapman University Hold? How Is It Obtained?\nWe collect basic personal information (such as Name, Organization name, Organization state, Contact information, Job title, Postal address, E-mail address, Phone, Personal URL, Academic major/minor) ONLY if you provide it to us voluntarily through e-mail, electronic forms, surveys, inquiries, or otherwise.\nOther information that may be held includes but is not limited to:\n\nEmergency Contact Information\nSpecial Needs Information; as in a speaker or faculty member at a Chapman University event or that of one of its affiliates (we maintain biographical information used in the event)\nOnline programs as well as evaluation results submitted by attendees after your session(s). If you participate in a secured SharePoint Team Web site, we collect site access and contribution information.\n\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses persistent cookies to analyze how users use this site. The information generated by the cookie about your use of the website (including your IP address) will be transmitted to and stored by Google. Google will use this information for the purpose of evaluating your use of the website, compiling reports on website activity for website operators, and providing other services relating to website activity and internet usage. Google may also transfer this information to third parties where required to do so by law, or where such third parties process the information on Google's behalf. Google will not associate your IP address with any other data held by Google. You may refuse the use of cookies by selecting the appropriate settings on your browser; however please note that if you do this you may not be able to use the full functionality of this website. By using this website, you consent to the processing of data about you by Google in the manner and for the purposes set out above. Learn more about Google's Privacy Policy and the Google Analytics Terms of Service.\nCookies\nWe use cookies to help manage secure web site sessions such as online forms or surveys. A cookie is a piece of data that is either maintained only for the duration of a particular session visit or is stored on the user's computer to support future visits. By continuing to browse on Chapman websites or by clicking \"accept all cookies,\" the user agrees to the storing of first- and third-party cookies on user device to enhance site navigation, analyze site usage, and assist in Chapman marketing efforts. \nSession cookie – This type of cookie is used to enhance and make more efficient the user's experience during a site visit. Once the user closes the browser, the cookie terminates.\nPersistent cookie – This type of cookie stores a small text file on the user's hard drive for an extended period of time to remember visit activity that will help make subsequent visits more efficient. Persistent cookies can be removed by following the user's Internet browser help directions.\nHow Does Chapman University Secure Your Personal Information?\nThe personal information we collect is stored in databases and files that are protected by passwords and firewalls. In addition, online forms used for financial transactions are secured with SSL encryption technology to ensure the safety of sensitive information transmitted through them.\nHow Does Chapman University Use Your Personal Information?\nWe use anonymous, aggregated data about Web site visitors' site usage and technical capabilities as well as about HTML message opening and click-through rates to improve online services and communications.\nHow Does Chapman University Handle Legally Issued Subpoenas and Law Enforcement Agency Requests?\nChapman University may disclose personal information if we are required to do so to comply with the law or with legal process.\nIs credit card / transaction information secure on this Web site?\nWe care about the safety and security of your transaction. We use SSL (Secure Sockets Layer) to communicate with your browser software when you register with us online. SSL is the industry standard security protocol, which makes it extremely difficult for anyone else to intercept your credit card or other information that you send us.\nWe have partnered with the commercial Internet financial service, TouchNet to handle credit card transactions, and we do not store credit card information after the transaction is processed. See TouchNet's privacy policy.\nWhat Other Exceptions Are There?\nChapman University reserves the right to use personal information in its database to identify the source of any inappropriate use of information resources managed by the association, including but not limited to: offensive or illegal postings to online discussion lists, collaboration sites, and other communication vehicles; denial of service actions; unauthorized use of online services and network infrastructure; misuse or unauthorized use of the Chapman University name, logo, or other representations of the association; and to protect the personal safety and privacy of our members, online users, and the public under the policies and practices described above.\nThis is the privacy policy for the Common App which we use for undergraduate students to apply to Chapman: https://www.commonapp.org/privacy-policy \nThis is the privacy policy on PCTAS which we use for students to apply to Chapman’s Physical Therapy doctorate program: http://www.ptcas.org/PrivacyPolicy/\nThis is the legal notice LSAC which we use for students applying to Chapman’s Law School: http://www.lsac.org/aboutlsac/policies/privacy-policy\nThis is the privacy policy for Star Rez which we use for Residence Life’s Housing Request system: https://www.starrez.com/legal/privacy\nThis is the privacy policy for OrgSync which we use for Student & Campus Life's clubs and organizations: http://www.orgsync.com/legal/privacy\nThis is the privacy center for PowerSchool which we use for new student inquiries, campus visits and VIP pages for prospective students: https://www.powerschool.com/privacy-statement-overview/\nStudent Email Accounts\nOffice 365 and Gmail are the official student email accounts for all University email communications with its students. For student email services, the University has contracted with Microsoft as the provider of Office 365 and Google as the provider of Gmail (collectively “the Providers”).\nUnder the Providers’ terms of service, the University may respond to a third party’s request for student email records. A “Third Party Request\" means a request from a third party for records related to a student’s Gmail or Office 365 account or other student related Provider service records. Third Party Requests include, but may not be limited to, a search warrant, court order, subpoena, litigation discovery or legal preservation hold request, other valid legal order, or a written consent from the student permitting disclosure. If the University receives a Third Party Request, it may interface with Microsoft or Google to obtain or preserve the requested records or direct the requestor to contact the Provider or the student directly.\nSimilarly, the University may also preserve a student’s Office 365 or Gmail records and other student related Provider service records by way of the Provider’s interface when the University receives notice of a disciplinary or other matter involving the student, a claim, potential litigation or other legal duty to preserve the records.\nWhile students may use University provided Office 365 and Gmail accounts for personal communications, students are reminded that the primary purpose of the accounts are for University related communications.\nIs my Student email account secure and private?\nAs stated above, Office 365 and Gmail are the official student email accounts for all University email communications with its students.\nThe University provides Office 365 and Gmail to students to support the educational, research, and public service missions of the University. The Chapman University Computer and Network Acceptable Use Policy applies to these Microsoft and Google online education services. In addition, all Microsoft and Google apps usage are governed by their own terms of service that all Chapman users are required to abide by.\nStudent email and account data may include personally identifiable information from the student’s education records that are subject to the Family Educational Rights and Privacy Act (\"FERPA\"). To the extent that student data includes FERPA records, Microsoft and Google acting as the Providers will each be considered a \"School Official\" (as that term is used in FERPA and its implementing regulations) and will comply with FERPA.\nBoth Microsoft and Google provide additional settings and tools within the account that let you protect your data and privacy.\nRead more about the security and privacy for Microsoft and Google at:\nGoogle Policies: https://www.google.com/policies/  Microsoft Policies: https://www.microsoft.com/en-us/trustcenter/Security/Office365Security\nWhat should I do if I have questions?\nIf you have questions about our privacy policy, please contact servicedesk@chapman.edu.\nConsent\nBy using this site, you signify your consent to Chapman University's on-line privacy policy. If you do not agree to this policy, please do not use this site. We reserve the right, at our discretion, to update, change, modify, add, or remove portions of this policy from time to time.\nThis Privacy Policy has been developed with the recognition that Internet technologies are rapidly evolving and that underlying standard business models are still not well established. Accordingly, this Privacy & Security Statement is subject to change. Any such changes will be posted on this page.\nReporting Copyright Infringements\nIn accordance with Title II of the Digital Millennium Copyright Act (DMCA), Chapman University has designated an agent DMCA-agent@chapman.edu to receive notification of a claim of copyright infringement for the Chapman University network domain. To report a claim of possible copyright infringement, please refer to our DMCA Notification Agent page.\nOFFICE RESPONSIBLE FOR POLICY\nName of Office: Information Services & Technology\nContact information for questions about this policy: privacy@chapman.edu\nWEBSITE ADDRESS FOR THIS POLICY\nhttps://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx\nWHO APPROVED THIS POLICY\nSenior Staff member submitting the policy: Helen Norris\nDate approved: August 13th, 2019\n______________________________\nPresident\n \nPUBLICATION DATE\nEffective: August 19th, 2019\n\n\n\n\n\n\n\n\nPolicies and Procedures\n\n\nAcceptable Use Policy\n\n\nAccessibility Policy\n\n\nComputer Refresh Plan\n\n\nEmail Usage Guidelines \n\n\nHardware and Software Purchasing\n\n\nIS&T Onboarding\n\n\nLeaving Chapman University\n\n\nMicrosoft Teams Security Policies\n\n\nPrinting Policy\n\n\nPrivacy Policy\n\n\nPrivacy Practices\n\n\nUG Student Worker Canvas Access\n\n\n\n\n\n\n\n\n\n\n\n\n Contact Us   Maps & Directions    Emergency \n\n\n\nOrange Campus\nOne University Drive  Orange, CA 92866   (714) 997-6815\n\nRinker Health Science Campus\n9401 Jeronimo Road  Irvine, CA 92618 \n\n\n\nGet Started\n\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment\n\n\n\nDiscover\n\nSchools and Colleges\nPrograms at Chapman\nEvents at Chapman\nNewsroom\nDirectory\n\n\n\n\nSupport\n\nReport Concern or Incident\nAccessibility Feedback\nWebsite Feedback\nDisability Services\nConsumer Disclosures\nPrivacy Policy\nTitle IX\n\n\n\n Chapman Logo                                               \n© 2022 Chapman University           \n\n\n Back to top    \n\n\n\n\n\n/_featured/Default.xml\nDefault\nDefault\nDo Not Show\nDo Not Show\n\n\n\n",
    "links": [
        "#main",
        "https://www.chapman.edu/index.aspx",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "https://www.chapman.edu/about/connect/index.aspx",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/https://catalog.chapman.edu",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/financing/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit/campus.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/https://blogs.chapman.edu/huell-howser-archives/",
        "https://www.chapman.edu/https://events.chapman.edu/?view=list&group_id=21",
        "https://www.chapman.edu/arts/escalette-collection.aspx",
        "https://www.chapman.edu/wilkinson/art/gallery/index.aspx",
        "https://www.chapman.edu/https://www.hilbertmuseum.com/#california-art=",
        "https://www.chapman.edu/https://muscocenter.org/Online/default.asp",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/http://www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/https://events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/health-and-wellness/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "https://www.chapman.edu/research/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index-bk.aspx",
        "https://www.chapman.edu/research/industry-alliances-commercialization/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/give/contact-us.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/campus-services/community-relations/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/industry-partners/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "https://www.chapman.edu/index.aspx",
        "https://www.chapman.edu/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/https://secure.touchnet.com/C27377_ustores/web/product_detail.jsp?PRODUCTID=1&SINGLESTORE=true",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/campus-services/community-relations/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/industry-partners/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/javascript:void(0)",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "../campus-services/information-systems/services/email/panther-mail.aspx",
        "https://my.chapman.edu/",
        "https://working.chapman.edu/",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "https://www.chapman.edu/about/connect/index.aspx",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/https://catalog.chapman.edu",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/financing/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/undergraduate/net-cost-calculator.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit/campus.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/https://blogs.chapman.edu/huell-howser-archives/",
        "https://www.chapman.edu/https://events.chapman.edu/?view=list&group_id=21",
        "https://www.chapman.edu/arts/escalette-collection.aspx",
        "https://www.chapman.edu/wilkinson/art/gallery/index.aspx",
        "https://www.chapman.edu/https://www.hilbertmuseum.com/#california-art=",
        "https://www.chapman.edu/https://muscocenter.org/Online/default.asp",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/http://www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/https://events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/health-and-wellness/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "https://www.chapman.edu/research/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index-bk.aspx",
        "https://www.chapman.edu/research/industry-alliances-commercialization/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/give/contact-us.aspx",
        "/",
        "../../index.aspx",
        "../../budget-office/index.aspx",
        "../../campus-controller/index.aspx",
        "../../campus-planning/index.aspx",
        "../../career-professional-development/index.aspx",
        "../../community-relations/index.aspx",
        "../../event-operations/index.aspx",
        "../../facilities-management/index.aspx",
        "../../fire-safety/index.aspx",
        "../index.aspx",
        "../../institutional-compliance-and-internal-audit/index.aspx",
        "../../institutional-research/index.aspx",
        "../../legal-affairs/index.aspx",
        "../../mail-services.aspx",
        "../../parking-services/index.aspx",
        "../../public-safety/index.aspx",
        "../../marketing-communication/index.aspx",
        "../../sustainability/index.aspx",
        "../../copy-jobs.aspx",
        "../index.aspx",
        "../educause.aspx",
        "../it-fab.aspx",
        "../news-blogs-updates/index.aspx",
        "index.aspx",
        "../research-technology-support/index.aspx",
        "../security/index.aspx",
        "../services/index.aspx",
        "../software/index.aspx",
        "../training/index.aspx",
        "../working-and-teaching-remotely/index.aspx",
        "http://www.google.com/intl/en/policies/privacy/",
        "https://www.commonapp.org/privacy-policy",
        "http://www.ptcas.org/PrivacyPolicy/",
        "http://www.lsac.org/aboutlsac/policies/privacy-policy",
        "https://www.starrez.com/legal/privacy",
        "http://www.orgsync.com/legal/privacy",
        "https://www.powerschool.com/privacy-statement-overview/",
        "https://www.google.com/policies/",
        "https://www.microsoft.com/en-us/trustcenter/Security/Office365Security",
        "mailto:servicedesk@chapman.edu",
        "mailto:privacy@chapman.edu",
        "index.aspx",
        "acceptable-use-policy.aspx",
        "accessibility-policy.aspx",
        "computer-refresh.aspx",
        "email-usage-guidelines.aspx",
        "hardware-and-software-purchasing.aspx",
        "ist-onboarding.aspx",
        "leavingcu.aspx",
        "microsoft-teams-security-policies.aspx",
        "printing-policy.aspx",
        "privacy-policy.aspx",
        "privacy-practices.aspx",
        "ug-student-worker-canvas-access.aspx",
        "../../../about/connect/index.aspx",
        "../../../about/maps-directions/index.aspx",
        "../../../emergency/index.aspx",
        "https://www.google.com/maps/place/Chapman+University/@33.7931305,-117.8543282,17z/data=!3m1!4b1!4m5!3m4!1s0x80dcd9e1d9d6e8ef:0x6ebb27c51b72a8ec!8m2!3d33.7931305!4d-117.8521395?hl=en",
        "tel:+1714-997-6815",
        "https://www.google.com/maps/place/Chapman+University+Rinker+Health+Science+Campus/@33.650635,-117.7203547,17z/data=!4m13!1m7!3m6!1s0x80dce81715a0d84b:0x8fe3dc2fce1c83da!2s9401+Jeronimo+Rd,+Irvine,+CA+92618!3b1!8m2!3d33.650635!4d-117.718166!3m4!1s0x80dcde16796ddc25:0xb4afb4199eff4db8!8m2!3d33.6506535!4d-117.7181062?hl=en",
        "../../../about/visit/index.aspx",
        "../../../students/tuition-and-aid/index.aspx",
        "../../../admission/undergraduate/how-to-apply/index.aspx",
        "../../../faculty-staff/human-resources/jobs/index.aspx",
        "../../../academics/schools-colleges.aspx",
        "../../../academics/degrees-and-programs.aspx",
        "https://events.chapman.edu/",
        "https://news.chapman.edu/",
        "../../../directory/index.aspx",
        "../../../reporting/index.aspx",
        "../../../accessibility/feedback-form.aspx",
        "../../../website-feedback-form.aspx",
        "../../../students/health-and-safety/disability-services/index.aspx",
        "../../../consumer-information-disclosures/index.aspx",
        "privacy-policy.aspx",
        "../../../students/health-and-safety/title-ix/index.aspx",
        "/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu"
    ]
}