{
    "title": "Tennis legend John McEnroe will speak at Stanford Commencement",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 12, 2023 Tennis legend John McEnroe will speak at Stanford’s 2023 Commencement ceremony John McEnroe, who led Stanford to the NCAA tennis championship while winning the individual title in 1978 and whose television roles include narrator of Netflix's Never Have I Ever, will return to campus as the 2023 Commencement speaker in June. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Chris Peacock\n\nGraduates, families, and guests at Stanford’s 132nd Commencement ceremony in June will hear remarks from John McEnroe, a tennis star on the Farm who went on to a wide array of pursuits as a professional athlete, broadcaster, voice actor, art collector, philanthropist, and father of six.\n\nJohn McEnroe (Image credit: EPI 1959)\n\nThe ceremony begins at 9:30 a.m. Sunday, June 18, in Stanford Stadium.\n“John McEnroe has had a legendary career, and we’re looking forward to a lively talk about his journey to, through, and beyond the Farm,” said Stanford President Marc Tessier-Lavigne. “John has excelled in the many chapters of his life. He has competed in some of the greatest moments in tennis history, offered plain-spoken commentary as a broadcaster, and created a foundation that helps young people overcome racial, economic, and social challenges to pursue educational and sports opportunities. His insights will help our graduates think through their coming transitions, as new chapters unfold in their own careers and lives.”\nAfter reaching the Wimbledon semi-finals as an amateur and achieving an ATP ranking of 25th in the world in 1977, McEnroe enrolled at Stanford. The following spring, he helped win the NCAA team title and won the NCAA individual singles title as a freshman before turning pro and leaving the Farm. A fiery competitor with a legendary, well-documented distaste for authority, he went on to win seven Grand Slam singles titles (three Wimbledon championships and four U.S. Open championships) and 10 Grand Slam doubles titles, and to help lead the United States to five Davis Cup championships.\nBeyond his playing career, McEnroe opened the John McEnroe Gallery in SoHo, New York, where he collects and displays his diverse collection of art, and has authored two memoirs, including his New York Times best-selling autobiography, You Cannot Be Serious. In 2012, he founded the nonprofit Johnny Mac Tennis Project to help transform young lives by removing the economic, racial, and social barriers to success through tennis. The project introduces tennis to thousands of underresourced New York City-area children – particularly those living in East Harlem and the South Bronx, two communities immediately adjacent to the John McEnroe Tennis Academy – to help them explore their potential, adopt healthy lifestyles, and develop problem-solving skills.\nOff the court, McEnroe continues to work at each of the Grand Slam tournaments as an Emmy-nominated analyst and commentator for five worldwide television networks. He appears in television shows and films, most recently as narrator of the Never Have I Ever comedy series, and regularly performs with his Johnny Smyth Band as lead guitar and singer.\n\nMcEnroe in 1978 (Image credit: Robert Beyers)\n\n“We are all very excited to have John McEnroe as Stanford’s 2023 Commencement speaker,” said senior class presidents Alison Cohen, Nicolas Garcia, Ecy King, and Grant Sheen, who worked with the Office of the President on the selection. “McEnroe’s experience and transformation from tennis star to voice acting talent embody how the possibilities for Stanford students are truly limitless and that life is never a fixed path. We are excited to hear his insights from both on and off the court.”\n“I am honored and pleased to have been invited to deliver the Commencement address at Stanford’s 2023 graduation ceremony,” McEnroe said. “I am gratified that my lack of an undergraduate degree from Stanford has not been held against me or disqualified me from this prestigious honor, and I look forward to sharing some of my life experiences with the graduating students and their families.”\nMcEnroe was inducted into the International Tennis Hall of Fame in 1999 and the Stanford Athletics Hall of Fame in 1997. His 155 combined singles and doubles titles are the most-ever on the ATP Tour tournament win list. His 82-3 singles match record, set in 1984, remains the record for the best year win percentage of the Open Era. His individual record during his lone season at Stanford was 19-2. When Coach Dick Gould retired in 2004 after 38 years at Stanford, he called McEnroe “the best we ever had.”\nStanford’s 132nd Commencement ceremony is part of a weekend-long celebration, scheduled for June 15-18, for graduates, their families and friends, and members of the Stanford community. More information is available on the Commencement Weekend website.\n\n\n\n\n\n\n\n\n\n\n\n\nCampus News\nUniversity Affairs\nCommencement 2023\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D11899",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/McEnroe.jpg",
        "https://www.atptour.com/en/corporate/about",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/bwMcEnroe.jpg",
        "https://gostanford.com/honors/stanford-athletics-hall-of-fame/john-mcenroe/257",
        "https://commencement.stanford.edu/",
        "https://news.stanford.edu/report/content-partner/university-communications/campus-news/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/topic/commencement-2023/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D11899",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}