{
    "title": "Performance Chat Summary: 25 April 2023 – Make WordPress Core",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Core\n\n\nTickets\nComponents\nHandbook\nBrowse Source\nTrac Timeline\nCreate a New Ticket\n \n\n\n\nHide welcome box\n\n\n\n\nWelcome!\nThe WordPress coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. development team builds WordPress! Follow this site for general updates, status reports, and the occasional code debate. There’s lots of ways to contribute:\nFound a bugbug A bug is an error or unexpected result. Performance improvements, code optimization, and are considered enhancements, not defects. After feature freeze, only bugs are dealt with, with regressions (adverse changes from the previous version) being the highest priority.? Create a ticket in the bug tracker.\nWant to contribute? Get started quickly with tickets marked as good first bugs for new contributors or join a bug scrub. There’s more on the reports page, like patches needing testing, and on feature projects page.\nOther questions? Here is a detailed handbook for contributors, complete with tutorials.\n\n\nCommunication\nCore uses Slack for real-time communication. Contributors live all over the world, so there are discussions happening at all hours of the day.\nCore development meetings are every Wednesday at 20:00 UTC in the #core channel on Slack. Anyone can join and participate or listen in!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nEmily Clarke\n\n4:03 pm on April 25, 2023 \n\n\n\nTags: core-media ( 114 ), core-performance ( 23 ), performance ( 192 ), performance-chat ( 150 ), summary ( 693 )   \n\t\t\t\t\n\nPerformance Chat Summary: 25 April 2023\n\n\nMeeting agenda here and the full chat log is available beginning here on Slack.\nAnnouncements\nUpdated the cadence of bugbug A bug is an error or unexpected result. Performance improvements, code optimization, and are considered enhancements, not defects. After feature freeze, only bugs are dealt with, with regressions (adverse changes from the previous version) being the highest priority. scrubs to be every 2 weeks – next one scheduled for April 26, 2023 at 15:00 UTC.\n@flixos90 Also briefly sharing that I just published a performance retrospective post on WP 6.2 that I had been working on over the past few weeks: https://make.wordpress.org/core/2023/04/25/the-benefits-of-prioritizing-and-measuring-performance-in-wordpress-6-2/ It highlights some of the key aspects which changed in 6.2 in how we dealt with performance and also summarizes high level numbers. It can be seen as somewhat complementing https://make.wordpress.org/core/2023/04/05/wordpress-6-2-performance-improvements-for-all-themes/, at a higher level however without looking as much at specific improvements.\nDiscussion regarding the decoupling of the SQLite pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party from the performance lab work. In reference to this conversation that came up in a previous performance chat. Would love to have an open discussion about peoples preferences here and whether we do decouple this?\n@olliejones I favor that approach. It will usually be deployedDeploy Launching code from a local development environment to the production web server, so that it's available to visitors. independently of the stuff in PL.\n@10upsimon I tend to lean more toward an agreement with @rmccue in that SQLite is not necessarily performance improvements focused (or at least that is not the primary goal), and probably belongs outside of the realm of the performance lab work.\n@spacedmonkey To be clear, I think that performance team should continue to support SQlite getting into coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress., to much sure it done in a performant way. But SQlite is not a performance benefit on the face of it, so it is confusing why we part of performance lab plugin.\n@rmccue Yeah, that was basically my thought; I think it’s beneficial all-round to separate it out (but with performance still consulting as @spacedmonkey says)\n@olliejones yes, having SQLite headed for core is good. I believe the issue is about monorepo and multifunction plugins on the one hand and a separate repo and plugin on the other.\n@aristath I agree with what was mentioned above 100%. SQLite can be related to performance, but is not in itself a “performance” module/plugin. It should be developed in collaboration with the performance team since it can have a big impact, but I’d vote to decouple it from the performance-lab plugin\n@olliejones Maybe in a parallel universe or another year, there can be a separate database team. But for now the perf. team has the talent.\n@spacedmonkey If you want to setup a meeting for a database team, that could work. Many component meetings have less than 5 people.\n@flixos90 To clarify, this conversation is slightly different and mostly unrelated to the “unbundling Performance Lab plugin” effort. While we are publishing other PL modules as standalone plugins, those standalone plugins will still be directly associated with the performance team, developed in the monorepo, referenced from the PL main plugin etc. Removing / decoupling SQLite from PL would be different: We would still support getting the plugin towards WP core of course, but it wouldn’t be in any way connected to PL anymore. Maybe that was clear, but just in case.\nNext steps clarification:\n@aristath I think the only thing to do here would be to remove the module from PL, and add a notice so in case the user previously had the module activated, they’ll be prompted to install the standalone plugin\n@joemcgill I assume we’ll remove the module from the performance lab plugin in the same release where we remove other modules. How we handle the transition so as to not break any active sites, is not clear to me at the moment.\n@olliejones Do we have any usage telemetry to help guide that decision?\n@flixos90 Potentially. As mentioned, I think this conversation is decoupled from the general PL unbundling effort, so we could do it at the same time, but also sooner. I would love to find a way to make the transition smooth though. For sites that already have the SQLite module active, we should probably recommend activating the SQLite plugin before deactivating the feature.\n@aristath That’s a good idea…\n@flixos90 Has anyone tried yet to activate the SQLite standalone plugin on a site where the PL SQLite module is already active? We need to make sure it doesn’t throw fatal errors\n@aristath Adding it on my TODO list for tomorrow, though from what I recall I tried it last month and I there were no issues. I’ll need to test that again just to be sure, it’s been a long time\n\n@10upsimon I feel strongly about not intentionally breaking users sites, however few are using it. Perhaps we need to defer the removal to 2 versions from now, and raise a notice or similar in the adminadmin (and super admin) making it very clear that from version n it will no longer be supported as a core PL module.\n@flixos90 agreed @10upsimon adding though that for a smooth transition the plugin should be activated before deactivating the PL module, so we have to make sure that that is actually possible\n\n@joemcgill A similar transition plan will be good for all of the modules, to be honest, even though SQLite is the most critical due to potential breakage.\n@flixos90 @joemcgill I think for the other modules we’ll handle that in a central effort as part of unbundling, but with SQLite it will now be bit different, since that plugin will not be referenced directly from PL in the future. But I agree it’s most critical there to have a smooth transition since switching back to a MySQLMySQL MySQL is a relational database management system. A database is a structured collection of data where content, configuration and other options are stored. https://www.mysql.com/. / MariaDB database accidentally will break any site that actually relies on SQLite right now\n\n\nPriority Projects\nServer Response Time\nLink to roadmap projects\nContributors: @joemcgill @spacedmonkey @aristath\n@spacedmonkey I landed lazy loading term metaMeta Meta is a term that refers to the inside workings of a group. For us, this is the team that works on internal WordPress sites like WordCamp Central and Make WordPress.https://github.com/WordPress/wordpress-develop/commit/2c6bf77a9e7532c6ac3a03502b44d108cae86179\nI hope to get comment meta in the next week.https://github.com/WordPress/wordpress-develop/pull/4128 – Code review welcome\nRelated to term meta, https://github.com/WordPress/wordpress-develop/pull/4259 also need code review\nThis saves around 15k calls to sanitise term function per page load\nTLDR, there was no need to call get_term , we already had the term id, so just remove that\nI also reviewed this – https://github.com/WordPress/wordpress-develop/pull/4097 (amazing work @oandregal)\n@joemcgill This is a huge one that I had noticed in my profiling research, so nice to see this already addressed!\n@10upsimon Call me cheesy, but 15% server time alone across many WP hosts is a positive contribution to the environment alone\n@mukesh27 With all this improvement, 6.3 is faster than 6.2\n@flixos90 Yeah, this alone will make blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. theme performance in 6.3 almost as much faster as it got faster in 6.2\n\n@flixos90 Certainly the highest performance improvement in a single PR that I’ve seen so far\n@joemcgill Worth noting that the 15% improvement on that PR is compared against WP 6.1.1, not the commit prior to that one, so it would be interesting to A/B against the commit prior (if I’m reading the workflow correctly)\n@flixos90 No, the 15% is against today’s trunk. The original metrics on the PR are incorrect, but then I measured it against trunk and that’s where the 15% come from\n\n\nDatabase Optimization\nLink to roadmap projects\nContributors: @aristath @spacedmonkey @olliejones @rjasdfiii\n@olliejones I’ve been on the SQLite Object Cache, making it more useful for @spacedmonkey hopefully – Nothing on the bigger SQLite project.\n@spacedmonkey Not related to database, but object caching. I have been working WP CLICLI Command Line Interface. Terminal (Bash) in Mac, Command Prompt in Windows, or WP-CLI for WordPress. support new functionality object cache\nhttps://github.com/wp-cli/cache-command/issues/79\nhttps://github.com/wp-cli/cache-command/issues/80\n\nJavaScriptJavaScript JavaScript or JS is an object-oriented computer programming language commonly used to create interactive effects within web browsers. WordPress makes extensive use of JS for a better user experience. While PHP is executed on the server, JS executes within a user’s browser. https://www.javascript.com/. & CSSCSS Cascading Style Sheets.\nLink to roadmap project\nContributors: @mukesh27 @10upsimon @adamsilverstein\n@10upsimon Regarding “Enhancing the WP Scripts APIAPI An API or Application Programming Interface is a software intermediary that allows programs to interact with each other and share data in limited, clearly defined ways. with a Loading Strategy”:\nWe’ve had a good amount of feedback and iteration on our draft PR\nWe’ve had some valuable feedback come in this week, so we’ll be addressing that with the goal of opening a PR against core later this week. Thanks @joemcgill @adamsilverstein and @westonruter for the invaluable feedback thus far (and to @spacedmonkey)\nWe’ve established a mostly approved documentation plan/roadmap, with slight ongoing tweaks thereto. Draft documentation and documentation updates can commence soon\n\n@flixos90 One more thing regarding JSJS JavaScript, a web scripting language typically executed in the browser. Often used for advanced user interfaces and behaviors. & CSS, last week I opened https://github.com/WordPress/gutenberg/issues/49927 to optimize how block CSS is loaded in classic themes (it’s great in block themes, but not so much for classic themes, and we can probably improve that). There have been some great conversations on that. @aristath has pointed out a detailed code example with how we could improve this by printing inline styles per block type right before the first block of each type is rendered\n@aristath If you have some capacity to work on a PR, I think that would be a great next step\n@flixos90 If we can find a solution that works reliably, maybe we can eventually even change the default behavior so that it’s no longer opt-in but just works out of the box \n@spacedmonkey I have a PR for the above –  https://github.com/spacedmonkey/wordpress-develop/tree/try/inline-styles It might be useful in discovery\n\nImages\nLink to roadmap projects\nContributors: @flixos90 @thekt12 @adamsilverstein @joemcgill\nNo updates this week\nMeasurement\nLink to roadmap projects\nContributors: @adamsilverstein @olliejones @joemcgill @mukesh27\n@joemcgill I’ve been working to prioritize a set of “next steps” for automated performance testing. For me, the “next step” is to turn these tasks into tracTrac An open source project by Edgewall Software that serves as a bug tracker and project management tool for WordPress. tickets that we can address as capacity allows.\nOne of the big ones is to improve the stability of the results and make them more atomic, so we can use them to evaluate specific PRs (like the discussion we had earlier about the get_block_templates PR)\n\nEcosystem Tools\nLink to roadmap projects\nContributors: @joegrainger\n@joegrainger We’re still progressing through the issues raised in the Plugin Checker Milestone 1 Review/QA and will continue to be working on these over the coming weeks. You can follow the progress on the GitHub repo and any thoughts/ideas/comments are welcome. Thanks!\n@spacedmonkey Got some feedback from the community – https://github.com/10up/plugin-check/issues/153\nCreating Standalone Plugins\nLink to GitHub overview issue\nContributors: @flixos90 @mukesh27 @10upsimon\n@flixos90 We’re still waiting to get the Fetchpriority standalone plugin approved, beyond that and then the same for Dominant Color, we have basically completed the work for “Milestone 1” in https://github.com/WordPress/performance/issues/656\nWe should probably close https://github.com/WordPress/performance/issues/661 following the conversation earlier, or we can break it out as another issue to discuss how to remove SQLite from PL\n\n@flixos90 Separately, we need to explore what we want the user experience for “Milestone 2” to look like, both in terms of the regular UIUI User interface of the PL plugin going forward (in which it controls certain plugins as well as the Site Health modules), and for a smooth migrationMigration Moving the code, database and media files for a website site from one server to another. Most typically done when changing hosting companies. from the modules to remove to their standalone plugins\nNew Projects / Proposals\n@spacedmonkey I would love feedback on – https://github.com/WordPress/performance/issues/718 a new module proposal for adding object caching information to site health\nI want to make it easier for users to understand what kind of object cache they are using and what features it supports.\nSpecially if your object cache drop in supports multiple gets. I got a lot of questions after this article was published.\n\nOpen Floor\nNo updates\nOur next chat will be held on Tuesday, May 2, 2023 at 15:00 UTC in the #core-performance channel in Slack.\n#core-media, #core-performance, #performance, #performance-chat, #summaryShare this:TwitterFacebookLogin to Reply\n\n\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nPost navigation\n← The benefits of prioritizing and measuring performance in WordPress 6.2 Editor Chat Agenda: 26 April 2023 →\n\n\n\n\n\n\n\n\nSearch\n\n\n\nEmail Updates\n\n\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 5,560 other subscribers\t\t\t\t\n\nRecent UpdatesRecent CommentsNo RepliesRecent UpdatesRecent CommentsNo RepliesCurrent Release The current release in progress is WordPress 6.3.\nPlanned future releases are listed on the Project Roadmap.\nFeature projects not tied to specific releases can be found on the Features page.\n\nRegular ChatsNote: All chats happen on Slack.\n\n\n\nWeekly Developer Meetings: Wednesday 20:00 UTC in #core\n\n\nAbout the Dev Chat\n\n\nAgendas | Summaries\n\n\n\n\n\nAPAC Triage Sessions Tuesday 5:00 UTC alternating between #core and #core-editor\n\n\nJavaScript Weekly Chat Tuesday 14:00 UTC in #core-js\n\n\nPerformance Weekly Chat Tuesday 15:00 UTC in #core-performance\n\n\nMultisite Weekly Chat Tuesday 17:00 UTC in #core-multisite\n\n\nREST API Weekly Chat Thursday 18:00 UTC in #core-restapi\n\n\nEditor Weekly Chat Wednesday 14:00 UTC in #core-editor\n\n\nNew Contributors Chat Wednesday 19:00 UTC in #core\n\n\nImages/Media Weekly Chat Thursday 15:00 UTC in #core-media\n\n\nCSS Weekly Chat Thursday 21:00 UTC in #core-css\n\n\nCustomize Weekly Chat Monday 19:00 UTC in #core-customize\n\n\n\n\nSee all meetings → \nRecent Posts and Comments\n\n\n\t\t\tTeam Pledges\n\t\t\n\n1853 people have pledged time to contribute to Core Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F25%2Fperformance-chat-summary-25-april-2023%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/core/reports/",
        "https://make.wordpress.org/core/components/",
        "https://make.wordpress.org/core/handbook/",
        "https://core.trac.wordpress.org/browser",
        "https://core.trac.wordpress.org/timeline",
        "https://login.wordpress.org/?redirect_to=https://core.trac.wordpress.org/newticket",
        "https://wordpress.org/support/bb-login.php?redirect_to=https://core.trac.wordpress.org/newticket",
        "https://core.trac.wordpress.org/tickets/good-first-bugs",
        "https://make.wordpress.org/core/handbook/testing/bug-gardening/",
        "https://make.wordpress.org/core/reports/",
        "https://core.trac.wordpress.org/tickets/needs-testing",
        "https://make.wordpress.org/core/features/",
        "https://make.wordpress.org/core/handbook/",
        "https://make.wordpress.org/chat/",
        "http://time.is/2000_in_UTC",
        "https://wordpress.slack.com/messages/core/",
        "https://make.wordpress.org/chat/",
        "https://profiles.wordpress.org/clarkeemily/",
        "https://profiles.wordpress.org/clarkeemily/",
        "https://make.wordpress.org/core/tag/core-media/",
        "https://make.wordpress.org/core/tag/core-performance/",
        "https://make.wordpress.org/core/tag/performance/",
        "https://make.wordpress.org/core/tag/performance-chat/",
        "https://make.wordpress.org/core/tag/summary/",
        "https://make.wordpress.org/core/2023/04/25/performance-chat-agenda-25-april-2023/",
        "https://wordpress.slack.com/archives/C02KGN5K076/p1682434772025969",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230426T1500",
        "https://profiles.wordpress.org/flixos90/",
        "https://make.wordpress.org/core/2023/04/25/the-benefits-of-prioritizing-and-measuring-performance-in-wordpress-6-2/",
        "https://make.wordpress.org/core/2023/04/05/wordpress-6-2-performance-improvements-for-all-themes/",
        "https://wordpress.slack.com/archives/C02KGN5K076/p1680019422571839",
        "https://profiles.wordpress.org/olliejones/",
        "https://profiles.wordpress.org/10upsimon/",
        "https://profiles.wordpress.org/rmccue/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://profiles.wordpress.org/rmccue/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://profiles.wordpress.org/olliejones/",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/olliejones/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://profiles.wordpress.org/olliejones/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/10upsimon/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/10upsimon/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://www.mysql.com/",
        "https://make.wordpress.org/performance/roadmap-2023/#category-server-response-time",
        "https://profiles.wordpress.org/joemcgill/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://github.com/WordPress/wordpress-develop/commit/2c6bf77a9e7532c6ac3a03502b44d108cae86179",
        "https://github.com/WordPress/wordpress-develop/pull/4128",
        "https://github.com/WordPress/wordpress-develop/pull/4259",
        "https://github.com/WordPress/wordpress-develop/pull/4097",
        "https://profiles.wordpress.org/oandregal/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://profiles.wordpress.org/10upsimon/",
        "https://profiles.wordpress.org/mukesh27/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://profiles.wordpress.org/flixos90/",
        "https://make.wordpress.org/performance/roadmap-2023/#category-database-optimization",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://profiles.wordpress.org/olliejones/",
        "https://profiles.wordpress.org/rjasdfiii/",
        "https://profiles.wordpress.org/olliejones/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://github.com/wp-cli/cache-command/issues/79",
        "https://github.com/wp-cli/cache-command/issues/80",
        "https://www.javascript.com/",
        "https://make.wordpress.org/performance/roadmap-2023/#category-javascript-css",
        "https://profiles.wordpress.org/mukesh27/",
        "https://profiles.wordpress.org/10upsimon/",
        "https://profiles.wordpress.org/adamsilverstein/",
        "https://profiles.wordpress.org/10upsimon/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://profiles.wordpress.org/adamsilverstein/",
        "https://profiles.wordpress.org/westonruter/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://profiles.wordpress.org/flixos90/",
        "https://github.com/WordPress/gutenberg/issues/49927",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/aristath/",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://github.com/spacedmonkey/wordpress-develop/tree/try/inline-styles",
        "https://make.wordpress.org/performance/roadmap-2023/#category-images",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/thekt12/",
        "https://profiles.wordpress.org/adamsilverstein/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://make.wordpress.org/performance/roadmap-2023/#category-measurement",
        "https://profiles.wordpress.org/adamsilverstein/",
        "https://profiles.wordpress.org/olliejones/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://profiles.wordpress.org/mukesh27/",
        "https://profiles.wordpress.org/joemcgill/",
        "https://make.wordpress.org/performance/roadmap-2023/#category-ecosystem-tools",
        "https://profiles.wordpress.org/joegrainger/",
        "https://profiles.wordpress.org/joegrainger/",
        "https://github.com/10up/plugin-check/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://github.com/10up/plugin-check/issues/153",
        "https://github.com/WordPress/performance/issues/656",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/mukesh27/",
        "https://profiles.wordpress.org/10upsimon/",
        "https://profiles.wordpress.org/flixos90/",
        "https://github.com/WordPress/performance/issues/656",
        "https://github.com/WordPress/performance/issues/661",
        "https://profiles.wordpress.org/flixos90/",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://github.com/WordPress/performance/issues/718",
        "https://xwp.co/object-caching-improvement-wordpress-6-2/",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1500",
        "https://wordpress.slack.com/messages/core-performance/",
        "https://make.wordpress.org/chat/",
        "https://make.wordpress.org/core/tag/core-media/",
        "https://make.wordpress.org/core/tag/core-performance/",
        "https://make.wordpress.org/core/tag/performance/",
        "https://make.wordpress.org/core/tag/performance-chat/",
        "https://make.wordpress.org/core/tag/summary/",
        "https://make.wordpress.org/core/2023/04/25/performance-chat-summary-25-april-2023/?share=twitter",
        "https://make.wordpress.org/core/2023/04/25/performance-chat-summary-25-april-2023/?share=facebook",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F25%2Fperformance-chat-summary-25-april-2023%2F%23respond&locale=en_US",
        "/core/2023/04/25/performance-chat-summary-25-april-2023/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F25%2Fperformance-chat-summary-25-april-2023%2F&locale=en_US",
        "https://akismet.com/privacy/",
        "https://make.wordpress.org/core/2023/04/25/the-benefits-of-prioritizing-and-measuring-performance-in-wordpress-6-2/",
        "https://make.wordpress.org/core/2023/04/26/editor-chat-agenda-26-april-2023/",
        "#",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/core/?o2_recent_comments=1",
        "https://make.wordpress.org/core/?replies=none",
        "https://make.wordpress.org/core/6-3/",
        "https://wordpress.org/about/roadmap/",
        "https://make.wordpress.org/core/features/",
        "https://make.wordpress.org/chat/",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T2000",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "http://make.wordpress.org/core/weekly-developer-chats/",
        "http://make.wordpress.org/core/tag/agenda",
        "http://make.wordpress.org/core/tag/summary",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T0500",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "https://wordpress.slack.com/archives/C02QB2JS7",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1400",
        "https://wordpress.slack.com/archives/C5UNMSU4R",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1500",
        "https://wordpress.slack.com/archives/C02KGN5K076",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1700",
        "https://wordpress.slack.com/archives/C03BVB47S",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T1800",
        "https://wordpress.slack.com/archives/C02RQC26G",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T1400",
        "https://wordpress.slack.com/archives/C02QB2JS7",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T1900",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T1500",
        "https://wordpress.slack.com/archives/C02SX62S6",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T2100",
        "https://wordpress.slack.com/archives/CQ7V4966Q",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230508T1900",
        "https://wordpress.slack.com/archives/C0381N237",
        "https://make.wordpress.org/meetings/",
        "https://make.wordpress.org/core/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}