{
    "title": "Soon-to-be Theatre Arts Graduate Has Played a Starring Role Offstage - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nSoon-to-be Theatre Arts Graduate Has Played a Starring Role Offstage\n\nLuke Reid\nApril 26, 2023\n\n\n\n\n(Jason Halley / University Photographer) \n\n\n\nGaby Saxon has worn several hats in Chico State’s Theatre Arts program. She’s been a stage manager, director, costume fabricator, and more—all in service of the compelling stories the department tells.\nDespite spending most of her time out of the spotlight, she’s become a star thanks to her role as a student leader and advocate. The story of Saxon’s transformative experience at Chico State, and in turn, the influence she’s had on the department as an empowered member of the campus community, is the kind Chico State’s faculty and staff strive to make space for.\nSaxon will graduate with honors this May with a degree in theatre arts and leave a vital legacy, having helped create lasting change in the department’s people, policies, and practices.\nHer Visit\nWhen Saxon visited Chico State with her best friend from Southern California, she already had plans to attend school in Boston or Seattle, and was leaning toward a degree in psychology.\nAfter a tour of campus and lunch at The Bear, she recalled walking back toward the car and feeling the first drops of rain fall. This quickly shifted to hail and lightning. “We were running from building to building, trying to hide under eaves, but soon we realized there was no point,” she said, noting that the sudden change felt like a sign. “We just walked through the rain. Right then, I just knew that I was supposed to go (to Chico State).” She also knew, as if by divine intervention, that her future lay in theatre.\nHer Vision\nSaxon did not have plans to star in Singing in the Rain. She envisioned herself as a stage manager, and eventually a director. She wanted to pull the rope that engages the sprinklers or find just the right-looking umbrella. She wanted to organize the ambiance, set the vision for the actors, and provide an outlook for the lighting. Saxon set an audacious course for herself, and as soon as she shared it with Associate Department Chair Matthew Teague Miller, he was sold. He offered her an assistant stage manager position for the play She Kills Monsters at the start of her first year.\n“I have rarely had a student as proactive about their own education and growth as Gaby, and that started from the first day we spoke,” Miller said. “From day one, she’s made the most of her four years here.”\n\nHer Voyage\nSaxon pressed forward into new and exciting territory each year. But more storms were ahead. First came the doubts. On the set of She Kills Monsters, Saxon questioned her abilities. She was insecure about her inexperience.\n“I was just trying to not get in the way,” Saxon recalls. “But Matty (Miller) and (former faculty member) Jacob Brown and the students in the cast were fantastic and supportive. I feel like everyone in this department really believed in me when I didn’t believe in myself. It’s because of that belief and support that I’m where I am today.”\nDuring her sophomore year, that same support system taught Saxon an even more valuable lesson. A health scare, instability in her living situation, and her first assignment as a stage manager combined to create feelings of fear and flooding.\n“I didn’t want to tell my directors what was going on because I felt like I needed to be someone they could rely on, but they helped me realize that asking for help is important,” Saxon said.\nShe’s gone on to work as the stage manager for four more shows and been a wardrobe supervisor in another.\nHer Voice\nSaxon wanted new experiences beyond stage managing. And she boldly asked Miller for a shot at directing—an opportunity undergraduate students rarely get—at the perfect time.\n“I was in a conundrum,” said Miller. “I was this white male set to direct Legally Blonde, a show about a young woman finding her voice, when Gaby said she needed an opportunity to direct. I knew she had the heart and willingness to learn.” Of course, she rose to the occasion. “Everything I gave her, she said yes. We were 50-50 in terms of our contributions to the project.”\nLast December, Saxon directed the one-act play No Exit from start to finish, rummaging around in costume storage for what the actors would wear, casting the show, pulling props and furniture, and determining the tone.\nWritten in France just before D-Day, the play is set in a version of Hell in which three characters are locked together in a plain room. Saxon was particularly proud of her vision to portray a queer character in a more positive light.\n“It’s a weird show,” admitted Saxon. But she loves that it asks a lot of big questions.\nJust as she has used her voice to create opportunities for herself, she does her best to create the same opportunities for others. As a woman and sister of someone with autism and epilepsy, she is constantly reminded of the disconnect between theatre and many audiences, and how far she believes the industry must go to become equitable and inclusive.\nSaxon was among a pilot group of students who took a “Social Justice in Theatre” course last year—now a requirement for every theatre and musical theatre major. Saxon said the class helped make her a better human, stage manager, and director through the discovery of improved practices around identities and theatre and the role language can play in helping create a safer space.\n“People work best when they’re in a room that feels safe,” Saxon said. “Even on a creative level, the ability to feel comfortable to make decisions and make choices in the room is really important to me, and that’s part of my foundation as a stage manager and a director—making sure that people feel safe and comfortable.”\nAccording to Miller and Elizabeth Grace Davis (her supervisor in the costume shop), Saxon’s focus on social justice, coupled with her ability to merge it with her work in the theatre, has changed the department for the better.\n\n“Gaby has become a very powerful person and fierce ally,” Miller said. “She’s been ferocious about creating a more inclusive environment. Whatever privilege she has, she uses it to advocate for others. She risks standing up to people in power to make positive change wherever she is. For her to have that kind of care at this age and at this point in her career is kind of amazing.”\nHer Vehicles\nSaxon has also left her mark in the theatre department’s policy manual, and in its consent-based practices. Both efforts are designed to make all involved feel safer and more comfortable—values sometimes easy to ignore in the backstage hurry and hullabaloo of a production.\nSaxon was part of a committee of students who reimagined the department’s mission statement, policies, and procedures. She led the effort to create a technological component from scratch—in essence, setting the tone for students who follow in her footsteps as stage managers and directors.\nShe’s also embraced a move toward better practices when it comes to boundaries and consent among theatre workers and students.\nFor the last two summers, Saxon has taken this perspective with her to the Clinton Area Showboat Theatre, a summer stock professional theatre in Clinton, Iowa, where she worked as an assistant stage manager and manager.\n“I’ll ask an actor if it’s within their boundaries for me to mic them today, and they want to know if I’m required to ask that,” Saxon said. “Once I explain that it’s just part of my practice you can see people begin to feel more comfortable. It also just opens the door for conversations.”\nHer View Forward\nMay is a big month for Saxon. She is the wardrobe supervisor for the Music and Theatre Department production of The Wizard of Oz, which runs May 4–7 at Laxson Auditorium. Tickets are still available! She has been devoted to stitching together all the intricate details of a beautiful, bubbly dress to be worn by the actor portraying Glinda, “the Good Witch of the North.”\nSaxon will graduate with honors a few weeks later, walking across the stage—even if she’s tempted to stay behind the scenes to make sure the show goes just right.\nAfter that, it’s off to Durham, North Carolina, for a summer job as a production stage manager at American Dance Festival. \nShe also has a fiancé, Nolan Mancl. The pair met working at the Showboat in Iowa, and after six months of dating long distance, Mancl moved to Chico and is now attending Chico State. In fact, he composed the music and sound effects for No Exit.\nThey share a passion for advocacy, equity, and inclusion, as well as an artistic drive.\n“He has always been very supportive of me and my career, and that was important for me with a partner,” Saxon said. “I think it helps that we are both artists, we understand the kind of commitment it takes to do our work.”\nThey’re hoping to be married in early June 2024.\nNo matter where the road ahead leads, she will be building on a solid foundation.\n“I’m really proud of what I’ve done in the theatre department,” said Saxon. “But I’m equally proud of and grateful for the friendships I’ve made and the relationships I’ve built with faculty members on campus.”\n\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tLuke Reid\t\t\n\n\n\t\tLuke Reid (History, '04; Kinesiology, '09) is a content producer for University Communications.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/lreid/",
        "https://calstatechico.my.salesforce-sites.com/ticket/#/events/a0S4P00000CLX45UAH",
        "https://today.csuchico.edu/gaby-saxon/?share=facebook",
        "https://today.csuchico.edu/gaby-saxon/?share=twitter",
        "https://today.csuchico.edu/gaby-saxon/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Soon-to-be%20Theatre%20Arts%20Graduate%20Has%20Played%20a%20Starring%20Role%20Offstage&body=https%3A%2F%2Ftoday.csuchico.edu%2Fgaby-saxon%2F&share=email",
        "https://today.csuchico.edu/gaby-saxon/#print",
        "#",
        "https://today.csuchico.edu/author/lreid/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}