{
    "title": "Alumni Share Their journey to Creating the Truff Condiment Brand | Titan - The Digital Magazine of Cal State Fullerton",
    "body": "Some page features may require javascript to run.Skip to Content (Press Enter)The Secretâ\u0080\u0099sin the Hot SauceFirst came the Instagram handle, then came the hot sauce. Cal State Fullerton alumni share their journey to creating the Truff luxury condiment brand.By Lynn Juliano / Photos courtesy of Truff / Design by Tofer MedinaWhen Nick Guillen secured the @sauce Instagram handle in 2015, he and classmate Nick Ajluni quickly began to brainstorm how they could capitalize on the opportunity. They considered merchandise, a blog and salad dressing before landing on hot sauce.The Cal State Fullerton alumni are co-founders and co-CEOs of Truff, a luxury condiment brand known for its truffle-infused twists on hot sauce, pasta sauce, mayonnaise, truffle oil and salt. Ajluni â\u0080\u009915 (B.A. business administration) and Guillen â\u0080\u009915 (B.A. communications) share the excitement and challenges of starting a business from the ground up, their commitment to authenticity as business leaders, and how the CSUF Business Plan Competition was an invaluable part of their education.How did you use social media to launch your business?Nick GuillenGUILLEN: When we got the Instagram name @sauce, we began to post content that centered around our love of pop culture and food. Our posts featured drool-worthy dishes in elaborate settings, and the account quickly gained a cult-like following of individuals eager to engage with the brand. This rapid success signaled an opportunity for us to expand the brand into a tangible, buzzworthy product. After a while, we wanted to create an upscale sauce for the audience that we had built. Our goal was to make a sauce that elevated the category as a whole. In our search for ingredients, we resonated with black truffle and found a way to incorporate it into the sauce. Our recipe uses a mix of real black truffle along with the highest quality black truffle oil available.What was the scariest part of the process?Nick AjluniAJLUNI: When we started Truff in 2017, a lot of people doubted us. Whether it was the unique mixture of truffles and spice or the price point or our direct-to-customer roots â\u0080\u0094 a lot of retailers did not think we were a viable business. Throughout all this, we remained confident in ourselves and our product. We knew that if we just got people to try Truff, they would understand that it deserved a prominent place in the hot sauce market. Today, weâ\u0080\u0099ve built something much bigger than just a condiment. Truff is seen as a conversation point because of all the reasons that some originally doubted us.Truffâ\u0080\u0099s Award-Winning ProductsSince the release of its hot sauce in 2017, Truff quickly became one of the fastest-growing condiment brands. The companyâ\u0080\u0099s products are available nationwide and have been recognized by such publications as:Oprahâ\u0080\u0099s Favorite Things, 2022, 2021, 2019, 2018People Magazineâ\u0080\u0099s Food Awards: Best Mayonnaise, 2022Clean Eatingâ\u0080\u0099s Clean Choice Award: Best Pantry Staple, 2022Kitchn Essentialsâ\u0080\u0099 Essential Groceries: Best Mayonnaise, 2021NBC Today Showâ\u0080\u0099s Best Selling Products, 2020Forbesâ\u0080\u0099 30 Under 30: Food and Drink, 2019What programs at csuf were influential to you?AJLUNI: We found great value in the CSUF Business Plan Competition (now CSUF Startup Competition). I submitted NixFix Chasers, a powdered beverage, in the 2013 competition and placed second out of 80 contestants. This was an amazing experience for both of us, and it helped us learn a lot about what to think through when starting a business. Additionally, we both had the privilege of having the late Joe Formichelli (lecturer in management) as an instructor in college, and we loved his class.What advice do you have for college students dreaming of starting their own business?GUILLEN: The challenge of building a business from the ground up is rewarding in itself. You have to love the process because it isnâ\u0080\u0099t always glamorous. One of the most important things is to be authentic and not just focus on selling things to people. Your goal should be to provide as much value as humanly possible to your audience.What s your favorite food to pair with hot sauce?AJLUNI: Pizza and tacos.GUILLEN: Omelets, pizza, mac and cheese.Support the Center for Entrepreneurship:give.fullerton.edu/entrepreneurshipMore StoriesOnce a Titan, Always a TitanA Titan Takes the FieldChloe the Engineer Stomps Out StereotypesRaising $270 Million: A Titan Success StoryPresidentâ\u0080\u0099s MessageThis site is maintained by Division of University AdvancementTo report problems or to comment about this site, please contact strategiccomm@fullerton.eduÂ Â |Â Â Privacy PolicyÂ© California State University, Fullerton. All Rights Reserved.Additional ResourcesEmergency InformationUniversity PoliceCSUF Accessibility Â  | Â  Feedback FormDownload Adobe Acrobat Reader Acrobat Reader Â  | Â  Download Word viewer, or download Excel viewer, or download PowerPoint viewer Microsoft ViewerPrivacy PolicyAnnual Security Report (Clery)Title IXContacts and AddressesSite IndexCampus MapCSUPresidentFramroze M. Virjee, JDVice President, University AdvancementGregory J. SaksAssociate Vice President, Strategic Communications and Brand ManagementEllen TreanorEditorialTaylor Arrey, Lynn Juliano, Valerie Orleans, Debra Cano RamosDesign and VisualsHoward Chang, Matt Gush, Robert Huskey, Robert Rodriguez, Mishu VuProductionJillian Brander, Denise Del Cid, Michael Mahi, Savannah Terrazas",
    "links": [
        "#MainContent",
        "https://www.instagram.com/sauce/",
        "https://give.fullerton.edu/entrepreneurship",
        "/spring-summer-2023/i-am-and-always-will-be-a-titan/",
        "/spring-summer-2023/titan-in-the-outfield/",
        "/spring-summer-2023/chloe-the-engineer/",
        "https://titanmag.fullerton.edu/spring-summer-2023/raising-270-million/",
        "/spring-summer-2023/presidents-message/",
        "http://www.fullerton.edu/advancement",
        "mailto:strategiccomm@fullerton.edu",
        "https://www.fullerton.edu/it/iso/policy/online-privacy.php",
        "http://emergency.fullerton.edu",
        "https://police.fullerton.edu/",
        "http://www.fullerton.edu/ati",
        "http://www.fullerton.edu/ati/reportati",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/",
        "https://www.fullerton.edu/it/iso/policy/online-privacy.php",
        "https://police.fullerton.edu/jeanneclery",
        "http://www.fullerton.edu/titleix/",
        "https://www.fullerton.edu/contact.aspx",
        "https://www.fullerton.edu/a-z.aspx",
        "http://www.fullerton.edu/campusmap/",
        "https://www2.calstate.edu/"
    ]
}