{
    "title": "Gutenberg Changelog #82 - Gutenberg 15.6 and proposed schedule for WordPress 6.3 - Gutenberg Times",
    "body": "\nSkip to the content\n\n\n\n\n\n\n\n\nMenu\nClose\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\nHome\nNews\nPodcast: Gutenberg Changelog\nLive Q & A Archive\nTestimonials\nAbout UsShow sub menu\n\nContact Us\nSponsors\n\n\n\n\n\nSearch For…\n\n\nSearch\n \n\n\n\n\nTwitter\nYouTube\nmastodon\n\n\n\n\n\n\n\n\nGutenberg Times\nCurating news and community voices about the WordPress Block Editor, codenamed Gutenberg\n\n\nTwitter\nYouTube\nmastodon\n\n\nSearch\n \n\nMenu\n\n\n\n\n\n\n\n\n\n\n\nSearch For…\n \nSearch\n\n\nClose\n\n \n\n\n\n\n\n\n\n\n\nGutenberg Changelog #82 – Gutenberg 15.6 and proposed schedule for WordPress 6.3\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tGutenberg Changelog\t\t\t\t\t\nGutenberg Changelog #82 - Gutenberg 15.6 and proposed schedule for WordPress 6.3\n\n\n\n\nPlay Episode\n\n\nPause Episode\n\n\n\n\n\n\n\n\n\n\n\n\n\nMute/Unmute Episode\n\n\nRewind 10 Seconds\n\n1x\n\nFast Forward 30 seconds\n\n\n\n00:00\n/\n\n\n\n\n\n\n\nSubscribe\nShare\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tAcast\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tApple Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCastBox\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tGoogle Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPocketCasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPodbean\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPodchaser\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRSS\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tSpotify\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStitcher\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\tRSS Feed\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tShare\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tLink\t\t\t\t\n\n\n\n\n\n\n\n\t\t\t\t\tEmbed\t\t\t\t\n\n\n\n\n\n\n\n\nDownload file | Play in new window | Recorded on April 20, 2023Subscribe: Acast | Apple Podcasts | CastBox | Google Podcasts | PocketCasts | Podbean | Podchaser | RSS | Spotify | Stitcher\nNick Diego and Birgit Pauli-Haack discuss the most recent Gutenberg plugin release 15.6, the proposed schedule for WordPress 6.3 release in August of this year and a few things that are in the works. \nShow Notes / Transcript\n\nMusic: Homer Gaines\nEditor: Sandy Reed\nLogo: Mark Uraine\nProduction: Birgit Pauli-Haack\n\nSpecial Guest: Nick Diego\n\nFollow on Twitter: @nickmdiego\nWordPress.org: Nick Diego\n\nAnnouncements\n\nWordPress 6.3 Planning Proposal & Call for Volunteers\nPreparing for the Next Women & Nonbinary Release Squad\n\n\nFSE Program Exploration: Build a block theme\nFSE Program Testing Call #21: Front Page Fun\nUsing template patterns to build multiple homepage designs (Dev Blog) \n\nCommunity Contributions\nGiveWP: Visual Donation Form Builder in Beta\nBring me your Issues with Ryan Welcher\n\nBring me your Issues #1\nBring me your Issues #2\nBring me your Issues #3\nTooling: Using Create-Block Scaffolding and 3rd Party Templates\n\nGutenberg 15.6\n\nWhat’s new in Gutenberg 15.6? (19 April)\nGutenberg 15.6 Introduces Experimental Details Block and Command Center for Site Editor\nIntrinsic design, theming, and rethinking how to design with WordPress (Dev Blog)\nNick Diego’s Video on Twitter on Spacing for the Spacer block.\n\nWhat’s discussed or in the works?\n\nWIP – Add a UI to allow saving patterns 🚧#49607\nThe wp:pattern block#48458\nExperimental: Global styles revisions#49912 (alternative to #46667)\nEditor: expose revisions in the UI for all available post types#49601\nBlocks: Provide a general solution to customize the list of allowed blocks for inner blocks with block attributes \n\n\nStay in Touch\n\n\nDid you like this episode? Please write us a review \nPing us on Twitter or send DMs with questions. @gutenbergtimes and @bph.\nIf you have questions or suggestions, or news you want us to include, send them to changelog@gutenbergtimes.com. \nPlease write us a review on iTunes! (Click here to learn how)\n\n\nTranscript\nBirgit Pauli-Haack: Hello, and welcome to our 82nd episode of the Gutenberg Changelog Podcast. In today’s episode, we will talk about the Gutenberg plugin version 15.6, the proposed schedule for WordPress 6.3, and a few things that are in the works again. I’m your host Birgit Pauli-Haack, curator at the Gutenberg Times and full-time core contributor for the WordPress Open Source Project. I’m thrilled to have with me today, co-host Nick Diego, plugin developer, core contributor as well, and we are both part of Automattic’s Five for the Future project. Nick and I teamed up to manage the Gutenberg plugin release 15.6, so this is fresh from the press, so to speak. Thanks for joining me today again at the Gutenberg Changelog. Nick, how are you today?\nNick Diego: I’m doing great. I’m very excited that 15.6 is out in the wild now.\nBirgit Pauli-Haack: Yeah, me too. And this is a daily dose of Nick Diego for me because the last two days we were in communication about the release. \nAnnouncements\nBut before we head into the Gutenberg 15.6 release, let’s do a few announcements from the WordPress project. As mentioned in the intro, the release schedule for WordPress 6.3 proposal is published and includes a call for volunteers for the release squad. A beta is proposed to be, beta one, is proposed to be on June 27th, 2023. So it’s after WordCamp and “after after” WordCamp, so to speak, WordCamp Europe. Release candidate and dev notes. Deadline is proposed for July 18th, 2023, and then the final release is proposed to be scheduled on August 8th, 2023. So you raised your hand right, Nick? I raised my hand.\nNick Diego: I did. Yeah. Yes, exactly. So yeah, I’ve been in the editor triage lead for the last three-year releases and it was a new role when I started. I’d love to help somebody grow into that role because I love doing it, but we want to see other people in that role as well. And I think it’s a fun role. It’s pretty unique. Yeah, it’s not very technical. It’s more organizational and just engaging with other release leads and kind of keeping everything moving smoothly. So it’s a great lead for somebody who maybe is not as technical but wants to really engage with the release.\nBirgit Pauli-Haack: Yeah. Yeah, I want to change my role. The last three releases, I did documentation pieces and especially the Gutenberg dev notes wrangle them through GitHub and that is definitely something that somebody that is not technical can do as well. I’m open to mentor somebody for 6.3 and the proposal for the schedule comes actually on the heels of Josepha Haden Chomphosy’s post, which preparing for the next women and non-binary release squad, AKA underrepresented gender squad.\nAnd if you want to be part of it, you can raise your hands in the comments there. And of course we have the links and show notes, but if you haven’t worked on the major WordPress release squad before, it would be really good and you want to be part of the underrepresented gender squad, it would be good that you also look at the schedule for 6.3 and raise your hand there because quite a few mentors would be available to skill up contributors to be part of 6.4 because that’s how you get new people in that you need to… We need to shepherd them through the responsibilities and how things work and who to talk to and how this all… It can be very intimidating when you haven’t done this before.\nSo not to throw you into the deep end of the water to swim.\nNick Diego: It’s always good to see how the sausage is made and there’s so much going on and so many people involved. I know when I first did it, I was very intimidated, but after you see it once, it starts to make a bit more sense. So yeah, mentor for 6.3 and then get really well-prepared for 6.4.\nBirgit Pauli-Haack: Yeah. Yeah. And if you want to learn more, yeah, you find us on Twitter or on the WordPress Slack and you can just kind of DM us or ask us some questions there. Well, I volunteered you now. Big sorry.\nNick Diego: Yeah. Oh, if anybody has any questions about the release, feel free to reach out to us. We’re here to help, here to get more people on board with the release. I know for myself, it kind of kicked off my journey in contributing more to WordPress and it really made me kind of fall in love with the process. And so I highly encourage anybody else who might be even a little bit interested to start exploring it.\nBirgit Pauli-Haack: And if you want to help the quality race on some of the products, you can also follow the FSE outreach program that has been in place for two and a half years almost. And there is, Anne McCarthy runs the program and you still have until April 26th to follow the testing call number 20. And that is using the create block theme plugin to create a block theme and you get some instructions on the call for testing. It’s another six days, but if you are not so much into theme development, maybe you want to do the new call for testing that just came out and have some front page fun with a block scene and create some templates that are for the front page. And there is actually also a developer news blog out, blog post out that just came out last week, and that is by Justin Tadlock using the template patterns to build multiple homepage designs. So I don’t know exactly if they’re related, but I’m pointing you to it as well, so you get a little bit broader picture of it. Yes.\nNick Diego: And I want to stress that these call for testings, even if you’ve been building with blocks forever and you’re very engaged, it’s a great exercise to go through. I consider myself very entrenched in WordPress and know what’s going on, but sometimes when you go through these testing calls, you find pitfalls or issues that somebody who’s maybe brand new to blocks would encounter. It’s a great way to find problems or things that can be fixed to make that onboarding experience smoother. So I know I always find things that I don’t expect, but the goal of these call for testing is to make WordPress better. And so even if you use WordPress every day, I encourage you.\nBirgit Pauli-Haack: Yeah, that’s a good point. Absolutely. And if I want to get something done on my theme, for instance, for the Gutenberg Times or for my personal blog and try to do this, I always find something that might be a little quirky, that might be a little bit, oh, I haven’t thought about that, but now that I use it, maybe there are some things that could be easier to handle or more intuitive or I run into some problems.\nIt’s so fresh from out of the releases that there’s always… There is no bug free software. That ship has sailed when we so many people are involved. All right.\nNick Diego: Absolutely.\nBirgit Pauli-Haack: Yeah. But that’s also something if I get asked, I want to contribute to WordPress, but I don’t know how. So I’ll appoint them to the testing calls because it’s gets them hands-on with the WordPress site and also contribute back by just giving feedback. You don’t have to know the processes. You don’t need to know any development, but when something doesn’t work right and you can raise your hand and say, I found something and explain that to other people. And Anne has been very good in creating GitHub issues for the developers and to feed that back into the development process.\nNick Diego: Absolutely.\nCommunity Contributions\nBirgit Pauli-Haack: For the community contribution, I wanted to point out Ryan Welcher started a new series on his Twitch stream and it’s called Bring Me Your Issues. And he uploaded the first of the few issues for persistence on YouTube, and I wanted to point you to it. He also went through the work and added chapter timestamps to it, and especially for the first one that was really helpful because that’s a two and a half hour Twitch session. I really admire his persistence and his patience.\nSo you can look through the list of the topics that he covered and one of them… So I can only say three things, but that it was more so how to use the create block scaffolding tool. It’s always interesting to see that and how to build an edit block for the lockdown user. So edit post block I should say. And that’s certainly something that could come to core, but if it’s easier… Yeah, relatively easy to build, you can build it yourself. Then he answers the question, what and why inner blocks, which is a component that is for block building. And then another question is how to create a placeholder and parent and child relationships for your block development and using the example of a post pickup block. Yeah.\nNick Diego: It’s a goldmine of tools and how to do different things, so if you haven’t checked out Ryan’s streams, you definitely should.\nBirgit Pauli-Haack: Yeah, and there’s a second edition of it, where you can learn more about the get post type selectors in the data store and the use entity records, all technical terms, that you will know so easy after you listen to that. The render appender, I like that. The render appender on the inner box. And then in the third edition here, Ryan also talks a little bit over the Gutenberg 15.5 release and how to create a external template for APIs for the great block scaffolding tool. Always a good thing to know so you can create your own templates for the tool. There was actually also a topic at one of our Gutenberg live Q&As was Grzegorz Ziolkowski and Fabian Kagy. It’s a couple of years old, but it’s still very, very current with demos and additional background on how to create those templates. So we share all this in the show notes. I know it’s a little bit tech and developer happy, heavy, happy too, but I just wanted to point out these new resources and additional resources.\nNick Diego: Yeah, absolutely.\nBirgit Pauli-Haack: So GiveWP published a block-based visual donation form builder. That’s a mouthful, and it’s in beta. So GiveWP has, in an earlier episode, we discussed GiveWP’s way to rebuild the powerful donation plugin with our block first mindset and starting off with a WordPress native components and scripts to build the interface and only use custom code to augment it. And the visual donation form builder, it’s getting better, is the first product that comes from this effort. And if you work for an agency that helps nonprofits fundraise using the GiveWP Plugin, this beta is definitely for you. It’s also for you when you are working at a nonprofit organization and you are responsible for the fundraising and creating the campaign-related forms. This is also a beta for you. So it gives you early insight in what’s coming to GiveWP in the version 3.0. And it also gives you a better feel for what will be possible with a new form builder that isn’t available right now. So check it out, GiveWP. We have the link definitely in the show notes to the beta announcement, and that’s it from our community contributions.\nNick Diego: Lots of good stuff.\nWhat’s Released – Gutenberg 15.6\nBirgit Pauli-Haack: Yeah. So what’s released this week? We have Gutenberg 15.6 and we are coming right from it. It was released yesterday and the release post is also available now. It includes a total of 112 PRs. It’s a smaller release in comparison to the ones that come closer to a major WordPress release. It was authored by 45 contributors and seven of which were new contributors. So congratulations everyone on the good work and let’s get into what’s in there. And we’re starting out with, we now have spacing presets to the spacer block.\nNick Diego: Yeah, this is what I’m so excited about. We’ve had… Since 6.1, presets were added to WordPress, which allow you to do a little slider for margin and padding and block app. It’s configuring margin or padding can be kind of complicated, but when you have a preset of small, medium, large or 1-2-3-4-5, it just makes it a little bit easier for the user. And the way that you could apply those, is you could actually make them fluid, using clamp to make them fluid, which allows for really interesting designs that don’t require media queries because you can make all your one margin for desktop, another for mobile. We didn’t have that for the spacer block, which adds vertical height between different blocks. So if you had a hundred pixel spacer block, you wanted it to be smaller on mobile, you would need to use custom CSS.\nWell, now spacing presets come to the spacer block, which also in turn allows for fluid spacer blocks, which people have been asking for forever. Because the spacer block is such a natural tool. It’s so easy to add for end users. It makes sense. I want to add some space between these two items. Okay, add the spacer block, but now that they’re fluid… Now that you can make them fluid, it allows for dynamic websites where you have one size on desktop, another for tablet and another for mobile. And it’s all on this fluid spectrum and you don’t need media queries. You don’t need anything else. You’re just using these spacing presets. So I couldn’t be more excited. I’ve only have just began exploring this and I know other theme developers are as well, so exciting stuff.\nBirgit Pauli-Haack: Awesome. Yeah, thank you so much for telling us about it. I also want to point out a blog post that’s on the developer blog and it kind of talks about that fluid part of intrinsic design versus media queries for theming and thinking about how designing WordPress makes it a little bit more modern when you… Because the proliferation of screen sizes, you are probably not very content with just three media or three sets. You might need 12 sets or 6 sets, and who keeps track of all the different settings for all these presets? Intrinsic design, that’s a fluid typography. That’s a fluid spacing. It’s definitely a way to go.\nIt doesn’t say that you cannot have any media queries, but it’s definitely for the strategic way to build websites. It’s the way to go now.\nNick Diego: Definitely.\nBirgit Pauli-Haack: And then we had, the cover block had border support, but now you also have these pop over resizable box and I think it also was in 15.5, but cover block has now a great border support. You can have the radios. You can have the colors. You can have the resizable block kind of… Resizable blocks adhered to those. Yeah, that was really nice when I tested it. I’m not quite sure that’s 5.6 native, but it’s definitely improved with 15.6\nNick Diego: In 16.1, we did a huge effort to add all these design tools to most blocks, but border was left off a handful of them. One of them being cover block because of the clipping so if you did a background image and you tried to put border radius on it, you’d need to use overflow. It just became tricky with CSS and it took some more time to figure out how to implement that correctly. And so we finally got there and I think that this has been one of those things, why isn’t there border control? I thought, well, it was a little more tricky than we expected. So it’s nice to see it here and it really opens up a lot of designs and again, removes some extra custom CSS that you may have needed in the past to achieve a specific design.\nBirgit Pauli-Haack: So next thing on the list of change of was, add styles section to the… Well, they call it browse mode sidebar, but it’s the style editor of the style. Well, somebody called it site editor dark side as well, so which I don’t feel slightly better. It’s the left sidebar that is on the site editor. And now there is a style section where you can see all the styles that come with the theme, the style variations, and when you click on it, you see how your site changes, but there’s also an edit button there. So you can then go and open up the right side and change some of the settings for the style variation. And that is a very fluid workflow. I really love that. And it’s now in the Gutenberg plugin, so it’s really cool.\nNick Diego: Before you had to know where the style variations were. You had to click into the template, then go to the style panel. And so this just makes it much more surfaced for users, allowing you to easily switch your style variation out. Great improvement, and also that name to be determined left-hand sidebar. That will get more features as we go on as well. But this is one additional addition beyond templates and template parts and navigation.\nBirgit Pauli-Haack: Those are the four main items right now. Yeah, navigation, global styles, template and template parts. And there might be a pattern in the future.\nNick Diego: Hopefully.\nBirgit Pauli-Haack: Hopefully. Yes, yes, yes. And then in Gutenberg 15.6, there’s also two experiments. One is a new block that the details and summary block, which mostly was working by Carolina Nymark and she did a fantastic job, shepherding that for maybe a year until it actually got merged as an experiment into the plugin. It’s how you can hide things. You write a movie review and you want to hide the spoiler part where you reveal some of the drama in the movie, but you want your users to know or readers to know that you making a choice here. You open it up and it’s a spoiler. You can also hide some details on certain things. There are numerous of use cases and it’s quite nice because it has all the design tools. It has the typography. It has the spacing. It has the backgrounds, the colors. So it’s actually a nice little block and it can use some testing, but you need to go to the menu of the Gutenberg plugin into the experiments and check it on. Yeah. Have you used it Nick?\nNick Diego: Yeah, I played around with it quite a bit. I think that the colloquial term would be an accordion, is basically kind of what we’re talking about here. It’s really hard to do in an accessible way, which is one of the reasons why this has taken so long to get into WordPress. Core, that is. And so I think Carolina did a great job. The current experimental implementation includes a number of a parent block and then a number of child blocks. There’s another exploration that’s maybe trying to simplify that. But either way, we’re getting closer and closer to having this block and core and it’s something that everybody’s asked for. So why isn’t this in core? We want this in core. So it’s, it will get there and I think this is a great first step. Encourage everybody to try out the experiment. Find problems with it. Find out how we can make it better.\nBirgit Pauli-Haack: Yeah. Excellent. And then there’s another experiment. It’s called a command center for the site editor. And that is really a rough interface right now if you switch it on. Yeah, don’t expect too much user-friendliness in there because it’s still in an experimental way. So if I understood this correctly, you get a little search bar like the spotlight on a Mac or so, and then you can say edit something or change color or so and it will get you to the place where you can actually do that. So you wouldn’t need to know all the 15 levels of menus to get to a certain place. I have not played with it. Did you test it a bit?\nNick Diego: Yes, so we’ve been all hearing about artificial intelligence these days. AI is everywhere, and this is not AI, but it’s an experiment to start exploring one, how you can move things around. How you can move around the site. You could tell it, I want to add a new page, but you can also start to see where in the future you could hook in… third-party extenders could hook in a different additional functionality into this command center to do, write me a post about Mars, whatever. You can start to think about where this could eventually go, which is why this is currently an experiment, but the baseline is going to be take me to the styles panel, add a new page, simple things. But it could be huge. It could be a really important component of what WordPress is. And so really test it out, start exploring it. The idea behind it is it’s going to be very extensible, so you can add additional functionality as a third-party extender. So really excited to see where this goes.\nBirgit Pauli-Haack: Yeah, me too. And then there are quite a few, I call them or we call them here, quality of life kind of enhancements you don’t know that you need it until you see that what you get. And one of them is the smoother animations for the drop zone and what is a drop zone? It’s not a movie thing. You go from drag and drop and to drop, you need to know where you it’s is actually going on your canvas and the animation that… So there’s a blue line appearing on your canvas and it tells you, okay, your drop thingy will drop here when you release the button if you wanted to. And the animations are much smoother. It’s actually a delightful experience now to drag and drop blocks from one section to the other or from the list view over… From the list view over to your canvas. So that’s a very nice addition there.\nNick Diego: Yeah, it’s really nice. And then there’s some improvements to list view itself around dragging. I’ve run into it too. You see sometimes you drag items within the list view and it’s… Things don’t go exactly where you want them to. And one of those was dragging underneath a container like a group block was a little challenging. And then they’ve improved that as well. So dragging and dropping and got it much easier across the board.\nBirgit Pauli-Haack: Yeah, and that I think were all the highlights that we wanted to point out today from the Gutenberg 15.6 release. We will have the release post in the show notes so you can follow up on things. \nWhat’s in Active Development or Discussed\nAnd now we want to talk to you about what’s in active development and what’s coming down the line. And first off is the work with patterns. So I hear this over and over again. I want to create my own patterns. Why can’t I do this with WordPress? I need a plugin. And we know all the good plugins. There’s a, Justin Tadlock had a plugin to create patterns and Block Meister was one, and then WP Engine came out with a pattern builder. And so Ari has a work in progress to add UI to allow saving patterns. And we definitely share that and it’s coming along fine, but it’s still a work in progress. And I don’t know what are the problems they’re hitting? Do you have a feeling on how that’s difficult?\nNick Diego: Well, I think it’s one of those things where we have all sorts of different entities in the block editor. We have reusable blocks. We have templates. We have template parts. What do you use when? What do you use where? And so I think that not only the functionality of being able to save a pattern, but also the UI around saving a pattern and making it clear to users when you should use one over the other and in what context things should be used. So there’s a technical issue and then there’s also a UI understanding user experience issue as well. So it’s getting there. It’s great to see this happening in core patterns are such a great way to create content and then use it in different places. And being able to do that in core would be such a huge benefit. It would allow you to design something, save it as a pattern, go to a different page, use your pattern. There’s just so many delightful applications of this and really excited to see it moving forward.\nBirgit Pauli-Haack: Yeah, it definitely needs to be in there. And there’s also a work done on the WP pattern block, which allows you to create patterns or use patterns in template parts. So that’s also reusable designs that are already available to use them in templates, so you can reuse, have them on every type of page that you want to be on. That is also in the works. It definitely comes together with the UI for the patterns as well. So look out, we have the links for the PRs, will be in the show notes, so if you want to check it out and keep a tab on it, feel free to do those.\nNick Diego: Yeah, and I think that the long and short of it is patterns are under the hood a very simple thing. It’s just a collection of blocks. And the initial implementation of patterns was just that. It was a collection of blocks that you could deploy in different places. Now that people are starting to expand and adopt block-based WordPress, it’s become very clear how powerful patterns can be. And now we’re seeing all these like, well, can it do this? Can it do this? Can we do it here? Yeah. And so we’re trying to address those things.\nBirgit Pauli-Haack: And I just want to… Just had the idea, we talked about pattern before and I pitched that developer news post where you can have patterns for particular templates, and that’s also part of that idea where you can expand. How you can use it. How can theme developers support users in creating what they need to create on their websites and be fast with that? Yeah. So that’s also part, yeah.\nAnother thing that was definitely had a lot of questions and a lot of requests was getting revisions on the global styles for the interface. So contributors look to implement revisions and display them in the global styles. There’s current and experimental implementation that shows a separate revision menu item in the global styles. And when you selected, you can see the latest revisions, the preview of them in the editor, and you can also go back to the latest revision and change it again. Or there is also a restore of unsafe changes and also a reset to the science of the theme. So there was, the design team did lot of thinking about how that can be displayed. And now developers are working on some iterations on the PR before it’s merged. And it will certainly need some thorough testing, but I wanted listeners to know that that is coming as well.\nNick Diego: Yeah, revisions are such a big thing when you make those changes in the site editor can be a little discerning because you’re like, I’m making all these changes. How do I get back? How do I get back to a design that I liked before and it was clicking the back button a million times or just a little… It was tough. So there’s a revision, especially visual revisions where you can go back and see what the changes that were made I think is going to be really important for broader adoption of the site editor. So great to see.\nBirgit Pauli-Haack: Yeah, definitely. And when users do make their own designs or make changes on their design, sometimes they don’t know what the final design looks like until they actually have it and then they don’t like it anymore and then they need to go back and that these revisions definitely will help with that process. I’m that way. Yeah.\nNick Diego: Oh, yeah.\nBirgit Pauli-Haack: And the last item that I have in the list for, or we have in the list for you to learn that is discussed and in the works is again, a little bit more developer oriented, but now there is a PR one issue discussed on how to get allowed blocks into the blockchain meta. It is an attribute for the inner block. So if you have a custom block and you want other blocks in there, you can restrict which blocks can be put in there, but you are not able to add this to your… A data point to your outside block. And that is something especially for developers that restrict them or they find solutions around it. And if you… Yeah, one is if you want to restrict an instance of the media and text block, that it only can do heading, paragraph, and image, but you can tell the media and text block that is what you want them to put in there. So developers do all kinds of interesting things to work around this, but there should be a standard in core and the developers are working on it.\nNick Diego: Yeah, I’d love to see this extensibility. When the block editor is being built, obviously, you need the core components to be built, but I think we’re finally out of time where a lot of things are stable and now is really how do we allow people to make changes, extend different components. One of the beauties of WordPress. You can change anything. You can configure it in many ways and getting some of that configurability into more configurability into the block editor is great. So these little things that may seem minor have huge impacts for developers’ lives and what they’re trying to implement. So great to see this happening.\nBirgit Pauli-Haack: And I was thinking about, well, this is an issue that’s discussed for four years now. And finally there are enough use cases, there have been enough ways to use the block editor and extend an editor, and now there’s a real need there to actually have that discussion come to fruition into a PR or into a new feature that helps the developers to extend things. And I think we will see through the year of 2023, the next two major WordPress releases, certainly additional things that add more extensibility to the block editor, especially to the site editor and to custom blocks. And it’s exciting times and I’m really glad that we are there now just before the next phase of Gutenberg.\nYeah, absolutely. And with that, dear listeners, we are at the end of the show. It was a shorter show, but I’m glad I had Nick with me for you and could talk to you about a few things that are beyond the Gutenberg plugin release. \nSo before the end of the show. I remind you if you want to help WordPress get better, heed the call for testing, either building a block theme with a block plugin in the 20th testing call or rating front pages, different kind of front page for your website. So anything else that you want to add to things that we haven’t talked about that you were top of your mind?\nNick Diego: No, just encourage people to go check out 15.6 and that call for testing. Embrace blocks and try to push the block editor to his limits. And if there are issues, let us know and we’ll help make it better.\nBirgit Pauli-Haack: All right, so you changed jobs, Nick? Have anything but you are not new to our listeners. That’s why we kind of cut through the introduction a little bit. But have anything… If people want to get in touch with you, has anything changed?\nNick Diego: Nope. The best place usually is just on Twitter or obviously WordPress Slack at NDiego. On Twitter, NickMDiego. So feel free to reach out to me with your questions, comments, suggestions about WordPress. Here to help.\nBirgit Pauli-Haack: And we have a new video of you, Fluid Spaces.\nNick Diego: Yeah, I’m going to make more of those. I’m going to be trying to do more little shorts about different features that come out in WordPress so we’ll see how that goes.\nBirgit Pauli-Haack: And the first one is out today and we will have the link in the show notes and it talks about the spacers, spacer block. And so let Nick know what you think about and what your ideas are for new little shorts. \nAs always, the show notes will be published on gutenbergtimes.com/podcast. This is the 82nd edition or episode. And if you have questions or suggestions or news you want to send, include them to changelog@gutenbergtimes.com. That’s changelog@Gutenbergtimes.com. Thank you everybody, and I wish you a great weekend and a new weekend of spring eternal. Hopefully, and the weather getting better and talk to you in two weeks. Bye-bye.\nNick Diego: Bye-bye.\n\n\n\n\nLeave a Reply\t\t\t\t\tCancel reply\n\n\n\n\n\n\n\n\n\n\nThis site uses Akismet to reduce spam. Learn how your comment data is processed. \n\n\n\n\n\n\n© 2023 Gutenberg Times\n\n\t\t\t\t\t\t\tTheme by Anders Norén \n\nTwitter\nYouTube\nmastodon\n\n\n\nBy using this website, you agree to our Privacy Policy× \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#site-content",
        "#",
        "#",
        "/",
        "https://gutenbergtimes.com/news/",
        "/podcast",
        "https://gutenbergtimes.com/live-q-a-archive/",
        "https://gutenbergtimes.com/testimonials/",
        "https://gutenbergtimes.com/about-us/",
        "#",
        "https://gutenbergtimes.com/contact-us/",
        "https://gutenbergtimes.com/category/sponsors/",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "https://gutenbergtimes.com/",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "#",
        "#",
        "#",
        "https://play.acast.com/s/gutenberg-changelog",
        "https://podcasts.apple.com/us/podcast/gutenberg-changelog/id1469294475",
        "https://castbox.fm/channel/Gutenberg-Changelog-id2173375",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9ndXRlbmJlcmd0aW1lcy5jb20vZmVlZC9wb2RjYXN0",
        "https://pca.st/7O43",
        "https://www.podbean.com/podcast-detail/chi7j-9904a/Gutenberg-Changelog-Podcast",
        "https://www.podchaser.com/podcasts/gutenberg-changelog-878239/",
        "https://gutenbergtimes.com/feed/podcast/",
        "https://open.spotify.com/show/620NwVKQJGdTupy36zYxvg",
        "https://www.stitcher.com/show/gutenberg-changelog",
        "https://www.facebook.com/sharer/sharer.php?u=https://gutenbergtimes.com/podcast/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3/&t=Gutenberg Changelog #82 - Gutenberg 15.6 and proposed schedule for WordPress 6.3",
        "https://twitter.com/intent/tweet?text=https://gutenbergtimes.com/podcast/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3/&url=Gutenberg Changelog #82 - Gutenberg 15.6 and proposed schedule for WordPress 6.3",
        "https://gutenbergtimes.com/podcast-player/23907/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3.mp3",
        "https://gutenbergtimes.com/podcast-download/23907/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3.mp3?ref=download",
        "https://gutenbergtimes.com/podcast-download/23907/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3.mp3?ref=new_window",
        "https://play.acast.com/s/gutenberg-changelog",
        "https://podcasts.apple.com/us/podcast/gutenberg-changelog/id1469294475",
        "https://castbox.fm/channel/Gutenberg-Changelog-id2173375",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9ndXRlbmJlcmd0aW1lcy5jb20vZmVlZC9wb2RjYXN0",
        "https://pca.st/7O43",
        "https://www.podbean.com/podcast-detail/chi7j-9904a/Gutenberg-Changelog-Podcast",
        "https://www.podchaser.com/podcasts/gutenberg-changelog-878239/",
        "https://gutenbergtimes.com/feed/podcast/",
        "https://open.spotify.com/show/620NwVKQJGdTupy36zYxvg",
        "https://www.stitcher.com/show/gutenberg-changelog",
        "https://gutenbergtimes.com/podcast/gutenberg-changelog-69-gutenberg-releases-wordpress-6-0-1-the-create-block-theme/#shownotes",
        "https://gutenbergtimes.com/podcast/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3/#transcript",
        "https://soundcloud.com/xirclebox",
        "https://www.linkedin.com/in/sandy-reed/",
        "https://markuraine.com/",
        "https://icodeforapurpose.com",
        "https://twitter.com/nickmdiego",
        "https://profiles.wordpress.org/ndiego/",
        "https://make.wordpress.org/core/2023/04/14/wordpress-6-3-planning-proposal-call-for-volunteers/",
        "https://make.wordpress.org/core/2023/04/07/preparing-for-the-next-women-nonbinary-release-squad/",
        "https://make.wordpress.org/test/2023/03/29/fse-program-exploration-build-a-block-theme/",
        "https://make.wordpress.org/test/2023/04/17/fse-program-testing-call-21-front-page-fun/",
        "https://developer.wordpress.org/news/2023/04/using-template-patterns-to-build-multiple-homepage-designs/",
        "https://givewp.com/visual-donation-form-builder-beta/",
        "https://www.youtube.com/watch?v=Aut0EcsKbxM&t=6s",
        "https://www.youtube.com/watch?v=n2SYJhh3PGs",
        "https://www.youtube.com/watch?v=7qalDqYnFRA&t=856s",
        "https://gutenbergtimes.com/tooling-using-create-block-scaffolding-and-3rd-party-templates/",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/",
        "https://wptavern.com/gutenberg-15-6-introduces-experimental-details-block-and-command-center-for-site-editor",
        "https://developer.wordpress.org/news/2023/02/intrinsic-design-theming-and-rethinking-how-to-design-with-wordpress/",
        "https://twitter.com/nickmdiego/status/1649055649542856704",
        "https://github.com/WordPress/gutenberg/pull/49607#top",
        "https://github.com/WordPress/gutenberg/issues/48458#top",
        "https://github.com/WordPress/gutenberg/pull/49912#top",
        "https://github.com/WordPress/gutenberg/pull/46667",
        "https://github.com/WordPress/gutenberg/issues/49601#top",
        "https://github.com/WordPress/gutenberg/issues/15682",
        "https://lovethepodcast.com/gutenbergchangelog",
        "https://twitter.com/gutenbergtimes",
        "https://twitter.com/bph",
        "mailto:changelog@gutenbergtimes.com",
        "https://gutenbergtimes.com/itunes/",
        "mailto:changelog@gutenbergtimes.com",
        "mailto:changelog@Gutenbergtimes.com",
        "/podcast/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3/#respond",
        "https://akismet.com/privacy/",
        "https://gutenbergtimes.com",
        "https://www.andersnoren.se",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "https://gutenbergtimes.com/privacy-policy/"
    ]
}