{
    "title": "Degrees of Hope and Opportunity - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nDegrees of Hope and Opportunity\n\nSean Murphy\nApril 28, 2023\n\n\n\n\n(Photo courtesy of the Yang family) \n\n\n\nChico State has been a second home to countless families who’ve shared and cherished the Wildcat experience. For these families—and more than 177,000 alumni—Chico State is not just a university or campus. It is the branches of the family tree. This is one of six profiles of families who are rooted in their Wildcat connection.\nLiving in Laos in 1983, Xue Yang and his wife, Ong, had their first child, a son, Kong. The following year, the family fled for Thailand to escape the Pathet Lao Communists. Along the way, the family added two more sons to their brood—Sue and Ze.\nIn spring 1987, sponsored by a great aunt who lived in Seattle, the family of five emigrated to the Northwest—welcoming another son, Dao, to the family there. In summer 1988, they settled down in Oroville, reuniting with relatives and ending their four-year trek to a new life. Xue and Ong eventually had 10 children (seven boys and three girls) and it was Xue’s dream that every one of his children earn college degrees—he saw all but one of his children graduate before he passed away in December 2019.\nOver the course of 16 years, each of the 10 siblings graduated from Chico State, spanning nine different majors and four colleges, not to mention two teaching credentials and a pair of graduate degrees—the last of which will be conferred this year, when the youngest Yang, Pa, will earn her master’s in psychology.\nTeng, the fifth child and first born in Oroville, said his father’s encouragement to pursue education took root early in the children’s lives.\n“My dad instilled in us that education is everything, our future, and an opportunity,” said Teng. “He began preparing us foundationally for education when we were in grade school.”\nIf not for the support of Ong, however, this foundation likely would have crumbled. As the Yang family matriarch, the siblings said she was instrumental in ensuring the house ran smoothly while the kids took care of business in their respective classrooms.\n“Mom was always the one that always made sure we were fed and physically OK,” said sister Chia. “Even though she wasn’t able to help us seek the academic resources we needed, Mom was always there to pray over us and to make sure our physical needs were met.”\nXue practiced what he preached, earning an associate’s degree from Butte Community College in business management in spring 1995. Overcoming a language barrier, he attended classes and studied before working evenings. Though the road to graduation was never without its bumps, the Yang siblings say they know their father’s persistence to pursue higher education came from a loving place.\n“Growing up, you feel like the pressure may have been too much, but as you get older, you learn to appreciate it,” said brother Ze. “It’s all about love and wanting the best for us.”\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tSean Murphy\t\t\n\n\n\t\tSean Murphy (English, ’97) is the Media Relations Coordinator at Chico State. When he's not writing press releases and pitching story ideas to the media or fielding media inquiries, he's writing about human interest stories, sports, the outdoors and the remarkable students, staff and faculty at Chico State.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/samurphy/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://today.csuchico.edu/degrees-of-hope-and-opportunity/?share=facebook",
        "https://today.csuchico.edu/degrees-of-hope-and-opportunity/?share=twitter",
        "https://today.csuchico.edu/degrees-of-hope-and-opportunity/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Degrees%20of%20Hope%20and%20Opportunity&body=https%3A%2F%2Ftoday.csuchico.edu%2Fdegrees-of-hope-and-opportunity%2F&share=email",
        "https://today.csuchico.edu/degrees-of-hope-and-opportunity/#print",
        "#",
        "https://today.csuchico.edu/author/samurphy/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}