{
    "title": "CloudFest, WordPress Day and a Hackathon with Carole Olinger",
    "body": "\n\n\n\n\t\tSkip to content\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nPodcast\nBlog\nFriends\nWooBits\nSponsor\n \n\n\n\n\nSearch for:\n\n\nSearch\n\n\n\n\n\n\n\n\nSearch\n\n\n \n\n\n\n\nSubscribeSubscribe \n\n\n\n\n\n\n\nPodcast\nBlog\nFriends\nWooBits\nSponsor\n \n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nMain Menu\n\n \n\n\n\n\n\n\n\n\n\nPodcast\nBlog\nFriends\nWooBits\nSponsor\n \n\n\n\n\n\n\n\n\n\n\n / Do the Woo Podcast, Europe / By  \n\n\n\t\t\t\tBobWP\t\t\t\n\n\n\n\n\n\n\n\n\n\n \n\n\nCloudFest, WordPress Day and a Hackathon with Carole Olinger\n\n\n\n\n\nApril 25, 2023 \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tDo the Woo - A WooCommerce Podcast\t\t\t\t\t\nCloudFest, WordPress Day and a Hackathon with Carole Olinger\n\n\n\n\nPlay Episode\n\n\nPause Episode\n\n\n\n\n\n\n\n\n\n\n\n\n\nMute/Unmute Episode\n\n\nRewind 10 Seconds\n\n1x\n\nFast Forward 30 seconds\n\n\n\n00:00\n/\n\n00:41:54\n\n\n\n\n\nSubscribe\nShare\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tApple Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tGoogle Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOvercast\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPandora\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPocketCasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tSpotify\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\tRSS Feed\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tShare\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tLink\t\t\t\t\n\n\n\n\n\n\n\n\t\t\t\t\tEmbed\t\t\t\t\n\n\n\n\n\n\n\n\nDownload file | Play in new window | Duration: 00:41:54Subscribe: Apple Podcasts | Google Podcasts | Overcast | Pandora | PocketCasts | Spotify\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThanks to Our Pod Friends\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \nA2 Hosting keeps your clients Woo shops running 24/7 and offer high performance through their VPS and Dedicated Turbo plans. Plus you get their enhanced security and no-hassle money back guarantee. \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nIn today's show we are talking about larger conferences and stepping out of the bubble. Robbie chats with co-host Robert and guest Carole Olinger, from Yoast, about this years CloudFest. Whether you listen for WordPress insights, or WooCommerce insights this one will hit home either way.\nCarole, Culture & Recruitment Strategist at Yoast and a WordPress community leader, is the head of the Hackathon at CloudFest. And this is not small and simple hackathon. Which leads us into the first WordPress day and CloudFest and the conference in general. I encourage you to join in and listen to the three them convince you that next year's CloudFest should be on your calendar.\nGroundbreaker Talents\n\nCloudFest\nCloudFest Hackathon\nCloudFest US\nCloudFest WordPress Day\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nConnect with Carole\n\n\n\n\n\n\n\n \n\n\n\n\n@CaroleOlinger \n\n\n\n\nCarole Olinger \n\n\n\n\n\n\n\n\n\n\n\nYour Hosts\n\n\n\n\n\n\n\n \n\n\n\n\nRobbie Adair \n\n\n\n\nRobert Jacobi \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSo I personally prefer not to be in the privileged situation, not to have to choose where I'm spending my hours too. I want to deliver good work, and I love doing that for CloudFest.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nRobbie: Hello, everyone, this is Robbie Adair with Do the Woo, another episode. We are so excited today. I've got Robert Jacobi, my partner in crime normally on this. He is here today with me. How's it going today, Robert?\nRobert: Fantastic.\nRobbie: Cool.\nRobert: It's been a crazy spring. Crazy fast, exciting spring.\nRobbie: In Indeed. Robert's going to be my co-host, but he's also going to be partial guest this time because we've got a topic today we're going to be talking about, which is CloudFest. Me, having never been there, I'm not going to be able to give you guys much knowledge, but I'm going to pick these guys brains, and our other guest that we have is Carole Olinger. Look, I told her I was going to mess her name up.... Hey, Carole, how's it going today?\nCarole: Yeah, I'm good. What about you all?\nRobbie: Fantastic. It has been busy. Actually, Robert and I just came from another conference. It's conference season, I tell you. It's going crazy lately. It's good though. It's like getting used to coming back to conferences after pandemic. I still feel like even now, I mean, really it's been a year of conferences almost since pandemic, but I still feel like it's still affecting everything. I still feel like, \"Wow, I hadn't seen these people in forever.\" It maybe it's because some of the smaller conferences are starting to come back. But you guys have been going to CloudFest, and CloudFest is huge. It's just huge. Let's talk about this last year of CloudFest. Did you both attend?\nCarole: Yeah. I mean, I was there at the Hackathon and at the main event, and I think perhaps Robert as well, right?\nRobert: Yes. Both in '22 and '23. We were all there for '23's Hackathon, WordPress Day, and the CloudFest proper.\nCloudFest Hackathon\nRobbie: Awesome. Let's talk about the Hackathon. I know WordPress has been making big, big scenes at CloudFest. It feels like you're hearing WordPress every time you hear about CloudFest now. Let's talk about that. How is that happening? How is this evolving?\nRobert: I just wanted to clarify. There's Carole's Hackathon, and then there was a WordPress Day, but really an afternoon, and then... So there was almost three events, Hackathon, WordPress Day, and CloudFest proper.\nRobbie: Okay, awesome. Carole, tell us what is Hackathon. Give us the elevator pitch.\nCarole: The CloudFest Hackathon is basically the open-source part of the CloudFest, which is the biggest cloud and hosting event in the industry. Now this is actually the sixth edition of the CloudFest Hackathon. We were trained to build that bridge between the open-source communities and the CloudFest main audience, which is cloud industry. I think this was my fourth year being involved and the second time that I was being the head of CloudFest Hackathon. I really, really, really love this event. It's my favorite side project outside my main gig at Yoast. It is just fascinating for me to combine these two communities that have been involved for such a long time, and which are both very, very different from each other. The WordPress community on one hand and the CloudFest community on the other hand. It is an absolute pleasure to combine these two worlds of mine, which I cherish both in very different ways.\nRobbie: Well, I'm going to say actually, Carole, you guys are combining more than just CloudFest and WordPress in your Hackathon because I was talking to some Joomla people, and they were like, \"Yeah, we were at the Hackathon, we know Carole.\" I was like, \"Wow.\" It's more than just combining WordPress and Hackathon. You guys have got all kinds of open-source at your Hackathon, right?\nCarole: Yeah, absolutely. As I said in the beginning, it is the open-source part of CloudFest. We always have a huge number of people from the Joomla community supporting the CloudFest Hackathon since the very beginning. In the beginning, mostly the projects that we have been working on were pitched by the sponsor companies of CloudFest and that changed a little bit. Nowadays, the projects that we will be working during three days and nights between 80 and 130 hackers depends a little bit on the year. This year was the biggest Hackathon. They come from the open-source communities and from the partner companies that are involved in CloudFest and in the Hackathon. This can as well be from the Joomla community, from the Drupal community, from PHP community in general, from everything there is outside. But because of its market share and totally also because of my involvement in this event for each of the WordPress community, considerably has grown in the past few years.\nRobbie: Awesome. That's great. Robert, you've been involved in Hackathon in various ways, I'm assuming over these last few years. So tell us what's your experience with it?\nRobert: Last year as part of Cloudways, we actually sponsored a project and pushed that forward and there seems to be about, I don't know, 50% of the projects are in WordPress, but then you get Joomla, you get CMS agnostic projects like analytics and accessibility databases. I mean, boy, 50% increase in attendance this year from last year. Everyone was knee-deep into actually finishing something in just a couple of days. What's great about the Hackathon, it's not just, \"Oh, we're tossing around ideas,\" stuff is really getting done that supports one or multiple projects.\nRobbie: Basically, you've got projects, who sets the projects, who comes up with the projects, Carole?\nCarole: We are doing culture projects, which is usually going out in autumn the year before the Hackathon happened. For example, for 2024, it would be worth keeping an eye on the website starting from September, October this year because then we are going to start announcing what is going to happen in the next edition. Then everybody can basically pitch their ideas and projects. What we did in the last few years and also this year is we were working with project mentors with people from the communities that are experienced hackers to say so but involve in open-source work for years to help potential project leagues define their ideas and set realistic goals for this three days event because it's really important that the projects became more goal-oriented, which they have been in the past two years for sure.\nIf you have an idea or an existing project that you want to boost or that you want to find more contributors, the CloudFest Hackathon is the exact right place to do so because you will find people that want to help build a better open web with you. The best part is, we as CloudFest, we will invite you to come there for three days in one of the amazing themed Europa-Park Hotel. So the accommodation is sponsored by CloudFest via the partner companies that are supporting our event. We are going to have so much fun there collaborating on open-source projects and there may be a chance you'll be able to ride a rollercoaster as well.\nRobert: And win some prizes.\nRobbie: I was going to say there's a competition part to this Hackathon. I mean, you guys are judging at the end or voting? How does that work for... How you determine who has solved the project that was up the easiest or the best?\nSupporting female developers at Groundbreaker\nCarole: his year, we actually came up with a new idea. Last year there were physical prices that have been sponsored by our partner companies, and this year we thought to increase this open-source thought and to not only build a better web, but it will also give other people in the world the opportunity to help us build a better web and build a better livelihood. We decided to support a charity, which name is Groundbreaker, and they are working with female developers in Uganda.\nThey're sending them out through a developer boot camp and after a year... They have already been through university, so they have studies in IT, but it turned out they are not 100% fit and set up for the job markets to get started immediately. Now these boot camps helps them to really get an actual job and to increase their chances in the market worldwide to get hired, especially, with the remote opportunities already before but even more after the pandemic that arises the market. So we decided to support that charity and we raised 5,000 euros, which covers one year of boot camp for one female developer in Uganda, and we will happily invite that person next year to the CloudFest Hackathon 2024.\nRobbie: Awesome. I love that. Fantastic. I love it. It's open-source and y'all are reaching out to support nonprofits. I love it. Is the Hackathon, does it have a separate website or someone wanted to learn more about how to get involved with Hackathon? Would they just go to the CloudFest website, or should they go to another website?\nCarole: At the moment it was cloudfest.com/hackathon, but we'll be working on having an own presence. Now that I've said it out loud, the pressure is there for my team, but for the moment, it is really cloudfest.com/hackathon.\nRobbie: Okay, great. Well, people can keep a lookout on that page to see as you guys start to talk about posting for new projects and things like that. But if someone wanted to be involved in the organization, are you guys looking for any help, volunteers for that part?\nCarole: Not until now. That may change. CloudFest is not like WordCamps organized by volunteers. CloudFest is an organization where, for example, I have a contract with CloudFest and I'm part of the team as a freelancer, so I am paid to organize this event, which makes it even more exciting for me because I really do not have to make that choice when spending hours on CloudFest if I have to deduct this from some other job that I'm being paid for, which makes it so much more pleasant to really put the effort and the hours that are needed to make this an awesome event into it.\nThat's also something that I personally prefer, and don't get me wrong, I love and cherish and respect every volunteer, when I'm saying volunteer-driven collaboration and events, but my personal opinion is starting from a certain size and professionalization of an event, it is really, really hard to cover that with volunteers. Sometimes I also have the feeling it is unfair towards volunteer contributors to put that pressure on them when there's so much investment, and I'm talking about time, money, and other types of investment from the companies, from the speakers, from the audience. So I personally prefer not to be in the privileged situation, not to have to choose where I'm spending my hours too. I want to deliver good work, and I love doing that for CloudFest.\nWordPress Day at CloudFest\nRobbie: Awesome. You're correct. There are a lot of times that trying to run large events with just volunteers, it is a lot of work on those volunteers that should be possibly paid. I totally agree with you on that one. After Hackathon, we said we've got a half-day WordPress Day. Robert, tell us a little bit about the WordPress Day.\nRobert: I don't want to say it was like a last-minute add-on, but it was definitely added on later to the schedule than the typical CloudFest planning goes. Really, my involvement in that was as a panel moderator, but not like I organized or anything else that. In fact, Carole, who organized it? Did you organize it?\nCarole: Nope, I didn't organize it, but some other people from my team were leading efforts towards that WordPress Day, and the idea was obviously because of the huge market share of WordPress in the CMS world to try to find out if there's interest to give WordPress a bigger platform before the event. I think Soeren von Varchmin who is the former CEO of CloudFest, and he's Chairman of the Advisory Board, I think he took the lead on organizing the WordPress Day.\nRobert: Thank you. Because I don't know how it came together, but it was pretty quick and awesome. WebPros was actually the lead sponsor, or the only, the core sponsor for WordPress Day and WebPros has cPanel, plus WHMCS as some of their companies in there. But it was great because it really helped bridge WordPress folk who had just come for the Hackathon into actually attending the rest of CloudFest. I think it was like, \"Hey, by the way, we're going to have a WordPress Day.\" \"Well, you're already here, so why don't you spend and check out the rest of CloudFest?\" As well as getting your typical hardcore infrastructure folks from security, from performance, from hardware to come a day early to check out, \"Okay, there's a whole WordPress Day and a lot of our customers' customers are using WordPress. It was fantastically attended and filled the room. We had folks from Automattic in there, a lot of hosting companies, Rocket.net, we talked about security, performance, a lot of it was WordPress core specific. I can't wait to see what happens with maybe WooCommerce stuff next year.\nRobbie: I was about to ask.\nRobert: I think baby steps. This was a WordPress Day that touched really on the WordPress experience, the WordPress agencies, where's WordPress going. It'll be great to see how much WooCommerce they add into the mix next year given its relationship to WordPress. I get giddy about it because there were so many WordPress folks who had never been to CloudFest before and their experience with conferences was strictly WordCamps. Even the biggest ones like WordCamp Europe, US, and now Asia did not prepare them for what CloudFest is really like.\nCloudFest is a three, four, five-day, I always lose track of time. Technically, I guess it's five days business meeting, jumping from meeting to meeting. Everyone understands their role there in that they're willing to be sold to, and they will definitely be selling, and so many partnerships are created. There are so many relationships, so many deals, and it's just a different type of environment than what people who have normally attended WordCamps would expect. There is a lot of caring and love, but at the end of the day, it's about how do we move the markets forward. It's fascinating to watch folks who had never been there before.\nRobbie: I do want to dig into more about the CloudFest part there, but I do have one more question about the WordPress Day and that is what was the format? Were there sessions? Was it one big session? You said there was only one big sponsor, so there weren't sponsor booths there for that, I take it. What was the format of the day?\nRobert: It was one track over the course of five hours. There were a couple of solo or duo presenters. You might have two people from cPanel talking about their latest WordPress product. I think that was WPSquared was their product from cPanel. You might have Jesse from Automattic/Jetpack talking about WPCloud. I'm trying to remember Rocket.net, plus there were a number of those solo presentations. Then a couple of panels. There was panels... I was lucky enough to sit on where performance and generosity at scale.\nThat's why it was great to have Groundbreakers in the mix on the Hackathon side because then Leoni Rossberg from Groundbreaker got to have a fireside chat with her as well as... Oh, boy, I'm going to... Matt Cromwell from WP Give now part of Stellar. I'm just namedropping all along because... Well, all these folks put in a lot of time and effort to be there and it's some wonderful paid experience. You care about the stuff you do and you want to be able to share with folks. So it was great to see everyone there. There's even a whole WordPress Day section of the CloudFest website, so you can actually see what happened during the conference.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThanks to our Pod Friend A2 Hosting\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nAround 7,500 attendees\nRobbie: Okay. Now I'm going to ask you the same question that I did about the Hackathon and that is if someone wants to learn about this WordPress Day or whatever it might be called next year, would they go to CloudFest website to do this as well or is there another place that they should visit in the WordPress world that would tell them about getting involved?\nRobert: Easiest to just go to cloudfest.com.\nRobbie: Okay. All right. Well, again, same thing. We'll put that link, but if there's another one or an updated one, we'll try to also include that. Now we've talked about the Hackathon, we've talked about the WordPress Day, which I think are just amazing things. If someone was going to be doing that, Carole, you were there, I'm assuming three or four days before CloudFest even begins. I mean, after you finished all this work, you're about ready to drop, you're like, \"Now I've got to go to four, five days of CloudFest, which is huge. What was the attendance this last year?\nCarole: We had 11,000 registration.\nRobbie: Wow.\nCarole: That's huge. In attendance, I don't think I heard about 7,000 or 8,000, but I can't confirm officially yet. I'm not sure if the number has been safely communicated yet or not, but we just say it's about 7,500 or so. That's what I heard.\nIt's the biggest, biggest CloudFest ever, and it's just like... I mean, I was there full week, and I think Robert as well from Friday to Friday or so.\nA seven-day marathon that you have to run out of sprint\nRobert: I was there from Saturday till Friday. It's exhausting\nCarole: Doing Hackathon, WordPress Day, and CloudFest, you would actually need two weeks of recovery afterwards, but it is so worth it. One of my favorite events in the year... The more people I see coming together from these two worlds of mine that I mentioned, the more of a blast I have. It is so amazing because it has so many win-win opportunities for both worlds to learn from each other. I can only begin to imagine what the potential is if people like Robert and me and Lucas from Automattic, and other people that are involved in these both communities, what they can do for both if we manage to bring them together. Also, talking about business more in the future.\nRobert: The way I describe to a lot of the newbies is it's a seven-day marathon that you have to run out of sprint. It's just so many and everyone you want to talk to. You're talking to Joost from Yoast, you're talking to CEOs across the spectrum, I mean, folks from Monarchs, Virtuoso, hosting companies Galore. You really have an opportunity to connect with business leaders up and down the stack, and you just can't miss an opportunity. Yes, it's a marathon at sprint speed.\nCarole: Yeah, that's a lot of FOMO.\nRobbie: I could see that because at that many people, I'm sure... Is it set up like a traditional booth area, there's sessions going on, and then you've, of course, I'm sure got different companies doing their own private events wrapped around this? I think FOMO would be pretty serious when you have that many people. There's no way you could go to everything.\nRobert: No, there's no way you can go to everything. Decent folks, I mean, set up meetings a month in advance to just be able to lock in slots because you're going to get pulled and twisted all day long.\nCarole: Then you also have the parties in the evening. Let's not forget to mention the parties in the evening, which are really legendary and wild at CloudFest. But the good news for you, Robbie, is CloudFest maybe because you were talking about Austin before we started here.\nRobbie: I think it's like next weekend maybe or somewhere. It's close, right? When is it, Robert?\nRobert: Four weeks away. May 31st to June 3rd.\nRobbie: I don't think I'm going to be able to make it. I already had a previous obligation, so I was really bummed because I was like, it's right there. It's like a 2.5-hour drive for me. Robert and I were just then in Austin for a conference a couple of days ago. So we'll see. Maybe I can make it. Is this the first or the second USA CloudFest?\nCarole: I do think it has been in the US a while ago, and this is the return, but that was before my time. Robert, maybe you know better.\nRobert: There was technically one CloudFest in the USA, but it was not like a regular conference, it was more like a executive retreat. It wasn't what we had in CloudFest to be like, and that was five, six years ago. Much smaller model of conference. This is back to trying to replicate to some degree original CloudFest. It's impossible because with CloudFest in Europe, you're trapped in a theme park. People are going to be in Austin and there might be things like bat caves to see.\nRobbie: Well, I see that they're doing it at the Omni Hotel downtown. You're real close to the bridge with the bats and this is at that time of year, so you can watch the bats take-off in the afternoon, but it sounds to me if CloudFest USA is just even a slight smidgen of what it is over there, no one will have time to go see bats. Everybody's going to be too busy. By the way, if people are listening, I do see early bird tickets are still on sale right now. If people are interested... I did hear through the grapevine because it's in hotel it's going to be limited capacity. I think they're expecting a sellout, right? Are you involved in this one at all, Carole?\nDiverse audience generates more ideas and creativity\nCarole: I'm not because there's not going to be a Hackathon and also, I can't be there, it's just too close to WordCamp Europe for me. My heart breaks, but I'm going to give it a pass. But I would definitely... Anyone that is in the area or that is from the US or that has it easier to go there than to come to Europe, just go attend, have a look, you probably going to be blown away by all the opportunities and all the great people you're going to meet. I have been at NamesCon last year, which is organized by the same people, so it's the WorldHostingDays GmbH. I have been at NamesCon and because this year's CloudFest is also attached to NamesCon and what I can say is NamesCon has been a blast for me. It is so not the industry that I am used to interact with, and that is what made it interesting. I met new people, I learned new things, and I loved it.\nRobbie: I don't know if either of y'all attended the Merge Conference, it was in Florida a couple years before pandemic, I guess. It was great because what they were starting to do is they were bringing NamesCon, we had Joomla Day, Florida was also involved. Basically, they merged four or five conferences, and basically everybody just had their conferences at the exact same time in that hotel and they had a shared schedule, so you could see. We had people coming from NamesCon listen to a talk about Joomla, or I did a talk about augmented reality, and I had people from all of the different ones coming. Crypto was the other thing that was there. I had people from all of those coming in and it was really cool.\nAs a speaker, I felt it was really cool because you got a mixed-up audience. They would come up with questions you had never heard because you're used to going and speaking... If you speak about WordPress, you go to WordCamps, you speak about that, you go to Joomla, you go to Joomla Day, you talk about that, right? You anticipate some of the questions that are coming from your audience. But when I was in a room where I had people that were there because they're domain resellers and buyers and/or they were trying to get cryptocurrency into E-commerce or whatever, and things like this. They came at me with totally different questions than I had expected. I think it's fascinating, and it sounds to me like that's your Hackathon, WordPress Day, and CloudFest that is what's happening there. They don't call it Merge, but that is really what's happening. You're getting so many different audiences there together, and it does generate more ideas and creativity I feel like.\nCarole: Yeah. With so many other things, the more diverse groups are, the better the outcome, at least from my personal opinion. That's also what we tried to do with the Hackathon to start with. It was really, really important to me when I took over to increase diversity within the Hackathon. When I attended the hackathon for the very first time. I was sent by Plesk, which I have been working with few years ago. I started helping there a little bit, just trying to increase. To use my network within WordPress to get more WordPress people to participate in Hackathon.\nI entered a room and I was one of three women in the room so to start with, it's basically all white men and I'm there still a long way to go, but I'm very proud to say that things have considerably changed already from when I visited first to this year's event. So we are really proactively each year reaching out to towards communities that may be underrepresented and getting more diversity in there. I was just taking the opportunity from what you said to say diversity in so many ways always leads to better results in my opinion.\nRobert: Even at CloudFest USA, I think they've taken feedback from just a couple months ago and are just very iterative and agile about putting the conference together. There won't be a WordPress Day at CloudFest USA. WordPress will be sprinkled throughout the conference, so that seem more like, \"Yeah, of course, there's going to be WordPress here,\" so that's going to be fantastic.\nCarole: Yeah. I've been seeing that as well in the email. There's a lot of interesting topics covered on stage during the main event that are directly or indirectly WordPress related, so I really like seeing that.\nRobbie: Yeah, I really bummed. I can't go to the CloudFest USA. Now that I talk to you guys and learn more about the actual CloudFest... It's Germany at an amusement park.\nCarole: Yeah. It's the biggest amusement park there is in Europe. It's called Europa-Park, and it isn't that clever. You put all the people in a huge amusement park and there's literally nothing around you. Like Robert said, you trapped in an amusement park and this is what makes it so awesome. You are all going to be stuck together for three, four, or five or even more days, and you will interact with people, and you will all do the same things, and you will enjoy it.\nRobert: My favorite story from this year's CloudFest, again, focusing on being in that trapped environment, I literally got into a car to go from the hotel to the main conference area. I mean, you can walk it, you can take the monorail, it's very Disney-esque, and someone else got into the car and that person happened to be a CEO of a huge sponsoring organization at the event, and we had a conversation for 10 minutes, and then had a follow-up meeting two days later. Those accidents are actually very intentional at CloudFest. Really, you're just not going to get that in at most other events. It was amazing this year.\nPitching on a rollercoaster\nCarole: What is also may be worth a mention for our audience here, CloudFest always comes up with the most creative ideas for creating business opportunities. This year, for example, CloudFest organized a rollercoaster pitch. Now that was amazing. I don't know if you heard about it, Robbie, but there's this huge rollercoaster called Silver Star. They would give startup founders or young startup of companies the chance to pitch their ideas, services, products for investment, but it had to be during the rollercoaster ride. Basically, the thing goes up real slowly, so you would have like one minute while you could actually do the hard work and pitch your idea very well, and then it would go down crazy fast. It was hilarious. I can just recommend anybody to just go through either the CloudFest website or through the social media channels and use the CloudFest tag and hashtag and see the rollercoaster pitches. It's hilarious. (check out this video on YouTube)\nRobbie: Oh, my gosh. That is so exciting. That just cracks me up, Carole. I had never heard of that, and I just love it. Now I really want... Everyone I've ever met that's gone to CloudFest is like, \"Robbie, you've got to go. You've got to go.\" I mean, literally, everybody, whether they've been to all of them, whether they've just been to one, everybody's like, \"You've got to go.\" I'm like, \"I ask questions, but I don't get a whole lot of information out of people.\" I'm like, \"Why should I go?\" They're like, \"You just need to go.\" I'm like, \"Okay.\" But something like that, oh, my gosh, that sounds like so much fun. But by the way, I scream a whole lot when I'm on a rollercoaster. So now I have to practice my elevator pitch screaming. I'm going to try that. I'm better be practiced up before I go.\nCarole: We have a deal. We will all see next year video hashtag rollercoaster pitch from Robbie.\nReturning to conferences, support and exhaustion\nRobbie: I'm definitely going to try. I do want to go to CloudFest because it just sounds amazing. I was hoping to start with the USA one, but like I said, not sure that's going to work out because same, it's very close to WordCamp Europe. This is the season, like I said, so many conferences are going on, but it does make it a little bit of a task to make it to all of them. Sometimes you just have to pick, you can't do everything.\nCarole: I also have the feeling after we've been out of practice because I have done so much more WordCamps even before the pandemic, and I felt less exhausted. But I really feel like I'm out of practice. So you're getting into the groove again. I feel like, \"Okay, I've done an event. Now I actually would need like two months of recovery.\"\nRobbie: I really do think the pandemic, it affected us down deep because I was always an extrovert, always an extrovert. But I do find, you're right, Carole, now I go to these conferences, and I actually went to New York just for... Actually, a pleasure trip. It's the only one I had this year so far. I was exhausted of people. We had two years basically we were locked in our houses all by ourselves. Even for us, extroverts, now we're feeling wow. It might have turned some of our extroverts into quasi-introverts, which is quite an interesting because I never thought I would be.\nCarole: I had these conversations before.\nRobert: Or we're just getting pickier and choosier. If we're going to spend 3,000% energy, we can only do it once a quarter instead of once a month.\nRobbie: Yeah, maybe.\nCarole: Also, we're getting older, but don't say it out loud.\nRobbie: Shame on you, Carole. We never say those words ever. We're getting wiser. That's right. I was about to say, we're getting wiser.\nCarole: Exactly. But I've had these exact same conversations. So I would also consider myself an extrovert at least 100% before the pandemic. But I do feel like there's an introvert side of me that has been severely triggered during the pandemic where I need my breaks in between where I would hide in the bathroom at a conference to at least five minutes, me, myself, and I recover and not talking.\nRobbie: Well, I could say at WordCamp US though, I was just so happy you had little Buffy there. I could just take a minute and pet Buffy. I was using Buffy as my emotional support dog at Camp USA.\nRobert: Everyone did.\nCarole: I actually had that experience with people. Also, that was not WordCamp related, but that was this weekend, literally, two days ago, I was at the conference that was not WordPress related and there was a very young speaker. She was 22, and she only knew two or three days before the conference that she had to jump in for another speaker that dropped out, and she was so nervous. She was so nervous that she stood there crying. I went there, and I first talked to her trying to give her a little bit of more self-confidence and comfort her. Then I took Buffy, and I was like, \"Hey, look, this is my little log girl here.\" They started interacting, and then I put Buffy in front of me so she could see her while being on stage, and she aced it. She aced it. I was like, \"Oh, this is so good.\" It's not only me that Buffy is able to help, but also, I can even amplify that in other people that may need a break or a little bit of focus shift. That's basically the thing.\nRobbie: Yes. Well, little Buffy, poor thing. She's going to need recharge times between these events because we're all starting to use Buffy. Buffy's going to be like, \"Nobody talk to me, I just need a week.\"\nCarole: She was also at CloudFest, and she will be WordCamp Europe.\nRobbie: Fantastic. Okay. Well, guys, we're kind of running out of time here. I really thank you because as I said, not ever been to CloudFest, I just really didn't understand what all was going on. It really sounds awesome. I think I'm going to have to put it on my calendar now. So tell people where can they find you guys if they want to contact you after this. Carole?\nCarole: Yeah, I think for me the easiest is on LinkedIn and on Twitter. It's always my first name and my last name, Carole Olinger. I'm also on the WordPress Slack.\nRobbie: All right, everybody, we will talk to you guys in the next episode, or you'll listen to us talk in the next episode. Hopefully, go check out CloudFest. If you haven't done it before or after hearing these guys talk about it, I know I'm interested. I'm going to go take a look at it, but I think everybody should is. Can you imagine if it grew any bigger than that? That's a lot of people. It'll be fun. Anyway, thank you guys both for being on here, and we'll talk to you next time.\nRobert: Thank you, Robbie. Thank you, Carole.\nCarole: Thank you. Bye-bye.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nThanks to our Pod Friends for their support\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost navigation\n← Previous PostNext Post →\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nPodcast\nWooBits\nBlog\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nDev Resources\nBuilder Meetup\nDo the Woo News\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nSubscribe to WooBits\nSponsor\nChangelog\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nPartners\nContact\nAbout\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nMenu \nHome\nPrivacy Policy\nDisclaimer\nTerms of Service\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDotheWoo.io does not have any affiliate links. Our efforts are full funded by our sponsors/partners.\nWordPress® and its related trademarks are registered trademarks of the WordPress foundation. This website is not affiliated with WooCommerce, Automattic, Inc., the WordPress Foundation or the WordPress® open source project. WooCommerce trademarks used with permission.\nCopyright: © BobWP 2010 - 2023 | Owned and operated by BobWP.\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://dothewoo.io/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/newsletter/archive/",
        "https://dothewoo.io/sponsor/",
        "#",
        "/subscribe/",
        "/subscribe/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/newsletter/archive/",
        "https://dothewoo.io/sponsor/",
        "https://dothewoo.io/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/newsletter/archive/",
        "https://dothewoo.io/sponsor/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/europe/",
        "https://dothewoo.io/friend/bobwp/",
        "https://itunes.apple.com/us/podcast/woocommerce-podcast/id1092157686",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9kb3RoZXdvby5pby9mZWVkL3BvZGNhc3Qvd29vY29tbWVyY2U?sa=X&ved=0CAMQ4aUDahcKEwj4i7ytppztAhUAAAAAHQAAAAAQAQ",
        "https://overcast.fm/itunes1092157686/do-the-woo-a-woocommerce-podcast",
        "https://www.pandora.com/podcast/do-the-woo-a-woocommerce-podcast/PC:29675",
        "https://pca.st/iqGi",
        "https://open.spotify.com/show/1jF5hPjfuNvVk7evAzpDON",
        "https://www.facebook.com/sharer/sharer.php?u=https://dothewoo.io/?post_type=post&p=74912&t=CloudFest, WordPress Day and a Hackathon with Carole Olinger",
        "https://twitter.com/intent/tweet?text=https://dothewoo.io/?post_type=post&p=74912&url=CloudFest, WordPress Day and a Hackathon with Carole Olinger",
        "https://dothewoo.io/podcast-player/74912/cloudfest-wordpress-day-and-a-hackathon.mp3",
        "https://dothewoo.io/podcast-download/74912/cloudfest-wordpress-day-and-a-hackathon.mp3?ref=download",
        "https://dothewoo.io/podcast-download/74912/cloudfest-wordpress-day-and-a-hackathon.mp3?ref=new_window",
        "https://itunes.apple.com/us/podcast/woocommerce-podcast/id1092157686",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9kb3RoZXdvby5pby9mZWVkL3BvZGNhc3Qvd29vY29tbWVyY2U?sa=X&ved=0CAMQ4aUDahcKEwj4i7ytppztAhUAAAAAHQAAAAAQAQ",
        "https://overcast.fm/itunes1092157686/do-the-woo-a-woocommerce-podcast",
        "https://www.pandora.com/podcast/do-the-woo-a-woocommerce-podcast/PC:29675",
        "https://pca.st/iqGi",
        "https://open.spotify.com/show/1jF5hPjfuNvVk7evAzpDON",
        "https://www.a2hosting.com/ecommerce-hosting/",
        "https://groundbreaker.org/talents/",
        "https://www.cloudfest.com",
        "https://www.cloudfest.com/hackathon",
        "https://www.cloudfest.com/usa/",
        "https://www.cloudfest.com/wordpress-day",
        "https://twitter.com/CaroleOlinger",
        "https://www.linkedin.com/in/carole-olinger/",
        "https://twitter.com/robbieadair",
        "https://twitter.com/RobertJacobi",
        "https://www.cloudfest.com",
        "https://www.cloudfest.com/hackathon",
        "https://www.europapark.de/en",
        "https://groundbreaker.org/talents/",
        "https://www.cloudfest.com/wordpress-day",
        "https://www.a2hosting.com/ecommerce-hosting/",
        "https://www.cloudfest.com/usa/",
        "https://www.youtube.com/watch?v=lP_8NCvnKac",
        "https://twitter.com/CaroleOlinger",
        "https://avlr.co/3EydDRH",
        "https://www.godaddy.com/pro/hub-dashboard?utm_source=dothewoofriends_2021_sponsorship&utm_medium=events&utm_campaign=en-us_events_prg_awa_partners_part_profile_desc_001",
        "https://www.hostinger.com/wordpress-hosting",
        "https://www.a2hosting.com/",
        "https://dothewoo.io/do-the-woo-friday-show-with-vito-peleg-and-bobwp/",
        "https://dothewoo.io/do-the-woo-joins-wordcamp-europe-2023-as-media-partner/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woobits/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/developer-resources-for-woocommerce/",
        "https://www.meetup.com/woocommerce-builder-events/",
        "https://dothewoo.io/do-the-woo-news/",
        "https://dothewoo.io/subscribe/",
        "https://dothewoo.io/sponsor/",
        "https://dothewoo.io/do-the-woo-changelog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/contact/",
        "https://dothewoo.io/about-the-woocommerce-builder-community/",
        "https://dothewoo.io/",
        "https://dothewoo.io/privacy-policy/",
        "https://dothewoo.io/disclaimer/",
        "https://dothewoo.io/terms-of-service/",
        "https://podcasts.apple.com/us/podcast/do-the-woo-a-woocommerce-podcast/id1092157686",
        "https://open.spotify.com/show/1jF5hPjfuNvVk7evAzpDON",
        "https://twitter.com/DotheWoo",
        "https://www.linkedin.com/in/bobwp/",
        "https://www.tumblr.com/bobwp",
        "https://www.youtube.com/channel/UC8dKw_0uwsZoNXTrUzd4oig",
        "https://dothewoo.io/partnership/",
        "https://woocommerce.com/trademark-guidelines/",
        "https://bobwp.com"
    ]
}