{
    "title": "Contribute to the Future of the WordPress App – Make WordPress Mobile",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Mobile\n\n\nHandbook\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nPaul Von Schrottky\n\n2:01 pm on April 11, 2023 \n\n\n\nTags: design ( 2 ), mobile ( 198 )   \n\t\t\t\t\n\nContribute to the Future of the WordPress App\n\n\nSince July 2022, the WordPress mobile team has been refocusing the WordPress app on coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. features. We’re excited to announce that most of this work is now complete, and there are ample opportunities to get involved in shaping the future. \nWhat’s Changed?\nThe following Jetpack features have been removed from the WordPress app and are now only available in the Jetpack app:\nStats\nReader\nNotifications\nActivity Log\nBackup\nSharing (Jetpack Social)\nJetpack blocks (BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Editor)\n@-Mentions and Crossposting (Block Editor)\nIn addition, core features that relied on the WordPress.comWordPress.com An online implementation of WordPress code that lets you immediately access a new WordPress environment to publish your content.  WordPress.com is a private company owned by Automattic that hosts the largest multisite in the world. This is arguably the best place to start blogging if you have never touched WordPress before. https://wordpress.com/ APIAPI An API or Application Programming Interface is a software intermediary that allows programs to interact with each other and share data in limited, clearly defined ways., including People, Themes, and Menus, have been removed from WordPress.com and Jetpack-connected sites. (These features have never been available to self-hosted users without a Jetpack connection from the WordPress app.) Placeholders of Jetpack-powered features will remain in the app for some period of time to allow for a transition for users of these features.\nThere is still some work to be done, particularly with login, which we knew would take some time to decouple. The WordPress.com REST APIREST API The REST API is an acronym for the RESTful Application Program Interface (API) that uses HTTP requests to GET, PUT, POST and DELETE data. It is how the front end of an application (think “phone app” or “website”) can communicate with the data store (think “database” or “file system”) https://developer.wordpress.org/rest-api/. still authenticates WordPress.com users, and these users should have the option to use the WordPress app if desired. The mobile team will continue to work on this challenge with the aim of eventually removing this dependency.\nHowever, with many Jetpack-specific features now removed, we’re ready to look to the future of the WordPress app. \nOne of the goals behind refocusing the app was always to enable larger involvement from the community, and we look forward to seeing all the great contributions and developments that will come from this decision. \nHow to Get Involved\nDo you want to help shape the future of the WordPress mobile app? Here’s how you can contribute and make a difference:\nWrite and submit code. If you’re a developer, you can contribute to the app’s codebase by submitting pull requests through GitHubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/:\nWordPress for iOS is ~80% Swift, with Objective C making up some parts of the codebase.\nWordPress for Android is written in Kotlin (~66%) and Java (~34%).\nIf ReactReact React is a JavaScript library that makes it easy to reason about, construct, and maintain stateless and stateful user interfaces. https://reactjs.org/. Native is your jam, you could consider contributing to the editing experience in both apps with Mobile Gutenberg.\nTest and review new features. Fortnightly calls for testing are posted to this blog, with steps you can take to participate. \nReport bugs. This can be done through the WordPress for Android, WordPress for iOS, or Gutenberg GitHub repositories. If you’re unsure where to file your report, you can get guidance in the #mobile channel on SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. or add your comment to the fortnightly calls for testing. \nSuggest or design new features. If you want to get further involved in the app’s design, check out the #design channel on Slack and follow +design.\nOpen GitHub tickets with your proposals for the path forward.\nTranslate the app. If you’re fluent in a language other than English, you can help by translating the app so more people can use it.\nHelp others. You can answer questions and help others in the new WordPress mobile app’s support forum.\nHave questions? Not sure how to contribute? Comment on this post or ask in the Slack #mobile channel. We’re excited to continue building something great together! \nLogin to Reply\n\n\n\n\n\n\n\n\n\n\n\n\nJonny Harris\n\n7:32 am on April 12, 2023 \n\n\n\n\nIs there anything that can be done to the rest apiREST API The REST API is an acronym for the RESTful Application Program Interface (API) that uses HTTP requests to GET, PUT, POST and DELETE data. It is how the front end of an application (think “phone app” or “website”) can communicate with the data store (think “database” or “file system”) https://developer.wordpress.org/rest-api/. to improve the mobile app? There were the blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. type api and application passwords added to make things easier for the mobile team. Are these being used? Is there anything else the rest api team can do?\n\n\n\n\n\n\n\n\nPaul Von Schrottky\n\n7:57 pm on April 19, 2023 \n\n\n\n\nThese are great questions! \nThere were the blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. type api\nMy understanding is that this is used for third-party blocks which the mobile editor doesn’t support yet and I don’t see it on GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ Mobile’s focus areas: https://github.com/WordPress/gutenberg/issues/38407. \nWas there an additional use for this when it was added?\napplication passwords\nI chatted with @jkmassel about this the other day. As he said to me, REST APIREST API The REST API is an acronym for the RESTful Application Program Interface (API) that uses HTTP requests to GET, PUT, POST and DELETE data. It is how the front end of an application (think “phone app” or “website”) can communicate with the data store (think “database” or “file system”) https://developer.wordpress.org/rest-api/. support has great potential to simplify the app’s architecture and allow a lot of code to be deleted, but would also require a rewrite of significant parts of the app. \nThis feels like a big opportunity for the WP app, but a big project, and I’m not sure it’s on any roadmap.\n\n\n\n\n\n\n\n\n\n\nbibahrayeq9\n\n8:35 am on April 17, 2023 \n\n\n\n\nIf you’re interested in contributing to the future of the WordPress app, there are several ways to get involved:\nBetaBeta A pre-release of software that is given out to a large group of users to trial under real conditions. Beta versions have gone through alpha testing in-house and are generally fairly close in look, feel and function to the final product; however, design changes often occur as part of the process. Testing: Join the beta testing program for the WordPress app, which allows users to test new features and provide feedback before they are released to the public.\nBug Reporting: Report any bugs or issues you encounter while using the WordPress app on the WordPress mobile apps GitHubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/ repository.\nTranslation: Help translate the WordPress app into different languages by contributing to the official WordPress mobile apps translations project on WordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/.\nCode Contribution: If you have programming skills, you can contribute to the WordPress app by submitting code to the official WordPress mobile apps GitHub repository.\nCommunity Support: You can also contribute by helping answer questions from other users in the WordPress support forums or on the WordPress mobile apps community SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. channel.\nNo matter what your skill level or experience is, there are ways to contribute to the development of the WordPress app and help shape its future.\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \n\n\n\nPost navigation\n← New Mobile Support Forum\n\n\n\n\n\n\n\n\nSearch\n\n\n\nEmail Updates\n\n\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 632 other subscribers\t\t\t\t\n\nWordPress Apps This is the development blog for all the official WordPress apps.\nHow Do I Start Contributing?\nYou can start with the Make WordPress Mobile Handbook. The handbook includes information about how to contribute, how we communicate, and general guides for how we work.\nYou can also head straight to the GitHub repositories. You'll all the instructions on how to get set up with any app environment in the README files for the Android app and the iOS app.\nOf course feel free to ask questions in our #mobile channel on Slack.\nGitHub\n WordPress for iOS\n WordPress for Android\n(Not supported anymore, but the sources are still available WordPress for Windows Phone, WordPress for BlackBerry)\n\nRecent Activity\n\n\n\t\t\tTeam Pledges\n\t\t\n\n742 people have pledged time to contribute to Mobile Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmobile%2F2023%2F04%2F11%2Fcontribute-to-the-future-of-the-wordpress-app%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/mobile/",
        "https://make.wordpress.org/mobile/handbook/",
        "https://profiles.wordpress.org/pschrottky/",
        "https://profiles.wordpress.org/pschrottky/",
        "https://make.wordpress.org/mobile/tag/design/",
        "https://make.wordpress.org/mobile/tag/mobile/",
        "https://make.wordpress.org/mobile/2022/07/27/refocusing-the-wordpress-app-on-core-features/",
        "https://wordpress.com/",
        "https://developer.wordpress.org/rest-api/",
        "https://github.com/",
        "https://github.com/wordpress-mobile/WordPress-iOS",
        "https://github.com/wordpress-mobile/WordPress-Android",
        "https://reactjs.org/",
        "https://github.com/wordpress-mobile/gutenberg-mobile",
        "https://make.wordpress.org/mobile/tag/call-for-testing/",
        "https://github.com/wordpress-mobile/WordPress-Android",
        "https://github.com/wordpress-mobile/WordPress-iOS/",
        "https://github.com/WordPress/gutenberg",
        "https://make.wordpress.org/mobile/tag/mobile/",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://make.wordpress.org/mobile/tag/design/",
        "https://translate.wordpress.org/",
        "https://wordpress.org/support/forum/mobile/",
        "https://make.wordpress.org/mobile/tag/mobile/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmobile%2F2023%2F04%2F11%2Fcontribute-to-the-future-of-the-wordpress-app%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/spacedmonkey/",
        "https://developer.wordpress.org/rest-api/",
        "https://profiles.wordpress.org/pschrottky/",
        "https://wordpress.org/gutenberg/",
        "https://github.com/WordPress/gutenberg/issues/38407",
        "https://profiles.wordpress.org/jkmassel/",
        "https://developer.wordpress.org/rest-api/",
        "https://profiles.wordpress.org/bibahrayeq9/",
        "https://github.com/",
        "https://wordpress.org/",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "/mobile/2023/04/11/contribute-to-the-future-of-the-wordpress-app/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmobile%2F2023%2F04%2F11%2Fcontribute-to-the-future-of-the-wordpress-app%2F&locale=en_US",
        "https://make.wordpress.org/mobile/2023/03/28/new-mobile-support-forum/",
        "#",
        "https://make.wordpress.org/mobile/handbook/",
        "https://github.com/wordpress-mobile/WordPress-Android/blob/develop/README.md",
        "https://github.com/wordpress-mobile/WordPress-iOS/blob/develop/README.md",
        "https://wordpress.slack.com/messages/mobile",
        "https://make.wordpress.org/chat/",
        "https://github.com/wordpress-mobile/WordPress-iOS",
        "https://github.com/wordpress-mobile/WordPress-Android",
        "https://github.com/wordpress-mobile/WordPress-WindowsPhone",
        "https://github.com/wordpress-mobile/WordPress-BlackBerry-Legacy",
        "https://make.wordpress.org/mobile/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}