{
    "title": "UCR Jobs - Position Details ",
    "body": "\n\n\n\n\n\nSkip Navigation\n\n\nHome Page\n\n\n\n\n\n\n\n\nLogin \nRegister \n\n\n\n\n\n\n\nHR Employment\n\n\n\n\n\n\n\n\n\nHome\nBrowse Jobs\nHow to Apply\nMy Account\nHelp\nAbout\n\n\n\n\n\n\n\n\n\n\nPosition Details\n\n\n\nView All Details\n \n          Back To Current Job Opportunities\n    \n\nApply\n\n\n\nProject Financial Analyst    \n\n\n\n\n Job Number\n Full/Part Time \n Schedule   \n Salary\n\n\n\n\n 29256585 \n Full Time    \n 8AM - 5PM    \n     $76,000 -    $123,700    \n\n\n\n\nPosition Information\n \nPLEASE NOTE: University of California career employees who have passed their probationary period will receive priority consideration for this position.  If a qualified pool of internal candidates is not identified, qualified external candidates may be considered at the discretion of the hiring department.CNAS is navigating a new travel system with the launch of Concur earlier this year. As of July 2023, the campus will launch Oracle Cloud Financials & Kuali Research Administration systems. Taken collectively, these new tools will transform the way we do business and are known as the Impact23 Project. This position is the key component in the Dean's Office strategy to evaluate operations and create standards in this new environment. The incumbent's areas of support include Impact23 C&G/Budget/Procurement, projects related to on-going commitments such as faculty IC/Start Up, TAs, GSRs, Primary Temp Teach, Course Material Fees, and Payroll. As an Impact 23 C&G/Procurement specialist, the position oversees process engineering, manages budget reconciliation & C&G processes, and provides guidance & consultation to CNAS departments. In addition, the position will play a critical role in helping us remedy our largest operational pain points, work toward streamlined solutions and utilize substantive knowledge of best practices, controls and reporting to bring creative, simple solutions to the forefront. Finally, while 60% of the position is focused on Impact23 for the next 24 months, 40% of the responsibilities include a share of Dean's Office Financial Team duties to include ad-hoc reporting, ledger reconciliation, budget call, and fiscal close processes. The weight of responsibilities included in this position will evolve as our operations within the Impact23 framework mature. The responsibility as a process expert, engineer and guide are a durable component of this role. As operations stabilize, we expect that the incumbent will take a greater share of senior level financial analysis and reporting within the Dean's Office Financial Team.As a condition of employment, you will be required to comply with the University of California SARS-CoV-2 (COVID-19) Vaccination Program Policy. All Covered Individuals under the policy must provide proof of Full Vaccination or, if applicable, submit a request for Exception (based on Medical Exemption, Disability, and/or Religious Objection) or Deferral (based on pregnancy) no later than the applicable deadline. For new University of California employees, the applicable deadline is ten weeks after their first date of employment.  \t\n    \n    \n Education  \n\n Education Requirements \n\n\n Degree \n Requirement \n\n\n\n Bachelor's degree in related area and/or equivalent experience/training. \n Required \n\n\n\n\n\n Experience  \n\n\n\n Experience \n Requirement\n\n\n\n  6 - 10   years of related experience.  \n Required  \n\n\n\n\n\n Minimum Requirements \nAdvanced project management skills.Advanced knowledge of applicable policy analysis techniques.Advanced analytical/problem-solving skills.Ability to multi-task with demanding timeframes.Ability to use discretion and maintain all confidentiality.Thorough knowledge of organizational or initiative processes, protocols and procedures.Strong communication and interpersonal skills to communicate effectively with all levels of staff and influence, both verbally and in writing. \n Preferred Qualifications  \nAdvanced knowledge of common organizational- or research-specific and other computer application programs. \nAdditional Information \nIn the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel.UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.  UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.  UC Riverside is the top university in the United States for social mobility. - U.S. News 2020  UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.  Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019  Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings  UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.   The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law. For information about our generous employee benefits package, visit: Employee Benefits Overview \nJob Description Details\n\n View complete Job Description for this position  \n\n\n\n\n\n\n\n\n\n\nMore Information\n\n\n\nGeneral Campus Information\n\nUniversity of California, Riverside\n\n900 University Ave.\n\nRiverside, CA 92521\n\n\n                                Tel: (951) 827-1012\n\n\n\nCareer Opportunities\n                            • UCR Libraries\n\nCampus Status\n                            • Maps and Directions\n\n\n\nDepartment Information\n\nHuman Resources\n1160 University Ave.\nRiverside, CA 92521\n                                    \nFax: (951) 827-6493\n                                    E-mail: jobshelp@ucr.edu\n\n\n\nRelated Links\n\nHuman Resources Home\nDiversity\nAbout UCR\n\n\n\n\n\n\n\n\nCampuswide Navigation\n\n\nHome\n\n\nAbout UCR\n\n\nAcademics\n\n\nAdmissions\n\n\nAthletics\n\n\nHappenings\n\n\nResearch\n\n\nCampus Resources\n\n\nGiving to UCR\n\n\n\nFooter\n\n\n\nPrivacy Policy\n\n\nTerms and Conditions\n\n\n                            © 2010 Regents of the University of California\n                        \n\n                            Last modified: 2010-Apr-22\n                        \n\n\n\n\n \n",
    "links": [
        "#main",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_login&module=jobs",
        "!Controller?action=jobs_webui.show_page&page=jobs_register&module=jobs",
        "#",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&public=true&module=jobs",
        "https://jobs.ucr.edu/how-apply",
        "!Controller?action=jobs_webui.show_page&page=jobs_account_overview&module=jobs",
        "https://jobs.ucr.edu/help",
        "http://jobs.universityofcalifornia.edu/",
        "#",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&module=jobs",
        "!Controller?action=jobs_webui.forward_link&link=jobs_webui.apply_job&requisition_id=29256585&module=jobs",
        "https://ucnet.universityofcalifornia.edu/compensation-and-benefits",
        "!Controller?action=jobs_template&page=CT_job_description&requisition_id=29256585",
        "http://www.ucr.edu/employment.html",
        "httsp://library.ucr.edu/",
        "http://campusstatus.ucr.edu/",
        "http://www.ucr.edu/about/directions.html",
        "http://campusmap.ucr.edu/campusMap.php?loc=PRSNL",
        "mailto:jobshelp@ucr.edu?subject=Web Site Inquiry",
        "http://hr.ucr.edu",
        "http://diversity.ucr.edu",
        "http://www.ucr.edu/about",
        "http://www.ucr.edu/",
        "http://www.ucr.edu/about/",
        "http://www.ucr.edu/academics/",
        "http://www.ucr.edu/admissions/",
        "http://www.ucr.edu/athletics/",
        "http://www.ucr.edu/happenings/",
        "http://www.ucr.edu/research/",
        "http://www.ucr.edu/resources/",
        "http://www.ucr.edu/giving/",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}