{
    "title": "iSpace Crash Highlights Why Apollo Sites Need Protection, Say Archaeologists",
    "body": "MenuSpaceiSpace Crash Highlights Why Apollo Sites Need Protection, Say ArchaeologistsAs commercial missions to the Moon ramp up, historic landing sites are vulnerable to robotic tourism, crash landings, and other damage.by Kiona Smith14 hours agoSTR/AFP/Getty ImagesIt turns out you need to be careful where you crash on the Moon.Japanese company iSpace lost contact with its Hakuto M1 lunar lander on April 26, moments before the lander was supposed to touch down in a northern crater. Engineers from iSpace say the lander was low on fuel and in freefall for the last few hundred meters of its descent, suggesting that it almost certainly crashed. Most likely, the lander’s wreckage now lies at the bottom of the 1.25-mile-deep Atlas Crater, which its pair of small rovers were supposed to explore.The loss makes iSpace the second company to crash-land on the Moon, following the Israel-based Beresheet spacecraft, which dumped a cargo of tardigrades in Mare Serenitatis in 2020. Both crashes underscore a harsh reality: landing on the Moon is still difficult, even more than fifty years after the Apollo missions.Takeshi Hakamada, CEO of Japanese firm ispace, bows after explaining that the communication of the Hakuto-R Mission 1 lander developed by ispace has been cut off, in Tokyo on April 26, 2023. (Photo by JIJI Press / AFP) / Japan OUT (Photo by STR/JIJI Press/AFP via Getty Images)STR/AFP/Getty ImagesIt’s one thing to crash a lunar lander in the middle of nowhere (even if you’re carrying the most absurdly resilient creatures known to science on board). But what happens if a future commercial lander crashes into the Apollo 11 LEM, destroys the Apollo 17 rover, or slams down atop the Luna 2 wreckage?Archaeological Sites on the Moon“The Apollo sites will always be the first places humans set foot somewhere other than our home planet,” Chapman University archaeologist Justin Walsh tells Inverse. “It’s hard to think of a more significant development than that. It will be important to our descendants to understand what that was like, how it happened, what the experience of those humans was, and how they had to operate in this new context.”Some of that knowledge can only come from eventually studying the places they walked and the things they left behind. Most of the Apollo astronauts left behind memoirs and official logs, but physical objects often record details that don’t make it into the written record. The lunar landing sites are archaeological sites.For now, they’re in exactly the same condition the astronauts left them in — except for weathering from UV radiation and micrometeorites.“But their only protection right now is the fact that we have not tried to go back to them yet,” says Walsh.Protecting the Final FrontierNo one currently has a mission in the works to any of the Apollo, Luna, or Ranger landing sites, but archaeologists like Walsh, Beth O’Leary at New Mexico State University, and Alice Gorman at Flinders University in Australia, along with organizations like For All Moonkind, argue that it’s important to have some legal protections for the sites before that happens.“We know that the unofficial motto of New Space companies is “move fast and break things,” says Walsh. “We really want to avoid that outcome when we’re talking about pristine heritage sites that we don’t even know how to approach properly yet.”NASA has issued a detailed set of guidelines advising everyone to steer clear of the sites. Those guidelines include “hard ‘keep out’ boundaries” of 75 meters for Apollo 11 and 225 meters for Apollo 17. And iSpace’s recent lander crash makes it clear why NASA recommends such a wide berth; landing on the Moon is hard, and things can still go wrong.But there’s nothing NASA can do to enforce those guidelines. They’re basically a request.The actual objects on the Moon, like lunar rovers or the discarded items Neil Armstrong and Buzz Aldrin left behind, remain the property of their original owners. So if a future Moon lander were to miss its mark and damage the descent stage of the Lunar Module, NASA could sue the space agency or company responsible. (But the damage would still be done. An irreplaceable piece of human history would be demolished.)“The only protection that any items in space have is that they continue to be the property of their owner. The landscape (or orbital environment, or whatever) cannot receive even this protection,” says Walsh. “To use the example of Tranquility Base, the US government still owns all the items left there in 1969, but the site, including whatever survives of the footprints, is not protected.”That means someone could set a lander down right on top of the Apollo 15 rover tracks — the first vehicle tracks on the Moon — and nobody on Earth could do more than give them a dirty look.None of the laws that can protect important historic or cultural sites here on Earth apply in space, and Walsh, along with O’Leary and others, say that needs to change before anyone gets around to trying to park next to the Apollo 17 rover.“We need an international treaty that specifically addresses heritage in space,” says Walsh. “There are similar treaties that exist for international contexts on Earth, such as the Antarctic Treaty and its addenda and the 2001 UNESCO Convention on the Protection of the Underwater Cultural Heritage, which we can use as models. We don’t have to start from scratch.”more like thisSpaceArtemis Moon Missions Are Still a Priority in NASA's Latest BudgetSpaceA Tiny Nearby Galaxy Has More Planet-Building Potential Than We ThoughtSpaceUltraviolet Light Produces A Toxic Gas in This Planet's Hellish AtmosphereLEARN SOMETHING NEW EVERY DAYSubscribe for free to Inverse’s award-winning daily newsletter!SubmitBy subscribing to this BDG newsletter, you agree to our Terms of Service and Privacy PolicySubscribe to our newsletter >Related TagsAstronomySpace SciencesearchEntertainmentCultureTVMoviesReviewsMarvelStreaming RecsSee AllGamingNewsReviewsGuidesSee AllGearNewsReviewsGuidesSee AllInnovationTechnologyScienceSustainabilitySpaceTransportation + EVsSee AllMind + BodyFitnessNutritionLongevityMental HealthSee AllAmplifying Our VoicesNewsletterAbout UsMastheadArchiveAdvertiseTermsPrivacyDMCAYour Privacy Options© 2023 BDG Media, Inc. All rights reserved.",
    "links": [
        "/",
        "/profile/kiona-smith-72172932",
        "https://www.inverse.com/science/tardigrades-may-have-taken-over-the-moon",
        "https://www.inverse.com/science/apollo-17-anniversary",
        "https://www.chapman.edu/our-faculty/justin-walsh",
        "https://anthropology.nmsu.edu/anthropology-faculty/oleary.html",
        "https://www.flinders.edu.au/people/alice.gorman",
        "https://www.forallmoonkind.org/",
        "/science/nasa-budget-request-2024-house-bill",
        "/science/rocky-planets-early-universe",
        "/science/sunlight-produces-noxious-gas-on-exoplanet-wasp-39b",
        "https://www.bdg.com/info/terms-of-service",
        "https://www.bdg.com/info/privacy-policy",
        "/newsletter",
        "/topic/astronomy",
        "/topic/space-science",
        "/entertainment",
        "/culture",
        "/tv",
        "/movies",
        "/inverse-reviews",
        "/marvel-universe",
        "/inverse-recommends",
        "/entertainment",
        "/gaming",
        "/gaming-news",
        "/inverse-video-game-reviews",
        "/video-game-walkthroughs",
        "/gaming",
        "/gear",
        "/gear-news",
        "/gear-reviews",
        "/gear-guides",
        "/gear",
        "/innovation",
        "/technology",
        "/science",
        "/sustainability",
        "/space",
        "/transportation",
        "/innovation",
        "/mind-body",
        "/fitness",
        "/nutrition",
        "/longevity-hacks",
        "/mental-health",
        "/mind-body",
        "/amplifying-our-voices",
        "https://www.facebook.com/inverse",
        "https://twitter.com/inversedotcom",
        "https://www.instagram.com/inverse/",
        "https://www.pinterest.com/inversedotcom/",
        "/newsletter",
        "https://www.bdg.com/inverse",
        "/info/masthead",
        "/archive",
        "https://www.bdg.com/advertise",
        "https://www.bdg.com/info/terms-of-service",
        "https://www.bdg.com/info/privacy-policy",
        "https://www.bdg.com/info/dmca"
    ]
}