{
    "title": "Graphic Design – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Graphic Design\n\t\t\t    \n                            GD Menu\n                        Show search box.HomeOur TeamCMT HomepageHomeOur TeamCMT Homepage(opens in new window)\n        Our Office\n        Location IconOur Location\n                                                                            Meriam Library, Room 006\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0005\n                                                                    Scott Sleeperssleeper@csuchico.edu530-898-6639Anna Olesenaolesen@csuchico.edu530-898-3620Current page:  Graphic Design\n                                        \n    \t\tGraphic Design\n    \tGraphic Design Services offers graphic support services for faculty and staff on campus-related projects.\n                        Design Services\n                    Graphic Design specializes in print design and production and development of marketing campaigns that serve the communication needs of the Chico State campus.Marketing: Development of visuals and messaging that reflect a long-running campaign, such as creating an appeal for incoming students, through the process of their admission to Chico State. This includes identifying key stages of outreach, visual materials that capture the message, and preparing all print and electronic versions of the campaign.Publications: Multi-page documents requiring department- specific design and press-ready production are a hallmark of our studio. We have extensive knowledge of pre-press technology and requirements, and are available to press-check your publication at the printer’s location.Environmental Graphics: Posters, banners, and directional signage are tools for announcing new course options, showcasing department events, or helping visitors navigate campus. We design and prepare environmental graphics to be handed off to our Presentation Graphics department.We work with you on concepting and ideation, flesh out the ideas, and prepare the final artwork for use in print materials and signage, apparel, email marketing, and for your website.\n                        Print Services\n                    BannersFlyersPamphlets & brochuresMagazinesEnvironmental graphicsCreative brainstormingExplore Print ServicesInformation TechnologyKendall Hall, 109www.csuchico.edu/itSupport Our CollegeYou might be looking for...Classroom Technology ServicesStudent Print CenterGraphic DesignMedia ProductionsPhotographyPrint ServicesPresentation and Environmental GraphicsWeb ServicesInformation Technology\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "people/index.shtml",
        "https://www.csuchico.edu/cmt/index.shtml",
        "index.shtml",
        "people/index.shtml",
        "https://www.csuchico.edu/cmt/index.shtml",
        "mailto:ssleeper@csuchico.edu",
        "tel:530-898-6639",
        "mailto:aolesen@csuchico.edu",
        "tel:530-898-3620",
        "https://www.csuchico.edu/it/index.shtml",
        "https://www.csuchico.edu/giving/index.shtml",
        "https://www.csuchico.edu/classrooms/index.shtml",
        "https://www.csuchico.edu/copycenter/index.shtml",
        "index.shtml",
        "https://www.csuchico.edu/mediaproduction/index.shtml",
        "https://www.csuchico.edu/photography/index.shtml",
        "https://www.csuchico.edu/prnt/index.shtml",
        "https://www.csuchico.edu/cmt/pgl/index.shtml",
        "https://www.csuchico.edu/web/index.shtml",
        "https://www.csuchico.edu/it/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}