{
    "title": "Creating a custom template with the WordPress site editor | Learn WordPress ",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tLearn\t\t\t\t\t\tWordPress\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\tTutorials\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tOnline Workshops\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tCourses\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tLesson Plans\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tContribute\t\t\t\t\t\t\t\t\n\n\nSearch for:\n\n\n\n\n\t\t\tSearch\t\t\n\n\n\n\n\n\n\n\n\n\nLearn Home,  » Tutorials,  » Creating a custom template with the WordPress site editor \n\n\n\n\n\nCreating a custom template with the WordPress site editor\n\n\n\n\n \n\n\nIn this tutorial, we will learn how to use the Site Editor to create a custom template for a unique post or page. You might want to create a custom template for an event, a landing page, different types of blog posts or even have unique styles for different pages on your site.\nLearning outcomes\n\nAdding a new custom template.\nModifying a custom template.\nAssigning a template to a page or post via the Template Editor.\nCreating different custom templates for separate blog pages.\nCrafting a landing page for marketing purposes.\n\nComprehension questions\n\nIn which situations would you use a custom template?\nHow do you assign a template to a page or post?\n\nResources\n\nSite Editor\nTemplate Editor\n\nTranscript\nHi, and welcome to Learn WordPress. In this tutorial, we will see how to create a custom template, which lets you use a different design or layout from the rest of your website. This means you can create a page or post template with a unique header, footer, or other page elements. You might want to create a custom template for an event, a landing page, different types of blog posts or even have unique styles for different pages on your site. \n\nTo create a custom template, make your way to Appearance and click on Editor. And this will take you to your site editor. And once you’re here, make your way to templates. Let’s first open the page template. As you will notice, the page template already has a header and a footer, and all the pages that have been assigned to this page template will have this header and footer. I want my sample page to have a different header and footer; custom templates will help me achieve that. \n\nSo let’s make our way to Templates and then click on Add New and scroll to the bottom and select Custom Template. Name it appropriately and then click Create. Next, I will open up my List View and then remove this header and footer from my template. I will keep my Post Content block in place as all content is displayed through the Post Content block. Next, I will insert a new header, one which I’ve already created and is available below the existing template parts. Then I will add a new footer and select one that I’ve already created, called Centred footer with social links. And now, I have completed my custom template with a new header and footer. \n\nAfter saving the custom template, we can make our way to our dashboard. Open our sample page, and here we will notice the content we’ve already added to the page. We will see that this template has been assigned to the page template, which is the default template. Now we will assign it to the new sample page custom template that we just created. Once updated, we can make our way to the front end of the website, and we will see that our other pages share the original header and footer. But if we now click on the sample page, we will see that the sample page has its own unique header and footer due to the fact that we’ve assigned a custom template to this page. \n\nIt is also worth noting that when we make our way back to the sample page, for example, and look at our sidebar settings, you can edit a template or add a custom template from here. \n\nNext, you might have a blog page and would like to have different page layouts for different types of blog posts. I’ve created a custom template for my book review page and for my movie review page. So when I make my way to my custom template for book reviews, you will notice I have added a unique banner with the help of a Cover block. When we open the Query Loop block, you will notice I’ve added a category filter to only display the relevant posts and when I make my way to the custom template for my movie reviews, we will see I followed the same process and I’ve added the movies category. \n\nNext, I will go to the dashboard and open the page named Books and then assign this page to the custom template I created called Books. Then I will open up the page named Movies and assign it to the Movies custom template. Once we have updated, we can check out the front end of our website to see the unique layouts for the blog page about movie reviews and the blog page about our book reviews. Before we move on, it is also important to note that the single template is the default template for displaying any single post. But you could create a different design for a single post using a custom template and assign it to the relevant post or posts. \n\nIn the last example, I’ve created a custom template for a landing page which can be used for marketing purposes. When we open the custom template, you will notice I’ve removed the header and the footer. I’ve only kept the Post Content block, as this displays all content from a page that has been assigned to this template. Now we can make our way to the dashboard and open up the relevant page with all the content, and we will also see I’ve already assigned this page to the landing page template which I’ve created. Now if we click on Preview, we can view our landing page, which can be used on social media or in an email, for example. \n\nI trust you feel more confident now creating your own custom templates, and visit Learn WordPress for more tutorials and training material.\n\n\n\n\nWorkshop Details\n\n\nLength\n\n\t\t\t\t\t\t\t6 mins\t\t\t\t\t\t\n\n\nRelated Version\n\n6.2 \n\n\nLanguage\n\nEnglish \n\n\nSubtitles\n\nEnglish \n\n\nTranscript\n\n\n\t\t\t\t\t\t\t\tView\t\t\t\t\t\t\t\n\n\n\nPrint View\n\n\n\t\t\t\t\t\t\t\tView\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\tJoin a live Online Workshop\t\t\t\n\n\n\n\n\n\n\nPractise your skills on a private demo site\n\n\nSuggestions\n\nFound a typo, grammar error or outdated screenshot?\n\n\nLet us know!\n\n\n\n\n\n\n\nThis work is licensed under a Creative Commons Attribution-ShareAlike 4.0 International License.\n\n \n\n \n \n\n\nPresenters\n\n\n\n\n \n\nWes Theron\n\n\t\t\t\t\t@west7\t\t\t\t\n\n\n\n\nI am an Instructional Designer for the WordPress open-source project sponsored by Automattic. I am a strong supporter of the open-source movement. I have a background in education and content development.  I am a husband, father, dreamer and lifelong learner.\n\n\n\n \n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n",
    "links": [
        "#main",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Flearn.wordpress.org%2Ftutorial%2Fcreating-a-custom-template-with-the-wordpress-site-editor%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/tutorials/",
        "https://learn.wordpress.org/online-workshops/",
        "https://learn.wordpress.org/courses/",
        "https://learn.wordpress.org/lesson-plans/",
        "https://learn.wordpress.org/contribute/",
        "https://learn.wordpress.org",
        "https://learn.wordpress.org/tutorials",
        "https://wordpress.org/documentation/article/site-editor/",
        "https://wordpress.org/documentation/article/template-editor/",
        "https://learn.wordpress.org/tutorials/?wp_version=45610",
        "https://learn.wordpress.org/tutorials/?language=en_US",
        "https://learn.wordpress.org/tutorials/?captions=en_US",
        "#transcript",
        "#",
        "https://learn.wordpress.org/online-workshops/",
        "https://developer.wordpress.org/playground/demo/?step=playground&theme=twentytwentythree",
        "https://learn.wordpress.org/report-content-errors/",
        "http://creativecommons.org/licenses/by-sa/4.0/",
        "http://creativecommons.org/licenses/by-sa/4.0/",
        "https://profiles.wordpress.org/west7/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}