{
    "title": "Need a zip from Gutenberg trunk branch? - Gutenberg Times",
    "body": "\nSkip to the content\n\n\n\n\n\n\n\n\nMenu\nClose\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\nHome\nNews\nPodcast: Gutenberg Changelog\nLive Q & A Archive\nTestimonials\nAbout UsShow sub menu\n\nContact Us\nSponsors\n\n\n\n\n\nSearch For…\n\n\nSearch\n \n\n\n\n\nTwitter\nYouTube\nmastodon\n\n\n\n\n\n\n\n\nGutenberg Times\nCurating news and community voices about the WordPress Block Editor, codenamed Gutenberg\n\n\nTwitter\nYouTube\nmastodon\n\n\nSearch\n \n\nMenu\n\n\n\n\n\n\n\n\n\n\n\nSearch For…\n \nSearch\n\n\nClose\n\n \n\n\n\n\n\n\n\n\n\nNeed a zip from Gutenberg trunk branch?\n\n\n\n \n\n\n\nThis download page is for people who would like to alpha/beta test Gutenberg, but \n\nDon’t want to do install NodeJS and npm  ✅\nDon’t want to use the command line ✅ \nDon’t want to download 2.7 Gigabytes in 232,740 files ✅\n\nA friend of mine asked me, “Every two weeks is not fast enough for you”? On October 19, 2020, there were 250 new commits made since the last release (9.1.1) and before the release of 9.2. Any issue you might file, might get a response like “Could you please try it in master, I think it was already fixed.” \n\nIf you want to actively test Gutenberg and help to find bugs, quirks or inconsistencies in work flow, you don’t want to waste anyone’s time and use the latest release. You need a fast way to get to a current version of the development. \nThe goal of this service is to increase the numbers of non-developers to test Gutenberg. \n\n\n\nTable of contents\nDaily builds from Gutenberg Trunk branch. Download Gutenberg NightlyHow to install Gutenberg Nightly?How do get updates to Gutenberg Nightly? History of the experimentWhat other people wrote about Gutenberg NightlyProject Updates \n\n\n\nDaily builds from Gutenberg Trunk branch. \nAlmost every morning, I build a new zip from trunk unless git merge upstream/trunk, indicates, everything is up-to-date.  I call this version Gutenberg Nightly analog to WordPress Nightly in the Beta Tester plugin. \n \n\nDownload Gutenberg Nightly\nApril 30, 2023 \n\nLatest Weekend Edition: 🙌 Getting started with block themes, playground, create-block tool and Block Data API—Weekend Edition #252\nNew episode:  🎙️ Gutenberg Changelog #82 – Gutenberg 15.6 and proposed schedule for WordPress 6.3 \nGutenberg 15.7 RC1 is now available for testing\n\nIf your site doesn’t update right away, go to the Git Updater Settings and click on the Refresh cache button. Now you should see the update notice for the Gutenberg Nightly in your wp-admin/plugins page.\nJoin us at the Discussion board, with questions and ideas, or leave your comments below. \nUpdates are made possible via Git Updater plugin, a plugin by Andy Fragen\n\n\n\nDownload Gutenberg Nightly \n\nv-15.8.20230429Also, available on GitHub\n\n\n\n\nGutenberg 15.6.2\n\n\nWhat’s new in Gutenberg 15.6? (19 April)\nv 15.6.1\nv. 15.6.2\n\n\n\nNote: The version tag of the Gutenberg Nightly will always be on decimal ahead of the stable. So version 10.3 is in the works, the nightly version will be 10.4. That way the Nightly stays in its lane and the bots working behind the scene are not confused by semantic versioning.\n\nHow to install Gutenberg Nightly?\nStep 1: To download *.zip file, click on the above Gutenberg Nightly button\nStep 2: Upload the zip file to your test site. Don’t use on live site or in production.\n\nGo to WPAdmin > Plugins\nClick on Upload Plugin\nClick on Choose File to select your downloaded file from your computer\nClick on Add new\nClick on Install Now\n\n\nIf you already have a previous version installed or the stable version, your site will notify you that this plugin is already installed and will show you meta-data from both version so you can make a decision.  \n\nIt’s safe to click on Replace current with uploaded\nStep 3: Activate plugin\n\nHow do get updates to Gutenberg Nightly? \nDownload the plugin Git Updater and install the same way, you did the nighly .zip file. Once activated, this plugin will check the Gutenberg Nightly repository and alert you of updates in your WP Admin > Plugins screen. \n\nPlease note:  The plugin Git Updater has a 12-hour cache. \nIf you need to update sooner, click the Refresh Cache button on the plugin’s settings page, and you’ll see the update notification on Gutenberg plugin \n\nA side note: Git Updater a free plugin for all. After 60 million downloads, Andy Fragen now explores ways to monetize some advanced features of the plugin. He is working on the transition. There will always be a free version of it. \nThe three features: Branch Switching, REST API endpoints, and WP-CLI integration will be migrated into the PRO version. \nIf you are using Git Updater plugin, you can support Andy Fragen as a GitHub Sponsor.\nHistory of the experiment\nWhat other people wrote about Gutenberg Nightly\n\nSet Up a Gutenberg Test Site in 2 Minutes with the Gutenberg Nightly Plugin \nSarah Gooding, WordPress Tavern\nOne of the quickest ways to get started doing alpha/beta testing is to install the Gutenberg Nightly plugin, which pulls in the latest build from the Gutenberg project. One of the quickest ways to get started doing alpha/beta testing is to install the Gutenberg Nightly plugin, which pulls in the latest build from the Gutenberg project. Ordinarily, to get the latest build one would have to install NodeJS and npm and use the command line to get set up. This process can be prohibitive, along with the dizzying pace of Gutenberg development, for less technical users who want to start testing. \n\n\nGutenberg: How to test the latest updates\nOn GoDaddyPro Online, I had the pleasure of joining Andy Fragen and George Mamadashvili and Courtney Robertson and talk about the many ways you can test WordPress and Gutenberg. \nI talked and demo’d the process on getting the Gutenberg Nightly and how to update it. You can watch the recording of the full show on YouTube \nCourtney Robertson wrote: “Gutenberg Nightlies — If you’d like to combine the Gutenberg plugin to test the most current version of the Gutenberg plugin, follow these tips from Birgit to get the latest version”\n\n\nProject Updates \nFebruary 7, 2023 – The latest Git Updater 12.1.0 makes the update work well again. \nFebruary 5, 2023 – Error message: Update failed: The source and destination are the same seems to be rooted in the Core Nightly or the Git Updater plugin. Andy Fragen has a fix in the Git Updater develop branch. Use Allow branch switching setting to test the fix. \nJan 29, 2023 Updated: All is right again, with Git Updates 12.04. Thank  you Andy. Jan 27, 2023 Note: Over the last week, we encountered download errors with Git Updater 12.0.3 – Reverting to 12.0.1 and Gutenberg Nightly updates without any issues. For convenience purposes, you can download the Git Updater version 12.0.1  here. (bph 01/27/2023)\nApril 21, 2022 – Goofed the first run of the Gutenberg Nightly because I was distracted and missed a step. For the second build to work and update via the Git Updater, I needed to do another version bump. The correct version is v-13.2.20220422\nMarch 18th, 2022 – Jamie Marsland, PootlePress uses the Gutenberg Nightly for trainings sites via TasteWP, he offers to his YouTube subscribers to test new features or themes with the latest Gutenberg changes. Marsland also published free Gutenberg tutorials on his website.\nMarch 3rd, 2022 – It seems to be working well for people. Sometimes WP Tavern links to it, like in this article: The WordPress Web Fonts API Has Arrived, when there is a feature already merged into the repo, but will only come in a future release. We crossed 114,000 downloads. \nDecember 8th, 2021 – After the new version of GitUpdater 10.6.7 updating the Gutenberg nightly assets works consistently again. Again, Huge Thanks to Andy Fragen, you help troubleshooting this and finding a solution. \nDecember 7th, 2021 – Andy Fragen has figured out why some sites wouldn’t update and is about to release a new version of the GitUpdater. \nDecember 6th, 2021 – Testing it again from SiteGround still that Bad Request error. I used it on the LocalWP instance and I successfully updated 20211203 to 20211206 version. I have no idea what the problem is. \nConnected with Andy on the WPSlack, and he \nDecember 4th, 2021 The update with GitUpdater has worked for the last two days. At my reference test site on SiteGround, I only get the message:  Updated failed: Download failed. Bad Request.\n\nTesting it again on a different site on Digital Ocean, and it worked well. \nNovember 24th, 2021 – Gutenberg Nightly just passed 100,000 downloads. \n\nNovember 22, 2021 – We just passed 99,000 downloads! Over the weekend I was successful to replicate the process, I had on my private computer on my company computer now. It’s major as the build process is now down to one minute! \nOctober 20, 2021 – We just passed the 90,000 download thresholds. \nJuly 17th, 2021: A couple week’s ago we pass the threshold of 70,000 downloads.  This is quite astonishing, considering the very specific use case for the Gutenberg Nightly. Today, I also updated references from GitHub Update plugin to Git Updater plugins by Andy Fragen. \nJuly 8th, 2021:  I noticed today, that if you deactivated the plugin because you are for instance testing a Beta/RC version of Core, the GitHub Updater doesn’t signal that there is an update available. It only places the “There is an update available” information on the plugins screen once you activate it again. VS Code lets me deal with merge conflicts by giving me the choices on which code segment to commit. \nMay 10th, 2021: Grzegorz Ziolkowski merged the latest stable code base (10.5) into WordPress Core. If you use the Beta Tester plugin, and set it to the channel “Bleeding Edge” and the stream to “Nightlies” you can already start testing 5.8 alpha including changes to Gutenberg 9.9 – 10.5. plugin releases.\nMay 6th, 2021. Release candidate for 10.6 is available now\nMay 5th, 2021. Changed the tag number to 10.7., to stay ahead of the 10.6 release cycle. Today, there might be a 10.6 rc release. Fixed the purged link to another plugin’s settings. page. \nApril 28th, 2021. In the WordPress News post – Curious About Full Site Editing? Gutenberg Nightly was mentioned on as a Resource. 65,000 Downloads, not much movement in the last 10 days. \nApril 19th, 2021. Added link to add a new post to the discussion board to the plugin description of the WP-Admin plugins page. TIL need to use anchor tag, not markdown. 🤣\nBefore\nAfter\nApril 18th, 2021. New build. 65,000 downloads. Also published Gutenberg Changelog #42 \nApril 15th, 2021. New build after 63,000 downloads. Added a note about GitHub Updater changes to come and a link to Andy Fragen Sponsor page. \nApril 11th, 2021. 62,000 downloads. Sarah Gooding wrote about it: “WPTavern: Set Up a Gutenberg Test Site in 2 Minutes”. \n\n“It’s a really valuable service that not many people know about yet.” \nSarah Gooding, editor WPTavern\nJoin the discussion of the article\nApril 10th, 2021. New build today at 61, 000 downloads. \nApril 9th, 2021. After a few days moving and traveling, a new build was created. 60,000 downloads.\nApril 5th, 2021. 58,000 downloads. \nRan into an error regarding chrome driver install. Use the suggest  --chromedriver-skip-install to skip it and the build went through. \nApril 2nd, 2021. 57,000 downloads \nMarch 26th, 2021. 53,000 downloads. \nMarch 24th, 2021. 52,000 downloads. \nMarch 19, 2021. 50,000 downloads. Also, for the second day in a row, I used git fetch upstream before I auto-merge command. (Turns out I didn’t change the version in gutenberg.php, so it wouldn’t update yet, running a second build. Every time a human is involved it increases the risk of borked-up steps)\nMarch 18th, 2021. Sometimes a build fails on first try the first thing is I  “delete all node_modules directories” command: rm -rf node_modules packages/*/node_modules\nMarch 14th, 2021. Just added the “open two sites in my browser” task to the distribute-nightly CLI: dist now command. Big thank you to Sindre Sorhus for the open() npm package. \nMarch 10th, 2021. Refactored the distribute-nightly CLI to read the gutenberg.php file to find the version, compare it to WP tag as well as the nightly tag and decide on ‘new version’ or update asset path. For a while now I have been using dist test to do a dry run of the CLI and could test the logic for various scenarios. I also updated the cli to work with the name change of the default branch to trunk. That switch has been completed through out the process. \nNew merge-command:git merge upstream/trunk -m 'prep build [date]' --no-verify\nNext step for distribute-nightly open two browser windows one for testing  the update in the reference environment, and this page to edit the information. \nWe are at 46,000 downloads. \nFeb 5th, 2021. Wednesday there was a new release of Gutenberg, and this morning they released 10.1.1. I’ll take the time over the weekend to work on my automated distribution script again. Turns out, the new version creation business logic is backwards. The new version needs to look at the gutenberg.php header to find out if a new version needs to be created or not. Comparing the origin and the fork only comes into play to double-check, but the decision falls when changing the version in gutenberg.php before the build. \nOn another good news, Gutenberg Nightly was included a second time in this week in a post on the WPTavern. Today’s post describes all the different User-Friendly Methods for Testing Gutenberg Enhancements and Bug Fixes.\n“Gutenberg Times has a page for grabbing a nightly-created ZIP of the plugin. This includes the latest features and bug fixes that have been merged into the project. For users who want to test the plugin and provide feedback to the development team, this is the easiest way to get started.” Justin Tadlock wrote.\n\n\nWarning: Undefined array key \"master\" in /home/customer/www/icodeforapurpose.com/public_html/wp-content/plugins/github-updater/src/GitHub_Updater/Plugin.php on line 453\n\nWhen I scrolled to the plugin list, I saw for the Gutenberg Nightly “Automatic update is unavailable for this plugin”. \n\nThis is when the GitHub updater’s feature “Enable Branch Switching” would come in. Go to the GitHub Updater’s Settings page, check the option and Save Changes\n\nNow scroll to the Gutenberg Nightly, you see highlighted “Current branch is ‘master`, try another version with a link to the new version. \n\nClick on “another version” and it will install the latest version. \n\nFebruary 17th, 2021 Ran into problems again on build run. But did get it finally resolved and another version out. \nAlso learned from Andy Fragen about Shields.io. The GitHub Version of the gb-nightly has been downloaded 35k times. \n\nThis was Riad’s advice: Use node 14 and npm 6 | Remove node_modules folders rm -rf node_modules packages/*/node_modules – That worked. \nRafael suggested npm clean:packages and npm clean:package-types to solve something like this. \n\nFeb \nFebruary 10th, 2021: Same problem. No new release updating the old one. \n\nFebruary 8th, 2021: Ran into some trouble during the build process. The team is working on fixes: #28824 & #28849. I got past it after I downgraded npm install -g npm@6\nAlso, my CLI version check didn’t give me a new release because I botched the new release for 9.9.0. Forgot the 0 so semantic versioning didn’t work. 🤦‍♀️\n\nJanuary 25th, 2021: modified the plugin build command to NO_CHECKS=true npm run build:plugin-zip` – to not have the script run through without user interaction. \nMore Tweets \n\nJust released today's build of Gutenberg Nightly a plugin zip from master Gutenberg branch. https://t.co/ZAgPGWC5UV 1/4— Gutenberg Times (@gutenbergtimes) January 25, 2021\n\n\nJanuary 16th, 2021. The distribute-nightly CLI now includes the SFTP upload of the new build  to this site’s files so the above download link always has the newest version.  \nJanuary 14th, 2021. Today for the first time, the new tag and release was automatically created via the new CLI. I also found out, thanks to Andy Fragen, what cause the bug that prevented GitHub updated to trigger and update. \nJanuary 9th, 2021. Continue to work on distribute-nightly CLI for my workflow, using GitHub CLI and NodeJS. Updated successfully existing release asset via CLI. \nJanuary 4th, 2021. Used GitHub CLI to create the release. \nScreenshot of creating a release via GitHub CLI.\nJust added some data on prompt and added the release comments manually via copy/paste from previous releases. \nDay 71, December 24, 2020. Yay, a Christmas Edition, just because of the date through. Had to fetch from upstream, seems we got out of sync again. \nDay 60, December 13, 2020: New build today. Updates as usual. \nDay 58, December 11, 2020: New build today, getting better at solving merge conflicts. Need to come up with some topics to discuss on the Discussion board. \nDay 57, December 10th, 2020: Earlier today, Gutenberg 9.5.2. was released. Later I build the nightly update. It’s practically the same.  \nDay 56, December 9, 2020.\nNew build today on a new tag (9.5.1-nightly). GitHub also offered their new section “Discussion” and I enabled it for the repository\nAlso, a Thread on Twitter. with four tweets: \n\n\nJust released today’s build of Gutenberg Nightly a plugin zip from master Gutenberg branch. https://gutenbergtimes.com/need-a-zip-from-master/#nightly 1/3\nGutenberg Nightly daily build can up to your wp-admin/plugins page like any other plugin via the GitHub Updated plugin by @andyfragen https://github.com/afragen/github-updater/releases/latest 2/3\nToday, we opened up the GitHub Discussion tab on the repository, in case you have questions or testing ideas or just share how you are using Gutenberg Nightly\nScreenshot how Gutenberg Nightly and GitHub Updater work together to bring updates to your WordPress site.\n\n\nOriginally tweeted by Gutenberg Times (@gutenbergtimes) on December 9, 2020.\n\nDay 54, December 7th, 2020. A couple of days ago, I discovered a thread on GitHub about a plugin zip etc. I suggested GT Nightly to the person seeking help. Here is his answer. \n\nDay 52, December 5th, 2020.  New built today. \nDay 50 – December 3rd, 2020. That’s a good round number! Merged the updates and created today’s build. Nothing of note, except that I still haven’t gotten any further in automating more of the manual process. \nDay 44, November 27, 2020  – New build uploaded. \nDay 42, November 25, 2020, New build uploaded. \nLearned that “Anyone who has Gutenberg Nightly installed but not active will see an update to the dot org version. If they update or auto-updates are on, they will need to re-install your version.” \nI also did a typo in the version since the last one. I had a 1 too many in the version number. Now going back to 9.4.1.20201125 makes it look like it’s an older version. \n\nDay 38, November 21, 2020, Yesterday 9.4.1 was released. Today, we have a new built. There were 81 new commit since 9.4.1 was released. The Gutenberg team is fierce!\nNeeded to update npm before the built and merge conflicts sometimes still throw me. \nAlso, fixed some typos, edit instructions for clarity and added a screenshot of the GitHub Update settings page, showing the Refresh Cache button\nDay 36, Nov 19, 2020 – Brand-new build today. Still semi-manual process. \nDay 33,  Nov 16, 2020 – I am expecting a 9.4 Release candidate version will come out later today \nDay 27, Nov 10, 2020. Second day in a row, there were no commits to master. \nDay 26, Nov 9, 2020. Updated gb-nightly. Also, tried to create a standard directory on the site, so the new gutenberg.zip can be FTPed to the live Pantheon server. Turns out, the idea was too simple for Pantheon’s set-up. Need to think of something else, then. \n\n\n When I clicked on update, I ran into the following error, which – as I understood it – just means the release asset for yesterday’s update isn’t available anymore. \n\nOnce, I refreshed the cache on GitHub Updates Settings, it would display the right version and I was able to update the site. \n\nDay 24, Nov 7, 2020. Updated nightly at 8:00. Anne McCarthy mentioned the Nightly version in here blog post: My setup for the latest & greatest for testing Full Site Editing.\nDay 23, Nov 6, 2020. A new nightly is available. Over the weekend, I’ll start the second phase for the project and try to automate the steps. This PR might give me a headstart.  \nDay 22, Nov 5, 2020. It’s the first day after an official release. 48 commits to master since the 9.3 version was released.  \n\nNovember 4 is the official #Gutenberg 9.3 #release day!You can even download the #Gutenber_Nightly from this link 👉https://t.co/RjE1vqvyYFMassive #ShoutOut to @bph for her work on thought on this project 👏— Ahmed Chaion (@chaion07) November 5, 2020\n\nDay 21, Nov 4, 2020 Gutenberg 9.3 was released. Also published a Gutenberg nightly for practice purposes and to see if they update is announced by GitHub Updater since the changes from yesterday. Gotta refresh that Cache! \nProps for this work on WP Slack. \n\n\nUsing the button ‘Replace current with uploaded’ gets you the Gutenberg Nightly installed. \n\nDay 19, Nov 2, 2020 – Andy Fragen and I optimized the workflow and will test it Friday Nov 6th, when 9.3 is released. For today and tomorrow, I just link to the RC, Thursday to 9.3 and Friday to our new Gutenberg nightly.  \nTwo parts: \n\nProvide a gutenberg.zip build that has all the proper headers to work with GitHub Updater here \n\nDay 18, Nov 1, 2020 – Updated Gutenberg-nightly file. Consolidated my local environment and manage a gutenberg fork, to eventually release the nightly via GitHub and GitHub Updater. \nDay 17, Oct 31, 2020 – Happy Halloween! 👻 🎃 💀👿No activity on this page.\nDay 16, Oct, 30, 2020 – new build ran into quirks because just by uploading the new file, the site created a new file name, which makes it not update the yesterday’s Gutenberg Nightly, but creates a new Gutenberg plugin on your site. Had to delete the previous upload to replace with this. I am working on providing a proper update process for the gutenberg nightly version. \nDay 15, Oct 29, 2020 – new build now with changed gutenberg.php which makes it a bit more obvious which version of the plugin you have installed. That’s after some testing that my changing the gutenberg.php files wouldn’t mess up the build. \nDay 14, Oct. 28, 2020 – new build. 90 commits since the 9.2.2 release \nAlso, we had some discussion about this process on Slack in #fse-outreach-experiments, with some great ideas on make this more useable at scale. \nDay 13, Oct 27, 2020 – new build after Isabel Brison “published some npm packages with bug fixes for 5.6 Beta 2″\nFirst time for me to actually review a PR on Gutenberg repo. I followed these instructions.\nGutenberg plugin 9.2.2 was released earlier today, and there were already 58 commits since then…\nWordPress 5.6 Beta 2 was released\nDay 12 Oct 26, 2020 – built a new version around 11 am. I didn’t see that there was a 9.2.2 release earlier today… Duh. Also: nosolosw released this 3 hours ago · 58 commits to master since this release\nDay 10/11 git pull showed a `Already up to date.` message both days (0ct. 24 + 25)\nDay 9, October 23, 2020 – Didn’t get to create the build until after our recording of the Gutenberg Changelog #31, where I mentioned this page. Andy Fragen released Beta tester plugin version 3.0 today. \nDay 8, October 22, 2020  — Gutenberg plugin 9.2.1 was released. You can download or update it. \n\nFrom the WordPress repository or \nFrom the GitHub repository\nOr wait until it shows up as an update on your plugins page. \n\nDay 7, October 21, 2020 Gutenberg plugin 9.2 was released. –\nPreparing the 227-item list for our Gutenberg Changelog episode #31 recording on October 23rd. \nMentioned this project during #core-editor meeting.\nDay 6, October 20, 2020 For the next few days I’ll refer the visitors to the Release Candidate and the stable version of the Gutenberg plugin.\nDay 5, October 19, 2020 After got the same message git status message  earlier this morning, although there were 20+ more commits made, I went ahead and created a new build. \n\nIn #core-editor Isabel Brison announced she will create the Gutenberg RC 9.2 early evening my time. \nDay 4, October 18, 2020. I didn’t run a new build as the git status gave me a “Your branch is up to date with ‘origin/master” message. \nDay 3, October 17, 2020 While I ran today’s build process, I listened to Helen Hou-Sandi on her Twitch channel getting frustrated that there wouldn’t be a download version to alpha-test Gutenberg and where she tried to find one. Glad I can help out. \nDay 2, On October 16, 2020 there was a testing sprint in core for the Widget Screen, and the scrub master added it to the instructions for the test users. \n\nThe first time, I posted the zip-from-master file on October 15, 2020. Very early in the Gutenberg development, I would test things, be very diligent with it to make sure I got the real problem isolated, then I would write up complete issues with steps to reproduce and all the pertinent information to find out that a developer has already fixed it and I should test it again in master to make sure. I wasn’t so keen anymore to do early feature testing. \nTesting WordPress 5.5 betas and release candidate, and a conversation with the developer of the WordPress Beta Plugin got me thinking, again about that situation. I wrote up some ideas on how to provide a plugin zip file from gutenberg master branch and make it available for other testers. \nBig Thanks to Andy Fragen and Anne McCarthy to be a sounding board for my “This should work like my car” idea. \nQuestions? Email me pauli@gutenbergtimes.com or DM me on WordPress Slack – @bph or leave a comment. \n\n\n\n\nLeave a Reply\t\t\t\t\tCancel reply\n\n\n\n\n\n\n\n\n\n\nThis site uses Akismet to reduce spam. Learn how your comment data is processed. \n\n\n\n\n\n\n© 2023 Gutenberg Times\n\n\t\t\t\t\t\t\tTheme by Anders Norén \n\nTwitter\nYouTube\nmastodon\n\n\n\nBy using this website, you agree to our Privacy Policy× \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#site-content",
        "#",
        "#",
        "/",
        "https://gutenbergtimes.com/news/",
        "/podcast",
        "https://gutenbergtimes.com/live-q-a-archive/",
        "https://gutenbergtimes.com/testimonials/",
        "https://gutenbergtimes.com/about-us/",
        "#",
        "https://gutenbergtimes.com/contact-us/",
        "https://gutenbergtimes.com/category/sponsors/",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "https://gutenbergtimes.com/",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "#",
        "#",
        "#",
        "#nightly",
        "#daily-builds-from-gutenberg-trunk-branch",
        "#nightly",
        "#install",
        "#updates",
        "#history",
        "#what-other-people-wrote-about-gutenberg-nightly",
        "#project-updates",
        "https://gutenbergtimes.com/getting-started-with-block-themes-playground-create-block-tool-and-block-data-api-weekend-edition-252/",
        "https://gutenbergtimes.com/podcast/gutenberg-changelog-82-gutenberg-15-6-and-proposed-schedule-for-wordpress-6-3/",
        "https://github.com/WordPress/gutenberg/releases/tag/v15.7.0-rc.1",
        "https://github.com/bph/gutenberg/discussions",
        "https://github.com/afragen/git-updater/releases/latest",
        "https://profiles.wordpress.org/afragen/",
        "https://gutenbergtimes.com/wp-content/uploads/2020/11/gutenberg.zip",
        "https://github.com/bph/gutenberg/releases/latest",
        "https://wordpress.org/plugins/gutenberg",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/",
        "https://github.com/WordPress/gutenberg/releases/tag/v15.6.1",
        "https://github.com/WordPress/gutenberg/releases/tag/v15.6.2",
        "https://github.com/afragen/git-updater/releases/latest",
        "https://github.com/sponsors/afragen",
        "https://wptavern.com/set-up-a-gutenberg-test-site-in-2-minutes-with-the-gutenberg-nightly-plugin",
        "https://wptavern.com/set-up-a-gutenberg-test-site-in-2-minutes-with-the-gutenberg-nightly-plugin",
        "https://www.youtube.com/watch?v=4yoZhuJ96yY",
        "https://www.godaddy.com/garage/gutenberg-how-to-test-the-latest-updates/",
        "https://www.youtube.com/watch?v=4yoZhuJ96yY",
        "https://gutenbergtimes.com/need-a-zip-from-master/",
        "https://gutenbergtimes.com/wp-content/uploads/2023/01/git-updater-12.0.1.zip",
        "https://tastewp.com/",
        "https://www.pootlepress.com/wordpress-gutenberg-block-editor-guide/",
        "https://wptavern.com/the-wordpress-web-fonts-api-has-arrived",
        "https://git-updater.com/",
        "https://github.com/afragen/git-updater/releases/latest",
        "https://github.com/WordPress/gutenberg/issues/31322#issuecomment-834322445",
        "https://github.com/WordPress/gutenberg/releases/tag/v10.6.0-rc.1",
        "https://github.com/bph/gutenberg/releases/tag/10.7.-nightly",
        "https://wordpress.org/news/2021/04/curious-about-full-site-editing/",
        "https://gutenbergtimes.com/podcast/changelog-42-full-site-editing-scope-for-wordpress-5-8/",
        "https://github.com/sponsors/afragen",
        "https://wptavern.com/set-up-a-gutenberg-test-site-in-2-minutes-with-the-gutenberg-nightly-plugin",
        "https://github.com/bph/gutenberg/discussions/10",
        "https://github.com/sindresorhus",
        "https://github.com/sindresorhus/open",
        "https://github.com/bph/distribute-nightly",
        "https://wptavern.com/user-friendly-methods-for-testing-gutenberg-enhancements-and-bug-fixes",
        "https://gutenbergtimes.com/need-a-zip-from-master/",
        "https://github.com/WordPress/gutenberg/pull/28824",
        "https://github.com/WordPress/gutenberg/pull/28849",
        "https://t.co/ZAgPGWC5UV",
        "https://twitter.com/gutenbergtimes/status/1353744263721455618?ref_src=twsrc%5Etfw",
        "https://gutenbergtimes.com/wp-content/uploads/2020/11/gutenberg.zip",
        "https://github.com/bph/gutenberg/releases/tag/9.5.1-nightly",
        "https://github.com/bph/gutenberg/discussions/3",
        "https://twitter.com/gutenbergtimes/status/1336679318819397632",
        "https://gutenbergtimes.com/need-a-zip-from-master/#nightly}",
        "https://twitter.com/andyfragen",
        "https://github.com/afragen/github-updater/releases/latest}",
        "https://github.com/bph/gutenberg/discussions/3",
        "https://twitter.com/gutenbergtimes",
        "https://twitter.com/gutenbergtimes/status/1336679318819397632",
        "https://github.com/WordPress/gutenberg/issues/19237#issuecomment-739131816",
        "http://nomad.blog/2020/11/06/my-setup-for-the-latest-greatest-for-testing-full-site-editing/",
        "https://github.com/WordPress/gutenberg/pull/26746",
        "https://github.com/WordPress/gutenberg/compare/v9.3.0...master",
        "https://twitter.com/hashtag/Gutenberg?src=hash&ref_src=twsrc%5Etfw",
        "https://twitter.com/hashtag/release?src=hash&ref_src=twsrc%5Etfw",
        "https://twitter.com/hashtag/Gutenber_Nightly?src=hash&ref_src=twsrc%5Etfw",
        "https://t.co/RjE1vqvyYF",
        "https://twitter.com/hashtag/ShoutOut?src=hash&ref_src=twsrc%5Etfw",
        "https://twitter.com/bph?ref_src=twsrc%5Etfw",
        "https://twitter.com/chaion07/status/1324262791184670722?ref_src=twsrc%5Etfw",
        "https://wordpress.org/plugins/gutenberg/",
        "https://github.com/bph/gutenberg/releases/tag/9.3.0-nightly",
        "https://gutenbergtimes.com/wp-content/uploads/2020/11/gutenberg.zip",
        "https://github.com/afragen/github-updater",
        "https://github.com/WordPress/gutenberg/releases/tag/v9.2.2",
        "https://wordpress.slack.com/archives/C015GUFFC00/p1603898899020600",
        "https://wordpress.slack.com/archives/C02QB2JS7/p1603781994073800",
        "https://github.com/WordPress/gutenberg/issues/25202",
        "https://github.com/WordPress/gutenberg/releases/tag/v9.2.2",
        "https://wordpress.org/news/2020/10/wordpress-5-6-beta-2/",
        "https://github.com/nosolosw",
        "https://github.com/WordPress/gutenberg/compare/v9.2.2...master",
        "https://wordpress.org/plugins/wordpress-beta-tester/",
        "https://downloads.wordpress.org/plugin/gutenberg.9.2.1.zip",
        "https://github.com/WordPress/gutenberg/releases/download/v9.2.1/gutenberg.zip",
        "https://make.wordpress.org/core/2020/10/21/whats-new-in-gutenberg-21-october/",
        "https://downloads.wordpress.org/plugin/gutenberg.9.2.0.zip",
        "https://www.twitch.tv/videos/772299357",
        "mailto:pauli@gutenbergtimes.com",
        "/need-a-zip-from-master/#respond",
        "https://akismet.com/privacy/",
        "https://gutenbergtimes.com",
        "https://www.andersnoren.se",
        "http://twitter.com/gutenbergtimes",
        "https://www.youtube.com/channel/UCSD3LG2kSHdr7llRSHaylxw",
        "https://twit.social/@gutenbergtimes",
        "https://gutenbergtimes.com/privacy-policy/",
        "#",
        "#"
    ]
}