{
    "title": "Butte Creek Ecological Preserve – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Butte Creek Ecological Preserve\n\t\t\t    \n                            BCEP Menu\n                        Show search box.Butte Creek Ecological PreservePublic Use of BCEPDirections and MapsEducation and ResearchEducation and ResearchOutdoor ClassroomPlant Species of the BCEPPlant Species of the BCEPFerns and Allies of the BCEPGrasses of the BCEPHerbaceous Plants of the BCEPLichen of the BCEPShrubs and Vines of the BCEPTrees of the BCEPContact UsSupport the ReservesLinksButte Creek Ecological PreservePublic Use of BCEPDirections and MapsEducation and ResearchEducation and ResearchOutdoor ClassroomPlant Species of the BCEPPlant Species of the BCEPFerns and Allies of the BCEPGrasses of the BCEPHerbaceous Plants of the BCEPLichen of the BCEPShrubs and Vines of the BCEPTrees of the BCEPContact UsSupport the ReservesLinks\n        Our Office\n        Location IconEcological Reserves\n                                                                            3521 14 Mile House Road\n                                                                \n                                                                                Forest Ranch, CA 95942\n                                                                530-898-5010530-342-1371Mailing Address\n                                                                            Ecological Reserves-Research Foundation\n                                                                \n                                                                                25 Main St. Suite 203\n                                                                \n                                                                                Chico, CA 95928-5388\n                                                                    \n                Give a Gift\n    Current page:  BCEP\n                                        \n    \t\tButte Creek Ecological Preserve\n    \tDue to hazards from extensive Camp Fire damage, the BCEP is closed until further noticeOur Mission StatementThe Butte Creek Ecological Preserve and the CSU, Chico Research Foundation's Ecological Reserve System (including the Big Chico Creek Ecological Reserve) work together to preserve critical habitat and to provide a natural area for environmental research and education.What is the Butte Creek Ecological Preserve (BCEP)?The Butte Creek Ecological Preserve (BCEP) is a 93-acre site along the middle section of Butte Creek. The site was formerly used for gold, sand and gravel mining, and is recovering from those activities.The property contains more than a mile of creek frontage, as well as habitat for many species of special status, including the Western Pond Turtle and Yellow-legged Frog. Butte Creek is critical salmon habitat and spawning grounds for the largest population of Central Valley Spring Run Chinook, a state and federal threatened evolutionarily significant unit (ESU).In December 1998 the Chico State Research Foundation purchased this site with grants from the US Fish and Wildlife Service, National Fish and Wildlife Federation, CALFED, and the Wildlife Conservation Board.The goal of the Preserve is to work in conjunction with other programs toward achieving a reasonable balance among the diverse demands on the resource base of the Butte Creek watershed.The Reserves have adopted an adaptive management approach to managing the property. Program areas at the preserve include habitat management and conservation, outreach and education, and research. The Preserve is open to the public year round.Social MediaEvents via Facebook\n\nBig Chico Creek Ecological ReserveIf you need special accommodation to access any document on this page, please contact the Office of Accessible Technology (OATS): Call OATS (530-898-6532) | Email OATS.Chico State EnterprisesAdministration Office 25 Main Street, Suite 203 Chico, CA 95928-5388 www.csuchico.edu/cse(opens in new window)530-898-6811fdnadmin@csuchico.eduRelated OrganizationsBig Chico Creek Ecological Reserve(opens in new window)Provost & Vice President for Academic Affairs\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "public-use.shtml",
        "maps.shtml",
        "education-and-research/index.shtml",
        "education-and-research/outdoor-classroom.shtml",
        "species/index.shtml",
        "species/ferns-allies.shtml",
        "species/grasses.shtml",
        "species/herbaceous-plants.shtml",
        "species/lichen.shtml",
        "species/shrubs-vines.shtml",
        "species/trees.shtml",
        "contact.shtml",
        "support.shtml",
        "links.shtml",
        "index.shtml",
        "public-use.shtml",
        "maps.shtml",
        "education-and-research/index.shtml",
        "education-and-research/outdoor-classroom.shtml",
        "species/index.shtml",
        "species/ferns-allies.shtml",
        "species/grasses.shtml",
        "species/herbaceous-plants.shtml",
        "species/lichen.shtml",
        "species/shrubs-vines.shtml",
        "species/trees.shtml",
        "contact.shtml",
        "support.shtml",
        "links.shtml",
        "tel:530-898-5010",
        "tel:530-342-1371",
        "https://securelb.imodules.com/s/1751/wide.aspx?sid=1751&gid=2&pgid=405&cid=1058&dids=146.1.154&bledit=1&sort=1",
        "https://www.csuchico.edu/bccer/",
        "https://www.facebook.com/pg/bigchicocreekecologicalreserve/events/",
        "tel:530-898-6532",
        "mailto:oats@csuchico.edu",
        "https://www.csuchico.edu/cse/index.shtml",
        "tel:530-898-6811%20",
        "mailto:fdnadmin@csuchico.edu",
        "https://www.csuchico.edu/bccer/index.shtml",
        "https://www.csuchico.edu/vpaa/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}