{
    "title": "Neesa Sonoquie - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\n\n\nNeesa Sonoquie\n\n \n\n\n\n\t\t\t\t\t\tContact Neesa Sonoquie at \n\t\t\t\t\t\t\tnsonoquie@csuchico.edu\t\t\t\t\t\t\n\n\n\n\n\n \nIdentical Twins Follow Different Dreams \n\n\t\tRelying on each other for support, Vanessa and Viviana Mendoza discover their own identity in college.\t\n\n\n\n\n \nIntroducing Josephine Hernandez: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tAnimal science major Josephine Hernandez is an empathetic leader committed to inspiring future agricultural students and giving back to her field. \t\n\n\n\n\n \nIntroducing Hannah Scholzen: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tCivil engineering student and soon-to-be graduate, Hannah Scholzen, is a model of perseverance and leadership in her field.\t\n\n\n\n\n \nFond Farewell: Retired Painter Ronald Kohl Sr. \n\n\t\tRemembered for his humble spirit and strong work ethic, Ronald Kohl Sr. worked as a painter at Chico State for almost thirty years.\t\n\n\n\n\n \n5 Questions with Chico State Alumna and Business Owner Ava Moon \n\n\t\tChico State graduate and local artist, Ava Bloom, channels her independent spirit, commitment to sustainability, and love for creating art into new vintage boutique.\t\n\n\n\n\n \nFond Farewell: Retired Custodian Martha Ann Armocido \n\n\t\tRemembered as friendly, hard-working, and kind, Martha Ann Armocido worked as a custodian on campus for more than a decade. \t\n\n\n\n\n \nUniversity Faculty Awarded Prestigious Lantis Endowments \n\n\t\tChico State faculty shine as three professors are celebrated for their achievements in research and contributions to their fields.\t\n\n\n\n\n \nFond Farewell: Retired Director of Human Resources Dennis Frazier \n\n\t\tRemembered for his keen sense of humor, warm personality, and commitment to his work, Dennis Frazier directed human resources at Chico State for more than two decades.\t\n\n\n\n\n \nFond Farewell: Retired Religious Studies Professor Emeritus John Bash \n\n\t\tProfessor Emeritus John Bash, a distinguished teacher, mountain hiker, and world traveler, will be remembered as a friend and mentor to both students and colleagues.\t\n\n\n\n\n \nCollege Friends Make A Perfect Match for Organ Donation \n\n\t\tWildcat bonds truly do last a lifetime— when alum Bob Phillips needed a kidney, his former college roommate came to the rescue. \t\n\n\n\n\n \nFond Farewell: Former Director of Alumni Allen Sherwood \n\n\t\tRemembered as friendly, funny, and wise, Allen Sherwood directed alumni relations at Chico State for two decades.\t\n\n\n\n\n \nFive Questions with Certified Nurse Midwife and Alumna Kathleen Belzer \n\n\t\tNursing alumna and midwifery advocate Kathleen Belzer is driving diversity and equality in pregnancy and childbirth healthcare.\t\n\n\n\n\n \nBringing Mental Health to Light \n\n\t\tChico State alumni and family find healing through mental health awareness advocacy and the creation of a Senate bill to improve youth mental health in schools. \t\n\n\n\n\n \nFond Farewell: Passing of Retired Mathematics Professor Larry Dion \n\n\t\tMathematics and statistics professor Larry Dion will be remembered for his commitment and generosity.\t\n\n\n\n\n \nFond Farewell: Anthropology Professor Emerita Beverly Newbold Chiñas \n\n\t\tA visionary in cultural anthropology and scholar of women's studies in Latin America and beyond, Beverly Newbold Chiñas taught at Chico State for 26 years. \t\n\n\n\n\n \nStaff Awards Recognize Exemplary Employees \n\n\t\tStaff Council honors five employees for their customer service, safety dedication, Wildcat spirit, and overall awesomeness.\t\n\n\n\n\n \nChico State Honors Diversity and Inclusion on Campus \n\n\t\tNine faculty, staff, and students are honored with the 14th Annual Conversations on Diversity and Inclusion Awards.\t\n\n\n\n\n \nFive Faculty Receive Professional Achievement Honors \n\n\t\tRecipients of these annual awards are honored for exemplary teacher-scholar achievement at Chico State.\t\n\n\n\n\n \n2022 Hall of Honor Inductees \n\n\t\tMeet the 8 retired faculty members that the Emeritus and Retired Faculty and Staff Association's (ERFSA) inducted to the 2022 Hall of Honor.\t\n\n\n\n\n \nClass Notes: Spring 2022 \n\n\t\tWhether it's starting a new business, writing a book, or achieving a lifelong dream, the Wildcat family continues to reach milestones. Alumni share professional and personal updates for spring 2022.\t\n\n\n\n\n \nNursing Alum Puts LGBTQ+ Patient Care Policy into Practice \n\n\t\tJonathan Gurrola takes school project from the classroom to the community to advocate for equality in health care. \t\n\n\n\n\n \nCAGD Student Models Success for Those Underserved in Her Field \n\n\t\tFirst-generation student of color finds inspiration in close-knit family and campus CAGD community as she sets off for a new adventure after graduation.\t\n\n\n\n\n \nChico State Recognizes 2021–22 Outstanding Faculty \n\n\t\tThese awards—among the highest at CSU, Chico—celebrate the excellence of eight phenomenal faculty.\t\n\n\n\n\n \n5 Questions with CEO of the Boys and Girls Clubs of the North Valley and Alumnus Rashell Brobst \n\n\t\tAs a first-generation college graduate, Rashell Brobst channels her passion into serving the needs of underserved youth in her community.\t\n\n\n\n\n \n5 Questions with Ceramicist and Alumnus Douglas Leiker \n\n\t\tAfter establishing a pottery business post-graduation, Douglas Leiker realized an opportunity to expand into the cosmetics market. His business now has sales worldwide.\t\n\n\n\n\n \nTwelve Students Awarded Lt. Rawlins Merit Scholarships \n\n\t\tThe award—one of the largest and most prestigious at Chico State—celebrates scholarship, extracurricular activities, and outstanding academic and professional accomplishments.\t\n\n\n\n\n \nOffice Hours: Regenerative Agriculture Leader and Professor Cindy Daley \n\n\t\tProfessor Cindy Daley honors her roots through regenerative agriculture education and carbon-smart solutions to fight climate change.\t\n\n\n\n\n \nOffice Hours: Men’s Soccer Coach and Leadership Instructor Felipe Restrepo \n\n\t\tProfessor and coach Felipe Restrepo helps first-generation and underserved students win on and off the field.\t\n\n\n\n\n \nFive Questions with Alumnus and Micro-Farmer Garrison Harward \n\n\t\tFrom stage to Senegal, lighting technician and micro-farmer Garrison Harward builds a global community through climate-conscious gardening.\t\n\n\n\n\n \nOffice Hours: Electrical and Electronic Engineering Professor Hadil Mustafa \n\n\t\tLeading by example, professor Hadil Mustafa shows young girls and women that engineering isn't \"just for boys.\"\t\n\n\n\n\n \n5 Questions with Alumna and Motivational Speaker Alycia Anderson \n\n\t\tAlycia Anderson has used a wheelchair all her life. After a successful career in technology sales, she's pursuing a more personal passion—inspiring people to believe in their limitless potential.\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "mailto:nsonoquie@csuchico.edu",
        "https://today.csuchico.edu/identical-twins-follow-different-dreams/",
        "https://today.csuchico.edu/rawlins-josephine-hernandez/",
        "https://today.csuchico.edu/rawlings-hannah-scholzen/",
        "https://today.csuchico.edu/fond-farewell-ronald-kohl-sr/",
        "https://today.csuchico.edu/5-questions-with-chico-state-alumna-and-business-owner-ava-bloom/",
        "https://today.csuchico.edu/fond-farewell-martha-ann-armocido/",
        "https://today.csuchico.edu/lantis-endowments-2022/",
        "https://today.csuchico.edu/fond-farewell-dennis-frazier/",
        "https://today.csuchico.edu/fond-farewell-john-bash/",
        "https://today.csuchico.edu/college-friends-make-a-perfect-match-for-organ-donation/",
        "https://today.csuchico.edu/fond-farewell-allen-sherwood/",
        "https://today.csuchico.edu/five-questions-kathleen-belzer/",
        "https://today.csuchico.edu/bringing-mental-health-to-light/",
        "https://today.csuchico.edu/fond-farewell-larry-dion/",
        "https://today.csuchico.edu/fond-farewell-beverly-newbold-chinas/",
        "https://today.csuchico.edu/staff-awards-2022/",
        "https://today.csuchico.edu/codi-awards-2022/",
        "https://today.csuchico.edu/2022-professional-achievement-honors/",
        "https://today.csuchico.edu/2022-erfsa-hall-of-honor/",
        "https://today.csuchico.edu/class-notes-spring-2022/",
        "https://today.csuchico.edu/nursing-alum-lgbtq-patient-rights/",
        "https://today.csuchico.edu/outstanding-grad-erika-muniz/",
        "https://today.csuchico.edu/2022-outstanding-faculty/",
        "https://today.csuchico.edu/distinguished-alumna-rashell-brobst/",
        "https://today.csuchico.edu/distinguished-alumnus-douglas-leiker/",
        "https://today.csuchico.edu/2022-rawlins-recipients/",
        "https://today.csuchico.edu/office-hours-cindy-daley/",
        "https://today.csuchico.edu/office-hours-felipe-restrepo/",
        "https://today.csuchico.edu/five-questions-with-garrison-harward/",
        "https://today.csuchico.edu/office-hours-hadil-mustafa/",
        "https://today.csuchico.edu/5-questions-alycia-anderson/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}