{
    "title": "Meet our faculty | Stanford News",
    "body": "\n\n\n\n \n \n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\nSearch form\n\n\n\nSearch term\n\n\n\n\n\n\nHome\nFind Stories\nFor Journalists\nContact\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJanuary 10, 2022 Meet our faculty \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\nScholarship is at its best when it draws upon a diverse community. Here, Stanford faculty members share the life experiences and interests that fuel the dynamic learning environment on campus.\n\n\n\n\n\n\n\n\n\n\n\nImage credit: Andrew Brodhead \n\nElizabeth Reese\nAssistant professor of law\nNavi towa hahweh Yunpoví. Navi Americana hahweh Elizabeth Reese. Nah Nambé Owingeh we ang oh mu.\nMy name is Elizabeth Reese, Yunpoví, and I am from the Pueblo of Nambé. I was born in a house that was originally built by my great-grandparents out of traditional adobe brick, and I grew up praying in one of the oldest buildings on the continent.\nMy parents met as teachers at the Santa Fe Indian School. My mother is Pueblo and my father is from a small town in Pennsylvania, the seventh child of a Lutheran minister. Growing up, my mom took me to ceremony and instilled values from my Native culture and heritage, and my father—who loves history and the classics—read to me from Homer and took me to Shakespeare plays. I was navigating both cultures and worlds.\nWhen I was 4, we moved away from Nambé Pueblo to Champaign–Urbana, and that was really hard. I went from being in this very Indian world to being basically the only Indian family in town, where the university had an Indian mascot. Some of the other kids in my class would say things like, “You can’t be an Indian. All the Indians are dead.” Or, “You don’t wear feathers.” That hurt, but it was also profoundly confusing. There’s still so much mythology around native people as being this thing of the past, as being erased from contemporary existence in the United States.\nI’m not sure there was ever a moment when I knew I wanted to be a lawyer, or study law. What really happened was that I saw how much of our life on the reservation was dependent on federal law, from the price of gas and groceries to who answers a 911 call. It became clear to me that learning those rules and using them to fight and advocate for my community was something that could be really important.\nI also realized that there were not a lot of people who looked like me at the table, who were in a position to be telling the important stories about who we were and where we belong in the future of American law and society. I just knew that was wrong and I was going to do something about it. I knew that we deserved a say in our own destinies.\nThere are 574 tribal governments that are making and passing laws all across the United States, that govern as much territory as the state of California. One of the things I write about is just how powerful it is to start paying attention to these communities in a more real and robust way as part of what we think of in the American system.\nThat point does this beautiful thing, when it clicks for people: it shatters an invisibility that has been comfortably the status quo for far too long.\n Go to the web site to view the video.\n\nKurt Hickman & Julia James\n\n\n\n\n\n\nImage credit: Andrew Brodhead \n\nShare this card\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\n\nMargot Gerritsen\nSenior associate dean for educational affairs, professor of energy resources engineering, and senior fellow at the Precourt Institute for Energy\n“I grew up in the Netherlands, on a small peninsula not too far from the North Sea and surrounded by river estuaries. Our village was quiet and quite religious. Luckily, like most kids at that time, my siblings and I were pretty much free-range kids. We would take our little bicycles and bike everywhere. But on rainy days and Sundays, we were mostly inside the house, and I became a ferocious reader. Reading allowed me to escape, and dream of sunnier places. I was very young when I decided that I wanted to move away.\n“I’ve always loved math. In high school, it came easy to me, and I continued on with it at university because I was determined to challenge myself as much as I could; I’m a competitive person, and because there were such few women in the field, it was like, I’ve got to show people that I can do this. At the same time, I really wanted to be an ornithologist and study birds. I’ve also been interested in natural hazards and I was fascinated by fluid flow. I was pulled in multiple directions, but I realized that if I built a foundational background in math and physics I could keep all those doors open—be agile, move around, study different topics through the computational science and engineering lens. That’s exactly what I’ve done, and I’ve really enjoyed it.\n“I’ve always been one of the very few women in my field. It’s a lonely experience at times. People notice you, and when you’re different, you’re often also scrutinized. I remember, in undergrad, our grades were always displayed by our names on a big list by the classroom door. People would look for my grade—”Let’s see what Margot has.” And they would compare and contrast. That was not such a nice feeling. Particularly when you’re a woman who’s like I can be—I wouldn’t say I’m in-your-face, but I’m assertive, I’m active—you can feel quite vulnerable at times.\n“You could also say that being one of the few women in my field is what has given me a wonderful platform. I’ve always found that I could help make a difference to girls and other women, and that has been a big motivator for me. Even if I occasionally have trepidation or hesitation to do something, I tell myself, if I don’t do it, then other women may not do it.\n“I co-founded Women in Data Science in 2015. I sometimes call it a revenge conference, but that’s a bit too dramatic. It came from the frustration of, for the umpteenth time, seeing a conference with only male speakers, and the response to it being the same as well: “We looked everywhere, but we just couldn’t find any women.” We thought, You know what? We’ll just set up a conference showcasing outstanding women doing outstanding work—simply saying, “You’re looking for women? Here they are.” We sold out and realized we’d hit the nerve; it was almost as if people had been waiting for this to happen. Now we have 500 ambassadors and 230 events and reach tens of thousands of girls and women across the globe each year. I’ve never been part of a conference with such energy and so much positivity. We’re not lamenting the state of things for women; we’re celebrating outstanding individuals. And it feels so good.”\n\nShare Margot's story\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\nPortrait of Debbie Senesky\n\n\nDebbie Senesky\nAssistant Professor of Aeronautics and Astronautics\n“It’s an exciting time to be an aerospace engineer. There have been amazing breakthroughs in the field, such as the realization of rockets that can launch, land and launch again. My research group is developing micro- and nanoscale sensors that can survive and function within extreme conditions found on the surface of Mars, Venus or within rocket engines. It’s thrilling to think that our work could eventually impact space exploration.\n“Deciding which engineering problems to solve and how to pursue the best solutions can be challenging. After completing my doctorate, I didn’t know which career path to choose. I ended up taking a job in industry, which opened my eyes to the challenges of commercialization and taught me how to transition a design concept to an actual product. However, I realized that I missed being in an academic research environment, so I took a nontraditional path and became a postdoctoral researcher after working in industry. It was a risky career choice, and people close to me questioned my decision, but the move was a helpful deviation in my career path. As a postdoctoral researcher, I learned how to run a lab, mentor students, teach classes, write proposals, and eventually, I decided to pursue a career in academia. Now, as an assistant professor, my work is multifaceted – I’m never doing the same thing every day – and I get to work with amazing students.”\n\nShare Debbie Senesky's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\nJennifer DeVere Brody\nProfessor of Theater and Performance Studies\n“I come from a long line of academics, and that history has been hard-earned. My parents met in graduate school in 1959, and because they were an interracial couple, their marriage would have been illegal had they not been in a northern state. After they graduated, my father’s advisor reached out to a university through the ‘old boys’ network’ because this was before the U.S. Equal Employment Opportunity Commission had been established and before jobs were advertised publicly. My parents were told that the institution had met their quota for Jews and wouldn’t hire my mother because they didn’t accept black professors. Fast-forward 30 years, and they both got jobs at that same institution. Now that I’m the director of the Center for Comparative Studies in Race and Ethnicity, I get to drive the mission to increase faculty diversity and carry on their legacy. As a black queer scholar, I don’t often see my identity reflected in the faculty at Stanford, but we’re working to make this a place where everyone of all faiths and persuasions feels welcome and can pursue their interests, where we can learn from one another and have truly robust intellectual discussions.\n“I wouldn’t be where I am now if I hadn’t explored and stayed open to new conversations, possibilities and life paths. As an undergrad, I was a Victorian studies major, and early in my career I wanted to be a manuscripts librarian. One of the first fellowships I was awarded was at the British Library, where Marx used to study. While working there, I discovered 75 plays about black women and slavery in the 19th century and these ended up becoming an integral part of my first book project. About 15 years ago, I switched from English to theater and performance studies, which looks at a wider range of material than just the printed word. I’ve always loved thinking about the ways in which art is a matter of social justice. At one point, I thought I might want to be a museum curator, but I’m very glad I became a professor; I like the variety, the new questions that emerge and the opportunity to work with Stanford’s number-one asset – its brilliant students.”\n\nShare Jennifer Brody's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\nMichael Penn\nProfessor of Religious Studies\n“I had a three-year identity crisis in college, wrestling with the question of ‘Am I going to be a molecular biologist or a historian of ancient religion?’ I started out majoring in molecular biology, but during my second semester of college I randomly took an introductory course in world religion and fell in love with it. Unfortunately, I was at one of the few institutions that allowed you to choose only one major – no dual majors, no minors, no certificates, no study abroad. My loophole ended up being that there was no limit on the number of classes I could take. For the rest of college, I took classes toward my degree while also taking tons of courses in world religion, history, and languages. I wasn’t yet ready to let go of molecular biology, but I was increasingly passionate about history. Both fields offer a sense of discovery.\n“After graduating, I decided to pursue graduate work in ancient religions and became a professor of religious studies. At Stanford, I have the exciting opportunity to be part of large, collaborative research. I work with computer scientists, data scientists, and software developers, within and outside of our university. Some of my current research involves using advances in how computers analyze modern handwriting for security software to help match up handwriting from ancient scribes. This helps us figure out when manuscripts were written, by whom, and the connections between them. And I get to be one of the first to uncover these findings! I look at artifacts like ancient cow hides that haven’t been seen for over a millennium – precious pieces in a larger historical puzzle. It’s exciting to discover new parts of history and share that context with the world, bringing light to our past as well as our present.”\n\nShare Michael's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\nAllison Okamura sitting in her lab\n\n\nAllison Okamura\nProfessor of Mechanical Engineering\n“I’m always looking for ways to make connections between humans and science. I’m currently studying the development of an artificial sense of touch for humans, particularly for its applications in medicine and rehabilitation. I’ve always been interested in human-machine interactions, but I didn’t always know I wanted to be an engineer. When I first entered college, I was considering becoming a lawyer because I like working with people. But then I took an introductory mechanical engineering class and fell in love with the field when I discovered how technology allows you to directly improve people’s lives.\n“Part of our research efforts to improve the future of human health and quality of life is developing minimally invasive medical robots for pediatric patients. These robots demonstrate enormous potential because they can precisely execute difficult maneuvers. Although some successful surgical robots exist, they’re too large for use on small children in certain procedures. One idea we’re pursuing is personalized surgical robots. These are made possible through 3D printing, medical imaging and virtual modeling — which would allow mechanical engineers and surgeons to work together to create robots customized for an individual’s body and needs. These tailored machines would minimize the invasiveness of operations and advance the precision of procedures, significantly reducing patients’ recovery time and risk of infection.\n“To introduce robotics to groups that would otherwise be underrepresented in our field, my lab runs an outreach program to conduct introductory engineering sessions with small groups of students. We demonstrate what robots can do outside of the movies and show them what a diverse team can look like in practice. I strive to make my lab a good role model for diversity, and outreach allows me to share my vision for inclusion with more of the world, as well as provides the opportunity to positively influence younger generations.”\n\nShare Allison's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\nHeike Daldrup-Link\nProfessor of Radiology\n“In 2003, my father was diagnosed with a very aggressive form of prostate cancer. I was a junior pediatric radiologist at that time, and because I was the only physician in the family, he kept calling me to go over his results. He believed that I could figure out the cure. At one point during his treatment, he called and said, ‘I had a bone scan and there were all these tumor areas on the scan. What does this mean?’ After seeing the degree to which his cancer had progressed, it was clear that that there was no cure for him. In that moment, I didn’t know what to say to my father. He had so much hope and trust that I could come up with the right treatment. But there was nothing I could do to save him. Even now, I feel that sense of helplessness when working to save a patient. It’s always on my mind: I couldn’t help save my father, but I’m continuing to learn and improve our techniques so that I can help save many others. It feels like a tribute to him every time we’re able to save a child.\n“With each patient at Stanford, I feel like every member of our team puts their whole heart into trying to heal every child. In pediatric oncology, as opposed to adult oncology, many children have a pretty good chance of being cured. It’s really satisfying when we can say, ‘We worked together as a team and this kid made it.’ The flipside is that it’s heartbreaking when treatment ultimately fails. We have an incredibly involved and caring oncology team. The oncologists are available around the clock. For example, on one recent Friday we had a newly diagnosed child and the next day, Saturday, everybody on the team – our oncologist, orthopedic surgeon, research associate, myself – were exchanging emails about this new patient. The child had a first biopsy that Friday, came in the following Monday for their first orientation, had a second biopsy the following day, another scan that afternoon and a final scan the next day. After that, we had a full diagnosis and could start their therapeutic plan. When a child is diagnosed with cancer, it’s a major catastrophe for the entire family. Waiting is not an option, and we don’t have the luxury of time. We work as quickly as we can to have everything in place so that we can start the plan as soon as possible, together.”\n\nShare Heike's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\nPortrait of Nadeem Hussain\n\n\nNadeem Hussain\nAssociate Professor of Philosophy\n“This past year, I took physics, math and chemistry courses with freshmen. It’s much easier the second time around – I’ve figured out how to learn! When you spend your time as a teacher carefully trying to explain things to others, it makes you better at understanding others’ explanations. Indeed, one of my professors last year taught me physics when I was a Stanford undergraduate. These classes may seem like they don’t have much to do with philosophy, but to make real progress on some central philosophical questions we need to look carefully at the interconnections between philosophy, science and mathematics.\n“I think philosophy has often not been taught effectively. We often throw students in the deep end of the swimming pool by giving them difficult classics or hard contemporary research articles. More students would be interested in the humanities if they were given courses that met them where they are. I’ve also been studying non-Western intellectual traditions in the hopes of redesigning my classes so that they do a better job of assessing why we’ve ended up doing the kind of philosophy we do. We need to give our students the tools of rational, critical thinking so that they can engage in difficult conversations even when their disagreements are generated by deep differences in background worldviews.”\n\nShare Nadeem Hussain's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\nImage credit: Holly Hernandez \n\nSean Reardon\nProfessor of Poverty and Inequality in Education\n“I always imagined myself as a teacher or a professor. I liked the idea of it. My dad used to call me ‘doctor’ when I was a little kid, as in PhD, doctor. I suppose that’s because I was always trying to teach people things.\n“Over time, my interests shifted. By the time I entered college, I didn’t expect to go to graduate school in education or to become a professor in that field. After my undergraduate studies, I was all set to begin a doctorate in comparative literature. But the summer before I was supposed to begin, I got cold feet and decided to give teaching a formal try. I had been a student for so long, and beginning a doctorate was just signing up for more time as a student, studying theories and abstract ideas. I wondered what the experience might be like on the other side, with much more practical applications. I found a position as a volunteer teacher on the Pine Ridge Indian Reservation in South Dakota, in a very poor county. They needed someone to teach English, so on a few weeks’ notice I moved out there and ended up teaching high school students for two years. It felt real in some way that mattered. After that, I left to pursue a doctorate in philosophy, but within months I missed teaching. I scrambled to find another teaching position, and I got a job at a Quaker school in a wealthy part of New Jersey, where I taught high school math for a couple years. Although I was in a completely different setting, I loved this teaching job as much as the last. I felt that same sense of making a difference in people’s lives.\n“My experience taught me that you can’t plan it all out. Doing the thing that’s interesting to you now usually leads you somewhere that’s interesting in the future, even if you don’t know where exactly that will be. My experience of seeing the two Americas—some of the poorest and richest parts of the country—naturally made me think a whole lot about inequality and the different kinds of opportunities kids have growing up in different places. When I finally went back to graduate school, I got a doctorate in education with a focus on race and inequality. I’ve been doing that kind of work ever since. A recent project I’m proud of is the launch of a new interactive data tool that allows users to generate charts, maps, and downloadable PDFs to illustrate and compare educational opportunity data from individual schools, districts, or countries. The tool is part of the Educational Opportunity Project, an initiative I direct in support of efforts to reduce educational disparities throughout the United States.”\n\nImage credit: Holly Hernandez \n\nShare Sean's story\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\nPortrait of Ge Wang\n\n\nGe Wang\nAssociate Professor of Music\n“Anything worth designing is worth designing beautifully. There’s an art to shaping our world in a way that’s both useful and human. Only recently have I realized that my work with music and technology is unified by design, specifically a notion of ‘artful design.’ We can’t simply ‘smush’ disciplines together and hope things work out – and design is how we fit all the elements together in the right place and order to create something new. Stanford is a place where creative things happen naturally at the intersection of many different disciplines, and such an intersection is where I work and play. And the weather here is pretty good, too.\n“It’s not enough to follow your interests – you have to fight for them. Back when I was an undergrad, there was no academic program that combined computers, music and design. Even as I pursued it out of interest, it was with constant doubt in my mind: ‘By doing this, am I shooting myself in the foot, or ultimately making myself unemployable?’ The one reassurance was knowing that if I were to ‘fail,’ it would be without regret because it was done out of solid interest. Looking back, life feels like a feedback loop, and I seem to be living what I am working on. And much like the book I’m currently writing, and the design process itself, I have no idea how it will turn out – and along the way, it’s enjoyable, sometimes agonizing, but always filled with curiosity.”\n\nShare Ge Wang's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\n (Image credit: Holly Hernandez) \n\nRichard Banks\nProfessor of Law and, by courtesy, of Education\n“I’m not sure what grade my father completed, but I know he didn’t graduate high school. He was a barber, and he ran a shop with his brothers. They were well-known in Cleveland: if you wanted a proper haircut, you went to the Banks Brothers. He was a very smart and philosophical man but didn’t have much formal education. He envied people who did. If he met someone who was a lawyer, it was a big deal to him to know someone who’d achieved that status.\n“The last chance I had to spend time with him was when I graduated from Stanford undergrad. He suffered from high blood pressure and prostate cancer, and his health went into a steep decline after a heart attack. Before he left the hospital to come to my graduation, the doctor told him not to go, that he wasn’t strong enough for the trip. My father shared with me that he told the doctor he was going to be at my graduation if he had to crawl. My mother had passed away when I was nine, so he was my only living parent. He made it, and that was the last time my family was together before he died. We had a different experience of Commencement compared to most families because he was so sick and I only had my dad and my sisters, but it meant a lot to me.\n“It wasn’t until after his death that I decided to go to law school. He’d always wanted me to go to Harvard, which I refused. We had a big fight about it — one of the biggest fights of our life. He’d known someone else whose son went to Harvard and he wanted me to go too, but I refused to apply. He knew so little about college that I think Harvard may have been one of the only names he knew, but he knew that everyone else knew it, too, so that it must be good.\n“After everything, I ended up going to Harvard Law. I applied about a year and a half after he died. It was in the wake of his death that I decided to go. Truth be told, in retrospect, I think it was partly a way to please him because of how much he had always respected lawyers – even if he wasn’t alive to see me become one. I was also drawn to Law because it’s a place where ideas meet the world. I get to think about the connections between big abstract issues and the concrete issues that arise in people’s lives.”\n\n (Image credit: Holly Hernandez) \n\nShare Richard's story\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\nPortrait of Paula Moya\n\n\nPaula Moya\nProfessor of English\n“Stories – narratives – are very powerful. I love literature for what it can teach us, what it makes us feel and how we use it to communicate with each other. The first book I remember really affecting me was the children’s book Striped Ice Cream by Joan Lexau. It moved me deeply. Raised in Santa Fe, New Mexico, I grew up around Mexican Americans and Native Americans. I did not know any African Americans at the time and would not meet any for several years. And so the book powerfully framed my understanding of what kind of people African Americans might be. The experience provided an early lesson in the power of narrative to create understanding and foster empathy.\n“As much as I loved reading as a child, I did not always know that I would – or even could – be a professor. And my path to Stanford was by no means a smooth or straight one! Few people know that for the first 10 years of my young adulthood, I was involved in electoral politics in Houston, Texas – I was, in fact, a political wife. At that point, I would never have believed it if you told me that I would ever be a professor at Stanford.\n“But my love of reading and my desire to seek out answers to some of humanity’s most fundamental questions took me on the path to graduate school and academia. Now, in my ongoing conversations with scholars across the disciplines, I research how narrative shapes the schemas through which people understand race and other significant issues in the world today.”\n\nShare Paula Moya's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\nAditi Sheshadri\nAssistant professor of earth system science\nWhen I was very little, I wanted to be an astronaut. But it didn’t seem like it was an achievable goal. As I grew up, I continued to be interested in space and astronomy. I thought a lot about propulsion and things like that, I guess because I wanted to be like my dad, who’s a professor of aerospace engineering, and because I was reading a whole lot of science fiction. Arthur C. Clarke and Isaac Asimov were particular favorites.\nI did my bachelor’s degree in Bangalore, in India. There were about 130 of us in the class doing mechanical engineering as a major. I was the only woman. I ended up at MIT in a PhD program in aeronautics and astronautics. It wasn’t a great fit. So I sort of sidestepped and got a PhD in atmospheric science instead. I already knew all the fluid dynamics, and I realized I could apply those skills to the climate problem, which is beautiful and fundamental and basic, but also has an immediate, practical importance in human lives.\nI do a lot of idealized modeling, which means that, for instance, I make up an ocean world in which there are no continents, and I ask, in some approximate scaling, can we come up with a theory about how many hurricanes we would expect under very different circumstances? One thing I find compelling in this work is that the small scales really affect the large scales. If you look down at the Earth from space, you see this whole range of motion, from little poofs to organized bands of clouds. They all impact weather and climate. I love this interplay between small and large and different time scales.\nI don’t have a unified theory for dealing with people. I’m not a people person, except in the scientific context, I totally am. I’ve been having a whole lot of fun getting to know my colleagues across the world. I very much enjoy interacting with people who are thinking about similar sorts of problems in potentially different ways, and learning from them.\nIn science, there are so many times you feel like things aren’t going to work out. But you’ve just got to keep going. It’s all about curiosity and persistence.\n\nShare Aditi's story\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\nPortrait of Grant Parker\n\n\nGrant Parker\nAssociate Professor of Classics\n“Studying the ancient Romans is like doing a 1,000-piece jigsaw puzzle with only 53 pieces. When studying contemporary society, there’s no shortage of source material. With the Romans there’s much less, so we need to be creative to fill in the picture and bring it to life. I want to show students the rich variety within ancient cultures and their afterlives. They’re much more than just the columns outside the Supreme Court building. Let’s try to understand the hopes and fears of different communities around the ancient Mediterranean, even if they’re not the ones whose texts have survived.\n“I focus on what happens when different groups of people come into contact: What persons, ideas and objects can we discern? What kinds of impact are involved? Generally speaking, it’s the victors that tell the stories, so we need to look for ways of going beyond that. It’s an intellectual challenge, but also an ethical one. In such ways we need a critical and self-aware dimension in our research. Stanford makes it easy to collaborate with scholars from different fields, and this has helped me develop a broader approach. In studying any society, ancient or not, language deserves to be a key element whenever possible. Regardless of your field, you can never know enough languages. Studying languages – even just a little bit, and even if a language is no longer anyone’s mother tongue – is fundamental if we’re going to be humble, respect different perspectives and see the breadth of human experience.”\n\nShare Grant Parker's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\nHeather Hadlock\nAssociate Professor of Music\n“As an undergraduate, I double majored in history and music; at that point I didn’t really understand that they could be intertwined. It wasn’t until I was a senior in college that one of my professors suggested that I pursue musicology, which is the study of the history of music. Earlier this year actually, my mother told me, ‘When you went off to study musicology in grad school, we didn’t know what you were doing, but we kept our mouths shut.’ And I’m thankful that my family didn’t plant a seed of doubt or skepticism back then, because I see that anxiety in more and more students: There’s reluctance to study something without a clear path toward a job and supporting oneself. I remember that sense of uncertainty myself as I searched for an environment where I could immerse myself in music, its history, and how it intersects with and informs our understanding of the world today.\n“I think the performing arts are exciting because they always have to be reincarnated: A musical score is a set of instructions from the past, and you need live people to reanimate it. So a musical work exists in multiple eras, from the moment it was first created through the most recent performance. The work I do on gender in opera is a perfect example of that. We can explore how changing ideas about gender inform our perception of operas from the past and our performances of them now. The gender systems and values of the past have changed so much, and we come to old artworks with new questions about modern people, voices and new ideas about gender and sexuality. The arts are a wonderful place where the past and the present are in conversation. And here at Stanford, people are constantly in conversation with one another. During my time as the director of the Program in Feminist, Gender and Sexuality Studies, I saw how faculty and students in different disciplines were incredibly engaged with their material and with one another. People are very intellectually generous here.”\n\nShare Heather Hadlock's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\nJennifer Eberhardt\nProfessor of Psychology and, by courtesy, of Law\n“Both of my parents passed away at a pretty young age, in their 50s. My father was a mailman and an antique dealer on the side, and my mother was a data entry clerk working at the federal building in downtown Cleveland. After I completed graduate school, and before my mother told me she was dying, she shared that seeing how far I could go in education had made a real impression on her, and that she wanted to follow in my footsteps. She decided to pursue a bachelor’s degree in urban studies and went on to complete her degree. I didn’t realize I could have that kind of influence on someone I loved just by doing what I loved. Going to college was a big change for her late in life, and I’m really proud of how she took that leap and seized the opportunity to advance her education. It encouraged me to keep doing more of the same.\n“When I was twelve, we moved from an all-black neighborhood to an all-white neighborhood. My parents knew there was a better school system in the new neighborhood, and they wanted to try to give us a chance at better educational opportunities. I think that move got me very interested in race and inequality. In the new neighborhood, it was expected that most of the kids would go to college and do great things. I felt like I was on a different path than I would’ve been had we stayed in the old neighborhood, where it wasn’t the expectation that people would go to college. Most people there didn’t pursue degrees. I think that experiencing this racial divide and seeing the discrepancies between the two communities is what first made me want to investigate human behaviors and interactions, and my current research addresses significant social issues such as bias, discrimination, and inequality. The idea that we can use science as a way to explore possible solutions to significant problems is really exciting to me. Social science research provides me with a unique avenue for contributing to society – while also inspiring others to pursue what they’re most passionate about.”\n\nShare Jennifer's profile\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\n\n\nIn The Spotlight\nFaculty & Staff\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nScience & Technology\nA better, faster tool for saving water on farms\nA new tool for designing and managing irrigation for farms advances the implementation of smart agriculture, an approach that leverages data and modern technologies to boost crop yields while conserving natural resources.\n \n\n\n\n\n\n \nScience & Technology\nBanking on nature\nThe Natural Capital Project is working with development banks and 10 pilot countries to put the environment at the forefront of policy and investment decisions.\n \n\n\n\n\n\n \nLaw & Policy\nBeyond the room where it happened\nYou may have given little thought to the role Native Americans played in the creation of the U.S. Constitution. But SLS scholars argue that Native people profoundly shaped the conversation.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Report\nTo receive Stanford news daily,\nsubscribe to Stanford Report.\n\n\nFor Journalists\n\nPress Releases\nMedia Contacts\nStanford Experts\n\n\n\nSee Also\n\nContact Stanford News\nFaculty / Staff Resources \n\n\n\n\nEvents\n\nEvents calendar\n\n\n\nStanford News is a publication of Stanford University Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/find-stories/",
        "https://news.stanford.edu/for-journalists/",
        "https://news.stanford.edu/contact/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23elizabeth-reese",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23margot-gerritsen",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23debbie-senesky",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23jennifer-devere-brody",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23michael-penn",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23allison-okamura",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23heike-daldrup-link",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23nadeem-hussain",
        "https://edopportunity.org/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23sean-reardon",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23ge-wang",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23richard-banks",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23paula-moya",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23aditi-sheshadri",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23grant-parker",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23heather-hadlock",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942%23jennifer-eberhardt",
        "https://news.stanford.edu/section/spotlight/",
        "https://news.stanford.edu/section/faculty-staff/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D11942",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://news.stanford.edu/section/science-technology/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://news.stanford.edu/section/law-policy/",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "/report/subscribe/",
        "/press-releases/",
        "/contact/media-contacts/",
        "/experts/",
        "/contact/",
        "http://ucomm.stanford.edu/facstaff/",
        "http://events.stanford.edu/",
        "https://ucomm.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}