{
    "title": "Knight-Hennessy Scholars program announces pioneer cohort of future leaders | Stanford News",
    "body": "\n\n\n\n \n \n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\nSearch form\n\n\n\nSearch term\n\n\n\n\n\n\nHome\nFind Stories\nFor Journalists\nContact\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFebruary 15, 2018 Knight-Hennessy Scholars program announces pioneer cohort of future leaders The inaugural group of 51 students is 57 percent women and includes citizens of 21 countries pursuing degrees in 31 Stanford graduate departments. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\nJohn Hennessy chats with finalists when they gathered on campus in January to begin a weekend of events. (Image credit: L.A. Cicero)\n\nThe Knight-Hennessy Scholars program has announced 51 students from around the world for its inaugural cohort of scholars.\nScholars will pursue graduate degrees in 31 departments across the university at all seven of Stanford’s schools: Business; Earth, Energy & Environmental Sciences; Education; Engineering; Humanities and Sciences; Law; and Medicine.\n“We have selected students who believe strongly in the pressing need for better leadership across all disciplines, and around the globe,” said John L. Hennessy, Shriram Family Director of Knight-Hennessy Scholars.\nHennessy called each selected scholar to share the news of their admission to the program. “Their reactions were inspiring,” said Hennessy. “There is a true optimism among this group that they can make a positive impact in the world, and that their time as Knight-Hennessy Scholars will help prepare them for that mission.”\nAlong with Hennessy, who served as the university’s 10th president from 2000 to 2016, the program is named for alumnus Phil Knight, MBA ’62, philanthropist, business leader and co-founder of Nike Inc., who is contributing $400 million to back the program.\n“This program brings together the best students from around the globe,” Knight said. “I expect they will become leaders in all sectors, both public and private, and find breakthroughs that will improve the world.”\nAnnounced in 2016, the program aims to prepare a new generation of leaders with the deep academic foundation and broad skill set needed to develop creative solutions for the world’s most complex challenges.\nScholars will receive financial support for the full cost of attendance for their graduate education at Stanford. Through the King Global Leadership Program, funded by a gift from Robert King, MBA ’60, and his wife, Dorothy, scholars will build on their core degree programs with leadership training, mentorship and experiential learning across multiple disciplines. The King’s gift will also help support scholars from less economically developed regions of the world.\nCohort profile\nIn its first year, the Knight-Hennessy Scholars program received 3,601 applications from around the world. The primary admission criteria when evaluating applicants were independence of thought, purposeful leadership and a civic mindset. Applicants were also required to apply to and be admitted by the Stanford graduate program of their choice.\n“The scholars we selected are not just outstanding academically,” said Jeff Wachtel, the program’s executive director. “Each exhibits the humility, kindness and empathy that establish the foundation for future cohorts of Knight-Hennessy Scholars, and that we hope will redefine global leadership.”\nAn initial profile of the selected cohort is as follows:\n\nWomen comprise 57 percent of the selected scholars, including 67 percent of doctoral students in engineering.\n63 percent of scholars hold non-U.S. passports, from 20 countries, including Afghanistan, Argentina, Australia, Canada, China, Colombia, Egypt, Germany, India, Israel, Italy, Mexico, Myanmar, New Zealand, Nigeria, Romania, South Korea, Syria, Tajikistan and the United Kingdom.\nThe scholars earned undergraduate degrees at 38 institutions, including:\n\nthree each from Harvard University, Stanford University and Yale University\ntwo each from Brown University, Dartmouth College, Georgia Institute of Technology, Massachusetts Institute of Technology, Ohio State University, Princeton University and Rice University\none each from Bowdoin College, California Institute of Technology, Claremont McKenna College, Colorado School of Mines, Columbia University, Duke University, Imperial College of London (England), Instituto Tecnologico Autonomo de Mexico, Middlebury College, New York University, Northwestern University, Ovidius University (Romania), Peking University (China), Santa Clara University, Tufts University, Universidad de los Andes (Colombia), University of Calgary (Canada), University of California, Berkeley, University of Chicago, University of Illinois (Urbana-Champaign), University of Lagos (Nigeria), University of Michigan (Ann Arbor), University of North Carolina (Chapel Hill), University of Toronto (Canada), University of Vermont, University of Western Australia, U.S. Naval Academy and Williams College.\n\n\nFirst-generation U.S. citizens comprise 23 percent of those selected.\nFirst-generation college students comprise 12 percent of those selected.\n\nDomestic and international outreach for the 2019 cohort is already underway, with plans to host over 100 information sessions in more than 30 countries. The application for the 2019 cohort of Knight-Hennessy Scholars will open May 1 and is due Sept. 12, 2018.\nPreparing for scholars’ arrival\nConstruction on Denning House, the future home of the Knight-Hennessy Scholars program, is underway on the shore of Stanford’s Lake Lagunita. The building will have classrooms; meeting, lecture and discussion rooms; and a dining space for dinners and events.\nA gift from Roberta Bowman Denning, ’75, MBA ’78, and her husband Steven A. Denning, past chair of the Stanford Board of Trustees, MBA ’78, made the building possible.\nAn artist-in-residence program will also bring emerging and established artists to campus to pursue their art practice and interact with scholars.\n“The art program at Denning House will allow scholars to engage with significant global artists who are poised to make a lasting impact,” said Roberta Denning, former chair of Stanford’s Arts Advisory Council. “The arts will be an important part of the Knight-Hennessy experience, strengthening our scholars’ ability to lead across disciplines and cultures.”\nAn orientation for the pioneer cohort of Knight-Hennessy Scholars and a dedication ceremony for Denning House are planned for fall 2018.\n\n\n\n\n\n\n\n\n\n\n\n\nUniversity Affairs\nInternational\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nScience & Technology\nA better, faster tool for saving water on farms\nA new tool for designing and managing irrigation for farms advances the implementation of smart agriculture, an approach that leverages data and modern technologies to boost crop yields while conserving natural resources.\n \n\n\n\n\n\n \nScience & Technology\nBanking on nature\nThe Natural Capital Project is working with development banks and 10 pilot countries to put the environment at the forefront of policy and investment decisions.\n \n\n\n\n\n\n \nLaw & Policy\nBeyond the room where it happened\nYou may have given little thought to the role Native Americans played in the creation of the U.S. Constitution. But SLS scholars argue that Native people profoundly shaped the conversation.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Report\nTo receive Stanford news daily,\nsubscribe to Stanford Report.\n\n\nFor Journalists\n\nPress Releases\nMedia Contacts\nStanford Experts\n\n\n\nSee Also\n\nContact Stanford News\nFaculty / Staff Resources \n\n\n\n\nEvents\n\nEvents calendar\n\n\n\nStanford News is a publication of Stanford University Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/find-stories/",
        "https://news.stanford.edu/for-journalists/",
        "https://news.stanford.edu/contact/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D18951",
        "https://knight-hennessy.stanford.edu/program/scholars",
        "https://news.stanford.edu/2016/02/23/scholars-program-announce-022316/",
        "https://news.stanford.edu/2017/02/07/knight-hennessy-scholars-program-identifies-admission-criteria/",
        "https://news.stanford.edu/section/university-affairs/",
        "https://news.stanford.edu/topic/international/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D18951",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://news.stanford.edu/section/science-technology/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://news.stanford.edu/section/law-policy/",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "/report/subscribe/",
        "/press-releases/",
        "/contact/media-contacts/",
        "/experts/",
        "/contact/",
        "http://ucomm.stanford.edu/facstaff/",
        "http://events.stanford.edu/",
        "https://ucomm.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}