{
    "title": "The Global Dean | Chapman Newsroom",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nFind information for\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\n\nDegrees\n\n                & Programs\nMaps &\n\n                Directions\nAll Directories\nNews\nEvents\n\nSocial\n\n\n\n\n\n\n\nfacebook\n\n\n\n\n\n\n\ntwitter\n\n\n\n\n\n\n\npinterest\n\n\n\n\n\n\n\ninstagram\n\n\n\n\n\n\n\n\n\nyoutube\n\n\n\n\n\n\n\nlinkedin\n\n\n\n\n\n\n\n\n\nsnapchat\n\n\n\n\n\n\n\ntumblr\n\n\n\n\n\n\n\nitunes\n\n\n\n\n\n\nSocial hub\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\nNewsroom\n\n\n\n\n\n\n\n\nTopics\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind\n\n\n\n\n\n\n\n\n\n\nLog in\n\n\n\n\n\n\n\n\n\n\n                    Login\n\n                  \n\n\n\n\ncanva icon\n\n\nCanvas\n\n\n\n\n\n\n\n\n\n\n\n\n\nHandshake\n\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty & staff) \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n              Chapman University\n\n            \n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nChapman Newsroom\nMain Menu >\n\n\nTopics\n\n\nToggle\n\n\n\n\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\n\nToggle\n\n\n\n\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\nMain Menu\n< Chapman Newsroom \n\n\n\nAbout\n\n\n\nToggle About\n\n\n\n\n\nMaps & Directions\nVisit Chapman\nDiscover Chapman\nFacts & Rankings\nLeadership\nCampus Services\nConnect\n\n\n\nAcademics\n\n\n\nToggle Academics\n\n\n\n\n\nDegrees & Programs\n\nSchools & Colleges\nAcademic Calendar\nFaculty Directory\nLibraries\nCourse Catalogs\nInternational Study\n\n\n\nAdmission\n\n\n\nToggle Admission\n\n\n\n\n\nUndergraduate Admission\n\nUndergraduate Application\nGraduate Admission\nGraduate Application\nAffordability\nFinancial\n\n                    Aid\n\n                    Calculator\nCampus Tours\n\n\n\nAlumni\n\n\n\nToggle Alumni\n\n\n\n\n\nEvents\nGet Involved\nCareer\n\n                    Support\n\n\nArts\n\nCampus Life\n\n\n\nToggle Campus Life\n\n\n\n\n\nAthletics\nDiversity & Inclusion\nEvents\nFish Interfaith\n\n                    Center\nHealth & Safety\nResidence\n\n                    Life\nStudent Life\n\n\n\nResearch\n\n\n\nToggle Research\n\n\n\n\n\nPre-Award\n\n                    Administration\nPost-Award\n\n                    Administration\nResearch Integrity\nInstitutes &\n\n                    Centers\nCenter for\n\n                    Undergraduate\n\n                    Excellence\nGraduate Research\n\n                    Support\n\n\n\nSupport\n\n\n\nToggle Support\n\n\n\n\n\nContact Development\nGet Involved\nAreas to\n\n                    Support\nAlumni Involvement\n\n\n\n\n\n\nFind information for...\n\n\n\nToggle Find Information By Audience\n\n\n\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\nDegrees & Programs\nMaps & Directions\nAll Directories\nNews\nEvents\nSocial\n\n\n\n\n\n\n\n\n\n\n\n\n\n45th Economic Forecast \nGet Chapman Experts' Projections\n\n\nREAD MORE\n\n\n\n\n\n\n\nShare via Facebook Share via Twitter Share via Reddit Share via Pinterest Share via Email Share via LinkedIn \n Print Friendly\n\n\n\n\n\n\n Henrik Cronqvist, dean of Argyros School of Business and Economics.\n\n\n\n\nBusiness & Economy \nThe Global Dean From Stockholm to Chicago, Miami to the metaverse, Henrik Cronqvist goes the distance in developing his vision for the future of business education.\n Joy JuedesFebruary 2, 20237 min read\n\n\nIf Henrik Cronqvist’s thoughts were visible, they might look like a live stock index.\nCronqvist has been dean of Chapman University’s Argyros School of Business and Economics for less than a year, and he has already mobilized his vision for business education that meets industry and leadership demands of the next decade and beyond.\nWhere to start? Adding a “metaverse” executive to the faculty; more collaboration with Chapman’s No. 4-ranked film and media college; meeting the growing demand for data analytics; offering a STEM-specialized MBA; a brand-new Asia Pacific initiative.\nAnd that’s just in 2023.\nOr, as Cronqvist put it at Chapman’s 45th Economic Forecast in December, “No other business school has progressed as much as this business school in such a short period of time.\n“That said, we have our best years ahead of us.”\nFrom Sweden to American academia\nCronqvist’s own trajectory toward business higher education started in his native Sweden, where he grew up in a town of 2,500.\nHe had been interested in economics and finance – particularly the stock market – since high school.\nHe decided to study economics, earning his MS from the Stockholm School of Economics. His thesis advisor there introduced him to some of his former students who had gotten Ph.D.’s in the United States.\n“Although I am a first-generation student, I was really intrigued by the prospect of a research career,” Cronqvist said.\n In 1999, he began his doctoral work in finance at the University of Chicago. His doctoral advisor was Richard Thaler, who won the Nobel Prize in 2017 for his work in behavioral economics.\n“Working with him and understanding how he thought about research projects and questions was a defining moment in my career,” said Cronqvist, who witnessed Thaler receive the Nobel in Cronqvist’s home country.\nBehavioral economics became Cronqvist’s academic path. He now studies the behavior of investors and executives – one of his most recent published pieces is “The Social CEO.”\n“CEOs, like humans more generally, are a product of their environment, beginning from birth and continuing with the various experiences throughout life,” Cronqvist writes with his co-author. “The compilation of these experiences determines not only the individual’s human and social aspects but also the policy direction of their firm.”\nFrom local economies, to global partnership, to the metaverse\nAfter Chicago, Cronqvist continued in American academia, teaching finance in the Midwest, China and Southern California. He landed in Florida and rose to vice dean at the University of Miami’s business school.\nAt Miami, he helped implement the school’s own stock index, an idea he is bringing to Chapman.\nThe two indices will track California and Orange County companies using Standard & Poor’s and will be copyrighted to Chapman. Cronqvist said he doesn’t know of another university in the state with a stock index.\n“When I joined Chapman, many people told me, ‘Chapman is a hidden gem in Southern California.’ And I said to myself, ‘Why do we hide? What are we hiding from?’” he said.\n“So we are going to move from being a hidden gem to just being a gem.”\nAs a global citizen, Cronqvist believes that Chapman “has gone from a local to a regional institution that is now making a sort of a leap into the national arena and also the global arena.”\nAs an educator and financial expert, Cronqvist gives concrete examples of his vision for how Chapman is making that leap – while holding to its history of economic research.\n“We are starting out based on 45 years of economic forecasting with President Emeritus Jim Doti and others,” he said. “There has been a tradition here at the Argyros School of providing very helpful information for businesses that was focusing on local, regional, then national information.”\nPart of Cronqvist’s vision includes the metaverse – a still-evolving concept of a central virtual world parallel to ours. \n“I think the metaverse is an intriguing concept and that’s why we wanted to beef up everything we do around that,” he said.\nHe wants to appoint an esports and gaming executive as “metaverse executive in residence” who will offer industry panels, career advice and courses.\nThe metaverse – which encompasses anything in cyberspace and how humans interact with it – is a multibillion-dollar industry with a range of jobs. Cronqvist said one of Chapman’s career experts was recently “inundated” with inquiries about working in gaming and esports.\n“There’s a lot of interest among young people for those products, and we’re in an area of the country where this is a very important industry,” he said. “We need to be able to meet demand among our students.”\nMeeting industry demand\nCronqvist emphasized how important experiential learning is to him – “that we learn not only in the classroom, but also through projects out with real companies, simulation exercises, through team-based education.”\nThis relates to corporate partnerships. Cronqvist wants students to work at businesses that will give them the tools they need for the workforce.\n“We already have good ties with industries, so we’re broadening and deepening those ties,” he said.\nOrange County’s rich business landscape – which includes biotech, health care, finance and entertainment – is ideal for deepening those ties. Many locally based corporations like Disney, Pimco, Chipotle and Edwards Lifesciences already hire Chapman students, looking to innovate to solve challenges and impact the future.\n“A lot of these companies are looking to digitally transform themselves and data has a very important role in that domain,” Cronqvist said.\nChipotle is an example, he said. During the pandemic, the company went from doing very little business online to “billions,” adapting to collect more information on customers.\nTo meet this exploding demand for data, Argyros is exploring offering a new master’s degree in business analytics. It will be “related to topics around data science, data analytics – machine learning, artificial intelligence, visualization of data,” Cronqvist said.\nHe is working on partnering with Chapman’s Schmid College of Science and Technology and Fowler School of Engineering for related courses, and for another new Argyros offering: a STEM-certified MBA.\n“If you look at the job market, the kind of jobs that are out there that are well paying, many of them are quantitative analytics, making sense of data,” he said.\nHollywood and beyond\nA related collaboration Cronqvist is working on is a new business of entertainment minor, through which he envisions capitalizing even more on Chapman’s proximity to Hollywood.\n“Chapman is known for its No. 4-ranked Dodge College of Film and Media Arts, and that’s all some people may know about Chapman, right?” he said. “So this is a concrete example of how we integrate two schools.\n“There are many different roles that are involved in Hollywood – it’s not only the directors or the producers,” he said, adding that the industry needs people in areas like finance and other positions on the business side of entertainment.\nChapman already offers a joint MFA/MBA program. In November 2022, Cronqvist and Dodge Dean Stephen Galloway interviewed DreamWorks co-founder Jeffrey Katzenberg.\nCronqvist is also looking beyond Tinseltown toward another facet of global business – Asia-Pacific commerce.\n“The idea is that we will be a provider of thought leadership research that will be helpful to businesses, in terms of understanding what’s going on in Taiwan, what’s going on in mainland China, what’s going on in Vietnam,” he said. “How will what’s going on there impact businesses – we want to take leadership in this particular domain.”\nHe said the new Asia-Pacific Geoeconomics and Business Initiative will differ from those at other universities by focusing on the effects of countries’ business policies, rather than the region’s politics or culture.\n“There’s many aspects of the Asia-Pacific region that business leaders would want to understand what’s going on, and we will fill that gap,” he said.\nMore about the impact of Argyros School of Business and Economics\nDoti Foresees Recession in 45th Economic Forecast | Chapman Newsroom\nScholars Represent Chapman at Prestigious Economics Conference | Chapman Newsroom\nChapman Hosts ‘Shark Tank’-Style Panther Cage Match | Chapman Newsroom\nArgyros Dean Publishes Article on ‘Social CEO’ | Chapman Newsroom\n\n\nArgyros School Argyros School of Business and Economics Asia-Pacific data analytics Dodge College of Film and Media Arts leadership MBA metaverse \n\n\n\n\n \n\nJoy Juedes \n\n\nView all posts \n\n\n\n\n\n\n\n\nChapman Launches Most Ambitious Fundraising Campaign to Date, Announces Major Gift\n\n\n\n\n\nSchool of Pharmacy Honored for Collaborative Residency Program\n\n\n\n\n\n\n\nYou may also like\n\n\n\n\n\n\n\n\n\n\nNew Asia-Pacific Initiative Offers Unique Take on Hotbed Region Growing up in Los Angeles, Robert Koepp became fascinated with Asia. He had Asian American friends, and absorbed happenings in that part of the world when his father watched the news. “As I got older, there were more...\n\n\nMay 1, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n\n\n\nDaniel Canogar’s “Pareidolia” Multimedia Artwork Unveiled at Chapman University On April 13, the Phyllis and Ross Escalette Permanent Collection of Art in Wilkinson College of Arts, Humanities, and Social Sciences unveiled its newest artwork installation, “Pareidolia,” by internationally renowned...\n\n\nApril 27, 2023 Staci Dumoski\n\n \n\n\n\n\n\n\n\n\n\nArgyros School Climbs to No. 60 Chapman University’s Argyros School of Business and Economics rose to No. 60 in the new Best Business School rankings by U.S. News & World Report. It’s the school’s highest-ever position in rankings of business...\n\n\nApril 25, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n Search\nNewsroom Topics\n\nArts & Film\nBusiness & Economy\nHealth & Behavior\nScience & Engineering\nAlumni\nCampus & Students\nCommunity\nHumanities & Society\nUniversity News\n\nSubscribe Sign up here to get updates on the latest Newroom stories.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmergency \n\nMedia ContactsCerise Valenzuela Metzger\n\nDirector of Public Relations\n(714) 289-3143 (office)\n(657) 390-6760  (cell)\ncmetzger@chapman.edu\n\nOffice of Public Relations\n\nPR@chapman.edu \n\nNewsroom SiteChapman Magazine\n\nChapman Forward\nCOVID-19 Resources\n\nChapman Site\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment \n\nServices & PoliciesAccessibility Feedback \nWebsite Feedback \nDisability Services \nDirectory Emergency \nConsumer Disclosures \nPrivacy Policy Title IX \n\n\n\n\n\n© 2023 Chapman University           \n\n\n\n\n\n\nTopics\n\nAlumni\nArts & Film\nBusiness & Economy\nCampus & Students\nCollege Knowledge\nCommunity\nCOVID-19\nHealth & Behavior\nHumanities & Society\nScience & Engineering\nUniversity News\n\n\nOur Voices\nCOVID-19 Resources\nMagazines\n\nChapman Magazine\nChapman Forward\n\n\nPress Room\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#",
        "#",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "#",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://www.pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu/",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/edu/school?id=17838",
        "https://www.snapchat.com/add/chapmanu",
        "http://chapmanadmission.tumblr.com/",
        "http://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://social.chapman.edu/",
        "#",
        "https://www.chapman.edu/",
        "/",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "https://news.chapman.edu/wp-admin/ ",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "https://www.chapman.edu/campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu",
        "https://news.chapman.edu/work/",
        "/",
        "https://www.chapman.edu/",
        "#",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "#",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/discover/index.html",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "/about/connect",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/academics/course-catalogs/index.aspx",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "/admission/undergraduate/applynow",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/afford.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/net-cost-calculator/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/events/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/students/health-and-safety/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "/research/",
        "https://www.chapman.edu/research/sponsored-projects-services/pre-award/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/post-award/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index.aspx",
        "https://www.chapman.edu/research/graduate-research/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/contact-us.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/ways-to-give/areas-to-support.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/audiences/index.aspx",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "https://social.chapman.edu/",
        "https://news.chapman.edu/2022/12/16/doti-gives-45th-economic-forecast-foresees-recession/",
        "#",
        "#",
        "#",
        "#",
        "mailto:?subject=The%20Global%20Dean&body=https%3A%2F%2Fnews.chapman.edu%2F2023%2F02%2F02%2Fthe-global-dean%2F",
        "#",
        "#",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://www.chapman.edu/business/index.aspx",
        "https://news.chapman.edu/2022/11/01/chapman-holds-to-lofty-no-4-spot-in-the-wraps-annual-ranking-of-top-50-film-schools/",
        "https://economicforecast.chapman.edu/2022-forecast/",
        "https://time.com/6116826/what-is-the-metaverse/",
        "https://www.wired.com/story/what-is-the-metaverse/",
        "https://www.chapman.edu/industry-partners/top-employers.aspx",
        "https://www.chapman.edu/scst/index.aspx",
        "https://www.chapman.edu/engineering/index.aspx",
        "https://news.chapman.edu/2022/12/16/doti-gives-45th-economic-forecast-foresees-recession/",
        "https://news.chapman.edu/2023/01/11/scholars-represent-chapman-at-prestigious-economics-conference/",
        "https://news.chapman.edu/2022/11/01/chapman-hosts-shark-tank-style-panther-cage-match/",
        "https://news.chapman.edu/2022/10/25/argyros-dean-publishes-article-on-social-ceo/",
        "https://news.chapman.edu/tag/argyros-school/",
        "https://news.chapman.edu/tag/argyros-school-of-business-and-economics/",
        "https://news.chapman.edu/tag/asia-pacific/",
        "https://news.chapman.edu/tag/data-analytics/",
        "https://news.chapman.edu/tag/dodge-college-of-film-and-media-arts/",
        "https://news.chapman.edu/tag/leadership/",
        "https://news.chapman.edu/tag/mba/",
        "https://news.chapman.edu/tag/metaverse/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/2023/02/13/burras-give-5-million-catalyzing-public-phase-of-new-comprehensive-campaign/",
        "https://news.chapman.edu/2023/01/31/school-of-pharmacy-honored-for-collaborative-residency-program/",
        "https://news.chapman.edu/2023/05/01/new-asia-pacific-institute-offers-unique-take-on-hotbed-region/",
        "https://news.chapman.edu/2023/05/01/new-asia-pacific-institute-offers-unique-take-on-hotbed-region/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/2023/04/27/daniel-canogars-pareidolia-multimedia-artwork-unveiled-at-chapman-university/",
        "https://news.chapman.edu/2023/04/27/daniel-canogars-pareidolia-multimedia-artwork-unveiled-at-chapman-university/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/university-news/",
        "/news-and-stories/sign-up-for-our-newsletter/",
        "https://www.chapman.edu/emergency/index.aspx",
        "tel:+1714-289-3143",
        "tel:+1657-390-6760",
        "mailto:cmetzger@chapman.edu",
        "mailto:PR@chapman.edu",
        "/magazine",
        "/forward",
        "/coronavirus/",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/jobs/index.aspx",
        "https://www.chapman.edu/accessibility/feedback-form.aspx",
        "https://www.chapman.edu/website-feedback-form.aspx",
        "https://www.chapman.edu/students/health-and-safety/disability-services/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "emergency/index.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/index.aspx",
        "https://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "https://www.chapman.edu/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/"
    ]
}