{
    "title": "Help – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\n\t\t\t        Chico State\n\t\t\t    MenuShow search box.AboutAcademicsCost & AidAdmissionsStudent LifeAthleticsAlumniGiveApplyVisitRequest InfoCSU, ChicoCurrent page:  Help\n                        \n    \t\tHelp\n    \tTips and resources for navigating the Chico State website and reporting issues.Web HelpCMT Web ServicesWebsite Design & Support Service CatalogComputing HelpIT Support Services (ITSS)ITSS Help Desk: 898-HELP (4357)Request Service (IT Service Catalog)(opens in new window)Errors, Change Requests & AccessibilityWe value your input. Please use the website Change Request Form to report errors or accessibility issues or to request changes to the University website.CSU, Chico InformationAbout Chico StateCampus MapCampus DirectoryCSU, Chico FactsCampus CalendarCSU, Chico Contact InformationUniversity Information Center: 530-898-INFOSearch HelpQuery SyntaxCase SensitivitySearch is not case sensitive. A search for \"chico\" will match both \"chico\" and \"Chico\".Multiple Search Termsweb servicesBy default, when searching for multiple terms the AND operator is used. This means that in the example above, search will look for documents that contain both \"web\" and \"services\".See Boolean Operators for other ways to search multiple terms.Exact Search or Phrase Search\"chico state\"If you need to search for a phrase, enclose the term in double quotes. Searching for a phrase will return only documents that contain the phrase as it appears between the quotes. The example above will only return a document if it contains the phrase \"chico state\" (those two words, in that order, with one space in between).Wildcard SearchesAsterisk (*) WildcardCalifornia State University, *The asterisk (*) operator serves as a single- or multi-word wildcard. In the above example, results could include \"California State University, Chico\" in addition to \"California State University, Channel Islands.\"Proximity Searcheschico AROUND(5) stateProximity search find words that are a within a specified distance of each other. To do a proximity search, use the AROUND(x) function between two terms. The example above will search for \"chico\" and \"state\" within 5 words of each other.Grouping(chico | state) AND webChico State's search supports using parenthesis to group clauses (forming sub-queries). In the example above, search would look for documents that contain either \"chico\" and/or \"state\" and \"web\" and \"web\". Put another way, the example would match documents that contain:the terms \"chico\" and \"web\"the terms \"state\" and \"web\"the terms \"chico\", \"state\", and \"web\"Boolean Operators\"AND\" Operatorchico statechico AND stateThe \"AND\" operator links two terms to find matching documents in which both terms exist. By default, searches containing multiple terms join those terms with an \"AND\" operator. This means that if no Boolean operator is used between two terms, the \"AND\" operator is assumed.In the above examples, a matching document would be any document that contains the words \"chico\" and \"state\" (in no particular arrangement).Minus Operator (-)chico -stateThe minus operator \"-\" excludes documents that contain the term after the \"-\" symbol.In the above example, a matching document would be any document that contains the word \"chico\" but not the word \"state\"\"OR\" or Pipe Operator (|)\"web services\" | \"university communications\"One pipe \"|\" (the pipe shares a key with backslash on standard keyboards) is equivalent to \"OR\" and links two terms to find matching documents in which either term exists.In the above example, a matching document would be any document that contains the either \"web services\" and/or \"university communications\".Limiting Your Search to a Specific Departmentcascade site:www.csuchico.edu/webThe CSU, Chico website consists of nearly 50,000 documents. Finding a specific result can be difficult, but you can increase your chances of success by limiting the search to a specific department.To limit your search to a single department, simply add site:www.csuchico.edu/{dept} after your search term(s), where \"{dept}\" is the root URL for the department in question. Be sure to remove any spaces after \"site:\".In the above example, we'd be looking for any documents within www.csuchico.edu/web(opens in new window) that contain the term \"cascade.\"We acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.MenuChico State HomeAboutAcademicsAdmissionsCost & AidStudent LifeAcademic DepartmentsAthleticsAlumniParentsChico FactsGiveResourcesQuicklinksCampus CalendarCampus SafetyJob OpportunitiesAccessibility Resource CenterAnnual Security Report (PDF)\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "#task-nav",
        "about/index.shtml",
        "academics/index.shtml",
        "cost.shtml",
        "https://www.csuchico.edu/admissions/index.shtml",
        "student-life.shtml",
        "https://chicowildcats.com",
        "https://www.csuchico.edu/alumni/index.shtml",
        "https://www.csuchico.edu/give/index.shtml",
        "https://www.csuchico.edu/admissions/apply/index.shtml",
        "https://www.csuchico.edu/admissions/visit/index.shtml",
        "https://www.csuchico.edu/admissions/request-information.shtml",
        "https://www.csuchico.edu",
        "https://www.csuchico.edu/web",
        "https://support.csuchico.edu/TDClient/Requests/ServiceCatalog?CategoryID=3197",
        "http://www.csuchico.edu/itss/index.shtml",
        "https://support.csuchico.edu/TDClient/Requests/ServiceCatalog",
        "http://www.csuchico.edu/contact/change-request/",
        "http://www.csuchico.edu/about/index.shtml",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "about/chico-facts.shtml",
        "https://www.csuchico.edu/calendar/index.shtml",
        "http://www.csuchico.edu/contact/index.shtml",
        "#boolean",
        "https://www.csuchico.edu/web",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "http://instagram.com/chicostate",
        "https://www.linkedin.com/edu/school?id=17823",
        "https://www.flickr.com/photos/chicostate",
        "https://www.youtube.com/user/ChicoStateChannel",
        "https://www.csuchico.edu",
        "about/index.shtml",
        "academics/index.shtml",
        "https://www.csuchico.edu/admissions/index.shtml",
        "cost.shtml",
        "student-life.shtml",
        "academics/academic-departments.shtml",
        "https://chicowildcats.com/",
        "https://www.csuchico.edu/alumni/index.shtml",
        "https://www.csuchico.edu/parents/index.shtml",
        "about/chico-facts.shtml",
        "https://www.csuchico.edu/giving/index.shtml",
        "audience-resources.shtml",
        "https://www.csuchico.edu/calendar/index.shtml",
        "https://www.csuchico.edu/campus-safety/index.shtml",
        "employment.shtml",
        "https://www.csuchico.edu/arc/index.shtml",
        "https://www.csuchico.edu/clery/_assets/documents/annual-security-report.pdf",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}