{
    "title": "Do the Woo Friday Show with Vito Peleg and BobWP",
    "body": "\n\n\n\n\t\tSkip to content\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nPodcast\nBlog\nFriends\nWooBits\nSponsor\n \n\n\n\n\nSearch for:\n\n\nSearch\n\n\n\n\n\n\n\n\nSearch\n\n\n \n\n\n\n\nSubscribeSubscribe \n\n\n\n\n\n\n\nPodcast\nBlog\nFriends\nWooBits\nSponsor\n \n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nMain Menu\n\n \n\n\n\n\n\n\n\n\n\nPodcast\nBlog\nFriends\nWooBits\nSponsor\n \n\n\n\n\n\n\n\n\n\n\n / Do the Woo Podcast, Europe, Friday Show, Product Builders / By  \n\n\n\t\t\t\tBobWP\t\t\t\n\n\n\n\n\n\n\n\n\n\n \n\n\nDo the Woo Friday Show with Vito Peleg and BobWP\n\n\n\n\n\nApril 21, 2023 \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tDo the Woo - A WooCommerce Podcast\t\t\t\t\t\nDo the Woo Friday Show with Vito Peleg and BobWP\n\n\n\n\nPlay Episode\n\n\nPause Episode\n\n\n\n\n\n\n\n\n\n\n\n\n\nMute/Unmute Episode\n\n\nRewind 10 Seconds\n\n1x\n\nFast Forward 30 seconds\n\n\n\n00:00\n/\n\n00:43:08\n\n\n\n\n\nSubscribe\nShare\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tApple Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tGoogle Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOvercast\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPandora\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPocketCasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tSpotify\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\tRSS Feed\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tShare\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tLink\t\t\t\t\n\n\n\n\n\n\n\n\t\t\t\t\tEmbed\t\t\t\t\n\n\n\n\n\n\n\n\nDownload file | Play in new window | Duration: 00:43:08Subscribe: Apple Podcasts | Google Podcasts | Overcast | Pandora | PocketCasts | Spotify\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThanks to Our Community Friend\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \nThe Jetpack agency partner program that will help you manage your client's sites important notifications, real-time backups, one click restores with a log that shows all changes, and who did what Plus you can look forward to recurring discounts on all new Jetpack licenses.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nIt's the Friday Show.\nVito Peleg from the Web Business Summit joins me as chat about WordPress community burnout, making flagship WordCamps bigger and turning site builders into chef's of their trade.\n\n\n\n\n\n\n \n\n\nConnect with Vito\n\n\n\n\n\n\n\n \n\n\n\n\n@VitoPeleg \n\n\n\n\nAtarim.io \n\n\n\n\nSign up for Web Agency Summit '23 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYou want to be a chef, you want to be the person that serves just a few customers, but it's so freaking tasty that they just want to come back for more. And then you don't need to worry about chasing clients constantly because you're serving the ones that you have at the chef level.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nBobWP: Well, it's a Friday Show and I'm here with Vito Peleg. Vito, how are you doing?\nVito: Very good. It's good to be back, Bob. Thanks for having me.\nBobWP: You've been on a few times here and there and stuff over the years it seems like. So for those of you that are just hearing this for the first time, the Friday Show, it's really just a conversation, I bring somebody in I know, and they act as a co-host and we just come up with a couple topics, run with it and see where this show takes us. But before I get into it. Vito has this great business called Atarim and why don't you just give a little intro to yourself. I know a lot of people know who you are, but for those that don't.\nVito: Sure. So my name is Vito. I've been in WordPress for almost 15 years now. Started a freelancer, then built an agency here in London in the UK, and through the experience of trying to manage a team and a bunch of clients at the same time, got frustrated with the client work. And so we built a tool to help us internally first to manage the clients and essentially facilitate communications in a visual way. And once it worked like magic, then I try to see if anyone else in the community would care for it. And that's what created Atarim. Initially we were called WP Feedback at the time, if you remember Bob, right in the beginning?\nBobWP: Oh yes. Those days.\nVito: And then it was a plugin that allowed people to literally click any part of the WordPress website to leave a comment where the request is, therefore, eliminating the back and forth and all of the message, trying to really get the client to tell you what they really want, not what they think they want. And that evolved into a platform that now works with any website. But now we have basically two sides to it. One is the visual collaboration aspect and the other side is the workflow management. And the goal is to save a whole bunch of time on service delivery for agencies and hosts and also internal product teams that are using this to just save all kinds of clicks when it comes to their day-to-day activity. It's been going pretty nicely. Now there's about 12,000 agencies that are using this with 1.2 million of their clients in past three and a half years, and we're just getting started.\nBobWP: Wow. That's amazing. And then just a little reflection on my part, and I may have mentioned this way back, well, not way back, but when we did the redesign of Do The Woo, and I worked with an agency, WebDev Studios, they actually use Atarim. So I experienced it and it was awesome. I really liked it because it was so cool to be able to communicate with them so easily. I had a great person I've worked with and having that on top of that made the whole thing really seamless and painless and it was like wham bam, it's over. And that was fun. So-\nVito: That's awesome. I remember I was talking to Christina about this. She was your point of contact at the time, right? I remember.\nBobWP: Yes, right.\nVito: And she said, \"Bob just went in and start marking things as done for us. Got crazy with the tool.\" And she's like, \"Fine, if he's marking the work for me, then that's even better.\"\nBobWP: I think I kind of went a little out of control there, I was like, \"Am I supposed to do this?\" Well, this is done. She's like, \"Oh, wait a minute.\" But anyway, it all turned out great. So couple topics. I'm going to start with mine. And this is something that... Let me put it this way. We all know that everybody's been talking about... Well, you hear some people, and maybe some of you out there listening aren't deep enough in the community. People are talking about community burnout and people are leaving. We've heard this for a few years and one of the interesting things I saw recently, and I'm not going to name names because one thing is, I can't remember half the people that were talking then, so I'd probably screw it up. They were talking in a Slack channel about this, and somebody pointed out WordCamp Asia, and they said, \"I think what we're looking at is bubbles of the ecosystem on burnout.\"\nAnd this might be even regional or something, because they said we were at WordCamp Asia and the energy level was dynamic. Everybody was excited. Sure you don't have people moping around when they come because they're depressed about WordPress or something. But the person that hadn't made the first comment responded by saying, \"Well, those are enthusiasts. Of course, they're going to be that way.\" I stayed out of the conversation, but I thought, well, they're really more than enthusiasts because these are builders. These are people that have stores and websites and everything else. And I tended to agree that sometimes, and as I get more into different parts of the world and talking with people, it was a little bit centric to maybe a certain region maybe. And the people that they communicate with, that the burnout seem to be getting more and more visible.\nSo I think there is that part of it that we need to, well first of all, get out of our little bubble and realized there's all these communities. And like I said, I've started talking to some of the Asian community. I've talked to them in Africa, I've talked to them on different continents. And some of them are so not just passionate, but there's a certain graciousness about them that shows how much WordPress has done for them. And they get through all that. Well, now I live in Portugal, but do you feel that, or have you ever sensed that? Do you agree with that in a way or what?\nVito: So I think there's definitely merit to it. One thing that I saw at Asia where we also were hanging out a little bit there together, the people that we were sitting with at the table are the same people that we were sitting at the table in WordCamp Europe and WordCamp US. It's the same folks that travel around the world following those events. I even had a conversation with another founder in our space just earlier today, and he was saying the same thing. I thought, I'm going to come to Asia and they're going to open a new market, but eventually it's the same people that just followed us there like he did as well. And so the way that I see this is that the community is so much broader than the small group of folks that are, let's call them, active community members, folks like yourself, like myself, we see each other wherever we go. We see when we scroll the feed on any social media, then it's us. You know what I mean?\nSo I think that one of the things that are missing from the community aspect in WordPress is community outreach. And that is the ability to expand those circles, not create new ones, but expand existing ones so that you drive fresh blood into those communities, into those small groups and bubbles to make sure that they keep thriving. Even more than this going to Asia and as well as now with WordCamp Europe coming just around the corner. One of the things that really bugged me with these events, even though we sponsor them, and I love going and it's like meeting family every time that you go, is that there are tiny in comparison to the impact of the software that they are there to represent.\nSo if you look at this from a standpoint of WordPress powering almost half of the internet, why isn't any of these or either of these or all of them are events that you have more than 20,000 people, not 2,000 people. They should be arena packed activities and which is going to be good for everyone. It's going to be good for the software, it's going to be great for contribution, it's going to be amazing for speakers, for sponsors. And then there's only that one last component missing which is the outreach.\nAnd so I was contemplating this a lot recently, especially after I went to CloudFest. Have you been before, Bob?\nBobWP: I haven't. And actually next week we're having on another show, Carol Alinger is coming in and I'm going to talk about the impact, but I'd like to hear a little bit about your experience there which would be great.\nVito: So, well, my introduction to CloudFest as an event was very similar to my introduction to WordCamps. So I was part of the community for many years before I even knew that this thing existed. And they were happening right here under my nose. In London, there's been a few camps that were happening over the 10 years that I've been living here without even me knowing. And so when I started promoting my product, I got in touch with a few folks that told me that there is this small event, if you know Lee Jackson, he was doing agency transformation live. So I was looking for mostly for agency related events. I went there and then I met Paul Lacey and Nathan Wrigley that told me that there's WordCamp London coming up in a week. I didn't even know that this was happening.\nSo I went there and that's where I found out that WordCamp Berlin or WordCamp Europe was happening just a month after. And I went there then I found out that there's WordCamp US, and that's where I met you. And so these things rolled in that way just by me taking a more active role. But it was my choice. It wasn't something that was brought to my table even though I was already building with WordPress and building hundreds of websites with the tool. I wasn't even aware of these things. And same thing with CloudFest now. Someone dropped me a message a year ago that there's an event in Germany, you should go see what's up. And that was three days before the event. I bought a plane ticket and I showed up. And this year, I was speaking and we were sponsoring, and now CloudFest is even a sponsor at our event next week.\nAnd so what I saw there is that CloudFest, just for comparison, it's a seven and a half thousand attendees, for an industry that is tiny compared to ours, this is an event that is mostly geared towards cloud tools and infrastructure for hosts. And if you consider how many hosting companies out there compared to how many WordPress professionals are there outside, and then see that our events are pretty much a third of the size, it was really baffling to me, and I was talking to this with the founder of CloudFest as well, and trying to figure out what did they do. It all came down to one thing, eventually, focus over time. And I see that coming from the music space as well. It's the same thing when you start a band. You play these dive bars, you play five people, seven people, five of them are the opening act. And then over time, the more you do it, the more you grow. And if you're good, then you figure out how to assemble an audience around what you do.\nAnd some bands do it because they do it over time and they do it consistently and they do it with intention. And some bands or some musicians jump between bands constantly. And so they never form that audience that keeps growing around them because they just keep on switching gears every now and then. I think that even though I very much appreciate, of course, all of the volunteers that are taking time from their busy schedules to organize those camps, they're volunteers and that is the difference. So they change and then the next year then there is no financial incentive. So if they get some kind of a gig that would make more sense or that they need to finish a client project, then that would take precedent over organizing the best and the biggest event that they can organize.\nAnd we just saw that with, I saw a message from, oh, I forgot her name, but one of the organizers last year and she said that she's not going to be doing it this year. She's focusing on her own stuff and things like this. So it's exactly that. On one hand, as attendees, you want to bring new blood, but as organizers, you want to have core teams that can grow this thing and make it a beast. And think about community outreach. Think about why as WordCamp Europe not... 20,000 is even small. Why is it not like Web Summit? When you're in portal. Web Summit is like 25, 30,000, 35,000 people every year. Why not?\nBobWP: Exactly. And that's an interesting perspective because it's almost like, I know people, the flavor of WordPress and the flavor of WordCamps and everything, but on the other hand, it seems like keeping the local WordCamps nice and local and you can keep that flavor going. But like you said, looking at the now three major WordCamps, the bigger ones that are more regional, it would be interesting to have a better focus, to have more stability and to have more outreach. Because potentially it could be crazy and I don't think it'd take away, I've thought about this a million times, but I never thought of it that way. Where that's kind of the big, oh, what do you want to call it? I don't want to say standard events, but they're the ones that are where it's really focused and we can keep that nice, feely part to the local WordCamps that continue to happen everywhere. So I like that. And so moving forward, I think Vito and I are going to start some kind of move to do that, or at least we're going to think about it for a while.\nVito: Yes. Well, we're already trying to do that with... And the reason why it occupies me a lot is because of our own event that we also see that growing year over year because we have the same team and a growing team, and so we have the processes honed in and the networks already established, and every year we're able to not try and replicate last year's success, but trying to up ourselves and let's say you're hired to a new role, the first thing that you want to do is you want to fill the old shoes, and then when there's another person coming into that role, then they want to fill those old shoes again. And because it's the same thing that happens almost every year or every other year, then you're not able to move from sneakers to massive cowboy boots.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThanks to our Community Friend Jetpack\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nBobWP: Let's shift over, we're about halfway through or so. What's on your mind, what do you want to chat about a little bit?\nVito: So there's a couple of things that I've been contemplating about. One of this is really this topic. It was spot on because this is essentially one of the things that I've been working on over the past couple of months, as well as just coming back from CloudFest and things like that. That's been really one of the things that has been occupying my mind as well. Another thing is when it comes to the landscape of web agencies in 'our space, because essentially when you think about what is really driving the community forward and the product and WordPress is a product, I see that there's three components to it.\nOne is top down, which is the big companies and the big hosting companies. So that would be the automatics, the GoDaddies of the world, and they drive the project with their own agendas and their own mindset as to what it should be about. Then on the other side of the spectrum, you have DIYs and people that are coming in and just trying to use the tool, figuring it out or website owners. But then in between you have the professionals and the agency space is first of all something that has on one hand a whole bunch of growth associated with it, because you never hear a good web designer scrapping for work. You know what I mean?\nBobWP: Yes, right, exactly.\nVito: But on the other end, there's always this feeling or you have the feast and famine concept of service delivery as well as the concept of people wanting to grow beyond. So they actively try to go above of where they are, and then they have this little monkey on the shoulder that tells them that there's a lot of competition and I got to compete on the price and I can't lose any clients and I got to give more and I got to give more and I got to give more. And then they burn out and a year later they become bakers or something.\nSo this is really something that has been occupying me because I'm talking to being an agency owner in my past as well and going through that journey, I see that there is a lot of fear going on, especially right now in that space coming from recession on one hand, and AI on the other spectrum of it, and as well as a race to the bottom where you see solutions that are trying to build websites for $500 and things like that. And one of the things that I came up with or that's where I felt comfortable thinking about this is that as an agency, you don't want to be McDonald's. You want to be a chef, you want to be the person that serves just a few customers, but it's so freaking tasty that they just want to come back for more. And then you don't need to worry about chasing clients constantly because you're serving the ones that you have at the chef level. It's not a buffet. You know what I mean?\nBobWP: Right.\nVito: Then there are other companies at Massive Scale that are designed to being McDonald's, but you don't see chef restaurants complaining about McDonald's. So those $500 websites, that's not where these folks should be. And the reason why I'm saying this is I just had a conversation recently with an agency owner and she was telling me how much she was charging, and I asked her, \"How long does it take you to build a website?\" And we did the math and she was charging literally $4 an hour. When you actually look at it at that level. And if you build a 100 websites a month, a 1,000 websites a month, which some operations do, then you can do it at those lower price points. But if that's not where you want to be or that's not where you are today, push it up, become a chef, increase the prices, increase your own ability to serve, and then magical things are going to happen around there.\nBobWP: And I like that because, so a couple of things. First of all, I look at... We recently had somebody from WooCommerce talking about their New Boo Express, which is a wordpress.com hosting, and he was talking about some of these smaller developers and stuff maybe doing these type of stuff versus just everything in the world. This would give the opportunity to do it. When you talk about the agencies and some of them worrying about these hosting companies that are putting together things that make it easier for DIYers to put it together, it's almost like, what do I want to say? It's kind of a survival of the fittest where now it's like, that's your time to think of what Vito said and start looking at doing that chef work rather than McDonald's work. Because McDonald's, is going to maybe soon be automated completely, and it's all self-serve.\nSo make that self-serve for those people where they can go up and set up their own site and everything gets pulled together. Jing, Jing, Jing. Good. And even though it might be in a sense, eliminating a certain part or a certain lower level there, that might be good in the long run because it's going to have those people looking at, well, maybe I need to be part of an agency or maybe I need to create my own agency. I need to start looking at those people that aren't wanting to go to GoDaddy or Woo Express and build their own site or their expectations are much higher. So I think there's a lot of things that are happening right now that people get freaked out about and think are going in the wrong direction, which when you look at what you said may actually be pushing things in the right direction to make a lot more people happier.\nVito: Yes. Well, not everyone is the right customer. So when I was in my early '20s, no way I could go and eat at a chef restaurant with my wife and have a 300 pound dinner. There's no way. And that is when I was budgeting one pound a day for a meal and you prepare everything yourself and you're DIYing your own lunch.\nSo that's a stage in life or that's a stage in people's careers. I even think about DIYs without trying to offend anyone, but really a lot of times they don't think about the value of their own time. Because, going to switch analogy here, but if I want to get a car, I'm not going to learn how to build a freaking car. I'm going to go and buy a car from somewhere. So spending 150 hours learning how to build a website in WordPress when what you need to do is build your own business, that has nothing to do with that. That is illogical to me, even though I did it as well myself.\nBobWP: Haven't we all?\nVito: So these are those types of folks and that's fine. That's where they are. Then above that, there's those small business owners like the small plumbers and the corner shops and the local pizzeria and they have an operation. They don't want to learn how to build a website, but they need one. They're not going to spend $5,000 to build a website now because they don't see the value of it yet in where they are. So again, they are not your client and that's fine. They are the ones that are going to go into those yellow pages. It's a good example of those things or the automatic 500 bucks website offering that they have on dot com. That's fine. That's where these people are, where you want to go to are the people our age that will be happy to sit at a fancy restaurant and be served properly and pay accordingly and maybe squint a little bit when the bill comes, but still be able to pay it.\nBobWP: Just have another glass of wine or another beer and get over it.\nVito: Get over it. Exactly. So I think that this is where a lot of those things misaligned. AI is not going to kill the people that want to have good meal. It's just going to filter people into the place where they should be and bigger agencies will figure it out. They are going upmarket, they're going enterprise, which is a good idea. But along with it comes long sales cycles and other challenges that still happen. But there's still a huge, huge market and there's enough to go around and we're seeing this with our platform. The amount of websites that people build every month is in the tens of thousands just to us. And we're still a small player. And so the amount and the volume that is out there when all you need is three clients a month really to not survive, but to thrive as a micro agency, then there's no even reason to have this little monkey on the shoulder that tells you that you can't.\nBobWP: And I love the analogy of the chef because right away I think of budget-wise and even time-wise, you go into a fast food place. Now a lot of them are automated almost. You go up to the thing, put in your stuff. When you want that, you want that. But you don't want to go into a high end restaurant and stand in the line and put in your order. You want the waiters to come up and fawn over you and you want to slowly experience everything. So it's happening there and those Zion restaurants aren't going to do that because they know what people come in and what they're paying for that experience. Cool. I love that. So excellent stuff. Speaking of agency, you can't get away without hearing about your event coming up because, well, just because this is perfect timing and you have been doing your summit for a while now and everybody in the world should actually go to it except for people maybe that don't have an agency, but every agency should go to. No, anyway, tell us a little bit about what's going on.\nVito: So as you mentioned Bobby, this is the fourth year now that we're doing this. The first one came in because I just started my product back towards the end of 2019 and we were starting to grow nicely and then I wanted to do a boost and reinvest into the company. And so WordCamp Asia, that was supposed to happen back then early 2020 was my path of doing it. And so we bought plane tickets and hotels to the team that we had. We were still small then. We had three people, but it was still a big endeavor at the time and we're sponsoring and shipped swag and all of those kind of things and marketing activities and whatever, all of those kind of things. I was all in. And then a week before it got canceled, and so I almost lost the company at that time because I was really investing more than we could afford just knowing that there's going to be a Hawaii on the other end of it.\nAnd so I was thinking, what can I do or is this going to shut us down or is this the end of it? We just started. So instead I reached out to a bunch of friends that I met at previous camps along that year, including yourself, and we put together an event in literally two weeks. I was staying up all night building a platform in WordPress to accommodate the summit and bring it to the virtual world. And I was hoping for 300 people or so. And then we ended up with 3,500 people and the whole thing crashed on the first day.\nBut luckily we had sponsors and partners from big companies that brought in like their AWS experts and their CEO and this guy. And I was just sitting there pulling my hair out and while they were setting things up and we got back on track, of course. And that was year one. And since then it became a thing that I wanted to do to mostly give back to the community as our yearly thing. So year two we were at 5,000 attendees, and last year we were at 7,500 attendees. And this year we are almost 10,000 already.\nBobWP: Cool.\nVito: So I'm really looking forward to the event that is coming next week. And one of the cool things that we did this time is I wanted to create a bit more of an engaging setup instead of or on top of those sessions that are happening live, which are great.\nAnd a lot of them are done by agency owners that have figured things out just this past year or last year and coming to share their knowledge, people that are literally in the trenches and they are like a year ahead of some of the other attendees. And that's how we all learn from each other. But on the other side of it, we've created these awesome panels where I try to bring in people from a little bit broader to our space. So this year one of the panels that I'm excited about is we have one of them with the guy from Microsoft that was in charge of implementing AI into Bing.\nAnd he's going to come in to talk a little bit about how is that going to affect search in the upcoming year and how is that going to affect SEO and what do agencies need to learn about this and who better person to hear from than the actual person that did it?\nAnd on that side we also have a panel with how bigger companies are looking into WordPress over the past year and a half and are starting to interact with it instead of ignoring it because we've been ignored for quite a long time. And so there's folks from HubSpot and Google and Web Pros, which is the guys behind C panel and Plesk and even the founder of CloudFest is coming in to share his opinion. And we have Josepha joining in that front from WordPress. She's the Director of WordPress and probably the second-strongest person in our community. So we try to bring that other side of the spectrum so you can learn from real people that are just like us. And then you can also hear from people that are shaping things behind the scenes in a really interesting way.\nBobWP: Cool. That's great to hear because it's almost like going back to the bubble, the ecosystem and stuff is you're bringing in things and that's even with this Friday Show, I'm trying to not always talk WooCommerce Pacific, but we can talk to anything that any builder in WooCommerce can relate to. And often you can branch out easily and there's a lot of stuff going on and bringing in those. And I do find it interesting, some of the big names you have coming in because even through our site, and when I talk to sponsors and potential sponsors, there's a lot of larger companies that are looking or they've started to get more and more intrigued with the WordPress base or even specifically the WooCommerce space and feeling like, we need to be a part of this, understand it more what's going on. So this sounds excellent. So give us the details before we go. Where, when, how all that stuff.\nVito: First of all, it's free. This is our way of giving back to the community. There's a bunch of activity going on... It's a full week event or basically 24 4, it's Tuesday to Friday, we're serving every time zone, so there's more than 10 hours a day of sessions, everything is live so you can engage with the speakers and the panelists in real time. And then we also have our networking areas where you and I mostly hang out every year, and that is powered by Post Status this year where they are creating this cool experience where you have every hour a hangout or a meetup about a different topic. And so just to keep the conversation going, we're going to have influencers and experts and as well as community members coming in and hosting their own hour of hangout and bringing their friends and running their own little parties really.\nAnd then of course there's also the sponsors area where you can meet up product makers in the space. And again, this year we have folks from Yost as well as Main WP and other brands from our space along with companies like Web Pros that I mentioned that are C Panel, even Duda, which is a website builder that is also looking into WordPress. Recently if you're an agency owner, you've probably seen some ads from them. So they're going to come in and talk a bit about their involvement and what is their offering as well. So it's a really great place to come in, meet them, speak to product makers, spin the wheel that we have their virtual wheel and win some free prizes.\nLast year there's been some incredible prizes just to be one over there. So it's a full week long celebration of the space. And one last thing that learned from previous years is that while it's free and you're invited to join, you're not expected to sit there attentively with your arms crossed and just watching the screen for 10 hours straight. What we saw is that a lot of folks are doing this as a kind of by the way, like how many people are probably listening to this podcast right now, they're not just sitting in a dark room.\nJust with the headphones and their eyes closed. So you're probably going to be reading some emails and doing some work, but in the background, you have your community by your side for a week so that we can also help a lot of us that are working from home and sometimes feel a bit lonely. So that is a great way to feel a little more connected during that week, pick up a few gold nuggets and each one of those gold nuggets can really transform the rest of the year for a lot of us.\nBobWP: Excellent. Well, it calls me that networking little channel there and I'm like, I got to get some work done. I can't go in there yet. And we'll see how it works out.\nVito: There you get stuck, in the networking lounge, you go in and you find yourself 4:00 AM still hanging out with people. That's the magic though, isn't it?\nBobWP: Really. Well, cool. So the URL.\nVito: Yes. Atarim A-T-A-R-I-M atarim.io/summit. So even if you search Web Agency Summit, you're going to find it or go to our Twitter account, Facebook account, every account, and you'll see a bunch of publications around this. Look for the Woodstock type of branding that we did this year.\nBobWP: Love it. I love that. That's right away. I was like going back in time. Anyway. Well, Vito, this has been fabulous. I love having you on. It was fun just chatting and spending our time on the Friday Show, so I'm sure we'll have you back. This is always open. If you ever want to pop back in as co-host, you know where to find me. So again, thank you very much for coming.\nVito: Thank you. And I'll see you next week in the lounge.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nThanks to our Pod Friends for their support\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost navigation\n← Previous PostNext Post →\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nPodcast\nWooBits\nBlog\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nDev Resources\nBuilder Meetup\nDo the Woo News\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nSubscribe to WooBits\nSponsor\nChangelog\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\nPartners\nContact\nAbout\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nMenu \nHome\nPrivacy Policy\nDisclaimer\nTerms of Service\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDotheWoo.io does not have any affiliate links. Our efforts are full funded by our sponsors/partners.\nWordPress® and its related trademarks are registered trademarks of the WordPress foundation. This website is not affiliated with WooCommerce, Automattic, Inc., the WordPress Foundation or the WordPress® open source project. WooCommerce trademarks used with permission.\nCopyright: © BobWP 2010 - 2023 | Owned and operated by BobWP.\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://dothewoo.io/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/newsletter/archive/",
        "https://dothewoo.io/sponsor/",
        "#",
        "/subscribe/",
        "/subscribe/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/newsletter/archive/",
        "https://dothewoo.io/sponsor/",
        "https://dothewoo.io/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/newsletter/archive/",
        "https://dothewoo.io/sponsor/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/europe/",
        "https://dothewoo.io/friday-show/",
        "https://dothewoo.io/product-builder/",
        "https://dothewoo.io/friend/bobwp/",
        "https://itunes.apple.com/us/podcast/woocommerce-podcast/id1092157686",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9kb3RoZXdvby5pby9mZWVkL3BvZGNhc3Qvd29vY29tbWVyY2U?sa=X&ved=0CAMQ4aUDahcKEwj4i7ytppztAhUAAAAAHQAAAAAQAQ",
        "https://overcast.fm/itunes1092157686/do-the-woo-a-woocommerce-podcast",
        "https://www.pandora.com/podcast/do-the-woo-a-woocommerce-podcast/PC:29675",
        "https://pca.st/iqGi",
        "https://open.spotify.com/show/1jF5hPjfuNvVk7evAzpDON",
        "https://www.facebook.com/sharer/sharer.php?u=https://dothewoo.io/?post_type=post&p=74823&t=Do the Woo Friday Show with Vito Peleg and BobWP",
        "https://twitter.com/intent/tweet?text=https://dothewoo.io/?post_type=post&p=74823&url=Do the Woo Friday Show with Vito Peleg and BobWP",
        "https://dothewoo.io/podcast-player/74823/do-the-woo-friday-show-with-vito-peleg-and-bobwp.mp3",
        "https://dothewoo.io/podcast-download/74823/do-the-woo-friday-show-with-vito-peleg-and-bobwp.mp3?ref=download",
        "https://dothewoo.io/podcast-download/74823/do-the-woo-friday-show-with-vito-peleg-and-bobwp.mp3?ref=new_window",
        "https://itunes.apple.com/us/podcast/woocommerce-podcast/id1092157686",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9kb3RoZXdvby5pby9mZWVkL3BvZGNhc3Qvd29vY29tbWVyY2U?sa=X&ved=0CAMQ4aUDahcKEwj4i7ytppztAhUAAAAAHQAAAAAQAQ",
        "https://overcast.fm/itunes1092157686/do-the-woo-a-woocommerce-podcast",
        "https://www.pandora.com/podcast/do-the-woo-a-woocommerce-podcast/PC:29675",
        "https://pca.st/iqGi",
        "https://open.spotify.com/show/1jF5hPjfuNvVk7evAzpDON",
        "http://jetpack.com/for/agencies",
        "https://twitter.com/VitoPeleg",
        "https://atarim.io/",
        "https://atarim.io/summit/",
        "http://jetpack.com/for/agencies",
        "https://www.godaddy.com/pro/hub-dashboard?utm_source=dothewoofriends_2021_sponsorship&utm_medium=events&utm_campaign=en-us_events_prg_awa_partners_part_profile_desc_001",
        "https://www.hostinger.com/wordpress-hosting",
        "https://www.a2hosting.com/",
        "https://avlr.co/3EydDRH",
        "https://dothewoo.io/database-developer-to-product-manager/",
        "https://dothewoo.io/cloudfest-wordpress-day-and-a-hackathon/",
        "https://dothewoo.io/woocommerce-podcast/",
        "https://dothewoo.io/woobits/",
        "https://dothewoo.io/woo-builder-blog/",
        "https://dothewoo.io/developer-resources-for-woocommerce/",
        "https://www.meetup.com/woocommerce-builder-events/",
        "https://dothewoo.io/do-the-woo-news/",
        "https://dothewoo.io/subscribe/",
        "https://dothewoo.io/sponsor/",
        "https://dothewoo.io/do-the-woo-changelog/",
        "https://dothewoo.io/pod-friends-of-do-the-woo/",
        "https://dothewoo.io/contact/",
        "https://dothewoo.io/about-the-woocommerce-builder-community/",
        "https://dothewoo.io/",
        "https://dothewoo.io/privacy-policy/",
        "https://dothewoo.io/disclaimer/",
        "https://dothewoo.io/terms-of-service/",
        "https://podcasts.apple.com/us/podcast/do-the-woo-a-woocommerce-podcast/id1092157686",
        "https://open.spotify.com/show/1jF5hPjfuNvVk7evAzpDON",
        "https://twitter.com/DotheWoo",
        "https://www.linkedin.com/in/bobwp/",
        "https://www.tumblr.com/bobwp",
        "https://www.youtube.com/channel/UC8dKw_0uwsZoNXTrUzd4oig",
        "https://dothewoo.io/partnership/",
        "https://woocommerce.com/trademark-guidelines/",
        "https://bobwp.com"
    ]
}