{
    "title": "Notion – Your wiki, docs & projects. Together.",
    "body": "ProductWikisCentralize your knowledgeProjectsFor every team or sizeDocsSimple & powerfulNotion AIIntegrated AI assistantTemplate gallerySetups to get you startedCustomer storiesSee how teams use NotionConnectionsConnect your tools to NotionDownloadiOS & AndroidMac & WindowsWeb ClipperSolutionsBy team sizeEnterpriseAdvanced features for your orgSmall businessRun your team on one toolPersonalFree for individualsBy team functionDesignEngineeringProductManagersNotion forStartupsRemote workEducationNonprofitsResourcesBlogGuides & tutorialsWebinarsHelp centerAPI docsCommunityFind a consultantPricingRequest a demoLog inGet Notion freeGet Notion freeProductWikisProjectsDocsNotion AITemplate galleryCustomer storiesConnectionsSolutionsResourcesDownloadPricingRequest a demoGet Notion freeLog inYour wiki, docs, & projects. Together.Notion is the connected workspace where better, faster work happens.Get Notion free Millions run on Notion every dayPowering the world’s best teams, from next-generation startups to established enterprises.Read customer storiesFinally, all your work in one placeWikisIt’s hard to move fast if you can’t find anything. Centralize all your knowledge in Notion.ExploreDocsSimple. Powerful. Beautiful. Communicate more efficiently with next generation docs.ExploreProjectsManage any type of project more efficiently. No separate, clunky system.ExploreConsolidate tools.\nCut costs.We got rid of nearly a dozen different tools because of what Notion does for us.Justin WattDirector of Ops & Marketing, MetaLabPowerful building blocksVisualize, filter & sort any way you wantShow only tasks assigned to you, or items marked as urgent. Break down any project in the way that’s most helpful to you.BoardTableTimelineCalendarGalleryListCustomize the info you trackCreate your own labels, tags, owners, and more, so everyone has context and everything stays organized.Build any page, communicate any ideaEverything is drag and drop in Notion — images, toggles, to-do’s, even embedded databases.Notion adapts to your needs. It’s as minimal or as powerful as you need it to be.Rahim MakaniDirector of Product, MatchgroupEvery team, side-by-sideEngineeringDesignProductMarketingOperationsHRJoin a global movement. Unleash your creativity.Our vibrant community produces content, teaches courses, and leads events all over the world.Learn more1M+community members150+community groups50+countries representedAn always-on support networkSwap setups and share tips in over 149 online communities.Choose your languageNotion currently supports English, Korean, Japanese, French, and German. With more to come!Community meet-up in TokyoNotion ambassador event in New YorkSharing Notion setups in San FranciscoCoffee pop-up in LondonDeborah Mecca@DebMeccaI used to HATE documenting things. And then I started using @NotionHQ and I document a lot. A LOT A LOT. Now I just realize that it wasn't that I hated documenting, I just hated Google Docs.André Blackman@mindofandreOne of the most incredible things about @NotionHQ is the dynamic community being built - creating and sharing at its best.Oliver Peyre@opeyre@NotionHQ Truly impressed by the velocity and quality of your work. Making using Notion even more fun week after week!Endless ways to use itBrowse all templatesCompany wikiGet templateProduct roadmapGet templateOKRsGet templateMeeting notesGet templateVacation plannerGet templateGet started for freePlay around with it first. Pay and add your team later.Try Notion freeRequest a demoEnglishEnglishEnglish (US)Français (France)FrenchDeutschGerman日本語Japanese한국어KoreanPortuguês (Brasil)Portuguese (Brazil)Español (Latinoamérica)Spanish (Latin America)Español (España)Spanish (Spain)ProductWikisProjectsDocsNotion AIWhat’s newSolutionsEnterpriseSmall businessPersonal useRemote workStartupsEducationNonprofitsEngineeringProductDesignManagersDownloadiOS & AndroidMac & WindowsWeb ClipperBuildConnectionsTemplatesAPI docsGuides & tutorialsFind a consultantBecome an affiliateLearnCustomer storiesHelp centerWebinarsBlogCommunityGet startedRequest a demoSwitch from EvernoteSwitch from ConfluenceSign upLog inResourcesPricingAbout usCareersMedia kitContact supportEmail usSecurityCookie settingsTerms & privacyCalifornia Privacy NoticeStatusDo Not Sell or Share My Info© 2023 Notion Labs, Inc.",
    "links": [
        "/product",
        "/product/wikis",
        "/product/projects",
        "/product/docs",
        "/product/ai",
        "/templates",
        "/customers",
        "/integrations",
        "/mobile",
        "/desktop",
        "/web-clipper",
        "/enterprise",
        "/teams",
        "/personal",
        "/product/notion-for-design",
        "/product/notion-for-engineering",
        "/product/notion-for-product",
        "/product/notion-for-managers",
        "/startups",
        "/remote",
        "/product/notion-for-education",
        "/nonprofits",
        "/blog",
        "/help/guides",
        "/webinars",
        "https://www.notion.so/help",
        "https://developers.notion.com",
        "https://www.notion.so/notion/04f306fbf59a413fae15f42e2a1ab029",
        "https://www.notion.so/consultants",
        "/pricing",
        "/contact-sales",
        "/login",
        "/signup",
        "/signup",
        "/product/wikis",
        "/product/projects",
        "/product/docs",
        "/product/ai",
        "/templates",
        "/customers",
        "/integrations",
        "/pricing",
        "/contact-sales",
        "/signup",
        "/login",
        "/signup",
        "/customers",
        "/product/wikis",
        "/product/docs",
        "/product/projects",
        "/community",
        "/templates",
        "/templates/company-home",
        "/templates/roadmap",
        "/templates/notions-company-goals",
        "/templates/meeting-notes-startup",
        "/templates/travel-planning",
        "/signup",
        "/contact-sales",
        "/product",
        "https://www.instagram.com/notionhq/",
        "https://twitter.com/NotionHQ",
        "https://www.linkedin.com/company/notionhq/",
        "https://www.facebook.com/NotionHQ/",
        "https://www.youtube.com/channel/UCoSvlWS5XcwaSzIcbuJ-Ysg",
        "/product",
        "/fr-fr/product",
        "/de-de/product",
        "/ja-jp/product",
        "/ko-kr/product",
        "/pt-br/product",
        "/es-la/product",
        "/es-es/product",
        "/product/wikis",
        "/product/projects",
        "/product/docs",
        "/product/ai",
        "/releases",
        "/enterprise",
        "/teams",
        "/personal",
        "/remote",
        "/startups",
        "/product/notion-for-education",
        "/nonprofits",
        "/product/notion-for-engineering",
        "/product/notion-for-product",
        "/product/notion-for-design",
        "/product/notion-for-managers",
        "/mobile",
        "/desktop",
        "/web-clipper",
        "/integrations",
        "/templates",
        "https://developers.notion.com",
        "/help/guides",
        "https://www.notion.so/consultants",
        "/affiliates",
        "/customers",
        "/help",
        "/webinars",
        "/blog",
        "https://www.notion.so/notion/04f306fbf59a413fae15f42e2a1ab029",
        "/contact-sales",
        "/evernote",
        "/confluence",
        "/signup",
        "/login",
        "/pricing",
        "/about",
        "/careers",
        "https://www.notion.so/205535b1d9c4440497a3d7a2ac096286",
        "mailto:team@makenotion.com",
        "/security",
        "https://www.notion.so/28ffdd083dc3473e9c2da6ec011b58ac",
        "https://www.notion.so/notion/Privacy-Policy-3468d120cf614d4c9014c09f6adc9091?pvs=4#18e15495ac2643659c303cbe96358620",
        "https://status.notion.so"
    ]
}