{
    "title": "Expanded CalFresh Eligibility Brings Food Access to More Chico State Students - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\n\nAlmendra Lawrence\nMay 1, 2023\n\n\n\n\n(Photos by Jason Halley / University Photographer) \n\n\n\nCalFresh has been a lifeline for first-year student, Josh Rodriguez, for as long as he can remember.\n“My mom was born with a disability, so we’ve been using government programs to help us in purchasing food and housing,” the Yuba City native said.\nWhile Rodriguez currently relies on the assistance his mom received for the family, he soon will be applying for CalFresh on his own.\nEligibility to CalFresh has expanded to allow more students to qualify for aid, said Amy Gonzales, program director for the Center for Healthy Communities at Chico State.\nAssembly Bill 396, signed into law by Gov. Gavin Newsom 2021, opened CalFresh eligibility to California community college and California State University students enrolled in credit and non-credit programs that have an employment or training component, like internships, apprenticeships, and on-the-job training.\nChico State’s list of approved programs grew from 16 to 129, including adding animal science and physics minors, as well as PATH Scholars. While the Chico State CalFresh Outreach Office is busy promoting this vital resource—including sending emails to students who may meet eligibility requirements—the service remains underutilized by students on campus and statewide.\n“We want to get the word out that even more students are potentially eligible because of new state policies,” Gonzales said.\nThe California Department of Social Services reported that on average, more than 127,000 California college students receive CalFresh funds each year. However, it estimates that between 416,000 and nearly 700,000 students are eligible.\n\nEmilio Ceja Guzman searches for items to buy at Urban Roots, which is one of two locations on campus that accept EBT cards for payment.\nCalFresh, federally known as Supplemental Nutrition Assistance Program (SNAP), gives qualifying candidates up to $281 a month to pay for groceries. The benefit is not just for families—college students have been eligible for about eight years. Benefits are issued on an Electronic Benefit Transfer (EBT) card that works like a debit card and can be used at most grocery stores. Chico State students can use their card at Urban Roots in the Bell Memorial Union and Butte Station. The year-round farmers markets on Saturdays and Wednesdays in Chico and Chico Natural Food Co-Op also accept EBT and offer additional savings.\nGonzales encourages students to think of CalFresh as financial aid that helps pay for food.\n“There are lots of students who are working hard to get through school and just don’t have enough money to make ends meet,” she said. “This is where CalFresh can be so helpful. Between this fall and spring semesters, we’ve helped more than 1,400 Chico State students apply for benefits.”\nRodriguez said that even when his family went through hardships and trouble paying for housing or electricity, they continued to have food at home because of CalFresh.\n\nStudents can qualify for up to $281 a month to pay for groceries.\n“My first semester, I tried to keep it quiet,” Rodriguez said of being a CalFresh recipient. “I didn’t want my friends to know, because usually when people hear you have EBT they’re like, ‘Oh you’re poor.’ But it’s just a resource that can help you access free food. If it’s there, why not use it?”\nEmilio Ceja Guzman, a freshman English major, with an option in English education, learned about CalFresh and the Wildcat Food Pantry through the Educational Opportunity Program (EOP) during the summer before his first semester.\n“They told us we could apply once we got to Chico State, so on day two of moving here, I applied,” he said. “I went to the CalFresh office and someone helped me complete the paperwork.”\nA foodie, Ceja Guzman likes that he can buy produce and quality products at the Asian Market on Nord Avenue and Safeway—both stores only a couple of blocks from his dorm. He said he regularly composes dishes using ingredients like noodles, rice, kimchi, lettuce, mushrooms, and other in-season vegetables. He also adds quick microwaveable meals to his grocery list for those days when his schedule is full.\n“I’m not eating like a starving college kid,” he said. “(CalFresh) gives me the option to make better choices. It also allows me to save money on groceries. I’m so thankful I have it.”\nCeja Guzman encouraged his roommates to apply for the benefit and two of them now are also recipients. The group plans grocery store trips together and potluck nights, each using ingredients they purchased with CalFresh funds.\nStudents who want to know if they’re eligible for benefits can visit the CalFresh Outreach Office in the Student Services Center Room 190A. The office is open Monday through Friday from 9 a.m. to 4 p.m., and walk-ins are welcome.\n“I want students to know that we are here to support them through this process. Going to college is hard enough without having to worry about how they are going to afford to buy groceries,” Gonzales said. “We’re your safety net.”\nPlaces you can use your CalFresh EBT card:\n\nUrban Roots in the Bell Memorial Union\nButte Station near Butte Hall\nSaturday Farmers Market in downtown Chico (benefits are matched between $10 to $15)\nWednesday Farmers Market at North Valley Plaza on East Avenue (benefits are matched between $10 to $15)\nThe Chico Natural Food Co-Op in downtown Chico (students can receive 50% off locally grown fruits and vegetables when they use their EBT card)\nAsian Market on Nord Avenue\nMost grocery stores\n\nFacts about CalFresh\n\nIf eligible, you could receive up to $281.\nReceiving CalFresh will NOT affect your financial aid.\nYou can use your benefits all year! They are not tied to the academic calendar.\nYou can use your EBT card to purchase fruits, vegetables, meat, poultry, fish, dairy products, breads or cereals, and start-up edible plans.\n\n\n        View this post on Instagram            A post shared by Chico State CalFresh (@chicostatecalfresh)\n\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tAlmendra Lawrence\t\t\n\n\n\t\tAlmendra (Journalism, '11) is a bilingual content producer that helps empower and inspire audiences through storytelling. She also assists with editing and communications project management. She is a proud alumna and former editor-in-chief of The Orion.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/acarpizo/",
        "https://www.chicostatecalfresh.org/students",
        "https://a46.asmdc.org/press-releases/20211005-governor-newsom-signs-new-law-targeting-growing-hunger-crisis-california",
        "https://www.csuchico.edu/fosteryouth/",
        "https://www.csuchico.edu/eop/",
        "https://www.instagram.com/reel/CqVxgLNpFjZ/?utm_source=ig_embed&utm_campaign=loading",
        "https://www.instagram.com/reel/CqVxgLNpFjZ/?utm_source=ig_embed&utm_campaign=loading",
        "https://today.csuchico.edu/calfresh/?share=facebook",
        "https://today.csuchico.edu/calfresh/?share=twitter",
        "https://today.csuchico.edu/calfresh/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Expanded%20CalFresh%20Eligibility%20Brings%20Food%20Access%20to%20More%20Chico%20State%20Students&body=https%3A%2F%2Ftoday.csuchico.edu%2Fcalfresh%2F&share=email",
        "https://today.csuchico.edu/calfresh/#print",
        "#",
        "https://today.csuchico.edu/author/acarpizo/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}