{
    "title": "UCR Jobs - Position Details ",
    "body": "\n\n\n\n\n\nSkip Navigation\n\n\nHome Page\n\n\n\n\n\n\n\n\nLogin \nRegister \n\n\n\n\n\n\n\nHR Employment\n\n\n\n\n\n\n\n\n\nHome\nBrowse Jobs\nHow to Apply\nMy Account\nHelp\nAbout\n\n\n\n\n\n\n\n\n\n\nPosition Details\n\n\n\nView All Details\n \n          Back To Current Job Opportunities\n    \n\nApply\n\n\n\nSenior Food Service Worker, Dining Services    \n\n\n\n\n Job Number\n Full/Part Time \n Schedule   \n Salary\n\n\n\n\n 28784289 \n Full Time    \n Varies    \n     $39,463 -     $49,068    \n\n\n\n\nPosition Information\n \nUC Riverside's Dining and Hospitality Services is recruiting for multiple, full-time Senior Food Service Workers. The Senior Food Service Worker performs a variety of semi-skilled duties that relate to food preparation, customer service, safety and sanitation, and general cleaning duties in one or more kitchen and/or a dining areas for UCR Dining Services. The Senior Food Service Worker may serve in a leadership capacity over a small group of student staff in a team environment.**As a condition of employment, you will be required to comply with the University of California SARS-CoV-2 (COVID-19) Vaccination Program Policy. All Covered Individuals under the policy must provide proof of Full Vaccination or submit a request for Exception (based on Medical Exemption, Disability, and/or Religious Objection) or Deferral (based on pregnancy) no later than the applicable deadline. For new University of California employees, the applicable deadline is ten weeks after their first date of employment.**  \t\n    \n    \n Education  \n\n\n Experience  \n\n\n\n Experience \n Requirement\n\n\n\n     Recent experience within a customer service oriented environment of responding to and meeting/exceeding the needs of the customer.  \n Required  \n\n\n     Previous experience working with and operating standard and specialized kitchen equipment generally found in a large commercial kitchen to accomplish daily assignments.  \n Required  \n\n\n     Experience interacting and leading in a team based environment to achieve completion of daily duties.  \n Preferred  \n\n\n     Experience and knowledge of proper procedures in heating and retherming food items.  \n Preferred  \n\n\n     UC Dining experience, knowledge of systems, policies, procedures and regulations.  \n Preferred  \n\n\n  6   months of recent experience in food preparation and general maintenance/cleaning in a kitchen and/or dining area within a high volume of food service operation; or an equivalent combination of education and experience.  \n Required  \n\n\n\n\n\n Special Conditions  \n\n\n\n Special Condition \n Requirement \n\n\n\n Overtime \n Required  \n\n\n Hired candidate must (1) successfully complete online Food Handlers Certificate Training within the first thirty (30) days of appointment start date. Positions within Starbucks require successful completion of training and certification as a Barista within ninety (90) days of appointment start date. Must successfully complete a pre-employment physical examination. \n Required  \n\n\n Must successfully complete a pre-employment, post-offer physical and background check through the DOJ and FBI prior to appointment start date. Must wear University issued uniform and ID badge. \n Required  \n\n\n Shift Work (hours outside standard Mon-Fri 8AM-5PM work hours) \n Required  \n\n\n\n\n\n Minimum Requirements \nKnowledge of general rules, regulations and procedures for sanitation and safety as it applies to food preparation, service, kitchens and storage areas. Must maintain compliance with California Health and Safety Codes.Ability to count inventory, food and supplies. Ability to read and comprehend basic instructions and understand common food measurements.Must adhere and meet the Injury Illness Prevention Program Guidelines: Work in a safe and responsible manner while not putting self or others at risk. Comply with applicable policies and procedures and regulations, using personal safety gear, observing warning signs, learning about potential hazards and reporting unsafe conditions. Must be able to exert wellpaced mobility of up to four (4) hours in length and stand continuously throughout an eight (8) hour shift on uncarpeted surfaces. Must be able to move 20 pounds frequently and 50 pounds occasionally following proper safety guidelines. Must be able to stand, walk, climb, stoop, push, pull, reach and crouch for extended periods of time, as required to complete job assignments. Ability to work in temperature extremes, continuous noise and physical risks found in food service environments.Proven ability to accurately perform repetitive tasks according to set procedures and pace and a proven ability to give and follow explicit directions and carry out instructions.Ability to read, write, perform basic arithmetic calculations, follow oral and written instructions.Demonstrated skill in cutting, slicing, and measuring dry and liquid food ingredients in units of measurements such as cup, pint, ounce, quart and pound.Proven ability to read, speak, write and understand English in order to determine and carry out job duties and communicate with supervisors, co-workers and customers. Skill in communicating effectively and professionally using tact and diplomacy. Skill to write legibly and record information accurately and as necessary to perform job duties. \n Preferred Qualifications  \n \nAdditional Information \nIn the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel.UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.  UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.  UC Riverside is the top university in the United States for social mobility. - U.S. News 2020  UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.  Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019  Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings  UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.   The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law. For information about our generous employee benefits package, visit: Employee Benefits Overview \nJob Description Details\n\n View complete Job Description for this position  \n\n\n\n\n\n\n\n\n\n\nMore Information\n\n\n\nGeneral Campus Information\n\nUniversity of California, Riverside\n\n900 University Ave.\n\nRiverside, CA 92521\n\n\n                                Tel: (951) 827-1012\n\n\n\nCareer Opportunities\n                            • UCR Libraries\n\nCampus Status\n                            • Maps and Directions\n\n\n\nDepartment Information\n\nHuman Resources\n1160 University Ave.\nRiverside, CA 92521\n                                    \nFax: (951) 827-6493\n                                    E-mail: jobshelp@ucr.edu\n\n\n\nRelated Links\n\nHuman Resources Home\nDiversity\nAbout UCR\n\n\n\n\n\n\n\n\nCampuswide Navigation\n\n\nHome\n\n\nAbout UCR\n\n\nAcademics\n\n\nAdmissions\n\n\nAthletics\n\n\nHappenings\n\n\nResearch\n\n\nCampus Resources\n\n\nGiving to UCR\n\n\n\nFooter\n\n\n\nPrivacy Policy\n\n\nTerms and Conditions\n\n\n                            © 2010 Regents of the University of California\n                        \n\n                            Last modified: 2010-Apr-22\n                        \n\n\n\n\n \n",
    "links": [
        "#main",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_login&module=jobs",
        "!Controller?action=jobs_webui.show_page&page=jobs_register&module=jobs",
        "#",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&public=true&module=jobs",
        "https://jobs.ucr.edu/how-apply",
        "!Controller?action=jobs_webui.show_page&page=jobs_account_overview&module=jobs",
        "https://jobs.ucr.edu/help",
        "http://jobs.universityofcalifornia.edu/",
        "#",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&module=jobs",
        "!Controller?action=jobs_webui.forward_link&link=jobs_webui.apply_job&requisition_id=28784289&module=jobs",
        "https://ucnet.universityofcalifornia.edu/compensation-and-benefits",
        "!Controller?action=jobs_template&page=CT_job_description&requisition_id=28784289",
        "http://www.ucr.edu/employment.html",
        "httsp://library.ucr.edu/",
        "http://campusstatus.ucr.edu/",
        "http://www.ucr.edu/about/directions.html",
        "http://campusmap.ucr.edu/campusMap.php?loc=PRSNL",
        "mailto:jobshelp@ucr.edu?subject=Web Site Inquiry",
        "http://hr.ucr.edu",
        "http://diversity.ucr.edu",
        "http://www.ucr.edu/about",
        "http://www.ucr.edu/",
        "http://www.ucr.edu/about/",
        "http://www.ucr.edu/academics/",
        "http://www.ucr.edu/admissions/",
        "http://www.ucr.edu/athletics/",
        "http://www.ucr.edu/happenings/",
        "http://www.ucr.edu/research/",
        "http://www.ucr.edu/resources/",
        "http://www.ucr.edu/giving/",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}