{
    "title": "Special Populations\n | Admissions | CSUSB",
    "body": "\n\n\n\n\nSkip banner navigation\nSkip to main content\n\n\n\nClose Navigation Screen\n\n\n\n\n\n\n\n\n\nLogin to  myCoyote \n\n\n\nView the Campus  Directory \n\n\n\nCSUSB  Library \n\n\n\nCSUSB  Maps and Directions \n\n\n\nCSUSB  Palm Desert Campus \n\n\n\n Make a Gift to CSUSB \n\n\n\n\n\n\n\n\n\n\n\nCSUSB Admissions - Global Site Navigation \n\n\n                        \n             Admissions Overview - Global Site Navigation \n\n\n                        \n             Apply to CSUSB - Global Site Navigation \n\n\n                        \n             After I'm Admitted - Global Site Navigation \n\n\n                        \n             First-year Students - Global Site Navigation \n\n\n                        \n             Transfer - Global Site Navigation \n\n\n                        \n             International Students - Global Site Navigation \n\n\n                        \n             English Language Program - Global Site Navigation \n\n\n                        \n             Undocumented Student Center - Global Site Navigation \n\n\n                        \n             Osher Lifelong Learners - Global Site Navigation \n\n\n                        \n             Military Veterans/Dependents - Global Site Navigation \n\n\n                        \n             Financial Aid & Scholarships - Global Site Navigation \n\n\n                        \n             Student Financial Services - Global Site Navigation \n\n\n                        \n             Summer Session - Global Site Navigation \n\n\n\n\n                                \n                 Academics - Global Site Navigation \n\n\n                        \n             Academic Calendar - Global Site Navigation \n\n\n                        \n             Academic Advising  - Global Site Navigation \n\n\n                        \n             Degrees & Programs - Global Site Navigation \n\n\n                        \n             Colleges & Departments - Global Site Navigation \n\n\n                        \n             Course Catalog / Bulletin - Global Site Navigation \n\n\n                        \n             Class Schedule - Global Site Navigation \n\n\n                        \n             Online Programs - Global Site Navigation \n\n\n                        \n             Academic Success and Undergraduate Advising - Global Site Navigation \n\n\n                        \n             Graduate Studies - Global Site Navigation \n\n\n                        \n             Office of the Registrar - Global Site Navigation \n\n\n                        \n             Academic & Support Resources - Global Site Navigation \n\n\n                        \n             Academic Research - Global Site Navigation \n\n\n                        \n             Graduation Initiative 2025 - Global Site Navigation \n\n\n\n\n\nCSUSB Athletics               \n\n\n                            \n               Men's Sports             \n\n\n\nMen's Sports Baseball           \n\n\n\nMen's Sports Basketball           \n\n\n\nMen's Sports Golf           \n\n\n\nMen's Sports Soccer           \n\n\n\n\n                            \n               Women's Sports             \n\n\n\nWomen's Sports Softball           \n\n\n\nWomen's Sports Cheer & Dance           \n\n\n\nWomen's Sports Track & Field           \n\n\n\nWomen's Sports Cross Country           \n\n\n\nWomen's Sports Volleyball           \n\n\n\nWomen's Sports Soccer           \n\n\n\nWomen's Sports Basketball           \n\n\n\n\n\n\n                                \n                 Campus Life - Global Site Navigation \n\n\n                        \n             Events Calendar - Global Site Navigation \n\n\n                        \n             Get Involved - Global Site Navigation \n\n\n                        \n             Student Services - Global Site Navigation \n\n\n                        \n             Recreation & Wellness - Global Site Navigation \n\n\n                        \n             Student Health & Safety - Global Site Navigation \n\n\n                        \n             Housing & Dining - Global Site Navigation \n\n\n                        \n             Music & Arts - Global Site Navigation \n\n\n                        \n             Student Employment - Global Site Navigation \n\n\n                        \n             Campus Safety & Emergency Info - Global Site Navigation \n\n\n                        \n             Palm Desert Campus Life - Global Site Navigation \n\n\n\n\n                                \n                 About CSUSB - Global Site Navigation \n\n\n                        \n             Inside CSUSB - Global Site Navigation \n\n\n                        \n             COVID-19           \n\n\n                        \n             Campus Map - Global Site Navigation \n\n\n                        \n             President's Office - Global Site Navigation \n\n\n                        \n             Shared Governance - Global Site Navigation \n\n\n                        \n             Strategic Plan 2023-2028 - Global Site Navigation \n\n\n                        \n             Administrative Divisions - Global Site Navigation \n\n\n                        \n             Organizational Chart - Global Site Navigation \n\n\n                        \n             Strategic Communication - Global Site Navigation \n\n\n                        \n             Mission, Vision & Core Values - Global Site Navigation \n\n\n                        \n             Accreditation           \n\n\n                        \n             Assessment           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSite Header Region\n\n\n\n\n\n\nCSUSB Home\n\n \n\n\n\nWe Define the Future\n\n \n\n\n\n\n\n\n\n\nLogin to  myCoyote \n\n\n\nView the Campus  Directory \n\n\n\nCSUSB  Library \n\n\n\nCSUSB  Maps and Directions \n\n\n\nCSUSB  Palm Desert Campus \n\n\n\n Make a Gift to CSUSB \n\n\n\n\n\n\n\n\nSearch CSUSB\n\n\nSearch CSUSB \n\n\n\n\n\n\n\nCSUSB Main Menu\n\n\n\n\n\n\nPage Header\n\n\n\n\n\n\n\n\nAdmissions\nSpecial Populations\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      Page Menu\n      \n\n\n\n\n\n\n                                            \n                       Home                      \n\nExpand Menu Item                                             \n                       Home                      \n\n\n\n\n\n\n\n\n                                        \n                     Majors & Departments                   \n\n\n                                        \n                     Cost                   \n\n\n\n\n\n\n                                        \n                     Palm Desert Campus                   \n\n\n                                        \n                     Student Life                   \n\n\n\n\n\n\n                                        \n                     Parent & Family Resources                   \n\n\n\n\n\n\n                                        \n                     Counselor Resources                   \n\n\n\n\n\n\n\n\n                                            \n                       Apply to CSUSB                     \n\nExpand Menu Item                                             \n                       Apply to CSUSB                     \n\n\n\n\n\n\n\n\n                                            \n                       First-Year Students                     \n\n\n                                        \n                     First-Year Student Impaction Criteria                   \n\n\n                                        \n                     First-Year Student Deadlines                   \n\n\n\n\n                                            \n                       Transfer Students                     \n\n\n                                        \n                     Transfer Impaction Criteria                   \n\n\n                                        \n                     Transfer Deadlines                   \n\n\n                                        \n                     Associates Degree for Transfer (ADT)                   \n\n\n\n\n\n\n\n\n                                        \n                     Spring Admission                   \n\n\n                                        \n                     Fall Admission                   \n\n\n\n\n\n\n                                        \n                     Special Populations                   \n\n\n                                        \n                     Returning Students                   \n\n\n                                        \n                     Military Veterans                   \n\n\n                                        \n                     Non-degree Programs                   \n\n\n\n\n\n\n                                            \n                       Establishing Residency                     \n\n\n                                        \n                     Undocumented Resources                   \n\n\n\n\n\n\n\n\n\n\n                                            \n                       Admitted Students                     \n\nExpand Menu Item                                             \n                       Admitted Students                     \n\n\n\n\n\n\n\n\n                                        \n                     Next Steps                   \n\n\n                                        \n                     Accept your Admission                   \n\n\n                                        \n                     Submitting Documents                   \n\n\n                                        \n                     Orientation                   \n\n\n\n\n\n\n                                        \n                     Coyote First STEP (ESP)                   \n\n\n                                        \n                     Early Assessment Program (EAP)                   \n\n\n\n\n\n\n                                        \n                     myCoyote                   \n\n\n                                        \n                     Summer Session at CSUSB                   \n\n\n\n\n\n\n\n\n                                        \n                     Admissions Forms                   \n\n\n                                            \n                       Contact Us                     \n\nExpand Menu Item                                             \n                       Contact Us                     \n\n\n\n\n\n\n\n\n                                        \n                     Meet the Team                   \n\n\n\n\n\n\n                                        \n                     Frequently Asked Questions                   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMain Content Region\n\n\n\nSpecial Populations\n\n\n\n\n\n\n\n\n\nSpecial Populations\nCSUSB is committed to providing Higher Education access to as many students as possible. We recognize several special populations of students in order to help better provide resources and support through the admissions process. All special population must meet regular Admissions criteria. For more information on admission, requirements please see our First-Year and Transfer Admission webpages.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEducational Opportunity Program (EOP)\nThe mission of the EOP program is to provide access to higher education for historically low-income, underrepresented, disadvantaged students who have the potential to succeed at the university level. EOP recruits, retains and graduates students by providing a comprehensive program of support services which include admission, academic advisement, career and personal counseling, tutoring, financial assistance and graduate school information.\nFor more information on the EOP at CSUSB visit the Educational Opportunity Program website. \n\n\n\n\n\nProgram Requirements\nThe Educational Opportunity Program is designed to provide academic support services to historically low-income and educationally disadvantaged, first-generation college students.\n\nApplicants must meet the EOP criteria:\nMust be a First-Time Freshman or a Transfer Student\nMeet the EOP Income Guidelines\nBe a first-generation college student\nDemonstrate the need for academic assistance and support services\nDemonstrate the academic potential and motivation to succeed\nBe a California resident or qualify for an AB 540/2000 nonresident tuition exemption. For more information on Establishing Residency visit our website.\n\nEOP applications are submitted through the Cal State Apply application during priority filling periods. Deadlines do apply. Students need to be prepared to answer several short essay questions and provide contact information for EOP Recommendation Forms. \nEOP, San Bernardino Campus\nThe Educational Opportunity Program is an admissions and support services program designed to assist students who meet specific income guidelines and demonstrate the potential to obtain a baccalaureate degree.\nThe program provides:\n\nAdmission to the University\nAcademic and personal counseling\nFinancial assistance to eligible undergraduate students. \n\nEOP, Palm Desert Campus\nAt this time the EOP program at CSUSB is only able to service students attending courses at the San Bernardino campus. \n\n\n\n\n\n\n\n\n\n\n\n\n\nOver 60 Program\nCSUSB offers a program which allows California residents, 60 years of age or older, to enroll in regular session courses without payment of certain specified fees. All regular admission requirements must be met. Official transcripts from each institution the individual has attended must be submitted to the Office of Admissions and Student Recruitment.\n\n\n\n\n\nProgram Requirements\nThe program is required to adhere to the following standards:\n\nEnrollment shall be limited to persons who are California residents, are 60 years of age or older, and are eligible for admission to the university\nPersons enrolling in the program will be able to register on the last day of priority registration. If someone applies after the priority period is over, they will register during the late registration period, but the $25 late fee will be waived.\n\nOver 60 Program, San Bernardino Campus\nFor more information, please contact the Office of the Registrar-Registration Unit at (909) 537-7671 or registration@csusb.edu.\nOver 60 Program, Palm Desert Campus\nPalm Desert area residents may participate in the Over 60 Program at Cal State San Bernardino’s Palm Desert Campus.\nPlease contact Ruth Howell at rhowell@csusb.edu for details.\n\n\n\n\n\n\n\n\n\n\n\n\n\nReturning CSUSB Students\nWelcome back Coyotes, #Coyote4life\nWe are happy to welcome back former CSU, San Bernardino (CSUSB) students who successfully completed at least one semester in a degree-seeking baccalaureate program. The first step in returning to CSUSB is to determine the type of Re-Admission Category you fall under.  Readmission consideration is based on both the academic standing when they left as well as whether they have attempted units since their enrollment in CSUSB degree program. Each category has a slightly different application process to return. \nMore information and resources for Returning CSUSB Students can be found on our webpage. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTransfer Student Success Center\nThe Transfer Student Success Center (TSSC) serves as the heart of CSUSB’s transfer student community. The TSSC supports prospective and current transfer students as they navigate the transition to and through CSUSB. The center provides programs, events, resources and support services created specifically for transfer students. We also offer peer-to-peer support through our team of Transfer Peer Mentors. The TSSC seeks to ensure that all transfer students find a sense of belonging at CSUSB and are successful in achieving their personal, professional, and educational goals. \nVisit the Transfer Student Success Center webpage for more information and to check their schedule of events. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUniversity Honors Program \n The Honors Program supports highly-motivated students as they transition from high school into collegiate studies and provides a community of support throughout their time at CSUSB. Peers, faculty, and staff work alongside each other in classes, workshops, and experiential learning activities that include retreats, service-learning, and excursions. Together, we are the Honors Coyotes. You can see what we’re all about on this site. For more information, email honors@csusb.edu or visit the University Honors Program website. \n\n\n\n\n\nProgram Requirements\nStudents are invited to apply to the University Honors Program once they have been admitted to CSUSB. Admission to the Honors Program depends on meeting a combination of GPA and other factors that are combined into something called a Multifactor Admissions Score.\nTransfer students and CSUSB students aspiring to apply for admission in their junior year must have a GPA of 3.5 to be admitted to the University Honors Program.\n\nThe application for admission to the program is entirely online, and qualifying students will be sent a link to complete it. It consists of a student résumé, a Tweet-length statement of purpose regarding what you hope to get out of and contribute to the program, and a short essay in response to a prompt. Applicants will also provide two letters of recommendation. The application is completed entirely online and the web-link is provided in the invitation to apply.\nPresidential Academic Excellence Scholarship (PAES)\nThe CSUSB Academic Excellence Program is a competitive program welcoming 20 new students annually. Initiations to apply to the program will be made after students receive their CSUSB admission.\nThis exceptional community experience provides students with supplemental leadership, mentoring and engagement opportunities specific to the Academic Excellence Program. These opportunities are intentionally crafted to support a student’s career and educational goals beyond the bachelor’s degree while providing a way for students to give back to the CSUSB and Honors community.\nThe CSUSB Academic Excellence Program supports 4 years (8 semesters) of enrollment toward a bachelor’s degree. In the current proposal for the program Participants in the program would receive:\n\nA scholarship to support any unmet tuition and mandatory fees beyond what is covered by Federal and State grants, tuition waivers or any other tuition paying programs\nAn annual scholarship for additional educational expenses, including books and other needs\nA one-time award to support a student’s participation in an unpaid leadership, academic or career related internship\nA scholarship to cover the cost of a double occupancy room and a basic meal plan for students who live in the Honors Residential Scholars community during their first year at CSUSB\n\nFor more information about the Presidential Academic Excellence Scholarship, visit their website. \n\n\n\n\n\n\n\n\n\n\n\n\n\nVeterans\nCal State San Bernardino is proud to provide educational opportunities for veterans of the military services and their dependents. The Office of Admissions and Student recruitment, in partnership with the entire campus community is here to support you through your journey to becoming a Coyote. \nWe have collected for you important information and campus resources to help streamline your admission process. However, If you ever have any questions or concerns please reach out. We thank you for your service and can't wait to welcome you to our campus. \nMore Information and resources for Veteran Student's can be found at our Military Veterans webpage. \n\n\n\n\n\nCredit for Military Service\nThe university grants lower-division undergraduate credit for completion of basic training in the armed forces of the United States. This credit is applied to the Lifelong Understanding area of General Education.\nA limited amount of additional credit may be granted to students who have completed certain service schools in addition to basic training. The total amount of credit earned on the basis of externally developed tests and through recommendations of the commission, which may be applied to a baccalaureate degree, shall not exceed 45 quarter units, except that advanced placement credit is excluded from the limit.\n\n\n\n\nOutreach and Special Programs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tAfrican American Initiative\n\t\t\t\t\t\nAt CSUSB, the goal for the African American Enrollment and Achievement Initiative is to build and foster the relationships with the African American community.  In this effort, we would like to increase the African American student population on our campus by going into our local communities to provide a service and resources for students to obtain information about higher education. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tNative American Initiative\n\t\t\t\t\t\nIn collaboration with local tribes and other community stakeholders, CSUSB's NAEAI created a specialized outreach unit to serve our Native American students and community members. Through the generous financial support of the San Manuel Band of Mission Indians, CSUSB has created specific scholarships, offices, and outreach support for the American Indian and Indigenous student populations interested in attending CSUSB or other CSU/UC systems.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tPromise Scholars Ambassadors\n\t\t\t\t\t\nCalifornia State University, San Bernardino has partnered with the Promise Scholars Organization in the Ontario-Montclair School District. Promise Scholars is dedicated to helping all Ontario-Montclair high school students get to college, whether enrolling at a four-year college or a local community college. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRight Content\n\n\nApply Now!\nBegin Your Coyote Journey\nOutreach and Student Recruitment\nGraduate Admissions\nInternational Admissions\nGraduation Initiative 2025\nVisit CSUSB\n \n\n\nContact Us\n\n\n\n\n\n\nAdmissions & Student Recruitment\n\n\n\nEmail moreinfo@csusb.edu\n\n\n\nPhone Number (909) 537-5188 \n\n\n\nLocation:UH-107\n\n\n\nOffice Hours\n\n\nMonday - Friday: \n 8:00 am - 5:00 pm\n\n\n\n\nSaturday - Sunday: \n Closed\n\n\n\n\n\nGraduate Admissions\nPhone: (909) 537-5058, Option 4\nEmail: gradadmissions@csusb.edu\nGraduate Website\nInternational Admissions\nPhone: (909) 537-5288\nEmail: international@csusb.edu\nInternational Website\n\n\n\n\n\n\n\n\n\nProfessor Spotlight\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming Events\n\n\n\n\n\n\n\n Jun 5-6\n\n\nCoyotes Rising\n\n 8:00am - 5:00pm\n TBD\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter Region\n\n\n\nCSUSB\n\n\nCalifornia State University, San Bernardino\n5500 University Parkway\nSan Bernardino, CA 92407\n+1 (909) 537-5000\n\n\n\n\n\nFollow Us\n\n\n\n\n\n CSUSB's Facebook\n\n\n\n\n\n CSUSB's Twitter\n\n\n\n\n\n CSUSB's YouTube\n\n\n\n\n\n CSUSB's Instagram\n\n\n\n\n\n CSUSB's LinkedIn\n\n\n\n\n\n CSUSB's Social Media\n\n\n\n\n\n\n\n\nAlso of InterestCredential ProgramsSpecial EducationCredential Program Requirements \n\n\n\n\n\n\n\n\n\nColumn 1 \n\n\n\n\nLogin\n\n\n\n\nmyCoyote\n  Login\n\n\n\n\nCanvas\n\n\n\n\nStudent Email\n  Login\n\n\n\n\nFaculty & Staff Email\n  Login\n\n\n\n\nCSUSB  \nDrupal Login\n\n\n\n\n\n\nOf Interest to...\n\n\n\n\nFuture Students\n  Interests\n\n\n\n\nCurrent Students\n   Interests\n\n\n\n\nFaculty & Staff\n  Interests\n\n\n\n\nFull-Time Faculty\n  Interests\n\n\n\n\nPart-Time Faculty\n  Interests\n\n\n\n\nCommunity & Visitors\n  Interests\n\n\n\n\nAlumni & Friends\n  Interests\n\n\n\n\nUniversity Partners\n  Interests\n\n\n\n\nMilitary/Veterans\n  Interests\n\n\n\n\n\n\n\n\nColumn 2 \n\n\n\n\nEmployment\n\n\n\n\nCSUSB \nJob Listings\n - CSUSB\n\n\n\n\nFaculty Jobs\n  - CSUSB\n\n\n\n\nCareer Center\n  - CSUSB\n\n\n\n\nHuman Resources\n  - CSUSB\n\n\n\n\nStudent Employment\n  - CSUSB\n\n\n\n\n\n\nResources\n\n\n\n\nContact\n  CSUSB\n\n\n\n\nClery Act\n\n\n\n\nAnnual Safety Reports\n  - CSUSB\n\n\n\n\nTitle IX Notice\n  - CSUSB\n\n\n\n\nDisclosure of Consumer Information\n  - CSUSB\n\n\n\n\n\n\n\n\nColumn 3 \n\n\n\n\nCampus Services\n\n\n\n\nAcademic Advising\n  - CSUSB\n\n\n\n\nHousing & Residential Life\n  - CSUSB\n\n\n\n\nOmbuds Services\n  - CSUSB\n\n\n\n\nParking\n  - CSUSB\n\n\n\n\nPolice\n  - CSUSB\n\n\n\n\nPsychological Counseling\n  - CSUSB\n\n\n\n\nServices to Students with Disabilities\n  - CSUSB\n\n\n\n\nStudent Health Center\n  - CSUSB\n\n\n\n\nTechnology Support\n\n\n\n\nTranscripts\n  - CSUSB\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccessibility\n\n\n\n\nPrivacy and Security\n\n\n\n\nNon-Discrimination Notice\n\n\n\n\nWebsite Copyright/DMCA Policy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page-header",
        "#main-content",
        "https://my.csusb.edu",
        "https://www.csusb.edu/campus-directory",
        "https://csusb.edu/library",
        "https://map.csusb.edu",
        "https://www.csusb.edu/pdc",
        "https://www.csusb.edu/advancement/development/how-give/make-a-gift",
        "https://www.csusb.edu/admissions",
        "https://www.csusb.edu/admissions-overview",
        "https://www.csusb.edu/admissions/apply-csusb",
        "https://www.csusb.edu/admissions/admitted-students/next-steps",
        "https://www.csusb.edu/admissions/apply-csusb/first-year-students",
        "https://www.csusb.edu/admissions/apply-csusb/transfer-students",
        "https://www.csusb.edu/international-education",
        "https://www.csusb.edu/international-education/programs/english-language-program",
        "https://www.csusb.edu/undocumented-student-success-center",
        "https://www.csusb.edu/olli",
        "https://www.csusb.edu/veterans",
        "https://www.csusb.edu/financial-aid",
        "https://www.csusb.edu/student-financial-services",
        "https://www.csusb.edu/summer",
        "https://www.csusb.edu/academics",
        "https://www.csusb.edu/academic-programs/academic-calendars",
        "https://www.csusb.edu/advising",
        "http://bulletin.csusb.edu/programs-az/",
        "https://www.csusb.edu/colleges-and-academic-departments",
        "https://bulletin.csusb.edu/",
        "https://www.csusb.edu/class-schedule",
        "https://www.csusb.edu/academics/online-programs-csusb",
        "/academic-success-and-undergraduate-advising",
        "https://www.csusb.edu/graduate-studies",
        "https://www.csusb.edu/registrar",
        "https://www.csusb.edu/academic-support-resources",
        "https://www.csusb.edu/academic-research",
        "https://www.csusb.edu/graduation-initiative-2025",
        "https://www.csusbathletics.com/",
        "https://www.csusbathletics.com/index.aspx?path=baseball",
        "https://www.csusbathletics.com/index.aspx?path=mbball",
        "https://www.csusbathletics.com/index.aspx?path=mgolf",
        "https://www.csusbathletics.com/index.aspx?path=msoc",
        "https://www.csusbathletics.com/index.aspx?path=softball",
        "https://www.csusbathletics.com/sports/2008/1/23/GEN_0123081553.aspx",
        "https://www.csusbathletics.com/index.aspx?path=wtrack",
        "https://www.csusbathletics.com/index.aspx?path=wcross",
        "https://www.csusbathletics.com/index.aspx?path=wvball",
        "https://www.csusbathletics.com/index.aspx?path=wsoc",
        "https://www.csusbathletics.com/index.aspx?path=wbball",
        "https://www.csusb.edu/campus-life",
        "https://www.csusb.edu/events",
        "https://www.csusb.edu/student-affairs/campus-programs-and-resources/getting-involved",
        "/student-affairs/leadership-team/assistant-vice-president-student-services",
        "https://www.csusb.edu/recreation-wellness",
        "https://www.csusb.edu/campus-life#student-health-and-safety",
        "https://www.csusb.edu/campus-life#housing-and-dining",
        "https://www.csusb.edu/campus-life#music-and-arts",
        "https://www.csusb.edu/human-resources/student-employment",
        "https://www.csusb.edu/advancement/strategic-communication/emergency-communication",
        "https://www.csusb.edu/pdc/student-life",
        "https://www.csusb.edu/about-csusb",
        "https://www.csusb.edu/inside",
        "https://www.csusb.edu/covid-19",
        "https://map.csusb.edu/",
        "https://www.csusb.edu/presidents-office",
        "https://www.csusb.edu/shared-governance",
        "https://www.csusb.edu/strategic-plan",
        "https://www.csusb.edu/administrative-divisions",
        "https://www.csusb.edu/sites/default/files/upload/file/University_Organization_Chart.pdf",
        "https://www.csusb.edu/advancement/strategic-communication",
        "https://www.csusb.edu/node/142646",
        "https://www.csusb.edu/academic-programs/accreditation/wasc-accreditation",
        "https://www.csusb.edu/assessment-capability-collaborative",
        "/",
        "https://my.csusb.edu",
        "https://www.csusb.edu/campus-directory",
        "https://csusb.edu/library",
        "https://map.csusb.edu",
        "https://www.csusb.edu/pdc",
        "https://www.csusb.edu/advancement/development/how-give/make-a-gift",
        "/admissions",
        "/visit-csusb/explore-csusb/explore-our-majors",
        "/admissions/cost",
        "/pdc/prospective-students",
        "/admissions/student-life",
        "http://www.csusb.edu/family",
        "/admissions/counselors",
        "/admissions/apply-csusb",
        "/admissions/apply-csusb/first-year-students",
        "/admissions/apply-csusb/first-year-students/first-year-student-impaction-criteria",
        "/admissions/apply-csusb/first-year-students/first-year-student-deadlines",
        "/admissions/apply-csusb/transfer-students",
        "/admissions/apply-csusb/transfer-students/transfer-impaction-criteria",
        "/admissions/apply-csusb/transfer-students/transfer-deadlines",
        "/admissions/apply-csusb/transfer-students/associates-degree-transfer-adt",
        "/admissions/apply-csusb/spring-admission",
        "/admissions/apply-csusb/fall-admission",
        "/admissions/apply-csusb/special-populations",
        "/admissions/apply-csusb/returning-students",
        "/admissions/apply-csusb/military-veterans",
        "/admissions/apply-csusb/non-degree-programs",
        "/admissions/apply-csusb/establishing-residency",
        "/admissions/apply-csusb/establishing-residency/csu-resources-undocumented-students",
        "/admissions/admitted-students",
        "/admissions/admitted-students/next-steps",
        "/admissions/admitted-students/accept-your-admission",
        "/admissions/admitted-students/submitting-documents",
        "https://www.csusb.edu/orientation",
        "https://www.csusb.edu/early-start",
        "https://www.csusb.edu/early-assessment",
        "https://my.csusb.edu/",
        "https://www.csusb.edu/summer/register",
        "/admissions/admissions-forms",
        "/admissions/contact-us",
        "/admissions/contact-us/meet-team",
        "/admissions/contact-us/faq",
        "https://www.csusb.edu/admissions/apply-csusb/first-year-students",
        "https://www.csusb.edu/admissions/apply-csusb/transfer-students",
        "https://www.csusb.edu/eop/admissions",
        "https://www.csusb.edu/admissions/apply-csusb/establishing-residency",
        "https://www2.calstate.edu/apply",
        "https://www.csusb.edu/eop/admissions/application-deadline",
        "mailto:rhowell@csusb.edu",
        "https://www.csusb.edu/admissions/apply-csusb/returning-students",
        "https://www.csusb.edu/orientation/transfer-student-success-center",
        "https://www.csusb.edu/orientation/transfer-student-success-center/events-transfer-students",
        "honors@csusb.edu",
        "https://www.csusb.edu/honors-program",
        "https://www.csusb.edu/honors-program/prospective-students/presidential-academic-excellence-scholars",
        "https://www.csusb.edu/honors-program/prospective-students/presidential-academic-excellence-scholars",
        "https://www.csusb.edu/admissions/apply-csusb/military-veterans",
        "https://www.csusb.edu/outreach-student-recruitment/special-programs-and-initiatives/african-american-initiative",
        "https://www.csusb.edu/outreach-student-recruitment/special-programs-and-initiatives/native-american-initiative",
        "https://www.csusb.edu/outreach-student-recruitment/special-programs-and-initiatives/promise-scholars-ambassadors",
        "https://www2.calstate.edu/apply",
        "https://www.csusb.edu/outreach-student-recruitment/begin-your-coyote-journey",
        "https://www.csusb.edu/outreach-student-recruitment ",
        "https://www.csusb.edu/graduate-studies",
        "https://www.csusb.edu/cisp",
        "https://www.csusb.edu/graduation-initiative-2025",
        "https://www.csusb.edu/visit-csusb",
        "https://www.csusb.edu/the-college-tour",
        "mailto:moreinfo@csusb.edu",
        "tel:+19095375188",
        "https://map.csusb.edu/?id=1850#!ref/UH",
        "Mailto:gradadmissions@csusb.edu",
        "https://www.csusb.edu/graduate-studies",
        "mailto:international@csusb.edu",
        "https://www.csusb.edu/international-education/international-admissions",
        "/we-define-the-future/spotlight/532735",
        "/event/565196",
        "tel:19095375000",
        "https://www.facebook.com/CSUSB",
        "https://www.twitter.com/csusbnews",
        "https://www.youtube.com/csusb",
        "https://instagram.com/csusb",
        "https://www.linkedin.com/school/california-state-university-san-bernardino/",
        "https://www.csusb.edu/advancement/strategic-communication/social-media-csusb",
        "https://www.csusb.edu/special-education/credential-programs",
        "https://www.csusb.edu/special-education",
        "https://www.csusb.edu/special-education/credential-program-requirements",
        "https://my.csusb.edu/",
        "https://csusb.instructure.com/login/saml",
        "http://mail.coyote.csusb.edu/",
        "http://mail.csusb.edu",
        "/cas",
        "https://www.csusb.edu/future-students",
        "https://www.csusb.edu/current-students",
        "https://www.csusb.edu/faculty-staff",
        "https://www.csusb.edu/faculty-resource-directory-ft",
        "https://www.csusb.edu/faculty-resource-directory-pt",
        "https://www.csusb.edu/community-visitors",
        "https://www.csusb.edu/alumni-friends",
        "https://www.csusb.edu/advancement/philanthropy/corporate-foundation-philanthropy",
        "https://www.csusb.edu/veterans",
        "https://www.csusb.edu/human-resources/talent-acquisition/job-opportunities",
        "https://careers.csusb.edu/en-us/filter/?job-mail-subscribe-privacy=agree&search-keyword=&category=unit%203%20-%20cfa%20-%20california%20faculty%20association",
        "https://www.csusb.edu/career-center",
        "https://www.csusb.edu/human-resources",
        "https://www.csusb.edu/human-resources/student-employment",
        "https://www.csusb.edu/about-csusb/contact-csusb",
        "https://www.csusb.edu/clery-act",
        "https://www.csusb.edu/sites/default/files/2022_CSUSB_Annual_Security_Report_0.pdf",
        "https://www.csusb.edu/institutional-equity-compliance/resources/title-ix-notice-non-discrimination-basis-gender-or-sex",
        "https://www.csusb.edu/registrar/disclosure-consumer-information",
        "https://www.csusb.edu/advising",
        "https://www.csusb.edu/housing",
        "https://www.csusb.edu/ombuds",
        "https://www.csusb.edu/parking",
        "https://www.csusb.edu/police",
        "https://www.csusb.edu/caps",
        "https://www.csusb.edu/ssd",
        "https://www.csusb.edu/student-health-center",
        "https://www.csusb.edu/its",
        "https://www.csusb.edu/registrar/records/request-csusb-transcript",
        "https://www.csusb.edu/ats/accessibility",
        "https://www.csusb.edu/about-csusb/privacy-and-security-notice",
        "https://www.csusb.edu/institutional-equity-compliance/resources/title-ix-notice-non-discrimination-basis-gender-or-sex",
        "https://www.csusb.edu/its/security/reporting/copyrightdmca-notice-and-procedure"
    ]
}