{
    "title": "California Pavement Preservation Center – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        California Pavement Preservation Center\n\t\t\t    \n                            CP2C Menu\n                        Show search box.California Pavement Preservation CenterTire Engineering Research CenterTire Engineering Research CenterTTC's TDA Project Database for CalRecycleIntroduction of TDATDA Training Module: IntroductionTDA BrochureTDA Environmental Testing and Earthquake SafetyTDA Low Cost Vibration MitigationAbout UsAbout UsStaffOngoing ResearchTechnical ServicesFacilitiesPavement Preservation Task GroupPavement Preservation Task Group (PPTG)PPTG Information and AnnouncementsCharterPPTG PhotosInnovation DatabasePavement Preservation Treatment Database (PPTDB)Strategy Selection ProgramEducational OpportunitiesEducational OpportunitiesPavement Preservation AcademyResources & PartnershipsCP2C NewslettersLibraryLibraryCaltrans DocumentsCP2 Center ManualsLinksCivil EngineeringCivil EngineeringContact InformationCalifornia Pavement Preservation CenterTire Engineering Research CenterTire Engineering Research CenterTTC's TDA Project Database for CalRecycle(opens in new window)Introduction of TDATDA Training Module: IntroductionTDA BrochureTDA Environmental Testing and Earthquake SafetyTDA Low Cost Vibration MitigationAbout UsAbout UsStaffOngoing ResearchTechnical ServicesFacilitiesPavement Preservation Task GroupPavement Preservation Task Group (PPTG)PPTG Information and AnnouncementsCharterPPTG PhotosInnovation DatabasePavement Preservation Treatment Database (PPTDB)Strategy Selection ProgramEducational OpportunitiesEducational OpportunitiesPavement Preservation AcademyResources & PartnershipsCP2C NewslettersLibraryLibraryCaltrans DocumentsCP2 Center ManualsLinksCivil EngineeringCivil Engineering(opens in new window)Contact Information\n        Our Office\n        Location Icon\n                                                                            Langdon, Room 203\n                                                                530-898-5114Regular Hours\n                                                                            8 a.m.–5 p.m.\n                                                                \n                                                                                Monday–Friday\n                                                                    Mailing Address\n                                                                            California Pavement Preservation Center\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0603\n                                                                    Current page:  CP2C\n                                        \n    \t\tPromoting Cost-Effective Pavement Preservation\n    \tAbout the CenterThe State of California, Department of Transportation (Caltrans) established the California Pavement Preservation Center (CP2C) at California State University, Chico in July 2006 and fully funded the Center in January 2007.Director HistoryDr. Hicks came on board in February 2007 as the Technical Director. In January 2009, Dr. Hicks stepped down and Dr. Mary Stroup-Gardiner was hired as the Technical Director. She stepped down in December 2009.Dr. DingXin Cheng has been the Director of the Pavement Preservation Center since 2010.Working With the Pavement Preservation Task Group (PPTG)The Center works closely with the Pavement Preservation Task Group (PPTG), a statewide volunteer group consisting of members from Caltrans, the Federal Highway Administration (FHWA) industry, various public agencies, and academia to help promote pavement cost-effective preservation.The PPTG is a partnering platform that includes all the organizations involved in pavement preservation in California.Mission Statement, History, Services and BenefitsExpand All | Collapse AllMission StatementThe mission of the Center is to serve as a leader in a partnered effort between government, industry and academia to advance and improve pavement preservation practices through education, innovation, applied and practical research, technology transfer, and implementation.This includes developing and advancing innovative approaches to pavement preservation and pavement materials. Specific objectives of the Center include:Serving as a technical resource for pavement preservation activities within the State of California;Educating others about the benefits of pavement preservation in partnership with public agencies and industry. This would involve educational programs at California State University, Chico as well as delivery of short courses and distance learning opportunities;Enhancing pavement preservation knowledge through research and training; andProviding advice and assistance to others in establishing a pavement preservation program.Center HistoryOne of the stated goals of the Caltrans Pavement Program Steering Committee (PPSC) for 2006 was to establish a pavement preservation center. This center addresses critical pavement preservation issues, as well as asset and pavement management needs.There is an essential need to focus on pavement preservation to conserve the existing highway infrastructure and to proactively increase its longevity, serviceability and safety. The Center addresses the goals of preservation, safety, service and innovation. It provides essential guidance to the Department and the Division of Maintenance to support the goals of Caltrans 5-Year Maintenance Plan as required by Senate Bill (SB) 1098.This is in line with the Program Level-Action Plan (PLAP) strategic goals. The needed assistance includes providing technical bases for the use of appropriate pavement preservation strategies that can result in extending pavement life (SHOPP avoidance), and in determining the optimum timing and efficiency of strategies, as well as provide effective cost control methods and sound asset management. The Center promotes partnerships and strengthens the Department's goals in pursing ways to enhance safety and stewardship.Caltrans officially announced the opening of the California Pavement Preservation Center, to be located at California State University, Chico, at the Annual Meeting of AEMA-ISSA-ARRA in Palm Springs February 2006.Caltrans stated the Center was able to provide unique help for those in need of related pavement preservation services by offering:1) expertise and exposure to national and international knowledge2) fast-track technology transfer, training and deployment of pavement preservation innovations3) timely solutions to pavement preservation issues4) solutions to overcome agency challenges and business practices5) solid working relationships and partnerships with industry, academia and other public agencies, and6) credible technical advice and consultation on pavement preservation issues.Center ServicesThe purpose of the Center is to provide pavement preservation services to public agencies and industry. Unique services include developing educational programs in pavement preservation, providing training and staff development opportunities, providing needed technical assistance to public agencies and industry, and managing/conducting research and outreach assistance.The Center works closely with the Pavement Preservation Task Group (PPTG), a statewide volunteer group consisting of members from Caltrans, the Federal Highway Administration (FHWA), industry, various public agencies, and academia to help promote pavement cost-effective preservation. The Center also is a member of the Rocky Mountain West Pavement Preservation Partnership (RMWPPP) and works with the National Center for Pavement Preservation (NCPP) on special projects.Benefits of Having the CenterWith the funding shortage for most state and local agencies, pavement preservation has become a cost effective way to extend pavement service life and reduce the deterioration of pavement. In summary, there are several benefits from having the California Pavement Preservation Center including:Pavement Preservation Database(opens in new window)Upcoming Events2023 Pavement Preservation Academy(opens in new window)Current and Future Events from the National Center for Pavement Preservation(opens in new window)ITS Berkeley Tech Transfer - Upcoming Courses(opens in new window)Featured EquipmentAPA is runningThe Asphalt Pavement Analyzer can study the rutting potential, and moisture susceptibility, and compare fatigue characteristics of asphalt concrete and their surface treatments.4-point Beam Fatigue Tester RunningThe 4-point beam fatigue test is used to evaluate the long-term performance of Hot Mix Asphalt under repeated load conditions.Roller Compactor RunningCP2 Center is purchasing an asphalt concrete laboratory slab compactor from James Cox and Sons.Useful LinksCampus LinksCollege of ECC(opens in new window)Chico State EnterprisesThe First International Conference on Pavement Preservation(opens in new window)The conference was held on April 3-5, 2010. All presentations are available on the conference website.Rock Products Committee(opens in new window)RPC provides the leadership and commitment to develop and improve Caltrans materials specifications, and test methods...Our CollegeDepartment Name 530-898-1234email@csuchico.eduSupport our College Other Majors and ProgramsAnthropologyChild DevelopmentNested List ItemNested List ItemHealth and Community ServiceSocial Work\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "terc/index.shtml",
        "http://ttc.ecst.csuchico.edu/TDADatabase",
        "terc/intro.shtml",
        "terc/tda_training_m_1.shtml",
        "terc/tda-brochure.shtml",
        "terc/tda_training_m_3.shtml",
        "terc/tda_training_m_4.shtml",
        "about-us/index.shtml",
        "about-us/people/index.shtml",
        "about-us/research.shtml",
        "about-us/technical-services.shtml",
        "about-us/facilities.shtml",
        "pptg/index.shtml",
        "pptg/info.shtml",
        "pptg/charter.shtml",
        "pptg/photos.shtml",
        "innovation-database.shtml",
        "pptdb.shtml",
        "strategy-selection.shtml",
        "educational-opportunities/index.shtml",
        "educational-opportunities/pp-academy.shtml",
        "resources-partnerships.shtml",
        "newsletter.shtml",
        "library/index.shtml",
        "library/caltrans-documents.shtml",
        "library/cp2c-manuals.shtml",
        "links/index.shtml",
        "https://www.csuchico.edu/ce/",
        "contact.shtml",
        "index.shtml",
        "terc/index.shtml",
        "http://ttc.ecst.csuchico.edu/TDADatabase",
        "terc/intro.shtml",
        "terc/tda_training_m_1.shtml",
        "terc/tda-brochure.shtml",
        "terc/tda_training_m_3.shtml",
        "terc/tda_training_m_4.shtml",
        "about-us/index.shtml",
        "about-us/people/index.shtml",
        "about-us/research.shtml",
        "about-us/technical-services.shtml",
        "about-us/facilities.shtml",
        "pptg/index.shtml",
        "pptg/info.shtml",
        "pptg/charter.shtml",
        "pptg/photos.shtml",
        "innovation-database.shtml",
        "pptdb.shtml",
        "strategy-selection.shtml",
        "educational-opportunities/index.shtml",
        "educational-opportunities/pp-academy.shtml",
        "resources-partnerships.shtml",
        "newsletter.shtml",
        "library/index.shtml",
        "library/caltrans-documents.shtml",
        "library/cp2c-manuals.shtml",
        "links/index.shtml",
        "https://www.csuchico.edu/ce/",
        "contact.shtml",
        "tel:530-898-5114",
        "about-us/people/staff/dingxin-cheng.shtml",
        "about-us/people/staff/dingxin-cheng.shtml",
        "pptg/index.shtml",
        "#",
        "#",
        "#panel1a",
        "#panel2a",
        "#panel3a",
        "#panel4a",
        "https://ceresearch2.csuchico.edu/cp2c/pptdb/",
        "educational-opportunities/pp-academy.shtml",
        "http://www.pavementpreservation.org/ncpp-events-2/ncpp-current-events/",
        "http://www.techtransfer.berkeley.edu/training/",
        "https://www.csuchico.edu/ecc/index.shtml",
        "https://www.csuchico.edu/cse/index.shtml",
        "http://www.pavementpreservation.org/icpp",
        "http://www.dot.ca.gov/hq/maint/Pavement/RPC/Rock_Products.html",
        "mailto:",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}