{
    "title": "August | 2013 | Watershed Review",
    "body": "\n\n\n\n\n\n\n\nWatershed Review\nEst. 2012\n\n\n\n\nMenu\n\nSkip to content\n\nHomeAbout This Blog\nHistory\nSubmit\n\n\n\n\n\n\n\t\t\t\t\tMonthly Archives: August 2013 \n\n\n\nA Conversation with Mari L’Esperance, Interviewed by Sabrina Derr \n\n\nThe Doll Maker \nLong before I knew what would become of you,\n I sat at the kitchen table, your small daughter,\n while you fashioned their brilliant robes\n out of colored rice paper: persimmon,\n indigo, mustard, silver and gold leaf, your\n fingers whispering across the dry sheets\n as they creased the layered folds of a kimono,\n working the stiff fibers so they would go\n where your hands willed them to go—\nuntil they lay quietly, bright leaves\n on the surface of a pond. The wide obi\n emerged from the richest patterns, was cinched\n around the tiny waist and fastened\n at the back. Black crepe became hair\n coiled in the style of old Edo, adorned\n with a splash of crimson. Here my mind’s eye\n falters, struggles to complete the image—\nand then I remember: the dolls were faceless,\n a blank oval of white tissue where eyes, mouth,\n and nose should have been—sightless, speechless,\n floating gracefully on their slender frames,\n hothouse orchids, mute and ephemeral.\n        When I first met Mari L’Esperance on October 7th, 2010, I had recently finished reading her full-length collection of poems, The Darkened Temple.  Mari was invited to read her collection at California State University, Chico, and I was honored to have been given the opportunity to introduce her remarkable work to a diverse audience of listeners.\n        The Chico heat was slowly laying itself to sleep, as autumn stirred the rustling leaves, and the sycamore trees left the University streets lined with crackling fragments. I remember what Mari said as we made our way to the reading, my palms moist with anxiety–a fear of speaking before others that I still can’t seem to overcome–but in her words, soft and contemplative, she said, “I love the dying season best.” We walked along the University grounds, in near darkness, crumbled leaves underfoot, and I suddenly realized that in those few words, Mari had inadvertently framed the complexities of The Darkened Temple for me, a collection with strong ties to memory, loss, and rebirth. Much like the transformation of the seasons, time and again, the eternal rest of a fallen leaf, this collection spoke to the transformation of the soul, the embrace of grief and its suffering, and the realization of one’s personal legend along the way.\n        It is wondrous how successful poetry can make the reader feel so suddenly, intimately involved with the poet, as if the words have intentionally inspired a correspondence. After reading Mari’s poems, even yet, I experience so many different emotions: with poems like “The Dollmaker”, I carry the speaker’s suffering for loss and the nostalgia for her heritage, and I mourn with the speaker in the poem, “Trying to Carry It”.  I find that all of Mari L’Esperance’s poems are graceful, compelling, and evocative. Please join me for a conversation with Mari L’Esperance:\nSabrina: Can you describe your drafting and revision process for The Darkened Temple?\nMari L’Esperance: First, thank you, Sabrina, for inviting me to participate in this interview and for your kind words about my poems. I also enjoyed meeting you in Chico two years ago and fondly remember visiting your class, taught by the lovely Jeanne E. Clark.\nAs to your question: it’s a tough one to answer, mostly because several of the poems in TDT were written quite a few years ago, so my memory’s fuzzy. What I can say: I was writing poem by poem and did not have a manuscript in mind as I was writing; that came many years later, once I realized I’d amassed enough publishable poems that might cohere into some kind of integrated whole. In terms of revision, I often tweak and fiddle with poems for months, sometimes years after they’ve been drafted and really only lay them to rest once they’ve been accepted for publication (and sometimes even that’s not the end of it!). It’s my obsessive nature, I suppose—not uncommon with poets!\nSabrina: You consider yourself a Hapa poet, so your identity is very much connected to your Japanese heritage. How has that influenced your writing?\nMari L’Esperance: I’d say my Japanese heritage significantly influences my writing and creative process, but in ways that are mostly not conscious to me. Japanese culture has traditionally been an inward-focused culture, where the interior life is deeply felt and resonant. This stance is reflected in Japan’s traditional arts and worldview, although there’s begun to be a shift in recent years, most noticeably post-3/11. I know that poems for me almost always begin with a feeling and an image (remembered or imagined), or an image that invites a particular feeling response. The beginning of a poem is a deeply interior experience for me and needs to evolve just like that—internally—and sometimes over many months before I’m ready to commit anything to paper. Therefore, I am not a particularly “productive” poet in the sense that I don’t write daily, or even weekly. This inwardness, the internal gestation and shape shifting of emotional and psychological material over long periods of time, could be attributed to my Japanese self, but I also know of Western (and non-Japanese/Hapa) poets who work in a similar fashion. Temperament has a lot to do with one’s creative process—as much as cultural influence, I think.\nSabrina Derr: I understand that much of the inspiration for The Darkened Temple was a coming to terms with the disappearance of your mother. How do you think that has ultimately shaped this collection?\nMari L’Esperance: Yes, the central concern of TDT is the disappearance of my mother in 1995 when I was studying poetry as a graduate student at New York University. Understandably, her disappearance has become a core theme for me and will likely infuse my writing for the rest of my life, in one form or another. There are a few poems in the collection that predate my mother’s disappearance, but in gathering poems for the manuscript back in 2006, it quickly became apparent to me that loss and the integration of loss were central themes in most of the poems. Since the book was published in 2008, I’ve come to realize the collection as a whole also speaks, indirectly and symbolically, to the devaluation of the archetypal feminine in our troubled world, evidenced by the havoc being wreaked on the environment, not to mention human rights violations in many countries and the systematic dismantling of social services, education, and healthcare as we’ve known them here at home. So although the collection is largely “about” my mother’s disappearance and its aftermath, I do believe it speaks to loss (and transformation) on a more universal scale as well.\nSabrina: I recall you telling me once that when you initially saw the cover of the book, you cringed. Did you have much of a say in the selection process, and looking back on it now that it has been well-received, what do you think of it?\nMari L’Esperance: You have a good memory! Yes, when I first saw the cover, I’ll admit I was taken aback—the colors and design were so bold and graphic and did not at all seem aligned with the content of my manuscript, which I felt was quiet and understated and needed a cover design that reflected this understatedness (that’s my Japanese self speaking!). But over time the cover has grown on me and I’ve come to appreciate its dark beauty and intensity. It really does reflect the transformational aspect of the manuscript accurately— “Below the furnace, the ash,” to quote Brenda Hillman—so there was clearly wisdom involved in its selection. The design team at the University of Nebraska Press did not involve me much in the selection process, but were open to my input.\nSabrina: What is your process for submitting new writing?\nMari L’Esperance: I’ll admit that I’ve not been sending out work for a while now; I’m not at that stage. But when I’m in submission mode, I’ll send poems to editors who’ve generously invited me to submit or to journals I admire and think will be receptive to my work. I know I’m not alone, but I really do despise sending my work out—there, I said it!—but realize it’s a necessary stage in the life of a poem if one wants it to be read. That said, I’m resigned to being in non-submission mode a while longer. I’m preparing to move to Los Angeles at the end of November and it’ll be some time before the dust settles. I’m curious to see how a change in surroundings, geography, and climate will influence new work.\nSabrina: What advice would you give to new writers beginning the practice of submitting their work?\nMari L’Esperance: As someone who’s spent time on both sides of the transom (until recently, I served as an Associate Poetry Editor for Connotation Press: An Online Artifact), I humbly offer:\n– Don’t rush to publish. Make sure your work is ready, and then send out only your best work.\n– Submit to publications whose aesthetics are aligned with your own (which means subscribing to/reading a wide array of journals, as your budget allows).\n– Follow the submission guidelines! This means: if the guidelines specify “Submit 3-5 poems,” don’t submit 10. If the submission period is September through May, don’t submit in July. This process is hard enough without making it harder on yourself by not following the guidelines.\n– Be courteous and brief in your cover letter (if submitting by snail mail—a disappearing practice, it seems) and address the editor(s) by name whenever possible.\n– Do say something brief about why you’re submitting to Journal X and do mention a small handful of recent publications in your cover letter.\n– Don’t include a five-page bio; no one will read it and (I think) it’s a turnoff. Your poems should be front and center.\n– If your work is accepted for publication, send a brief note of acknowledgment and gratitude; editors like to know their often-invisible toil is appreciated. Also: publishing is all about relationships, and editors have long memories; I say this only partly in jest.\n– Have faith: if the work’s good, it will find a home. Rejection is part and parcel of the writing life. Have your feelings of discouragement and disappointment (I have them often!), but then turn around and resubmit. This is another reason to submit seasoned work rather than work that’s fresh out of the gate; we’re often more emotionally attached to newer work and rejection can sting that much more. Build up that rejection callous!\n– Believe in your work. If you don’t, no one else will.\nSabrina: Which of the poems in your collection was the most difficult to write?\nMari L’Esperance: I suppose they were all difficult to write, each in its own way. But if I have to choose one, I’d say the 10-section “White Hydrangeas as a Way Back to the Self” because I really had to descend to a deep place within myself to access the poem, while at the same time struggle mightily to convey authenticity of feeling and experience; avoid gratuitous sentimentality; and incorporate form and shape and appropriate language/diction, images, and sonic effects that allowed the poem to succeed on the page. I also feared being “too self disclosing,” but ultimately let the poem speak the way it needed to speak.\nSabrina: Do you have a special writing ritual?\nMari L’Esperance: It’s not “special,” but I do need adequate (thirty minutes to an hour) time and space to daydream and stare into nothingness before writing. Reading, intuitively and without external directives, often has a part in this wool gathering phase. I’d call this process “creating transitional space,” which is necessary (at least for me) to access the deeper layers of my psyche, where the beginnings of poems reside. I do carry a small notebook in which I’ll occasionally jot things down, but I don’t necessarily translate my jottings into poems; it all simply goes into the pot and somehow results in Art—somehow, sometime.\nSabrina: This is kind of a strange question, but what is your favorite animated film?\nMari L’Esperance: Oh… so hard to name just one! But I absolutely love Isao Takahata’s “Grave of the Fireflies” (1988) http://www.imdb.com/title/tt0095327/ because it powerfully connects me with my mother’s experience as a young girl in Japan during World War II. Although it’s not easy to watch, I highly recommend it. Following closely are Hayao Miyazaki’s “My Neighbor Totoro” (1988) http://www.imdb.com/title/tt0096283/ and Yoshifumi Kondo’s “Whisper of the Heart” (1995) http://www.imdb.com/title/tt0113824/; the former is now well known in the United States, the second less so. “Whisper of the Heart” has a special place in my heart because it’s set in pre-Internet/cell phone Japan and brings me back to pleasant memories of my childhood there (although I was mostly raised in the United States, I visited Japan often when I was growing up). I also now realize the film was released the year my mother disappeared; I hadn’t noticed this before, but this might help to explain its significance to me.\n——-\nSabrina: It’s been an honor, Mari. Thank you.\nMari L’Esperance: Thank you kindly, Sabrina, for this opportunity. It’s been a pleasure.\nTo find out more about Mari L’Esperance, her books, and upcoming readings, visit her website at: http://www.marilesperance.com/\n\n \n\nAugust 20, 2013watershedcsuc CSUC, interview, Mari L'Esperance, poetry, Sabrina Derr, The Darkened Temple, Watershed Review\nLeave a comment\n\n\n\n\n\n\nBlogroll\n\nDiscuss\nGet Inspired\nGet Polling\nGet Support\nLearn WordPress.com\nTheme Showcase\nWordPress Planet\nWordPress.com News\n\n\nTopics\n\nIntern Spotlight\n\nUncategorized\n\n\nUpcoming Events No upcoming events\nArchives\n\nMay 2022\nMarch 2022\nMay 2020\nOctober 2019\nMay 2019\nApril 2019\nOctober 2018\nJanuary 2018\nDecember 2017\nOctober 2017\nSeptember 2017\nApril 2017\nNovember 2016\nOctober 2016\nSeptember 2016\nDecember 2015\nOctober 2015\nSeptember 2015\nApril 2015\nMarch 2015\nFebruary 2015\nNovember 2014\nOctober 2014\nSeptember 2014\nApril 2014\nFebruary 2014\nNovember 2013\nOctober 2013\nAugust 2013\nApril 2013\nMarch 2013\nFebruary 2013\nJanuary 2013\n\n \n\nFollow me on TwitterMy Tweets \n\n\n\n\nBlog at WordPress.com.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\tPrivacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. \nTo find out more, including how to control cookies, see here:\n\t\t\t\t\n\t\t\tCookie Policy\t\t\n\n\n \n\n\n\nFollow\n\n\nFollowing\n\n\n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\nJoin 44 other followers\n\n\n\n\n\n\n\n \n\n\t\t\t\t\t\t\t\t\t\t\t\tSign me up\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tAlready have a WordPress.com account? Log in now. \n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\n\n Customize\n\n\n\n\nFollow\n\n\nFollowing\n\n\nSign up\nLog in\n\n\n\t\t\t\t\t\t\t\t\t\t\tReport this content\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tView site in Reader\t\t\t\t\t\t\t\t\t\t\n\n\nManage subscriptions\n\nCollapse this bar\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n",
    "links": [
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/",
        "#content",
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/about/",
        "https://watershedcsuc.wordpress.com/history/",
        "https://watershedcsuc.wordpress.com/submit/",
        "https://watershedcsuc.wordpress.com/2013/08/20/a-conversation-with-mari-lesperance-interviewed-by-sabrina-derr/",
        "https://watershedcsuc.wordpress.com/2013/08/20/a-conversation-with-mari-lesperance-interviewed-by-sabrina-derr/mari-lesperance-2/",
        "http://www.imdb.com/title/tt0095327/",
        "http://www.imdb.com/title/tt0096283/",
        "http://www.imdb.com/title/tt0113824/",
        "http://www.marilesperance.com/",
        "https://watershedcsuc.wordpress.com/2013/08/20/a-conversation-with-mari-lesperance-interviewed-by-sabrina-derr/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/interview/",
        "https://watershedcsuc.wordpress.com/tag/mari-lesperance/",
        "https://watershedcsuc.wordpress.com/tag/poetry/",
        "https://watershedcsuc.wordpress.com/tag/sabrina-derr/",
        "https://watershedcsuc.wordpress.com/tag/the-darkened-temple/",
        "https://watershedcsuc.wordpress.com/tag/watershed-review/",
        "https://watershedcsuc.wordpress.com/2013/08/20/a-conversation-with-mari-lesperance-interviewed-by-sabrina-derr/#respond",
        "http://en.forums.wordpress.com/",
        "http://www.plinky.com/",
        "http://polldaddy.com/",
        "http://en.support.wordpress.com/",
        "http://learn.wordpress.com/",
        "http://theme.wordpress.com/",
        "http://planet.wordpress.org/",
        "http://en.blog.wordpress.com/",
        "https://watershedcsuc.wordpress.com/category/intern-spotlight/",
        "https://watershedcsuc.wordpress.com/category/uncategorized/",
        "https://watershedcsuc.wordpress.com/2022/05/",
        "https://watershedcsuc.wordpress.com/2022/03/",
        "https://watershedcsuc.wordpress.com/2020/05/",
        "https://watershedcsuc.wordpress.com/2019/10/",
        "https://watershedcsuc.wordpress.com/2019/05/",
        "https://watershedcsuc.wordpress.com/2019/04/",
        "https://watershedcsuc.wordpress.com/2018/10/",
        "https://watershedcsuc.wordpress.com/2018/01/",
        "https://watershedcsuc.wordpress.com/2017/12/",
        "https://watershedcsuc.wordpress.com/2017/10/",
        "https://watershedcsuc.wordpress.com/2017/09/",
        "https://watershedcsuc.wordpress.com/2017/04/",
        "https://watershedcsuc.wordpress.com/2016/11/",
        "https://watershedcsuc.wordpress.com/2016/10/",
        "https://watershedcsuc.wordpress.com/2016/09/",
        "https://watershedcsuc.wordpress.com/2015/12/",
        "https://watershedcsuc.wordpress.com/2015/10/",
        "https://watershedcsuc.wordpress.com/2015/09/",
        "https://watershedcsuc.wordpress.com/2015/04/",
        "https://watershedcsuc.wordpress.com/2015/03/",
        "https://watershedcsuc.wordpress.com/2015/02/",
        "https://watershedcsuc.wordpress.com/2014/11/",
        "https://watershedcsuc.wordpress.com/2014/10/",
        "https://watershedcsuc.wordpress.com/2014/09/",
        "https://watershedcsuc.wordpress.com/2014/04/",
        "https://watershedcsuc.wordpress.com/2014/02/",
        "https://watershedcsuc.wordpress.com/2013/11/",
        "https://watershedcsuc.wordpress.com/2013/10/",
        "https://watershedcsuc.wordpress.com/2013/08/",
        "https://watershedcsuc.wordpress.com/2013/04/",
        "https://watershedcsuc.wordpress.com/2013/03/",
        "https://watershedcsuc.wordpress.com/2013/02/",
        "https://watershedcsuc.wordpress.com/2013/01/",
        "https://twitter.com/466661251926335488",
        "https://wordpress.com/?ref=footer_blog",
        "https://automattic.com/cookies/",
        "",
        "",
        "https://watershedcsuc.wordpress.com",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2013%2F08%2F20%2Fa-conversation-with-mari-lesperance-interviewed-by-sabrina-derr%2F&signup_flow=account",
        "https://watershedcsuc.wordpress.com",
        "https://watershedcsuc.wordpress.com/wp-admin/customize.php?url=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2013%2F08%2F",
        "",
        "",
        "https://wordpress.com/start/",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2013%2F08%2F20%2Fa-conversation-with-mari-lesperance-interviewed-by-sabrina-derr%2F&signup_flow=account",
        "http://en.wordpress.com/abuse/?report_url=https://watershedcsuc.wordpress.com",
        "https://wordpress.com/read/feeds/7518230",
        "https://subscribe.wordpress.com/",
        "",
        "#",
        "#"
    ]
}