{
    "title": "Stay Connected",
    "body": "This website uses scripting to enhance your browsing experience. Enable JavaScript in your browser and then reload this website.This website uses resources that are being blocked by your network. Contact your network administrator for more information.This website uses resources that are being blocked by your network. Contact your network administrator for more information.AdmissionsVisitApplyStay ConnectedLoading...We're excited that you are interested in learning more about San Diego State University. Please complete and submit the form below. We look forward to keeping in touch with you!First Name *Last Name *Birthdate *Birthdate *JanuaryFebruaryMarchAprilMayJuneJulyAugustSeptemberOctoberNovemberDecember123456789101112131415161718192021222324252627282930312023202220212020201920182017201620152014201320122011201020092008200720062005200420032002200120001999199819971996199519941993199219911990198919881987198619851984198319821981198019791978197719761975197419731972197119701969196819671966196519641963196219611960195919581957195619551954195319521951195019491948194719461945194419431942194119401939193819371936193519341933193219311930192919281927192619251924192319221921192019191918191719161915191419131912191119101909190819071906190519041903190219011900Contact InformationEmail *Mobile Phone *Can we text you occasionally? *Can we text you occasionally? *YesNoMailing Address *Mailing Address *CountryStreetCityRegionPostal CodeAre you an international student?  *YesNoYour Academic PlansWhen will you enroll at SDSU? *Fall 2023Fall 2024Fall 2025Fall 2026Fall 2027Fall 2028I will be a: *First-Year StudentTransfer StudentIntended Major (optional)AccountingAdvertisingAerospace EngineeringAfricana StudiesAmerican Indian StudiesAnthropologyArtArt (Teaching)Art HistoryAsian StudiesAsian Studies (Chinese Studies and Language)AstronomyBiochemistryBioengineeringBiologyBusiness AdministrationCellular and Molecular BiologyChemical PhysicsChemistryChemistry (Teaching)Chicana and Chicano StudiesChild DevelopmentCivil EngineeringClassics (Classical Humanities)Classics (Classical Language)CommunicationComparative International StudiesComparative LiteratureComparative Literature (Teaching)Computer EngineeringComputer ScienceConstruction EngineeringConstruction ManagementCriminal JusticeDanceEcologyEconomicsElectrical EngineeringEnglishEnglish (Teaching)EntrepreneurshipEnvironmental EngineeringEnvironmental SciencesEuropean StudiesEvolution and SystematicsFinanceFinancial ServicesFitness, Nutrition and HealthFoods and NutritionFrenchGeographyGeological SciencesGermanGerman StudiesGerontologyGraphic DesignHistoryHospitality and Tourism ManagementHotel Operations and ManagementHuman Resource ManagementHumanitiesInformation and Decision SystemsIntegrated Marketing CommunicationsInterior DesignInternational BusinessInternational Security and Conflict ResolutionIslamic and Arabic StudiesJapaneseJournalismKinesiologyLanguage, Culture, and SocietyLatin American StudiesLBGTQ+ StudiesLiberal StudiesLinguisticsManagementMarine BiologyMarketingMathematicsMathematics (Teaching)Mechanical EngineeringMedia StudiesMeetings & Events ManagementMicrobiologyModern Jewish StudiesMultimediaMusicNursingPainting and PrintmakingPaleontologyPhilosophyPhysical EducationPhysical SciencePhysicsPolitical SciencePrephysical TherapyPsychologyPublic AdministrationPublic HealthPublic RelationsReal EstateRecreation AdministrationReligious StudiesRestaurant ManagementRhetoric and Writing StudiesRussianRussian and Central European StudiesSculptureSocial ScienceSocial WorkSociologySpanishSpeech, Language, and Hearing SciencesStatisticsSustainabilityTelevision, Film and New MediaTheatre ArtsTribal Gaming ManagementUndecidedUrban StudiesWomen's StudiesZoologyAcademic BackgroundCurrent High School\nBegin typing the name, city, or CEEB of your school to searchHigh School CEEB (hidden)Level of Study (hidden)GraduateHigh SchoolUndergraduateCurrent College/University\nBegin typing the name, city, or CEEB of your school to searchCollege/University CEEB (hidden)Level of Study (hidden)GraduateHigh SchoolUndergraduateSubmitFacebookTwitter\n5500 Campanile Drive\nSan Diego, CA 92182Copyright © 2022 San Diego State University | All Rights Reserved",
    "links": [
        "https://support.google.com/answer/23852",
        "https://admissions.sdsu.edu",
        "https://admissions.sdsu.edu/tours-events",
        "https://admissions.sdsu.edu/apply",
        "https://www.facebook.com/SanDiegoState",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "https://instagram.com/sandiegostateuniversity",
        "https://twitter.com/sdsu"
    ]
}