{
    "title": "Business Double Major Ready for Life’s Next Big Challenge - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nBusiness Double Major Ready for Life’s Next Big Challenge\n\nClayton Truscott\nMay 1, 2023\n\n\n\n\n(Jason Halley / University Photographer) \n\n\n\nWhen Hirra Khan moved to Gridley from Pakistan in 2012, she found herself surrounded by the unknown: at a new school in a foreign country, learning to speak English from scratch, and the only 12-year-old for miles who wore a hijab.\nShe remembers sitting in sixth grade class as an English Language Development student, trying to process what was happening around her. “This was my first experience with being truly uncomfortable and feeling out of place,” she said, speaking at a recent graduation celebration for students enrolled in Chico State’s Educational Opportunity Program (EOP)—a program she leaned on as a first-year student and now works for as a paraprofessional peer mentor to over 30 first-generation students from low-income backgrounds. “But it was a ‘good uncomfortable,’ because it motivated me to get out of my comfort zone and expand my horizons. Growth can be seen in many forms but staying in your comfort zone is not one of them.”\nKhan’s empowered perspective on her situation has shaped her academic career.\nToday she is a senior preparing to graduate with one degree in business administration with an option in finance and another in business information systems with an option in management information systems. Khan ultimately sees her educational journey as an extension of two key lessons that began with her move to California: growing through mistakes and embracing mentors.\nKhan at her EOP workspace in the Student Services Center building. \nBy 2019, she enrolled at Chico State with the intention of majoring in biochemistry and pursuing a career in the medical field. Within her first semester, she knew this was not the right path for her. The work felt frustrating and didn’t allow her strengths to take center stage. “I tried really hard but couldn’t get into it. I’m so glad that I took that chemistry class in my first semester and realized how much I didn’t like it.”   \nDuring Summer Bridge, a transition program that brings first-year EOP students to campus before the semester starts to meet mentors, attend workshops, and get familiar with student life, Khan met her future adviser, Jennifer Duggan, assistant dean with the College of Business. Duggan immediately saw her dedication and academic enthusiasm, and the two built a mentor-mentee relationship based on their initial connection. Ultimately, Duggan would help Khan find her place in the business majors, setting her on a course for success.\n“Since meeting Hirra, she has shown a fierce determination to succeed academically,” Duggan said. “I’ve been impressed with her focus and discipline to maintain a high GPA in a difficult STEM major. It’s been a joy to watch her excel and reach her goal of graduating with this impressive double major.”\nThis shift in Khan’s focus toward business has allowed her to access new gears within herself and find an area of study that captivates her and holds promise in the working world.\n“The combination of MIS with finance really works for me,” Khan said. “I love numbers, analytics, and the financial side of my degree, and then MIS brings in a technology aspect, which is something I find very interesting.” In addition to being a sound analytical problem solver, she has proven to be an effective communicator and project manager in and out of the classroom.\nIn fact, it was a business communications class during her second year, which included writing cover letters and résumés, that prompted Khan to take the initiative and apply for a job with EOP. This began another important chapter in her story, where she could give back to the organization that helped set her up for success at Chico State. Khan’s first supervisor, Xia “Billy” Lo, was a positive influence and mentor who supported her in this new role, in which she has grown from strength to strength.    \n“She carries herself very confidently—she has a strong character, but she’s very quiet and she’s always listening,” said Teresa Hernandez, a coordinator with EOP’s freshman year experience program and Khan’s current supervisor for the last year. “That’s a very intriguing thing about her. She can be seen as someone who hangs in the background of a busy room, but then she can instantly command the attention of that room and get everyone focused on her. She’s a true leader in that way. I know she is going to be a very impactful person in every role she takes on.”\nAs someone who benefitted from EOP as a first-year student, Khan sees her work for the program as an important way of giving back to the students she advises now. “I think EOP creates a sense of home at Chico State,” Khan said. “Most students have similar backgrounds—they’re first-generation students, often coming from far away—and we can connect on that experience. We’re there to listen to them, understand what they need, and offer support, whether that’s a referral or just listening.”\nKhan’s impact with students is tangible, according to Hernandez. “Hirra has a very calming presence—she’s able to bring students down who might be feeling riled up or upset or worried,” Hernandez said. “The way she provides advice and motivation for them, so that they leave here feeling inspired to keep going and keep trying, is one of the most important things.”\nIn addition to Khan’s work with EOP, she is also a volunteer with AmeriCorps, serving adult learners in an open capacity that ranges from help with English as a second language course material to tutor training. \nBeyond the lessons she’s learned, a constant grounding force and source of inspiration in Khan’s life is her family and network. Her sister, Amna (Business Information Systems, ’21), and best friend Veronica Heredia, also a senior and majoring in human resources, have provided encouragement and positive affirmation at her most difficult moments. “Moving here was hard, but I’ve had a lot of family support to help me through,” Khan said. “My mom, especially. She is someone I have always admired—she has this emotional, inner strength and self-control that is inspirational.”  \nBeyond graduation, Khan is looking forward to challenging herself in the workforce, bringing her talents to a role that combines the strengths and skills that she has developed at Chico State.\n“I grew up pretty shy, and I guess I still am in some situations, but I’m also sure that I am a leader,” she said. “My confidence and skills have really grown through my work at and school and EOP, and I’m ready to take on a new challenge.”\nWhen she says this, we believe her.\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tClayton Truscott\t\t\n\n\n\t\tCommunications Manager Clayton Truscott leads storytelling and content development efforts for University Communications.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/ctruscott/",
        "https://www.csuchico.edu/eop/index.shtml",
        "https://today.csuchico.edu/hirra-khan/?share=facebook",
        "https://today.csuchico.edu/hirra-khan/?share=twitter",
        "https://today.csuchico.edu/hirra-khan/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Business%20Double%20Major%20Ready%20for%20Life%E2%80%99s%20Next%20Big%20Challenge&body=https%3A%2F%2Ftoday.csuchico.edu%2Fhirra-khan%2F&share=email",
        "https://today.csuchico.edu/hirra-khan/#print",
        "#",
        "https://today.csuchico.edu/author/ctruscott/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}