{
    "title": "Top Employers Recognized at 2023 Chapman State of the University | Chapman Newsroom",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nFind information for\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\n\nDegrees\n\n                & Programs\nMaps &\n\n                Directions\nAll Directories\nNews\nEvents\n\nSocial\n\n\n\n\n\n\n\nfacebook\n\n\n\n\n\n\n\ntwitter\n\n\n\n\n\n\n\npinterest\n\n\n\n\n\n\n\ninstagram\n\n\n\n\n\n\n\n\n\nyoutube\n\n\n\n\n\n\n\nlinkedin\n\n\n\n\n\n\n\n\n\nsnapchat\n\n\n\n\n\n\n\ntumblr\n\n\n\n\n\n\n\nitunes\n\n\n\n\n\n\nSocial hub\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\nNewsroom\n\n\n\n\n\n\n\n\nTopics\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind\n\n\n\n\n\n\n\n\n\n\nLog in\n\n\n\n\n\n\n\n\n\n\n                    Login\n\n                  \n\n\n\n\ncanva icon\n\n\nCanvas\n\n\n\n\n\n\n\n\n\n\n\n\n\nHandshake\n\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty & staff) \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n              Chapman University\n\n            \n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nChapman Newsroom\nMain Menu >\n\n\nTopics\n\n\nToggle\n\n\n\n\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\n\nToggle\n\n\n\n\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\nMain Menu\n< Chapman Newsroom \n\n\n\nAbout\n\n\n\nToggle About\n\n\n\n\n\nMaps & Directions\nVisit Chapman\nDiscover Chapman\nFacts & Rankings\nLeadership\nCampus Services\nConnect\n\n\n\nAcademics\n\n\n\nToggle Academics\n\n\n\n\n\nDegrees & Programs\n\nSchools & Colleges\nAcademic Calendar\nFaculty Directory\nLibraries\nCourse Catalogs\nInternational Study\n\n\n\nAdmission\n\n\n\nToggle Admission\n\n\n\n\n\nUndergraduate Admission\n\nUndergraduate Application\nGraduate Admission\nGraduate Application\nAffordability\nFinancial\n\n                    Aid\n\n                    Calculator\nCampus Tours\n\n\n\nAlumni\n\n\n\nToggle Alumni\n\n\n\n\n\nEvents\nGet Involved\nCareer\n\n                    Support\n\n\nArts\n\nCampus Life\n\n\n\nToggle Campus Life\n\n\n\n\n\nAthletics\nDiversity & Inclusion\nEvents\nFish Interfaith\n\n                    Center\nHealth & Safety\nResidence\n\n                    Life\nStudent Life\n\n\n\nResearch\n\n\n\nToggle Research\n\n\n\n\n\nPre-Award\n\n                    Administration\nPost-Award\n\n                    Administration\nResearch Integrity\nInstitutes &\n\n                    Centers\nCenter for\n\n                    Undergraduate\n\n                    Excellence\nGraduate Research\n\n                    Support\n\n\n\nSupport\n\n\n\nToggle Support\n\n\n\n\n\nContact Development\nGet Involved\nAreas to\n\n                    Support\nAlumni Involvement\n\n\n\n\n\n\nFind information for...\n\n\n\nToggle Find Information By Audience\n\n\n\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\nDegrees & Programs\nMaps & Directions\nAll Directories\nNews\nEvents\nSocial\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare via Facebook Share via Twitter Share via Reddit Share via Pinterest Share via Email Share via LinkedIn \n Print Friendly\n\n\n\n\n\n\n Chapman University's Top Employers for 2023 were honored during President Struppa's State of the University address. \n\n\n\n\nChapman Inspired \nTop Employers Recognized at 2023 Chapman State of the University\n Staci DumoskiFebruary 22, 20238 min read\n\n\n\n\n\nChapman University President Daniele C. Struppa welcomed representatives from 100 organizations to the 2023 State of the University address, honoring them for their status as “Top Employers” and thanking them for their continuing commitment to “Think Chapman First.”\n“I want to thank all of the [organizations] that work with us. They are so important to our success. They provide internships. They provide jobs to our students. They work with us to help us better understand the kind of curriculum we need to develop,” said Struppa. “Your role in the [university] is crucial. The university can’t succeed without these kinds of partnerships.”\nRepresenting a diverse range of industries from across the country, Chapman’s Top Employers are honored each year for the strength of their partnerships with the university, through their consistent, active participation in recruiting efforts as well as hiring a notable percentage of Chapman graduates for their workforce. Included among the organizations honored were international giants such as Experian, Netflix and Walmart, as well as local mainstays such as Edwards Lifesciences, CHOC and the City of Orange. \n>> See the complete list of 2023 Top Employers. \nA special reception for Top Employers was held following the State of the University address, where Jennifer Kim, assistant vice president of Career and Professional Development at Chapman, thanked those present once again.\n“As a Top Employer, you can attest to the distinction that comes with a Chapman University degree,” said Kim. “Our students not only receive an excellent education, but they graduate ready to launch impactful careers. Chapman Panthers are critical thinkers, team players, hardworking and loyal. They possess a combination of hard and soft skills that will make them tremendous assets at your organizations.”\nChapman Grads Praised as “Best Talent Nationally”\n\n“Chapman University is producing some of the highest and best talent nationally,” says Alex Hayden, vice chairman of CBRE, one of the organizations honored. CBRE, the world’s largest commercial real estate company, continually looks to Chapman as a source for quality young professionals, says Hayden.\n Tim Rahall, a partner at EY, one of the “big four” accounting firms, agrees. “Chapman students represent the best and brightest business and accounting students in Southern California.”\nWith more than 20 current students and alumni at their boutique law firm, Berger Kahn says that they choose to Think Chapman First  “because [Chapman] students are academically highly qualified, with a strong sense of practicality. They are ready to be achievers from day one.”\n“The talent that comes out of Chapman University has been a powerful driver of our growth and success in the marketplace,” says Kelly Vlahakis-Hanks (EMBA ’16), president and CEO of ECOS Earth Friendly Products. A Chapman alumna herself, Vlahakis-Hanks says that ECOS always looks first to Chapman in their hiring process. \n“Each one of the alumni we’ve hired has had a positive impact on our mission to protect the health and wellness of people, pets and the planet,” she says.\nPaving the Way to a Stronger Workforce\nChapman Top Employers don’t just hire graduates: their partnerships often include internship programs that help prepare students for the workplace. \n“We are proud to support Chapman students by providing hands-on experience in STEM fields that will not only benefit the student, but also benefit our community partner organizations,” says Tim Seidel, general manager of Phillips 66.\n“Joining forces allows us to help shape the next generation of pharmacy professionals and advance healthcare in our communities,” agrees Janet Govea, university relations manager for CVS Health.\nChapman Students are Prepared to Change the World\nChapman graduates are in demand in the arts and non-profit sectors, too. \n“Chapman students are change makers,” says senior recruiter Sakeena Ali of the Peace Corps, one of the many non-profit organizations that have repeatedly sought out Chapman alumni.\n“Chapman University’s graduates bring evolved thought, superior educational background and a modern skill set to the Orange County workforce and beyond,” says Robin Follman, campaign director and director of vocal programs at Orange County Music and Dance. Follman also serves as Secretary on Chapman’s Board of Governors, as well as a member of the Argyros School of Business and Economics Board of Counselors.  \n“It is our responsibility to assist these talented individuals as they cross into the professional world so that they can utilize their insights and skills in creating a brighter and more tolerant world for future generations,” says Follman. \nChapman alumna Carrie Nocella ’99, director of external affairs for Disneyland Resort, proudly serves on the university’s Board of Governors, as well.\nIn response to celebrating The Walt Disney Company’s fifth consecutive year as a Top Employer of Chapman talent, Nocella shared, “The Walt Disney Company is proud to be included in Chapman University’s Top Employers. Chapman University is one of many higher education institutions just miles from Disneyland Resort that enrolls many of our employees. In addition, Disney also employs a large number of Chapman University alumni. There’s magic in learning, and we’re proud to have partners like Chapman University!”  \nSee the full list of 2023’s Top Employers and find out how your organization will benefit when you Think Chapman First. \n\n\nChapman Top Employer 2023: Ingram MicroGreg Hauser Vice, President, Talent Acquisition; Christina Higgins, Professional, Talent Acquisition + Learning & DevelopmentChapman Top Employer 2023: DeloitteSean Peasley, Partner; John Sadoff, Managing DirectorChapman Top Employer 2023: Green StreetReagan Berkley, Regional Talent OfficerChapman Top Employer 2023: Rutan & TuckerKenneth Zielinski, PartnerChapman Top Employer 2023: Pacific SymphonyAbby Edmunds, Director of Volunteer Services; Jayee Liu Human, Resources ManagerChapman Top Employer 2023: Berger KahnTyler Angelini, Hannah Hong, Erin Mindoro EzraChapman Top Employer 2023: E. & J. Gallo WineryMassimo Lesti, Sales Recruiting Manager; Paulina Prado, Sales Recruiting ManagerChapman Top Employer 2023: MasimoPhilip Vickers Manager, Technical RecruitingChapman Top Employer 2023: Johnson & JohnsonFahmi Nahas, Head of Human Resources, Johnson & Johnson Med Tech; Luis Otero, Business Operations Senior SpecialistChapman Top Employer 2023: AmazonHeidi Kim, Staffing CoordinatorChapman Top Employer 2023: The Walt Disney CompanyCarrie Nocella, Director, External AffairsChapman Top Employer 2023: EYTim Rahal,l Partner; Kurt Rieck, PartnerChapman Top Employer 2023: Tustin Unified School DistrictMaurita De La Torre, Chief Personnel OfficerChapman Top Employer 2023: AAA Automobile Club of Southern CaliforniaLori Gioia, Corporate Recruiter; Oana Murray, Enterprise Talent Acquisition ManagerChapman Top Employer 2023:Peace CorpsSakeena Ali, Senior RecruiterChapman Top Employer 2023: 3 Arts EntertainmentOlivia Blanchard, HR ManagerChapman Top Employer 2023: Fisher PhillipsJeffrey Thurrell, Regional Managing PartnerChapman Top Employer 2023: County of OrangeJennifer Ramirez, Assistant Recruitment ManagerChapman Top Employer 2023: ECOSJenna Arkin, Chief Innovation Officer; Eric Hanks, Director of Strategic Accounts; Kelly Vlahakis-Hanks, President & CEOChapman Top Employer 2023: Arts & Learning ConservatorySidney Aptaker, Assistant to Theatre Education Director; Lydia Filippini, Theatre Education Director; Tiesha Hutchins, Director of Outreach; Isaiah Torres, Media Specialist; Debora Wondercheck, CEOChapman Top Employer 2023: CBREAlex Hayden, Vice Chairman; Nicole Moler, Sales Manager; Hannah Sevilla, Sales Analyst; Deepa Shah, Sr. Research Analyst; Michelle Tutor, Sales ManagerChapman Top Employer 2023: NBCUniversalViviana Siles, Specialist, Internship & Early Career ProgramsChapman Top Employer 2023: Zymo ResearchJanet Kim, Human Resources Assistant; Tommy Li Sr., HR GeneralistChapman Top Employer 2023: State Street Global AdvisorsEnoch Cheng, AVP, Regional Sales Consultant; Sean Pitstick, Internal Sales AssociateChapman Top Employer 2023: Goldman SachsLance Britt; Liane Hoar, Vice President - Director of Staffing and OperationsChapman Top Employer 2023: Pac-DentDaniel Wangg, President; Henry SunChapman Top Employer 2023: Orange County District Attorney's OfficeKeith Bogardus, Chief Assistant District AttorneyChapman Top Employer 2023: Phillips 66Juliana M, Public Affairs Senior Advisor; Tim S, General ManagerChapman Top Employer 2023: Center Theatre GroupAurora Ilog, Program Manager, Education & Community PartnershipsChapman Top Employer 2023: ArchytasKaren Caswelch, COO; Tom Caswelch, Manager, Print Farm; Ryan Polk, CEOChapman Top Employer 2023: Orange County Music and DanceRobin Follman, Campaign Director & Director of Vocal Program; Doug Freeman, Chief Executive Officer and Executive Chair; Walter Yenkosky, COOChapman Top Employer 2023: CVSYe Govea, University Relations ManagerChapman Top Employer 2023: Kaiser PermanenteReza Mohammadkhani, Regional Director Pharmacy Operations & Admin ServicesChapman Top Employer 2023: City of OrangeDan Slater, Mayor; Monica Espinoza, Director of Human Resources; Cody Kleen, Human Resources Manager\n\n\nCareer and Professional Development careers employment Industry Partners State of the University Think Chapman First Top Employers \n\n\n\n\n \n\nStaci Dumoski \n\n\nView all posts \n\n\n\n\n\n\n\n\nNew Orleans Interterm Course Provides 15 Years of Perspective on Crisis Response\n\n\n\n\n\nAttorney Teaches Law Students How to Hang Their Own Shingle\n\n\n\n\n\n\n\nYou may also like\n\n\n\n\n\n\n\n\n\n\nChapman Family Donors Make a Collective Impact On Giving Day  Thanks to the enthusiasm of the Chapman Family, Chapman University’s fifth annual Giving Day was an unrivaled success. The 24-hour online fundraising event surpassed its goal of 1,000 donations on April 25, raising more...\n\n\nApril 28, 2023 Staci Dumoski\n\n \n\n\n\n\n\n\n\n\n\nPA Program Breaks Top 100 in First US News Ranking Chapman University’s physician assistant program broke the top 100 in its first-ever ranking in U.S. News & World Report’s Best Health Schools. The program was ranked No. 96, putting Chapman in the top third of...\n\n\nApril 25, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n\n\n\nArgyros School Climbs to No. 60 Chapman University’s Argyros School of Business and Economics rose to No. 60 in the new Best Business School rankings by U.S. News & World Report. It’s the school’s highest-ever position in rankings of business...\n\n\nApril 25, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n Search\nNewsroom Topics\n\nArts & Film\nBusiness & Economy\nHealth & Behavior\nScience & Engineering\nAlumni\nCampus & Students\nCommunity\nHumanities & Society\nUniversity News\n\nSubscribe Sign up here to get updates on the latest Newroom stories.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmergency \n\nMedia ContactsCerise Valenzuela Metzger\n\nDirector of Public Relations\n(714) 289-3143 (office)\n(657) 390-6760  (cell)\ncmetzger@chapman.edu\n\nOffice of Public Relations\n\nPR@chapman.edu \n\nNewsroom SiteChapman Magazine\n\nChapman Forward\nCOVID-19 Resources\n\nChapman Site\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment \n\nServices & PoliciesAccessibility Feedback \nWebsite Feedback \nDisability Services \nDirectory Emergency \nConsumer Disclosures \nPrivacy Policy Title IX \n\n\n\n\n\n© 2023 Chapman University           \n\n\n\n\n\n\nTopics\n\nAlumni\nArts & Film\nBusiness & Economy\nCampus & Students\nCollege Knowledge\nCommunity\nCOVID-19\nHealth & Behavior\nHumanities & Society\nScience & Engineering\nUniversity News\n\n\nOur Voices\nCOVID-19 Resources\nMagazines\n\nChapman Magazine\nChapman Forward\n\n\nPress Room\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#",
        "#",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "#",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://www.pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu/",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/edu/school?id=17838",
        "https://www.snapchat.com/add/chapmanu",
        "http://chapmanadmission.tumblr.com/",
        "http://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://social.chapman.edu/",
        "#",
        "https://www.chapman.edu/",
        "/",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "https://news.chapman.edu/wp-admin/ ",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "https://www.chapman.edu/campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu",
        "https://news.chapman.edu/work/",
        "/",
        "https://www.chapman.edu/",
        "#",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "#",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/discover/index.html",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "/about/connect",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/academics/course-catalogs/index.aspx",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "/admission/undergraduate/applynow",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/afford.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/net-cost-calculator/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/events/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/students/health-and-safety/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "/research/",
        "https://www.chapman.edu/research/sponsored-projects-services/pre-award/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/post-award/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index.aspx",
        "https://www.chapman.edu/research/graduate-research/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/contact-us.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/ways-to-give/areas-to-support.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/audiences/index.aspx",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "https://social.chapman.edu/",
        "#",
        "#",
        "#",
        "#",
        "mailto:?subject=Top%20Employers%20Recognized%20at%202023%20Chapman%20State%20of%20the%20University&body=https%3A%2F%2Fnews.chapman.edu%2F2023%2F02%2F22%2Ftop-employers-recognized-at-2023-chapman-state-of-the-university%2F",
        "#",
        "#",
        "https://news.chapman.edu/category/chapman-inspired/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/02/10/struppa-looks-back-at-past-successes-illuminates-our-path-to-greatness-in-state-of-the-university-address/",
        "https://www.chapman.edu/industry-partners/index.aspx",
        "https://www.chapman.edu/industry-partners/top-employers.aspx",
        "http://bergerkahn.com/berger-kahn-honored-as-a-chapman-university-top-employer-2023/",
        "https://blogs.chapman.edu/scst/2022/07/18/ecos-recognized-for-commitment-to-stem-students/",
        "https://www.linkedin.com/posts/the-walt-disney-company_the-walt-disney-company-is-proud-to-be-included-activity-7032030880772587520-jOUa?utm_source=share&utm_medium=member_desktop",
        "https://www.chapman.edu/industry-partners/top-employers.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/recruit-hire/index.aspx",
        "https://news.chapman.edu/tag/career-and-professional-development/",
        "https://news.chapman.edu/tag/careers/",
        "https://news.chapman.edu/tag/employment/",
        "https://news.chapman.edu/tag/industry-partners/",
        "https://news.chapman.edu/tag/state-of-the-university/",
        "https://news.chapman.edu/tag/think-chapman-first/",
        "https://news.chapman.edu/tag/top-employers/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/02/23/new-orleans-interterm-course-provides-15-years-of-perspective-on-crisis-response/",
        "https://news.chapman.edu/2023/02/22/attorney-teaches-law-students-how-to-hang-their-own-shingle/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/04/25/pa-program-breaks-top-100-in-first-us-news-ranking/",
        "https://news.chapman.edu/2023/04/25/pa-program-breaks-top-100-in-first-us-news-ranking/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/university-news/",
        "/news-and-stories/sign-up-for-our-newsletter/",
        "https://www.chapman.edu/emergency/index.aspx",
        "tel:+1714-289-3143",
        "tel:+1657-390-6760",
        "mailto:cmetzger@chapman.edu",
        "mailto:PR@chapman.edu",
        "/magazine",
        "/forward",
        "/coronavirus/",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/jobs/index.aspx",
        "https://www.chapman.edu/accessibility/feedback-form.aspx",
        "https://www.chapman.edu/website-feedback-form.aspx",
        "https://www.chapman.edu/students/health-and-safety/disability-services/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "emergency/index.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/index.aspx",
        "https://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "https://www.chapman.edu/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/"
    ]
}