{
    "title": "Chico State - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\n\n\nChico State\n\n \n\n\t\t\t\t\t\tFounded in 1887, California State University, Chico is the second-oldest CSU campus and one of the highest-ranked master’s-level public universities in the West.\t\t\t\t\t\n\n\t\t\t\t\t\tContact Chico State at \n\t\t\t\t\t\t\tpublicaffairs@csuchico.edu\t\t\t\t\t\t\n\n\n\n\n\n \nRooted in Connection: The Wildcat Family Tree \n\n\t\tAttending college is a significant milestone for any student, but for many, enrolling at Chico State is both a personal achievement and a family tradition.\t\n\n\n\n\n \nChico State Recognizes 2022–23 Outstanding Faculty \n\n\t\tThese awards—among the highest at Chico State—celebrate eight phenomenal faculty for academic distinction, prominent scholarship, and commitment to transformative experiences.\t\n\n\n\n\n \nFrom Northern California to Ocean Engineer \n\n\t\tGridley native Irene Duran (Mechatronic Engineering, '20), moved to Cape Cod after graduating with one mission: an engineering job. \t\n\n\n\n\n \nNew Transport Program Provides Students Rides to Sacramento Airport During Breaks \n\n\t\tStudents leaving campus during extended breaks can sign up for Wildcat Rides, a new program shuttling students from campus to the Sacramento bus and train station and the Sacramento Airport. \t\n\n\n\n\n \nCelebrating Our 2023 Distinguished Alumni \n\n\t\tFrom working on cancer treatments to advocating for farmworkers to teaching human kindness through language, the 2023 Distinguished Alumni have chosen to \"Do and Dare\" in a big way.\t\n\n\n\n\n \nChico State College of Business Earns AACSB Reaccreditation \n\n\t\tChico State's College of Business has been reaccredited by the Association to Advance Collegiate Schools of Business International, the highest standard of achievement for business schools.\t\n\n\n\n\n \nChico State Announces New Interim Provost and Vice President for Academic Affairs \n\n\t\tStephen Perez, a longtime educator and administrator in the California State University system, will serve as interim provost and vice president for Academic Affairs.\t\n\n\n\n\n \nExpanding Collaborations in Latin America: Dean of College of Agriculture Visits Chile \n\n\t\tCollege of Agriculture Dean Patricia Stock visited several academic and research institutions to exchange knowledge about the myriad challenges agriculture is facing in Mediterranean climate regions—like those in California and Chile.\t\n\n\n\n\n \nProvost Debra Larson Announces Her Retirement \n\n\t\tProvost Debra Larson is retiring immediately, citing health and family reasons. \t\n\n\n\n\n \nClass Notes: Fall 2022 \n\n\t\tWhether it's starting a new business, writing a book, or achieving a lifelong dream, the Wildcat family continues to reach milestones. Alumni share professional and personal updates for fall 2022.\t\n\n\n\n\n \nAnimal Science Major Embraces Role of Lead Shepherd in Sheep Unit \n\n\t\tSince arriving at Chico State in fall 2019, Manny Lopez has been an integral part of the University Farm’s Sheep Unit and today serves as its lead shepherd.\t\n\n\n\n\n \nAlumni-Owners of Downtown Chico Businesses Share Their Stories \n\n\t\tWhether they opened their store shortly after graduation, took over a longstanding business, or brought something new to the area mid-career, the owners of four downtown businesses share what makes the Chico State connections special to them.\t\n\n\n\n\n \nJoy of Learning Showcases Faculty Expertise \n\n\t\tWith topics ranging from neuroscience to animal nutrition to sustainable electronics, eight faculty members who reflect the top of their disciplines will present on their area of expertise.\t\n\n\n\n\n \nAnthropology Faculty Reflects on Fulbright Experience in Jordan \n\n\t\tAnthropology faculty Jesse Dizard shares about his experience as a Fulbright Scholar in Jordan.\t\n\n\n\n\n \nFond Farewell: Retired History and Social Science Professor Ken Rose \n\n\t\tKen Rose was an impassioned and well-respected historian and history professor, as well as a beloved musician in a local Irish band.\t\n\n\n\n\n \nHow To: Stay Sharp at the Meat Counter \n\n\t\tAs inflation and food costs continue to set record highs, Chico State Meats Lab staff and students offer tips to include meat as a part of your healthy diet.\t\n\n\n\n\n \nMarketing Students Take Top Honors at International Conference \n\n\t\tTen students from the Chico State chapter of the American Marketing Association netted multiple awards at the AMA International Collegiate Conference.\t\n\n\n\n\n \nFond Farewell: Psychology Major Terry Nilsen \n\n\t\tAfter changing his major, Terry Nilsen  embraced both psychology and art and loved spending time in Chico.\t\n\n\n\n\n \nAgriculture Majors Explore Puerto Rico in Immersive Trip \n\n\t\tA 10-day agricultural exploration trip over winter break pushed eight Chico State students outside their comfort zones, gave them new perspectives on experiential education, and immersed them in a culture they will never forget.\t\n\n\n\n\n \nChico State Stands with the People of Ukraine \n\n\t\tPresident Gayle Hutchinson encourages the campus community to support one another and offers resources related to Russia's invasion of Ukraine.\t\n\n\n\n\n \nTomorrow Transformed \n\n\t\tThanks to the generous support of its benefactors, Chico State's first comprehensive capital campaign raised $106.6 million, transforming lives across campus. \t\n\n\n\n\n \nWildcats Do and Dare \n\n\t\tWhat might the world look like if, rather than wondering about some distant future, we took daily action toward the tomorrow of our dreams? Meet Wildcats who are doing exactly that.\t\n\n\n\n\n \nDay of the Dead Altar: A Celebration of Life \n\n\t\tIn honor of this year's Dia de los Muertos, student Guadalupe Cruz created an altar—borrowing many beloved items used by her family—for the Valene L. Smith Museum of Anthropology.\t\n\n\n\n\n \nParadise Continues to Rebuild and Evolve Three Years After the Camp Fire \n\n\t\tThree years after the Camp Fire scattered the residents of Paradise, the town continues its rebuilding process—while also evolving.\t\n\n\n\n\n \nFive Questions with Winemaker and Nutrition Educator Vanessa Pitney \n\n\t\tAfter falling into winemaking by accident, Vanessa and her husband, a fellow alum, love teaching others about the process. \t\n\n\n\n\n \n5 Questions with Fifth-Generation Farmer Derek Sohnrey \n\n\t\tDerek Sohnrey ('13) blends the lessons he learned at Chico State with modern technology and five generations of family farm experience to carry their operations into the future.\t\n\n\n\n\n \nNew Faculty Share Messages of Inspiration \n\n\t\tAs 17 new faculty join Chico State this semester, they spent a few minutes creating signs to inspire students with a word or phrase for the new school year. \t\n\n\n\n\n \nChico State Announces New Visual Identity for University, Athletics \n\n\t\tDuring President Gayle Hutchinson's Convocation address Thursday, she revealed new logos and a narrative identity for the University.\t\n\n\n\n\n \nAlumna Predicts Post-Pandemic Upgrades Will Enhance Study Abroad Experience \n\n\t\tAfter a decade living in Spain, Study Abroad alumna Lindsay Woychick (Journalism, '12) shares how COVID-19 has transformed the international experience.\t\n\n\n\n\n \nAlumna Kym Crosby Readies To Run for Team USA at 2021 Paralympics \n\n\t\tA bronze medalist in Rio in 2016, Kym Crosby ('17) claimed the 100- and 400-meter titles at the US Paralympic Trials. She heads to Tokyo in August.\t\n\n\n\n\n \nAlumna Leads Third-Generation Family Lumber Business \n\n\t\tAs president of Healdsburg Lumber Company, Jill Ziedrich Gaylor ('06) knows that changing attitudes about women and building supply starts from within.\t\n\n\n\n\n \nCSU, Chico Announces Stock as New Agriculture Dean \n\n\t\tFollowing the completion of a national search, Chico State's College of Agriculture's new dean is Patricia Stock.\t\n\n\n\n\n \nClass Notes: Spring 2021 \n\n\t\tWhether it's starting a new business, writing a book, or achieving a lifelong dream, the Wildcat family continues to reach milestones. Alumni share professional and personal updates for spring 2021.\t\n\n\n\n\n \nAgricultural Business Major Thrives in His Field \n\n\t\tJesus Barba was raised by farmworkers but didn't consider a career in agriculture until he discovered the range of possibilities he could pursue.\t\n\n\n\n\n \nEntrepreneurship Student Finds Niche in the Business of Excellence \n\n\t\tProactive and self-motivated, Christine Levine found success everywhere she went, thriving in her work, her studies, and sales competitions.\t\n\n\n\n\n \nDiversity Fellow Finds Niche in AAPI Politics \n\n\t\tAs a master’s student in political science, Edward Berdan has bloomed into a scholar destined to change the study of AAPI politics.\t\n\n\n\n\n \nDance Students Rediscover Groove in Virtual Collaboration \n\n\t\tThe CSU Dance Collective, cofounded by Professor Megan Glynn Zollinger, has not only kept dance alive at Chico State during the pandemic, it’s transformed collaboration and creativity for students, faculty, and campuses alike.\t\n\n\n\n\n \nFond Farewell: Retired English Professor Sharon Paquin \n\n\t\tAs an alumna and a professor, Sharon Paquin cultivated a lasting passion for writing, teaching, human rights, and environmental conservation during her time at Chico State.\t\n\n\n\n\n \nStudents Engage Globally, Virtually, Amid COVID-19 \n\n\t\tStudying abroad looks different in the age of COVID-19, but the pandemic hasn’t stopped students from expanding their world-views, gaining new skills, and building lasting relationships.\t\n\n\n\n\n \n5 Questions with ‘Singing Nurse’ Jared Axen \n\n\t\tRegistered nurse Jared Axen (MS, Nursing, ’20) has built a national reputation as the \"Singing Nurse.\" When COVID-19 pandemic happened,  the types of patients he treats have changed, but he's still crooning love songs and hymns to boost spirits and overall health. \t\n\n\n\nPosts navigation\n1\n2\n3\n…\n10\nNext\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "mailto:publicaffairs@csuchico.edu",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://today.csuchico.edu/2023-outstanding-faculty/",
        "https://today.csuchico.edu/from-northern-california-to-ocean-engineer/",
        "https://today.csuchico.edu/wildcat-rides/",
        "https://today.csuchico.edu/2023-distinguished-alumni/",
        "https://today.csuchico.edu/chico-state-college-of-business-earns-aacsb-reaccreditation/",
        "https://today.csuchico.edu/stephen-perez-interim-provost/",
        "https://today.csuchico.edu/dean-stock-visits-chile/",
        "https://today.csuchico.edu/provost-announces-retirement/",
        "https://today.csuchico.edu/class-notes-fall-2022/",
        "https://today.csuchico.edu/emmanuel-lopez-lead-shepherd/",
        "https://today.csuchico.edu/downtown-biz-alumni/",
        "https://today.csuchico.edu/joy-of-learning-2022/",
        "https://today.csuchico.edu/dizard-fulbright-jordan/",
        "https://today.csuchico.edu/fond-farewell-ken-rose/",
        "https://today.csuchico.edu/how-to-meat-lab/",
        "https://today.csuchico.edu/marketing-students-ama-awards/",
        "https://today.csuchico.edu/fond-farewell-terry-nilsen/",
        "https://today.csuchico.edu/agriculture-majors-explore-puerto-rico/",
        "https://today.csuchico.edu/chico-state-stands-with-ukraine/",
        "https://today.csuchico.edu/tomorrow-transformed/",
        "https://today.csuchico.edu/wildcats-do-and-dare/",
        "https://today.csuchico.edu/day-of-dead-altar/",
        "https://today.csuchico.edu/paradise-rebuild-and-evolve/",
        "https://today.csuchico.edu/five-questions-vanessa-pitney/",
        "https://today.csuchico.edu/5-questions-derek-sohnrey/",
        "https://today.csuchico.edu/new-faculty-share-inspiration/",
        "https://today.csuchico.edu/chico-state-announces-new-identity/",
        "https://blog.usac.edu/5-post-pandemic-upgrades-to-your-spanish-study-abroad-experience/",
        "https://chicowildcats.com/news/2021/6/30/womens-track-crosby-representing-the-cats-and-the-us-in-tokyo.aspx",
        "https://www.northbaybusinessjournal.com/article/article/3rd-generation-enters-leadership-at-sonoma-countys-healdsburg-lumber/",
        "https://today.csuchico.edu/stock-new-ag-dean/",
        "https://today.csuchico.edu/class-notes-spring-2021/",
        "https://today.csuchico.edu/outstanding-grad-jesus-barba/",
        "https://today.csuchico.edu/outstanding-grad-christine-levine/",
        "https://today.csuchico.edu/outstanding-grad-edward-berdan/",
        "https://today.csuchico.edu/dance-virtual-collaboration/",
        "https://today.csuchico.edu/fond-farewell-sharon-paquin/",
        "https://today.csuchico.edu/students-engage-globally-virtually-amid-covid-19/",
        "https://today.csuchico.edu/5-questions-with-jared-axen/",
        "https://today.csuchico.edu/author/publicaffairscsuchico-edu/page/2/",
        "https://today.csuchico.edu/author/publicaffairscsuchico-edu/page/3/",
        "https://today.csuchico.edu/author/publicaffairscsuchico-edu/page/10/",
        "https://today.csuchico.edu/author/publicaffairscsuchico-edu/page/2/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}