{
    "title": "About USC - Learn about USC and how our students, faculty, and physicians are building the model for a research university of the 21st century.",
    "body": "\n\n\n\nShow Navigation\nSkip to Content\n\nUniversity of Southern California\nAbout USC\nFacts and Figures\nAdministration\nFaculty Honors\nHistory\nPolicies and Core Documents\n\n\n\n\nSearch for:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA Leading Private Research University\nThe University of Southern California is one of the world’s leading private research universities. An anchor institution in Los Angeles, a global center for arts, technology and international business, USC’s diverse curricular offerings provide extensive opportunities for interdisciplinary study and collaboration with leading researchers in highly advanced learning environments.\n\n\n\nIn its comprehensive 2022 ranking, The Wall Street Journal and Times Higher Education ranked USC 19th among more than 1,000 public and private universities. Among all California institutions — public and private — only USC, Caltech and Stanford University ranked within the top 20. Of the 150 universities surveyed in the western U.S., USC ranks No. 3 overall. Among the top 25 schools, USC ranked No. 4 in engagement, which measures student sentiment on how their education prepares them for the real world.\n\n\n\nThis year, USC received more than 69,000 applicants for its fall freshman class, with an acceptance rate of 12 percent. The number of students who are the first in their families to attend USC has been growing steadily for five years — 22 percent of the incoming class are first-generation college students. With one of the most abundant financial aid pools in the country, USC provides more than $640 million in scholarships and aid. Students from families earning $80,000 or less each year attend tuition-free under a new USC initiative to make college more affordable for lower and middle-income families.\n\n\n\nUSC’s distinguished faculty of 4,000 innovative scholars, researchers, teachers and mentors includes five Nobel laureates, and dozens of recipients of prestigious national honors including the MacArthur “Genius” Award, Guggenheim Award, the National Medal of the Arts, the National Humanities Medal, the National Medal of Science, the National Medal of Technology and Innovation, and Pulitzer Prize.\t\t\t\t\t\t\t\t\n\n\nStudent body\n\n\nStudent enrollment statistics from the 2022-2023 academic year (rounded):\n\n\n\n\nUndergraduates\n21,000\n\n\nGraduate and professional students\n28,000\n\n\nTotal\n49,000\n\n\n\n12% of 69,062 freshman applicants were admitted\n\n\n\n\n\n\nFemale\n54%\n\n\nMale\n46%\n\n\n\n22% of freshmen were first-generation college students\n3.82-4.00 average unweighted GPA for entering freshman class\n\nFind more statistics in USC Facts and Figures.\n\n\n\n\n\n\nUSC first opened its doors to 53 students and 10 teachers in 1880, when the newly founded “city” still lacked paved streets, electric lights, telephones and a reliable fire alarm system. Today, USC is home to 49,000 students and 4,600 full-time faculty, and is located in the heart of one of the most vibrant and diverse cities in the world.\n\nUSC History\n\n\n\nTimeline Click the photos to learn more. previous next\n 2014\n 2010\n 2005\n 1999\n 1995\n 1983\n 1976\n 1961\n 1947\n 1932\n 1922\n 1904\n 1880\n 1878\n 1870\n For more, see the full timeline of key events in USC's history.\n\n\n\n\nLocated in the heart of Los Angeles, USC’s University Park campus is part of the city’s Downtown Arts and Education Corridor and is home to the USC Dana and David Dornsife College of Letters, Arts and Sciences and many professional schools. The Health Sciences campus, northeast of downtown Los Angeles, is home to the Keck School of Medicine of USC, the USC Alfred E. Mann School of Pharmacy and Pharmaceutical Sciences, three major teaching hospitals, and programs in Occupational Science and Occupational Therapy and in Biokinesiology and Physical Therapy. USC also has programs and centers in Marina Del Rey, Orange County, Sacramento, Washington, D.C., Catalina Island, Alhambra and around Southern California. Children’s Hospital Los Angeles, staffed by USC faculty from the Keck School of Medicine, is often referred to as USC’s third campus.\n\nVisit USC\n\n\n\nUSC photo stream \n\nFor more photos, visit USC on Flickr.\n\n\n\n\n\n\n\n\n\n\nUSC Communications / Notice of Non-Discrimination / Privacy Notice \n\n\n\n\n\n\n\n\n",
    "links": [
        "#topnav",
        "#content-main",
        "//www.usc.edu/",
        "https://about.usc.edu/",
        "https://about.usc.edu/facts/",
        "https://about.usc.edu/administration/",
        "https://www.provost.usc.edu/faculty-distinctions/",
        "https://about.usc.edu/history/",
        "https://about.usc.edu/policies/",
        "https://affordability.usc.edu/",
        "/facts/",
        "/facts/",
        "/economic-impact/",
        "/history/",
        "#more",
        "#more",
        "/history/#4795",
        "/history/#1543",
        "/history/#1634",
        "/history/#1481",
        "/history/#616",
        "/history/#1488",
        "/history/#1518",
        "/history/#1515",
        "/history/#1506",
        "/history/#884",
        "/history/#799",
        "/history/#780",
        "/history/#738",
        "/history/#769",
        "/history/#773",
        "/history/",
        "https://visit.usc.edu/",
        "https://www.flickr.com/photos/universityofsoutherncalifornia/albums/",
        "mailto:ucomm@usc.edu",
        "https://eeotix.usc.edu/notice-of-non-discrimination/",
        "https://www.usc.edu/privacy-notice"
    ]
}