{
    "title": "UCR Jobs - Position Details ",
    "body": "\n\n\n\n\n\nSkip Navigation\n\n\nHome Page\n\n\n\n\n\n\n\n\nLogin \nRegister \n\n\n\n\n\n\n\nHR Employment\n\n\n\n\n\n\n\n\n\nHome\nBrowse Jobs\nHow to Apply\nMy Account\nHelp\nAbout\n\n\n\n\n\n\n\n\n\n\nPosition Details\n\n\n\nView All Details\n \n          Back To Current Job Opportunities\n    \n\nApply\n\n\n\nAssociate Director, Maintenance    \n\n\n\n\n Job Number\n Full/Part Time \n Schedule   \n Salary\n\n\n\n\n 29191811 \n Full Time    \n 8AM - 5PM    \n     $84,100 -    $157,500    \n\n\n\n\nPosition Information\n \nUC Riverside's Auxiliary Facilities Services is recruiting for the Associate Director of Maintenance. The Associate Director, Auxiliary Services Facilities oversees the daily operation of maintenance services and smaller scale project work for Auxiliary Services' owned/operated properties. Auxiliary Services (AS) is comprised of Housing Services, Dining Services, Early Childhood Education, Transportation Services, Campus Business Services, and Finance & Business Operations. AS facilities is comprised of 105 buildings/structures totaling approximately 2.6M sf. Maintenance activities cover routine, preventative, reactive, and planned. The Associate Director directly manages and provides leadership to three maintenance/trades supervisors and indirectly oversees 28 technicians who have demonstrated experience and knowledge with carpentry, HVAC, food service refrigeration, paint, electrical, plumbing, access/lock shop and zone maintenance. Ensures adherence to safety requirements including OSHA, UC, campus/city/county/state process and policies. Tracks and follows up on work order reports, staff workloads and more complex repair needs. Holds a delegated authority designation for the department in order to manage minor maintenance and FFE projects including planning, determination of scope, schedule, vendor outreach, budget and bid/procurement/payment processes. In conjunction with the Director, Auxiliary Services Facilities and unit supervisory colleagues, demonstrates subject matter expertise for maintenance, skilled crafts, trades and other related work; represents the department on campus and UC-wide work groups. Responsible for operational budgets and good stewardship of university resources. Holds a critical role with AS emergency planning, response and recovery; expected to assist and provide leadership for a variety of emergency situations.The full salary range for the Associate Director, Maintenance is $84,100 - $157,500 annually. The expected pay scale for this position is up to $120,800 annually.**As a condition of employment, you will be required to comply with the University of California SARS-CoV-2 (COVID-19) Vaccination Program Policy. All Covered Individuals under the policy must provide proof of Full Vaccination or submit a request for Exception (based on Medical Exemption, Disability, and/or Religious Objection) or Deferral (based on pregnancy) no later than the applicable deadline. For new University of California employees, the applicable deadline is ten weeks after their first date of employment. **\t\n    \n    \n Education  \n\n Education Requirements \n\n\n Degree \n Requirement \n\n\n\n Bachelor's degree in related area and/or equivalent experience/training. \n Required \n\n\n\n\n Licenses \n\n\n License \n Requirement \n\n\n\n Valid Driver License \n Required  \n\n\n\n\n Certifications \n\n\n Certification \n Requirement \n\n\n\n Certification in a specialty skilled trade. \n Required  \n\n\n\n\n\n Experience  \n\n\n\n Experience \n Requirement\n\n\n\n  8 - 13   years of related experience.  \n Required  \n\n\n     Previous supervisory/managerial experience.  \n Preferred  \n\n\n     Experience in fiscal management and establishment of annual budgets for multiple funds and departmental units.  \n Required  \n\n\n     Higher education facilities experience.  \n Preferred  \n\n\n     Experience working in a union-represented environment.  \n Preferred  \n\n\n\n\n\n Special Conditions  \n\n\n\n Special Condition \n Requirement \n\n\n\n Hired candidate must successfully pass a background check through the DOJ and FBI. \n Required  \n\n\n Must possess or obtain a Valid CA Driver License in accordance with the California Department of Motor Vehicles, if driving a university/personal vehicle for university related business. \n Required  \n\n\n Public Driving Record \n Required  \n\n\n Must be available for on-call emergencies. \n Required  \n\n\n Travel \n Required  \n\n\n Travel Outside of Normal Business Hours \n Required  \n\n\n\n\n\n Minimum Requirements \nStrong technical skills in the trades.Strong knowledge of facilities maintenance and administration.Ability to promote and maintain a safe working environment through subordinate supervisors/staff.Ability to ensure that quality and customer service standards are communicated, implemented and continually monitored.Ability to ensure that subordinate staff provide quick, accurate and appropriate response to both routine maintenance issues as well as emergency response to more urgent situations.Strong management skills to include organization, interpersonal and written and oral communication, long-and short term planning.Ability to motivate and inspire subordinate staff to provide the highest level of service to campus constituents.Broad knowledge and understanding of applicable laws, rules, regulations, and internal policies.Ability to provide reports on budgets, operational costs/expenses, staffing, equipment, schedules, work order tracking, metrics, etc.Demonstrated working knowledge of diverse building types/infrastructures and establishment of preventative and reactive maintenance programs to ensure appropriate upkeep levels.Proficient in computer programs such as MS Word, Excel and work order systems (Famis, TMA, Maximo).Knowledge of human resources procedures, including staffing, hiring, training, disciplinary action, termination, and performance management.Working knowledge and/or experience of UC systems, polices, procedures and regulations. \n Preferred Qualifications  \nDemonstrated knowledge of maintenance/trades work in a portfolio with diverse building types/ages. \nAdditional Information \nIn the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel.UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.  UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.  UC Riverside is the top university in the United States for social mobility. - U.S. News 2020  UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.  Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019  Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings  UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.   The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law. For information about our generous employee benefits package, visit: Employee Benefits Overview \nJob Description Details\n\n View complete Job Description for this position  \n\n\n\n\n\n\n\n\n\n\nMore Information\n\n\n\nGeneral Campus Information\n\nUniversity of California, Riverside\n\n900 University Ave.\n\nRiverside, CA 92521\n\n\n                                Tel: (951) 827-1012\n\n\n\nCareer Opportunities\n                            • UCR Libraries\n\nCampus Status\n                            • Maps and Directions\n\n\n\nDepartment Information\n\nHuman Resources\n1160 University Ave.\nRiverside, CA 92521\n                                    \nFax: (951) 827-6493\n                                    E-mail: jobshelp@ucr.edu\n\n\n\nRelated Links\n\nHuman Resources Home\nDiversity\nAbout UCR\n\n\n\n\n\n\n\n\nCampuswide Navigation\n\n\nHome\n\n\nAbout UCR\n\n\nAcademics\n\n\nAdmissions\n\n\nAthletics\n\n\nHappenings\n\n\nResearch\n\n\nCampus Resources\n\n\nGiving to UCR\n\n\n\nFooter\n\n\n\nPrivacy Policy\n\n\nTerms and Conditions\n\n\n                            © 2010 Regents of the University of California\n                        \n\n                            Last modified: 2010-Apr-22\n                        \n\n\n\n\n \n",
    "links": [
        "#main",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_login&module=jobs",
        "!Controller?action=jobs_webui.show_page&page=jobs_register&module=jobs",
        "#",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&public=true&module=jobs",
        "https://jobs.ucr.edu/how-apply",
        "!Controller?action=jobs_webui.show_page&page=jobs_account_overview&module=jobs",
        "https://jobs.ucr.edu/help",
        "http://jobs.universityofcalifornia.edu/",
        "#",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&module=jobs",
        "!Controller?action=jobs_webui.forward_link&link=jobs_webui.apply_job&requisition_id=29191811&module=jobs",
        "https://ucnet.universityofcalifornia.edu/compensation-and-benefits",
        "!Controller?action=jobs_template&page=CT_job_description&requisition_id=29191811",
        "http://www.ucr.edu/employment.html",
        "httsp://library.ucr.edu/",
        "http://campusstatus.ucr.edu/",
        "http://www.ucr.edu/about/directions.html",
        "http://campusmap.ucr.edu/campusMap.php?loc=PRSNL",
        "mailto:jobshelp@ucr.edu?subject=Web Site Inquiry",
        "http://hr.ucr.edu",
        "http://diversity.ucr.edu",
        "http://www.ucr.edu/about",
        "http://www.ucr.edu/",
        "http://www.ucr.edu/about/",
        "http://www.ucr.edu/academics/",
        "http://www.ucr.edu/admissions/",
        "http://www.ucr.edu/athletics/",
        "http://www.ucr.edu/happenings/",
        "http://www.ucr.edu/research/",
        "http://www.ucr.edu/resources/",
        "http://www.ucr.edu/giving/",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}