{
    "title": "General Education - California State University Fullerton - Acalog ACMS™",
    "body": "\n\n\nSkip to Content\n\n\n\n\n\n\n\n\n\n\n\n\n\n California State University, Fullerton\n\n\n\n\n\n\n\n\n\n\n\n\nCourse Descriptions\n\n\nDegree Programs\n\n\nGeneral Education\n\n\nUndergraduate Admissions\n\n\nGraduate Admissions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    This site is maintained by   Academic Programs.\n\n\n                    To report problems or comments with this site, please contact   catalog@fullerton.edu.   Privacy Policy.\n                    © California State University, Fullerton. All Rights Reserved.\n                \n\n                    CSUF is committed to ensuring equal accessibility to our users.\n                    Let us know about any accessibility problems you encounter using this website.\n                \n\n\n\n\n                Additional Resources\n            \n\n\n                    Saftey & Security\n                \n\n\nEmergency Information\n\n\nUniversity Police\n\n\nAnnual Security Report (Clery)\n\n\n\n\n\n                    CSUF Information\n                \n\n\nContacts & Addresses\n\n\nCampus A-Z Index\n\n\nCampus Map\n\n\nCSU - Office of the Chancellor\n\n\n\n\n\n                    Accessibility & Equity\n                \n\n\nTitle IX\n\n\nWeb Accessibilty - ATI\n\n\nReport an ATI Issue\n\n\nAdobe Reader\n\n\nMicrosoft Viewers\n\n\n\n\n\n\n\n\n\n   \n\tCalifornia State University Fullerton\n\n\n\n   \n\n\n\n\n \n\n \n\t\t\t\tApr 29, 2023\t\t\t\n\n \n\n\n\n\n2022-2023 University Catalog \n\n\n\n\n\n\n\nSelect a Catalog\n 2023-2024 University Catalog\n2022-2023 University Catalog [ARCHIVED CATALOG]\n2021-2022 University Catalog [ARCHIVED CATALOG]\n2020-2021 University Catalog [ARCHIVED CATALOG]\n2019-2020 University Catalog [ARCHIVED CATALOG]\n2018-2019 University Catalog [ARCHIVED CATALOG]\n2017-2018 University Catalog [ARCHIVED CATALOG]\n2016-2017 University Catalog [ARCHIVED CATALOG]\n2015-2016 University Catalog [ARCHIVED CATALOG]\n2013-2015 University Catalog [ARCHIVED CATALOG]\n2021-2022 Faculty Handbook [ARCHIVED CATALOG]\n2018-2019 Faculty Handbook [ARCHIVED CATALOG]\n2022-2023 Faculty Handbook\n\n\n\n  \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGlobal Search\n\n\n\n\n\n\n\n\nCatalog Search \n\nChoose Search Location\n\n\n\nSelect an option\nCourses\nPrograms\nColleges/Departments\nOther Content\nEntire Catalog\n\n\n\n\n\n\n\nSearch Keyword Field\n\n\n\n\nWhole Word/Phrase\n\n\n\n\n\t\t\t\t\tAdvanced Search\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCatalog Navigation\n\n\n\n\n  Catalog Home\n  President’s Message \n  Academic Calendar \n  The California State University \n  About the University \n  Administration \n \n  College of the Arts \n  College of Business and Economics \n  College of Communications \n  College of Education \n  College of Engineering and Computer Science \n  College of Health and Human Development \n  College of Humanities and Social Sciences \n  College of Natural Sciences and Mathematics \n \n  Degree Programs \n  Course Descriptions \n \n  University Requirements and Regulations \n  Graduate Regulations \n  Admissions \n  Academic Advising \n  Registration \n  Academic Departments and Programs \n  Special Academic Programs \n  Academic Affairs Support \n  Student Affairs Support \n  Information Technology \n \n  Faculty and Administration \n  Emeriti \n \n  Archived Catalogs \n\n\n\n\n\n\n\n\n\n\n\n\n   My Portfolio\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHELP\n2022-2023 University Catalog [ARCHIVED CATALOG] \n\t\t\t\t\t\t\t  General Education\t\t\t\t\t\t\t  \nPrint-Friendly Page (opens a new window)\n\n\nFacebook this Page (opens a new window)\n\n\n\n\nTweet this Page (opens a new window)\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nIntroduction\nTitan Degree Audit\nGeneral Education Requirements\nCertification Policy\n\n\n\n\nAssociate Degrees for Transfer (AA-T/AS-T)\nLower-Division Transfer Patterns by Major\nThe Objectives of General Education\n\n\n\n\n\n\nIntroduction\nThe General Education program at Cal State Fullerton is the basis of a university education. It is the foundation upon which each and every major is built. The goal of the campus is to provide a well-rounded citizen, not only of the region and the nation, but of the world as well. Thus, this broad-ranging curriculum has been carefully designed to ensure that every graduate is exposed to current thinking and scholarship that will provide a lifetime of appreciation of the liberal arts and sciences, as well as the ability to grow intellectually, ethically, morally and technologically.\nAll students who graduate from Cal State Fullerton must complete 48-49 semester units of general education courses selected in accordance with the pattern designated on the following pages. General education courses must be selected from an approved list. Students should refer to their individual Titan Degree Audit to see a list of approved courses in each GE category. A student who has a break in enrollment for more than one semester in any calendar year may be held to new catalog requirements.\nCSUF students may complete lower-division general education requirements at a community college. In choosing equivalent courses, students must follow the CSUF general education plan and not the plan of the community college. Questions can be directed to the CSUF Academic Advising Center, Gordon Hall 123B.\nDuring the first academic year, unless the requirement has been completed, students shall enroll in G.E. Area A.1, Oral Communication, G.E. Area A.2, Written Communication, and G.E. Area B.4, Mathematics/Quantitative Reasoning courses appropriate to their major and skill level.\nTitan Degree Audit\nThe Titan Degree Audit serves as the official advising tool for both students and academic advisers. The report provides information on student progress toward the completion of general education, major and other degree requirements, and will follow the student’s progress from admission to graduation. Visit fullerton.edu/aac for instructions on accessing the TDA and the Titan Advising Network.\nGeneral Education Requirements\nUnit Requirements\n48-49 total units including:\n\nNine units upper division (300-level or 400-level courses) in designated areas B.5, C.3 and D.3 should be taken as a junior or senior at a CSU campus\nThree units in cultural diversity (courses marked with an asterisk *)\nEach course counts in only one G.E. Area, except those meeting Overlay Z, Cultural Diversity or those in Area B that may combine the lab (B.3) within the B.1 or B.2 course\n\nAcademic Standards\n\nLetter grade required\nC- (1.7) or better required in G.E. Areas A.1, A.2, A.3 and B.4. Thus, a grade of D+ (1.3) is not sufficient to fulfill these requirements\nCR/NC is allowed if it is the only grade option available\n\nCourses in Your Major\n\nG.E. approved courses offered by the department of the student’s major may be used to fulfill both G.E. and degree unit requirements.\nUpper-division G.E. courses are not applicable for graduate degree credit.\n\nTransfer Students\nThere are two General Education-Breadth patterns that California community college students can complete.\n\nCSU General Education-Breadth Program\n\tThis program is a lower-division, 39-semester-unit pattern. Students must take specified courses in five specific areas. Students with full certification are required to complete nine semester units of upper-division general education consisting of a minimum of three semester units each in Area B, C and D within the CSU after transferring to CSUF.\n\t \nIntersegmental General Education Transfer Curriculum\n\tAll lower-division Cal State Fullerton G.E. requirements may be satisfied by the completion in its entirety of this transfer curriculum at a California community college. Information about IGETC is available at each campus. Upper-division G.E. requirements for IGETC-certified transfers are nine semester units of upper-division general education consisting of a minimum of three semester units each in Area B, C and D within the CSU after transferring to CSUF.\n\nFor either pattern, a minimum of three units of a “cultural diversity” (identified with an asterisk *) course, if not met prior to transfer, is required. In addition, the U.S. History, Constitution and American Ideals areas are required for graduation and must be completed if not met prior to transfer. Using their student portal, students can access their Titan Degree Audit to get a summary of their G.E. requirements.\nCSUF General Education Plans\nThe following G.E. plan is for students that have rights to the fall 2022-spring 2023 catalog years:\n\n\n\n\nArea A: Core Competencies\nOral Communication\nWritten Communication\nCritical Thinking\n\n\n9 units\nA.1\nA.2\nA.3\n\n\n\n\nArea B: Scientific Inquiry and Quantitative Reasoning\nPhysical Science\nLife Science\nLaboratory Experience\nMathematics/Quantitative Reasoning\nImplications and Explorations in the Natural Sciences and Mathematics/Quantitative Reasoning\n\n\n12-13 units\nB.1\nB.2\nB.3\nB.4\nB.5\n\n\n\n\nArea C: Arts and Humanities\nIntroduction to the Arts\nIntroduction to the Humanities\nExplorations in the Arts or Humanities\n\n\n12 units*\nC.1\nC.2\nC.3\n\n\n\n\nArea D: Social Sciences\nIntroduction to the Social Sciences\nAmerican History, Institutions and Values\nExplorations in Social Sciences\n\n\n9 units\nD.1\nD.2\nD.3\n\n\n\n\nArea E: Lifelong Learning and Self Development\nLifelong Learning and Self-Development\n\n\n3 units\nE\n\n\n\n\nArea F: Ethnic Studies\nEthnic Studies\n\n\n3 units\nF\n\n\n\n\nOverlay Z: Cultural Diversity\nCultural Diversity (Courses are marked with an *)\n\n\nZ*\n\n\n\n\nMinimum Total\n\n\n48-49 units\n\n\n\n\n* 3 units from C.1; 3 units from C.2; 3 units from C.3; and 3 units from either C.1 or C.2. Designated high-unit majors may waive the “3 units from either C.1 or C.2” requirement. See an adviser for more information.\n\n\t\t\tStudents under earlier catalog years that contain different G.E. plans or who need help with the above chart should contact the Academic AdvisingCenter, Gordon Hall 123B, at 657-278-3606.\n\n\n\n\nCertification Policy\nUnder provisions of Title 5 and Executive Order 1100, accredited colleges and universities may certify the completion of part of the 48-49 units required in general education. Within the policy of the Board of Trustees, Cal State Fullerton will accept such certification of general education up to a maximum of 39 semester units, but may accept no more in general education than the number of units required in each area.\nTransfer students who are certified in any area with fewer than the required units will be subject to additional units and will be permitted to take the additional units in upper-division areas.\nAssociate Degrees for Transfer (AA-T/AS-T)\nThe Student Transfer Achievement Reform Act (SB 1440) establishes a transfer Associate of Arts (AA-T) or Associate of Science (AS-T) degree for California Community College students and is designed to provide a clear pathway to the CSU degree major. It allows students to complete an associate’s degree while satisfying lower-division general education and major requirements for transfer at the same time.\nIt is important that students contact their local community college for information on meeting the requirements for a transfer AA-T or AS-T degree. Students who have completed an approved associate transfer degree program deemed “similar” to their Cal State Fullerton major are eligible to graduate in 60 units. The exact pathway to complete the specific major will depend on the specific AA/AS curriculum. The 60-unit graduation option will obviously not be possible if the student changes majors or elects to add any additional degree objective, such as a second major or minor. It is highly recommended students have a consultation with their department academic adviser or visit the Academic Advising office.\nFor more information, visit admissions.fullerton.edu/prospectivestudent/transferdegree.php.\nLower-Division Transfer Patterns by Major\nLower-Division Transfer Patterns present potential transfer students with a set of “road maps” to follow that will ensure appropriate academic preparation for studies at CSU and decrease time to graduation once these students enter the CSU. The LDTP for each discipline or major has statewide as well as campus-specific components. The statewide component of the LDTP is appropriate for any CSU campus that offers the major and comprises general education coursework as well as some courses within the discipline. The campus-specific component identifies discipline-related coursework relevant to the major at the specific CSU campus where the student intends to transfer. Together these components for an LDTP will typically total at least 60 units, which is the number of units needed to transfer to CSUF as an upper-division student.\nThe Objectives of General Education\nGeneral education is central to a university education and should enhance students’ awareness of themselves in a complex universe, drawing upon multiple points of view. As a result of the general education experience, students should acquire knowledge of diverse disciplinary and cultural perspectives and skill in comparing, contrasting, applying and communicating effectively these perspectives in tasks considered appropriate to particular courses.\nThe General Education program at Cal State Fullerton is divided into six major areas: A. Core Competencies, B. Scientific Inquiry and Quantitative Reasoning, C. Arts and Humanities, D. Social Sciences, E. Lifelong Learning and Self-Development and F. Ethnic Studies. Additionally, the General Education program includes one Overlay, Z. Cultural Diversity, that adds content but no additional units to designated general education courses.\nWritten communication, oral communication, critical thinking and mathematics/quantitative reasoning are essential components of the entire program of general education at Cal State Fullerton.\nGeneral education courses shall include student writing appropriate to the course. Writing in general education courses shall involve the organization and expression of complex data or ideas. Instructors shall provide careful and timely evaluations of writing so that deficiencies are identified and suggestions are offered for improvement on subsequent writing in the course. Evaluations of the student’s writing competence shall be used in determining the final course grade. When a student is enrolled in a combined lecture and laboratory course, the laboratory portion of the course may be used to satisfy the general education writing requirement.\nNo single course should necessarily be expected to pursue every objective specified for that course’s G.E. area or subarea, although each course should meet the preponderance of the learning objectives within that area or subarea, thus satisfying the spirit and intention of the learning objectives (i.e., the more objectives that a particular course addresses the more appropriate that course will be as a general education offering.) However, courses that satisfy Overlay Z, Cultural Diversity, must include all of the learning objectives.\nCourse syllabi for courses that meet general education requirements shall include the following:\n\nA statement of the specific general education requirement(s) that the course meets.\nA list of the learning objectives for the general education area or subarea in which the course carries credit.\nCourses in Oral Communication (A.1), Written Communication (A.2), Critical Thinking (A.3) and Mathematics/Quantitative Reasoning (B.4) shall include a statement that “A grade of C- (1.7) or better is required to meet this general education requirement. A grade of D+ (1.3) or below will not satisfy this general education requirement.”\nA statement of how the general education writing requirement shall be met and assessed.\n\nGeneral education courses may be taught in any modality (e.g., face-to-face, hybrid or completely online).\n\nA. Core Competencies\nThe core competencies include Oral Communication, Written Communication and Critical Thinking. These shall be lower-division courses.\n\nOverall Objectives\nStudents taking courses in Area A shall practice and enhance their skills and abilities to:\n\norganize one’s thoughts and communicate them clearly and effectively, using language that demonstrates sensitivity to gender and cultural differences.\nfind, evaluate, select, synthesize, organize, cite and present information and arguments clearly and effectively for a variety of purposes and audiences.\nrecognize and evaluate the features, functions, and contexts of language that express and influence meaning.\ncompare and contrast with care and accuracy the relative merits of alternative or opposing arguments, interpretations, assumptions and cultural values.\nreflect in an open-minded manner on one’s own thinking in relation to the ideas of others.\n\nA.1 Oral Communication\nCourses in subarea A.1 must be taught in English. Students taking courses in subarea A.1 shall practice and enhance their skills and abilities to:\n\nDemonstrate the ability to communicate orally and listen effectively.\nUnderstand the rhetorical principles that underlie form, content, context and effectiveness of communication choices in formal speeches or social interactions.\nPresent well-organized oral messages practicing sound reasoning and advocacy that depend on the effective discovery, critical evaluation, accurate presentation and clear reporting of relevant information and supporting evidence.\nUnderstand how culture and social context influence oral communication and to appreciate the value of different communication styles.\nSelect and use effectively appropriate techniques and materials to support ideas and to motivate and persuade others.\n\nA.2 Written Communication\nCourses in subarea A.2 must be taught in English. Students taking courses in subarea A.2 shall practice and enhance their skills and abilities to:\n\nDevelop and present clearly written messages in English.\nExpress and advocate ideas clearly and effectively in writing.\nPresent well-organized written messages exhibiting sound reasoning and advocacy that depend on the critical evaluation of relevant information.\nUnderstand the rhetorical principles that underlie form, content, context and effectiveness of choices made in written messages, including how matters of style affect successful communication.\nImprove one’s own writing skills through the critique of the writing of others.\nUse writing to synthesize creative and innovative ideas, solutions and knowledge.\n\nA.3 Critical Thinking\nStudents taking courses in subarea A.3 shall practice and enhance their skills and abilities to:\n\nUnderstand the role of logic and its relation to language.\nUnderstand elementary inductive and deductive processes, including formal and informal fallacies.\nDevelop the skills to distinguish propositions and statements of fact from issues of judgment or opinion.\nDevelop skills to advocate for ideas.\nDevelop skills to reach well-supported factual and judgmental conclusions and the skills to successfully advocate for these conclusions.\nEvaluate, critique and analyze the quality and sufficiency of evidence and other forms of support for a position, including recognition of underlying lines of argument.\n\nB. Scientific Inquiry and Quantitative Reasoning\nScientific Inquiry and Quantitative Reasoning includes Physical Science, Life Science, Laboratory Experience, Mathematics/Quantitative Reasoning, and Implications and Explorations in the Natural Sciences and Mathematics/Quantitative Reasoning.\nCourses in B.1 through B.4 shall be lower-division courses. Courses in B.5 shall be upper-division courses.\nShared Learning Objectives\nB.1 Physical Science\nB.2 Life Science\nB.3 Laboratory Experience\nSubareas B.1, B.2 and B.3 share a set of core learning objectives. Students taking courses in subareas B.1, B.2 and B.3 shall:\n\nUnderstand the nature of scientific inquiry and the unique way that the natural sciences and mathematics describe the universe.\nEvaluate the validity and limitations of theories and scientific claims in interpreting experimental results.\nUnderstand the dynamic and evolving nature of the sciences.\nRecognize the importance of scientific paradigms and methods in understanding scientific concepts.\nUse quantitative techniques and scientific reasoning to investigate problems and phenomena in the natural universe.\nUnderstand the potential limits of scientific endeavors and the value systems and ethics associated with human inquiry.\nUnderstand different types of uncertainty and its impact on scientific methodology and reasoning.\nAnalyze and manipulate graphical representations of data.\nFormulate and evaluate hypotheses using quantitative techniques.\nUse statistical techniques to evaluate uncertainty in experimental data.\n\nB.1 Physical Science\nStudents taking courses in subarea B.1 shall explore the core objectives described above through in-depth exploration of the physical universe. Students taking courses in subarea B.1 shall obtain a foundational understanding of either the nature of matter and energy, or Earth as a planet and its relation to the universe.\nStudents taking courses focusing on the nature of matter and energy shall:\n\nUnderstand that energy exists in many forms, and that in any process, energy changes form and/or place, but the total amount of energy remains the same.\nRecognize that objects interact with one another by exerting forces, and that unbalanced forces acting on an object cause change in the motion of the object.\nUnderstand that all matter has observable properties that depend on the conditions and scale at which we look. Investigations of matter at the atomic and subatomic levels explain the properties, reactions and interactions of matter.\n\nStudents taking courses focusing on the Earth as a planet and its relation to the universe shall:\n\nApply basic principles of the physical and life sciences to understand earth and astronomical systems.\nUnderstand that earth materials and structures are organized in interacting systems and that the Earth itself is part of a planetary system.\nUnderstand that the Earth changes continuously and is part of a universe that itself is changing.\nRecognize that energy and matter flow and cycle through earth and astronomical systems, of which human society is an integral part.\nUnderstand that changes within an earth or astronomical system may affect other earth or astronomical systems. Humans are part of and may affect or be affected by these systems.\nUnderstand that earth and astronomical systems have interacted and evolved over billions of years encompassing the lifetime of planet Earth, the solar system and the universe.\n\nB.2 Life Science\nStudents taking courses in subarea B.2 shall explore the foundations of the Life Sciences through in-depth exploration of living systems. Students taking courses in subarea B.2 shall:\n\nUnderstand that living things are made of smaller structures whose functions enable organisms to survive.\nUnderstand that living things depend on each other and the physical environment as they interact to obtain, change and exchange matter and energy.\nUnderstand that the great diversity of living things — ranging from single-celled organisms to complex multi-celled organisms, including microbes, plants and animals — is the result of billions of years of evolution through the mechanisms of heredity, mutation and natural selection.\n\nB.3 Laboratory Experience\nStudents taking courses in subarea B.3 shall:\n\nApply scientific methodology through active experimental methods and experiences (laboratory/activity).\nEvaluate the validity and limitations of theories and scientific claims in interpreting experimental results.\n\nCourses in subarea B.3 shall be associated with B.1 or B.2.\nB.4 Mathematics/Quantitative Reasoning\nStudents taking courses in subarea B.4 shall demonstrate the abilities to reason quantitatively, practice computational skills, and explain and apply mathematical or quantitative reasoning concepts to solve problems. If a course in this subarea requires a prerequisite, it shall include a prerequisite reflective only of skills and knowledge required in the course. In addition to traditional mathematics, courses in subarea B.4 may include computer science, personal finance, statistics or discipline-based mathematics or quantitative reasoning courses, for example.\nStudents taking courses in subarea B.4 shall:\n\nUnderstand and appreciate the varied ways in which mathematics is used in problem-solving.\nUnderstand and appreciate the varied applications of mathematics to real-world problems.\nPerform appropriate numerical calculations, with knowledge of the underlying mathematics, and draw conclusions from the results.\nDemonstrate knowledge of fundamental mathematical concepts, symbols and principles.\nSolve problems that require mathematical analysis and quantitative reasoning.\nSummarize and present mathematical information with graphs and other forms that enhance comprehension.\nUtilize inductive and deductive mathematical reasoning skills in finding solutions, and be able to explain how these skills were used.\nExplain the overall process and the particular steps by which a mathematical problem is solved.\nDemonstrate a sense of mastery and confidence in the ability to solve problems that require mathematical concepts and quantitative reasoning.\n\nB.5 Implications and Explorations in Natural Sciences and Mathematics/Quantitative Reasoning\nCourses in this subarea draw upon, integrate, apply and extend knowledge and skills previously acquired in subareas B.1-4. These courses have a substantial scientific and/or mathematical content and require completion of appropriate courses in subareas B.1-4 as prerequisites to enrollment. Students taking courses in subarea B.5 shall:\n\nIntegrate themes in science, mathematics and/or quantitative reasoning from cross-disciplinary perspectives.\nSolve complex problems that require science, mathematics and/or quantitative reasoning.\nRelate science, mathematics and/or quantitative reasoning to significant social problems or to other related disciplines.\nWhen deemed appropriate, apply disciplinary concepts from mathematics and the natural sciences in a variety of settings, such as community-based learning sites and activities.\n\nC. Arts and Humanities\nArts and Humanities include Introduction to the Arts (C.1), Introduction to Humanities (C.2), and Explorations in the Arts and Humanities (C.3).\nCourses in C.1 and C.2 shall be lower-division courses. Courses in C.3 shall be upper-division courses.\nOverall Learning Objectives\nAfter completing course requirements in Area C, students shall:\n\nCultivate their intellect, imagination, sensibility and sensitivity through the study of the arts and humanities.\nUnderstand and explicate major concepts, themes and imagery found in the arts and humanities, and recognize aesthetic qualities and processes that characterize works of the human intellect and imagination.\nUnderstand how significant works in the arts and humanities respond to and address enduring problems of human existence.\nAppreciate the interdisciplinary nature of the arts and humanities, including disciplines both within and outside the arts and humanities.\n\nC.1 Introduction to the Arts\nStudents taking courses in subarea C.1 shall:\n\nUnderstand and appreciate the visual and performing arts.\nBecome cognizant of the various aesthetic and non-aesthetic values that have contributed to the development of civilization.\nRecognize and analyze the social, historical and cultural significance of works of human imagination, including those in the culturally diverse contemporary world.\nCultivate, both emotionally and intellectually, an understanding of the interrelationship between the self and the creative arts through the study of the arts or through experiencing the arts, including for example, attending dance recitals, concerts and plays, and visiting art sites such as museums.\n\nAlthough courses in subarea C.1 may include creative activities on the part of the student, these courses may not exclusively emphasize skills development and must contain a substantial cultural component.\nC.2 Introduction to the Humanities\nStudents taking courses in subarea C.2 shall:\n\nCultivate their intellectual reasoning skills, expand their capacity for creative imagination, develop their reasonable moral sensibilities, and increase their capacity for sensitive engagement through studying great works of human imagination and reason (which are to be primarily, although not exclusively, written texts and literature).\nUnderstand how the humanities have contributed to the development of culture, including the comparative study of the humanities in diverse cultures.\nUnderstand how the humanities have sought to provide answers to complex problems facing humanity, including the relationship of the self to culture and the natural world, the nature of moral and legal obligations, and the meaning and purpose of human existence.\n\nC.3 Explorations in the Arts or Humanities\nCourses in this subarea shall draw upon, integrate, apply, and extend knowledge and skills previously acquired in subareas C.1 and/or C.2. Although courses approved for C.3 will typically meet either the objectives for Explorations in the Arts or Explorations in the Humanities, some interdisciplinary courses may draw upon the learning objectives from both areas. Completion of appropriate courses in subarea C.1 and/or C.2 shall be required as a prerequisite for all courses in C.3. The learning objectives for subarea C.3 include the learning objectives for subareas C.1 and/or C.2.\nAll courses in subarea C.3 must contain a substantial cultural component. Courses in subarea C.3 may include creative activities on the part of the student provided they do not emphasize skills development exclusively. \nIn addition to the learning objectives of C.1 and/or C.2, students taking courses that are Explorations in the Arts shall:\n\nGain visual and performance literacy through the scholarly observation of culturally and historically significant art with an emphasis on the endeavor of the artist/creator.\nCultivate an understanding of a work of art that embodies an objective as well as subjective response to the aesthetic experience, defend an informed opinion and communicate their view to others.\nRelate the arts to significant social problems.\nUnderstand the broad, unifying themes in the arts from a wide array of perspectives.\nDeepen previously acquired artistic appreciation and understanding through participation either in making or performing of art forms or through the experience of such a process by direct observation.\n\nIn addition to the Learning Objectives of C.1 and/or C.2, students taking courses that are Explorations in the Humanities shall:\n\nUnderstand broad, unifying themes from cross-disciplinary perspectives in the humanities.\nUnderstand the relevance of the humanities for the thoughtful consideration of complex contemporary problems.\nAppreciate the complex relationship and interaction between the humanities and other fields of learning, including the natural sciences, social sciences and arts.\n\nD. Social Sciences\nSocial Sciences include Introduction to the Social Sciences, American History, Institutions and Values, and Explorations in Social Sciences.\nCourses in D.1 and D.2 shall be lower-division courses. Courses in D.3 shall be upper-division courses.\nOverall Learning Objectives \nAfter completing course from different disciplinary perspectives in Area D students shall:\n\nUnderstand the ways that social, political, and economic institutions and human behavior are interconnected.\nUnderstand problems and issues from respective disciplinary perspectives and examine issues in their contemporary as well as historical settings and in a variety of cultural contexts.\nUnderstand the principles, value systems, ethics and methodologies employed in social science inquiry.\nUnderstand the ways cultures construct social differences, such as those based on ethnicity, gender, race, class and sexual orientation, and their effects on the individual and society.\n\nD.1 Introduction to the Social Sciences\nStudents completing courses in subarea D.1 shall:\n\nUnderstand the purpose of the social sciences and the distinguishing features of the social sciences.\nUnderstand and explain major social science concepts, methods and theories and apply them to concrete problems of contemporary society.\nReflect on what it means to be a social, historical, cultural, psychological and political being.\nReflect on their own social, cultural and political experiences in light of social science concepts, methods and theories.\nUnderstand the integrated nature of social, political and economic behaviors and institutions in different geographical and historical contexts.\nUnderstand processes of social, political and cultural change and differentiation in a variety of cultural contexts.\n\nD.2 American History, Institutions and Values\nStudents completing courses in subarea D.2 shall:\n\nRecognize the significance of cultural, intellectual, ethical, economic and political struggles that have shaped American society over time.\nUnderstand critically the historical development of American institutions and values and their impact on the individual and collective lives of Americans.\nRecognize the significance of the interaction of ethnic and other social groups to the historical development of American society, institutions and values within contexts of accommodation and resistance.\nUnderstand critically how government under the Constitution of the United States has shaped American society.\nCritically situate changes in American society within the context of global events.\nAnalyze primary source materials, engage in critical and constructive discussions, and communicate effectively in writing.\n\nD.3 Explorations in Social Sciences\nBecause courses in subarea D.3 build upon the learning objectives in D.1, completion of subarea D.1 shall be required as a prerequisite for all courses in D.3. In addition, students completing courses in subarea D.3 shall:\n\nExamine problems, issues and themes in the social sciences in greater depth; in a variety of cultural, historical and geographical contexts; and from different disciplinary and interdisciplinary perspectives.\nAnalyze and critically evaluate the application of social science concepts and theories to particular historical, contemporary and future problems or themes, such as economic and environmental sustainability, globalization, poverty and social justice.\nAnalyze and critically evaluate constructs of cultural differentiation, including ethnicity, gender, race, class and sexual orientation, and their effects on the individual and society.\nApply theories and concepts from the social sciences to address historical, contemporary and future problems confronting communities at different geographical scales, from local to global.\n\nE. Lifelong Learning and Self-Development\nCourses in Lifelong Learning and Self-Development provide the opportunity to equip learners for lifelong understanding and development of themselves as integrated physiological, social and psychological beings.  Courses in E may be upper-division courses so long as adequate numbers of lower-division course options in E are available to students.\nStudents completing courses in Area E shall:\n\nFurther their own critical self-understanding and acquire the knowledge, skills, and attitudes necessary to engage and reflect in learning and self-development practices.\nDevelop strategies to be integrated physiological, socio-cultural and psychological beings to promote a holistic awareness of lifelong learning throughout their lives.\nActively apply and participate in developing a lifelong commitment to health for both personal well-being (such as physical, emotional, intellectual, spiritual, social/interpersonal and/or environmental aspects) and societal responsibility.\nDevelop themselves as responsible citizens, employees and employers, family members, and members of the global society.\n\nExamples of relevant topics in Area E include, but are not limited to:\n\nStudent success strategies\nHuman behavior\nSexuality\nNutrition\nPhysical and mental health\nStress management\nInformation literacy\nSocial and political relationships\nEnvironmental sustainability\nImplications of death and dying\nMedia literacy\n\nF. Ethnic Studies\nAn “Ethnic Studies course” is a course taught by faculty from the African American Studies, Asian American Studies, and Chicana and Chicano Studies Departments and identified in the catalog as taught through the African American Studies, Asian American Studies, and Chicano and Chicano Studies Departments as the home departments, if cross-listed.\nOnly the Ethnic Studies Requirement Committee may interpret California State University Core competencies for the Ethnic Studies Requirement into CSUF GE Area F learning objectives to be used to select courses to fulfill the requirement.  Courses that satisfy the Ethnic Studies requirement shall meet learning objectives that address at least three of the five CSU core competencies. \nCourses in F may be upper-division courses so long as adequate numbers of lower-division course options in F are available to students.\nStudents completing courses in Area F shall\n\na. (For lower division courses) Identify, define, and interpret core concepts such as race, racism, racial inaction, ethnicity, equity, ethnic-centrism, eurocentrism, white supremacy, self-determination, liberation, decolonization, sovereignty, anti-racism, migration, labor systems, settler colonialism, imperialism, citizenship, and immigration in any one or more of the following disciplines: African American Studies, Asian American Studies, Chicanx/a/o and Latinx/a/o Studies, and Native American Studies. Addresses CSU GE Area F core competency 1.\n\n \n\nb. (For upper division courses) Analyze, evaluate, and apply core concepts such as race, racism, racialization, ethnicity, equity, ethnic-centrism, eurocentrism, white supremacy, self-determination, liberation, decolonization, sovereignty, anti-racism, migration, labor systems, settler colonialism, imperialism, citizenship, and immigration in any one or more of the following disciplines: African American Studies, Asian American Studies, Chicanx/a/o and Latinx/a/o Studies, and Native American Studies.  Addresses CSU GE Area F core competency 1.\n\t​\nApply theory, creative expression, and/or knowledge to describe the histories, cultures, lived-experiences, and struggles within and/or across African American, Asian American, Chicanx/a/o and Latin/a/o, and/or Native American communities from one or more of the following: African American Studies, Asian American Studies, Chicanx/a/o Studies, Latinx/a/o Studies and Native American Studies.  Addresses CSU GE Area F core competency 2.\nDescribe and critically analyze the intersection of race with forms of difference affected by systems and hierarchies of oppression, for example:\n\n\nstructural racism\ncapitalism, genocide\nsexism, heterosexism\nableism\npolitical and cultural representation\n\n In African American, Asian American, Chicanx/a/o and Latinx/a/o and/or Native American communities. Addresses CSU GE Area F core competency 3.\n\nDemonstrate knowledge of and critically analyze creative activities and imagination such as poetry, performance, music, media, and popular culture in African American, Asian American, Chicanx/a/o and Latinx/a/o, and/or Native American communities.  Addresses CSU GE Area F core competency 3.\nExplain and interpret how histories of struggle, justices, solidarity, cultural and creative practice, language, identity development, and/or liberation are relevant to current identities and social structures on communal, national, international, and/or transnational scales as experienced, enacted, and studied by African Americans, Asian Americans, Chicanx/a/os, and Latinx/a/os, and Native Americans.  Addresses CSU GE Area F core competency 4.\nDescribe, document, and critically reflect on engagement with community issues focused on anti-racist and anti-colonial issues, and the practices and movements in African American, Asian American, Chicanx/a/o and Latinx/a/o, and/or Native American communities to build a just and equitable society.  Addresses CSU GE Area F core competency 5.\nEngage, produce, and critically analyze creative activities and imagination such as poetry, performance, music, media, and popular culture in African American, Asian American, Chicanx/a/o and Latinx/a/o, and/or Native American communities.  Addresses CSU GE Area F core competency 5.\n\nZ. Cultural Diversity \nCourses that satisfy the Cultural Diversity requirement must include all of the following learning objectives and in addition be approved G.E. courses in any area or subarea except A.1, A.2, A.3, B.4, or F.\nStudents completing courses in Overlay Z shall:\n\nDemonstrate an understanding of the ways in which culture, difference, and otherness are socially constructed and fundamental to social interaction in an inter-connected world.\nDemonstrate reflection and appreciation of the complex relationships that various factors such as gender, ethnicity, race, sexual orientation, religion, class, and exceptionality bring to a discussion of society and culture.\nDemonstrate a critical understanding of how power, privilege and oppression play out across a range of cultures, human experiences, intersecting social locations and historical experiences, including but not limited to one’s own experiences.\nRecognize how one’s own cultural histories and practices mediate one’s own sense of self and relationships to others.\nDescribe and understand how to enact ethical and transformative frameworks and modes of exchange and communication that promote rights, social justice, equity and inclusiveness.\n\nCourses in general education that meet these learning objectives will be identified by an asterisk (*) in appropriate publications or websites.\n\n\n\n Back to Top | Print-Friendly Page (opens a new window)\n\n\nFacebook this Page (opens a new window)\n\n\n\n\nTweet this Page (opens a new window)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   \n\nAll catalogs © 2023 California State University Fullerton. Powered by the Acalog™ Academic Catalog Management System™ (ACMS™).\n\n\n\n\n",
    "links": [
        "#select_catalog",
        "https://www.fullerton.edu/",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9878",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9876",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9803",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9813",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9810",
        "https://www.fullerton.edu/academicprograms",
        "mailto:catalog@fullerton.edu",
        "https://www.fullerton.edu/it/iso/policy/OnlinePrivacy.php",
        "https://emergency.fullerton.edu/",
        "https://police.fullerton.edu/",
        "https://police.fullerton.edu/jeanneclery",
        "https://www.fullerton.edu/contact.aspx",
        "https://www.fullerton.edu/a-z.aspx",
        "https://www.fullerton.edu/campusmap",
        "https://www2.calstate.edu/",
        "https://www.fullerton.edu/titleix/",
        "https://www.fullerton.edu/ATI",
        "https://www.fullerton.edu/ati/reportati/",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/office.aspx",
        "/search_advanced.php?catoid=75",
        "/index.php?catoid=75",
        "/content.php?catoid=75&navoid=9864",
        "/content.php?catoid=75&navoid=9793",
        "/content.php?catoid=75&navoid=9794",
        "/content.php?catoid=75&navoid=9796",
        "/content.php?catoid=75&navoid=9797",
        "/content.php?catoid=75&navoid=9868",
        "/content.php?catoid=75&navoid=9875",
        "/content.php?catoid=75&navoid=9869",
        "/content.php?catoid=75&navoid=9870",
        "/content.php?catoid=75&navoid=9871",
        "/content.php?catoid=75&navoid=9872",
        "/content.php?catoid=75&navoid=9873",
        "/content.php?catoid=75&navoid=9874",
        "/content.php?catoid=75&navoid=9876",
        "/content.php?catoid=75&navoid=9878",
        "/content.php?catoid=75&navoid=9866",
        "/content.php?catoid=75&navoid=9811",
        "/content.php?catoid=75&navoid=9813",
        "/content.php?catoid=75&navoid=9808",
        "/content.php?catoid=75&navoid=9867",
        "/content.php?catoid=75&navoid=9877",
        "/content.php?catoid=75&navoid=9882",
        "/content.php?catoid=75&navoid=9879",
        "/content.php?catoid=75&navoid=9880",
        "/content.php?catoid=75&navoid=9890",
        "/content.php?catoid=75&navoid=9795",
        "/content.php?catoid=75&navoid=9798",
        "http://www.fullerton.edu/catalog/archive",
        "/portfolio_nopop.php?catoid=75",
        "help.php?catoid=75",
        "/content.php?catoid=75&navoid=9803&print",
        "http://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9803&t=I am looking at the General Education page at California State University Fullerton",
        "http://twitter.com/intent/tweet?u=u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9803&t=Check out this page at California State University Fullerton",
        "javascript:void(0)",
        "#introduction",
        "#titan-degree-audit",
        "#general-education-requirements",
        "#certification-policy",
        "#associate-degrees-for-transfer",
        "#lower-division-transfer-patterns-by-major",
        "#the-objectives-of-general-education",
        "http://fullerton.edu/aac",
        "tel:657-278-3606",
        "http://admissions.fullerton.edu/prospectivestudent/transferdegree.php",
        "javascript:void(0);",
        "/content.php?catoid=75&navoid=9803&print",
        "http://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9803&t=I am looking at the General Education page at California State University Fullerton",
        "http://twitter.com/intent/tweet?u=u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9803&t=Check out this page at California State University Fullerton",
        "javascript:void(0)",
        "/misc/catalog_list.php?catoid=75",
        "http://www.digarc.com"
    ]
}