{
    "title": "Molecular Biology Student Turns ‘Beautiful Disasters’ into Lifelong Call to Service - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nMolecular Biology Student Turns ‘Beautiful Disasters’ into Lifelong Call to Service\n\nClayton Truscott\nApril 25, 2023\n\n\n\n\n(Jason Halley / University Photographer) \n\n\n\nHikmat Abou Shahla has experienced a lot of heartbreak in his 21 years. Hailing from Beruit, Lebanon, he first came to Butte County in 2017 with the Kennedy-Lugar Youth Exchange and Study (YES) program for a year as a high school student. In Oroville, his otherwise great experience was punctuated by the near-failing of the Oroville Dam’s auxiliary spillway, followed by the Camp Fire a year later. \nHe came back to Butte County in 2019 to begin his bachelor’s degree at Chico State—only to return to Lebanon in May 2020 when the pandemic rippled across the globe. There, he was shaken by the convergence of COVID-19 and a catastrophic explosion in the nation’s capital that took 218 lives.  \nWith each of these events, Abou Shahla has thrown himself into public service in ways that belie his youth and experience, performing basic first-aid services after the blast, later providing COVID-19 vaccinations in Beirut, and volunteering as a certified nursing assistant in several Butte County hospitals when he returned to the United States in 2021.  \nHe calls them “beautiful disasters” which narrowed his focus on becoming a doctor. \n“Yes, they were devastating,” he said. “But they opened up so many opportunities to get involved in our community and get stronger together.”  \nNow a graduating senior majoring in cellular and molecular biology and minoring in general chemistry, Abou Shahla can momentarily look back on a storied personal and academic career at Chico State. Between a stacked volunteering resume and club schedule, he has maintained a near-perfect GPA while leading a research project on idiopathic scoliosis and earning the prestigious Study California Scholarship in 2023.  \n\n Tasha Alexander (left), a coordinator for international student and scholar services, sits with Hikmat Abou Shahla (right).\n\nStepping back to see all of the organizations he has served—Pre-Med Association, Community Action Volunteers in Education (CAVE), First-Year Leadership Opportunity (FLO), Omicron Theta Epsilon, the Novick Cardiac Alliance, and International Medical Aid-Kenya—the common thread is Abou Shahla’s passion for helping people. This will continue once he moves on to begin his master’s at Johns Hopkins University’s School of Nursing—where he has a full ride scholarship and a white coat with his name on it.  \nA lasting achievement for Abou Shahla is founding the Global Student Society, the first international student community on campus. With a very healthy and growing number of students enrolled today, the organization serves as a connector between local and international students, helping facilitate cross -cultural celebrations and meetups, and more.  \n“It’s very rewarding to create an organization like a mini home for those people who are struggling just to find their way into calling Chico State home,” Abou Shahla said. “It’s academically challenging to be in a US university. It is culturally challenging to be around people that you don’t know, people who are different from your culture, and it’s also challenging physically to your brain to keep listening to a language that’s not yours. My head hurt from this during my first years.” \nHe said that having a sense of community is something that he will take away from Chico State and continue to pay forward to others as his journey continues. “It’s priceless to be a part of a community and feel a sense of belonging,” he said. \n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tClayton Truscott\t\t\n\n\n\t\tCommunications Manager Clayton Truscott leads storytelling and content development efforts for University Communications.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/ctruscott/",
        "https://today.csuchico.edu/hikmat-abou-shahla/?share=facebook",
        "https://today.csuchico.edu/hikmat-abou-shahla/?share=twitter",
        "https://today.csuchico.edu/hikmat-abou-shahla/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Molecular%20Biology%20Student%20Turns%20%E2%80%98Beautiful%20Disasters%E2%80%99%20into%20Lifelong%20Call%20to%20Service&body=https%3A%2F%2Ftoday.csuchico.edu%2Fhikmat-abou-shahla%2F&share=email",
        "https://today.csuchico.edu/hikmat-abou-shahla/#print",
        "#",
        "https://today.csuchico.edu/author/ctruscott/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}