{
    "title": "Code Of Ethics",
    "body": "\n\n\n\n\n\n\nSmall. Fast. Reliable.Choose any three.\n\n\n\nHome\nMenu\nAbout\nDocumentation\nDownload\nLicense\nSupport\nPurchase\n\nSearch\n\n\n\n\nAbout\nDocumentation\nDownload\nSupport\nPurchase\n\n\n\n\n\nSearch Documentation\nSearch Changelog\n\n\n\n\n\n\n\n\n\n\nCode Of Ethics\n\n\n1. History\nThis document was originally called a \"Code of Conduct\" and\nwas created for the purpose of filling in a box on \"supplier registration\"\nforms submitted to the SQLite developers by some clients.  However,\nwe subsequently learned that \"Code of Conduct\" has a very specific and\nalmost sacred meaning to some readers, a meaning to which this\ndocument does not conform\n[1][2][3].\nTherefore this document was renamed to \"Code of Ethics\", as\nwe are encouraged to do by rule 71 in particular and also rules 2, 8, 9, 18, 19,\n30, 66, and in the spirit of all the rest.\n\nThis document continues to be used for its original purpose - providing\na reference to fill in the \"code of conduct\" box on supplier registration\nforms.\n\n2. Purpose\nThe founder of SQLite, and all of the current developers at the time\nwhen this document was composed, have pledged to govern their\ninteractions with each other, with their clients,\nand with the larger SQLite user community in\naccordance with the \"instruments of good works\" from chapter 4 of\nThe Rule of St. Benedict\n(hereafter: \"The Rule\").\nThis code of ethics has proven its mettle in thousands of diverse\ncommunities for over 1,500 years, and has served as a baseline for many\ncivil law codes since the time of Charlemagne.\n\n2.1. Scope of Application\n\nNo one is required to follow The Rule, to know The Rule, or even\nto think that The Rule is a good idea.  The Founder of SQLite believes\nthat anyone who follows The Rule will live a happier and more productive \nlife, but individuals are free to dispute or ignore that advice if\nthey wish.\n\n\nThe founder of SQLite and all\ncurrent developers have pledged to follow the spirit of The Rule\nto the best of their ability. They\nview The Rule as their promise to all SQLite users of how the developers\nare expected to behave.\nThis is a one-way promise, or covenant.\nIn other words, the developers are saying: \"We will treat you this\nway regardless of how you treat us.\"\n\n\n3. The Rule\n\n\n First of all, love the Lord God with your whole heart,\n     your whole soul, and your whole strength.\n\n Then, love your neighbor as yourself.\n\n Do not murder.\n\n Do not commit adultery.\n\n Do not steal.\n\n Do not covet.\n\n Do not bear false witness.\n\n Honor all people.\n\n Do not do to another what you would not have done to yourself.\n\n Deny oneself in order to follow Christ.\n\n Chastise the body.\n\n Do not become attached to pleasures.\n\n Love fasting.\n\n Relieve the poor.\n\n Clothe the naked.\n\n Visit the sick.\n\n Bury the dead.\n\n Be a help in times of trouble.\n\n Console the sorrowing.\n\n Be a stranger to the world's ways.\n\n Prefer nothing more than the love of Christ.\n\n Do not give way to anger.\n\n Do not nurse a grudge.\n\n Do not entertain deceit in your heart.\n\n Do not give a false peace.\n\n Do not forsake charity.\n\n Do not swear, for fear of perjuring yourself.\n\n Utter only truth from heart and mouth.\n\n Do not return evil for evil.\n\n Do no wrong to anyone, and bear patiently wrongs done to yourself.\n\n Love your enemies.\n\n Do not curse those who curse you, but rather bless them.\n\n Bear persecution for justice's sake.\n\n Be not proud.\n\n Be not addicted to wine.\n\n Be not a great eater.\n\n Be not drowsy.\n\n Be not lazy.\n\n Be not a grumbler.\n\n Be not a detractor.\n\n Put your hope in God.\n\n Attribute to God, and not to self, whatever good you see in yourself.\n\n Recognize always that evil is your own doing,\n     and to impute it to yourself.\n\n Fear the Day of Judgment.\n\n Be in dread of hell.\n\n Desire eternal life with all the passion of the spirit.\n\n Keep death daily before your eyes.\n\n Keep constant guard over the actions of your life.\n\n Know for certain that God sees you everywhere.\n\n When wrongful thoughts come into your heart, dash them against\n     Christ immediately.\n\n Disclose wrongful thoughts to your spiritual mentor.\n\n Guard your tongue against evil and depraved speech.\n\n Do not love much talking.\n\n Speak no useless words or words that move to laughter.\n\n Do not love much or boisterous laughter.\n\n Listen willingly to holy reading.\n\n Devote yourself frequently to prayer.\n\n Daily in your prayers, with tears and sighs, confess your\n     past sins to God, and amend them for the future.\n\n Fulfill not the desires of the flesh; hate your own will.\n\n Obey in all things the commands of those whom God has placed\n     in authority over you even though they (which God forbid) should \n     act otherwise, mindful of the Lord's precept, \"Do what they say, \n     but not what they do.\"\n\n Do not wish to be called holy before one is holy; but first to be\n     holy, that you may be truly so called.\n\n Fulfill God's commandments daily in your deeds.\n\n Love chastity.\n\n Hate no one.\n\n Be not jealous, nor harbor envy.\n\n Do not love quarreling.\n\n Shun arrogance.\n\n Respect your seniors.\n\n Love your juniors.\n\n Pray for your enemies in the love of Christ.\n\n Make peace with your adversary before the sun sets.\n\n Never despair of God's mercy.\n\nThis page last modified on  2022-01-08 05:02:57 UTC \n",
    "links": [
        "index.html",
        "index.html",
        "javascript:void(0)",
        "about.html",
        "docs.html",
        "download.html",
        "copyright.html",
        "support.html",
        "prosupport.html",
        "javascript:void(0)",
        "about.html",
        "docs.html",
        "download.html",
        "support.html",
        "prosupport.html",
        "https://www.theregister.co.uk/2018/10/22/sqlite_code_of_conduct/",
        "https://pjmedia.com/news-and-politics/paula-bolyard/2018/10/24/tech-community-outraged-after-sqlite-founder-adopts-christian-code-of-conduct-n61746",
        "https://www.youtube.com/watch?v=S48VzyCwwtk",
        "https://en.wikipedia.org/wiki/Rule_of_Saint_Benedict",
        "https://sqlite.org/docsrc/honeypot"
    ]
}