{
    "title": "Give Day shines bright with $3.4 million raised | UC Davis Giving",
    "body": "\n\n\n\n\n      Skip to main content\n    \n\n\n\n\n\n\n\nCOVID-19 Response Learn More\n\n\n\n\n\n                    menu\n                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            Give Now\n                        \n\n\n\n\nMain navigation\n\n\nWays to Give\n\n\nImpacts of Giving\n\n\nColleges, Schools and Units\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUC Davis Giving\n\n\nImpacts of Giving\n\n\n                        Give Day shines bright with $3.4 million raised\n                    \n\n\n\n\n\n\n\n\n\nGive Day shines bright with $3.4 million raised\n\nBy Bryan Anthony\nShare: \n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe UC Davis community provided glowing support for this year’s Give Day over a sunny Picnic Day weekend. With more than 4,800 online and in-person donations, the 2023 giving event raised nearly $3.4 million dollars. Showing their tremendous dedication and commitment, more than 650 UC Davis employees donated this Give Day.\nSince the first Give Day in 2017, the fundraiser has been held in conjunction with Picnic Day. This year, Development and Alumni Relations employees cruised around campus in a pair of cow-themed-decorated golf carts dubbed “Fund-Grazers” to whip up visibility and boost support for the event. Donations from alumni, friends, faculty and staff, students, business and community partners and others poured in from 44 states and 13 countries.\n“After seven years, Give Day has become an integral part of the Picnic Day experience,” said Shaun Keister, vice chancellor of Development and Alumni Relations, the division responsible for Give Day. “It provides a wonderful opportunity for donors to show their support for UC Davis across the Davis and Sacramento campuses and beyond.” \nUp for the ‘challenge’\nAs in years past, challenge gifts magnified the impact of donation dollars. Each challenge asked for a specified number of contributions of any size to a particular program — and, when the threshold is met, the donor or donors behind the challenge “unlock” a larger gift.  \nGive Day 2023 kicked off with more than 214 challenge gifts worth $2.4 million, a notch lower than the 240 challenge gifts worth $2.8 million in 2022. But after a year of high inflation that heavily impacted day-to-day household costs for families, the money raised was impressive and in line with 2021 totals.\n“Challenge gifts spark a chain of giving, with every donor seeing the powerful impact we have when we all come together and join forces,” Keister said. “This inspiring support emphasizes our greater community’s commitment to UC Davis and their belief that, under Chancellor Gary S. May’s leadership, we are charting a bright and innovative future.”\nBeneficiaries ranged from scholarships, research and emergency funds to innovative experiential learning projects and more, touching every school and college and most units across UC Davis and UC Davis Health.\n\nImage\n \n\nStudents get into the Give Day spirit with Gunrock during Picnic Day. (Korinne Labourdette/UC Davis)College, school champions\nThe “Battle of the Colleges” saw a tight race for most gifts this year, with the College of Engineering coming in first place with 388 gifts — edging out the College of Letters and Science, which came in a respectable second place with 309 gifts. The School of Veterinary Medicine won the “Battle of the Schools” with 451 gifts — topping the School of Law who came in second with 221 gifts. \nAnother Give Day highlight was achieving full funding for the $25,000 prize attached to the Women & Philanthropy Impact Award that will be presented at an award ceremony on Oct. 22. The recipient of the award will direct the prize money to a UC Davis fund of their choice. \nBryan Anthony is a senior writer for the Annual and Special Gifts Program in the Office of Development and Alumni Relations, and can be reached by email or phone, 530-754-0482.\n\n\nShare: \n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAs we look forward, we look to you. Explore the many opportunities to join the UC Davis Campaign.\nGive Today\n\n\n\n\n\n\n\n\nRelated Stories\n\n\n \n\n\n\n\n\n\n\n\n\n\nFood truck offers free meals to students in need\n\n\nRead More\n\n\n  \n\n\n\n\n\n\n\n\n\n\nCan CRISPR cut methane emissions from cow guts?\n\n\nRead More\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy & Copyright ContentPrivacy Notice: We use technologies, such as cookies, to customize content and advertising, to provide social media features, and to analyze traffic to the site. We also share information about your use of our site with our trusted social media, advertising and analytics partners. By using this website, we will assume that you agree to the terms and conditions of our privacy policy.© The Regents of the University of California, Davis campus. All rights reserved.                                        Last Updated: Apr 25, 2023\n                \n\nFooter Menu 1Donor ResourcesFaculty & Staff Stewardship Awards ProgramCampaign VolunteersUC Davis Alumni & Affiliate Relations \n\nFooter Menu 2UC Davis FoundationDiversity, Equity & InclusionContact UsUpdate Your Contact Info \n\nFooter ContentUniversity of California, Davis \nOne Shields Avenue\nDavis, CA 95616-5270Development and Alumni Relations 530-754-4438development@ucdavis.edu \n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://www.ucdavis.edu/",
        "https://www.ucdavis.edu/coronavirus/",
        "/",
        "https://give.ucdavis.edu/Donate/YourGift/341017",
        "/ways-to-give",
        "/impacts-giving",
        "/colleges-schools-units",
        "/",
        "/impacts-giving",
        "https://www.linkedin.com/shareArticle?mini=true&url=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "https://www.facebook.com/sharer/sharer.php?u=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "http://twitter.com/share?text=&url=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "mailto:info@example.com?&subject=&body=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "mailto:baanthony@ucdavis.edu",
        "https://www.linkedin.com/shareArticle?mini=true&url=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "https://www.facebook.com/sharer/sharer.php?u=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "https://twitter.com/home?status=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "mailto:info@example.com?&subject=&body=https://giving.ucdavis.edu/impacts-giving/give-day-shines-bright-34-million-raised",
        "https://give.ucdavis.edu/Area",
        "/impacts-giving/food-truck-offers-free-meals-students-need",
        "/impacts-giving/food-truck-offers-free-meals-students-need",
        "/impacts-giving/food-truck-offers-free-meals-students-need",
        "/impacts-giving/can-crispr-cut-methane-emissions-cow-guts",
        "/impacts-giving/can-crispr-cut-methane-emissions-cow-guts",
        "/impacts-giving/can-crispr-cut-methane-emissions-cow-guts",
        "/",
        "/privacy-policy",
        "/resources",
        "/resources/stewardship-award-program",
        "/resources/volunteers",
        "http://alumni.ucdavis.edu",
        "/foundation",
        "https://diversity.ucdavis.edu/about",
        "/contact",
        "/update-info",
        "mailto:development@ucdavis.edu"
    ]
}