{
    "title": "Introducing the Ollie WordPress block theme – Ollie WordPress Block Theme",
    "body": "\n\n\n\n\n\n\n\n\n\n\nDownload OllieOllie BlogDocs\nContribute\nTwitter\n\n\n\n\n\n\n\n\nBlock Themes\nIntroducing the Ollie WordPress block theme\nMike McAlister\n·\nApril 24, 2023\n\n\nWe are in truly exciting times in the WordPress world, folks. If you’ve been following along on the Ollie blog and my Twitter feed, you’ve seen me sharing all kinds of fun and helpful bits about the WordPress site editor, patterns, blocks, global styles, and more.\nUnless you’re experimenting with this stuff everyday, it can be hard to keep up with it and know the full scope of what’s possible in WordPress with all of these new features. Heck, it’s hard to keep up even if you are experimenting every day. \nIn my experience, one of the best ways of working with all of these new features and learning how they all work together is by building a WordPress block theme. And that’s exactly what I’ve been doing over the past several months. \n\nIntroducing the Ollie block theme\nToday, I’m excited to share with you that the Ollie WordPress block theme is officially ready to download, test, experiment with, build with, reverse engineer, and contribute to! \n\nIn this initial beta release on Github, I’m hoping to gain as much feedback as possible to learn about how people use block themes. These themes introduce several new paradigms for WordPress site building, and there is a lot to be learned about how builders will use these themes and what kind of features really matter. \nAfter this brief beta testing period, the theme will be available for a free download on the official WordPress.orgWordPress.org WordPress.org is the source where you can download the software itself, which you can use to build and maintain a website on your own. repository. In the mean time, let’s take a spin through some of the most powerful features of Ollie.\nLearn more about the Ollie block theme on the Ollie homepage. Check out a live demo of the Ollie block theme and download it via Github.\n\n\nView Ollie Demo\nBrowse Github\nDownload Zip\n\n\nStart building with Ollie and the Site Editor\n\nOne of the most powerful features of the Ollie block theme is that it brings together all of the new WordPress site building features in a cohesive experience. Site editor, global stylesGlobal styles Global styles is a collection of styles and settings that control the overall look and feel of your website. These settings can be adjusted with a user interface in the editor., patternsBlock patterns Block Patterns are a collection of pre-designed blocks that you can insert into pages and posts and then customize with your own content., templatesTemplates Templates are designs for pages and can include one or more template parts., template partsTemplate parts Template parts are used to organize a theme in smaller reusable structural parts. They are commonly used for site headers and site footers. — Ollie supports all of these features, and they’re all beautifully-designed and super easy to edit and customize.\nA stunning pattern collection\nOllie ships with over 50 beautifully-crafted, pixel-perfect patterns. Patterns are pre-designed page elements that can be combined into page sections of full-page layouts. Preview some of these patterns on the Ollie demo.\n\nBuilding with patterns can significantly speed up the time it takes you to build your website. Simply add patterns to a page, edit the content, tweak the dials to your liking, and hit Publish.\nOllie’s patterns are thoughtfully designed with a fluid design system, meaning your website’s typography and spacing will automatically scale down gracefully to fit your visitor’s device.\nFull-page templates, fully-customizable\nBuilding with patterns lets you quickly build out your own pages, but the Ollie block theme also ships with 6 full-page designs for going live even quicker! \n\nPreview the Ollie page designs:\n\n\n\n\nHomepage\n\n\n\nAbout\n\n\n\nFeatures\n\n\n\n\n\nPricing\n\n\n\nDownload\n\n\n\nProfile\n\n\n\n\nWith a few clicks, you can insert a beautiful full page designs for Homepage, About, Features, Pricing, Download, and Profile pages. Between these full page designs and patterns, you can literally create hundreds of pixel-perfect combinations!\nCustomize to your style with Global Styles\nOne of the first things folks want to do when they get their website set up is customize the look and feel to match their branding. This couldn’t be easier with WordPress’s new Global Styles. \n\nWith the Ollie block theme, virtually every element on the page can be customized, and usually with a few clicks. With Global Styles, you can quickly change the site-wide color palette, change the look of individual elements like buttons, headings, links, and more. \nOn top of that, I’ve included seven different color palettes that you can use to change the look and feel of your site in a snap. \nResponsive out of the box\nResponsible websites work on a plethora of devices, and look good while doing it. Ollie is fully-responsive out of the box, and you don’t even have to fiddle with responsive settings.\n\nOllie uses fluid typography and fluid spacing to automatically scale down the design to fit on every device, from desktop to mobile. Responsive design is built into the Ollie design system, the patterns, and the templates. Everything you add to the page is automatically responsive, giving you more time to focus on more important things like content.\nBuilt to perform\nThe Ollie block theme is blazing fast out of the box, scoring top marks across the board in Google’s Pagespeed Insights. Not only is it blazing fast on the front-end, it’s also super speedy in the editor as well, unlike many bloated page builder plugins that slow down your site. \n\nOne of the most powerful performance features is the selective loading of assets. Instead of loading a large stylesheet on every page, Ollie only loads the styles needed on the page. This results in a much smaller page size, far less page requests, and an instantly-loading page, which search engines love. \nA new design for OllieWP.com\n\nRecently, I relaunched OllieWP.com with a new design, powered by the Ollie WordPress block theme. That’s right, I built Ollie with… Ollie! This site was built entirely in the WordPress site editor with blocksBlocks Blocks are content elements that you add to the editor in posts and pages to create content layouts. Each item you add to your post or page is a block., and very little code was touched in the process.\nThe shiny new Ollie homepage showcases the theme’s features, but it also is kind of a marketing page for WordPress itself. The thing is, WordPress has all of these powerful new features, but we’re not really doing a great job of communicating how all of these features work together as a powerful new site building experience.\nTo be fair, it’s a lot to take in, and I have an article in the works about this very topic. But in the mean time, if we want folks to start adopting this new paradigm, we have to shepherd them through this transition not only with great products, but great education and content that showcases practical use cases for building real websites.\nThis is just the beginning\nI built Ollie as a way of learning all of the new WordPress features, and I’m hoping that others can learn from what I’ve built so far. Although this is a very powerful v1, I’ve got lots in store for Ollie, both the free version and pro features further down the road. \nUntil then, stay tuned for more block theme content, tutorials, and more with the Ollie block theme as a central focus. \n\n\nView Ollie Demo\nBrowse Github\nDownload Zip\n\n\n\n\n\n\n\n\nIf you liked this post, you won’t want to miss the next one! Subscribe below and I’ll send it to ya.\n\n\nNo spam, just the good stuff. Unsubscribe anytime. 😎\n\n\n\n\n\n\n13 responses to “Introducing the Ollie WordPress block theme”\n\n\n\nBrin Wilson\nApril 26, 2023\n\nHiya, is there a blog sidebar option? I do hope so! Also: love the look and design of this. Excellent!\n\nReply\n\n\n\n\nMike McAlister\nApril 26, 2023\n\nHey Brin, I don’t have a blog sidebar yet, but that’s a great suggestion! I’ll create a pattern for that for the public release on .org.\n\nReply\n\n\n\n\nBrin Wilson\nApril 27, 2023\n\nExcellent! Also, I’ve just loaded a demo site up to have a play around in the back-end and I can’t see any Header or Footer patternsBlock patterns Block Patterns are a collection of pre-designed blocks that you can insert into pages and posts and then customize with your own content.. Are there different Header and Footer options?\n\nReply\n\n\n\n\nMike McAlister\nApril 27, 2023\n\nYes, there are several! They are tied to the header and footer template partsTemplate parts Template parts are used to organize a theme in smaller reusable structural parts. They are commonly used for site headers and site footers., which makes it easy to swap them out. Unfortunately, it seems they remove the patternsBlock patterns Block Patterns are a collection of pre-designed blocks that you can insert into pages and posts and then customize with your own content. from the inserter — an odd core behavior. Check out this video to see how to pick a new header/footer.\n\nReply\n\n\n\n\nBrin Wilson\nApril 28, 2023\n\nNice. Worked a treat. Thanks.\n\n\n\n\n\n\nMathew\nApril 26, 2023\n\nHi Mike,\nI was a lifetime purchaser of Arraythemes (oh the memories) and have followed your work ever since. Glad to see you contributing your minimal, elegant and ultra-specific design work once again.\nLooking forward to what’s to come – you legend!\n\nReply\n\n\n\n\nMike McAlister\nApril 26, 2023\n\nThanks so much, Mathew! That means so much to me that you were a lifetime customer. 🙌 We’re in a new era of WordPress themes, and I’m excited to bring that same energy to the block theme world. Stay tuned my dude!\n\nReply\n\n\n\n\nNoah\nApril 29, 2023\n\nHi Mike,\nthis is a really beautiful theme!\nIs it in any way possible to design the blog not as a list but in a grid (e.g. 3 rows with 3 posts each)?\nBest regards\n\nReply\n\n\n\n\nMike McAlister\nMay 1, 2023\n\nHey Noah, \nI don’t have a design in the theme for this yet, but I’ll add it to the list!\n\nReply\n\n\n\n\nBrin Wilson\nApril 30, 2023\n\nHi Mike, the default single blog post template seems the same as the wide one. Is there an example of what the wide template should look like? Thanks again, Brin.\n\nReply\n\n\n\n\nBrin Wilson\nApril 30, 2023\n\nDo all three blog posts on the live demo use the same post template?\n\nReply\n\n\n\n\nMike McAlister\nMay 2, 2023\n\nThis post uses the single wide template.\n\nReply\n\n\n\n\nMike McAlister\nMay 2, 2023\n\nHey Brin, \nThe wide one will stretch your featured image wider, past the content. You can’t see this in the editor because the editor view doesn’t show the featured image. Try applying it on a post with a featured image and then check out the post on the front end. \nPS if you ping me on Twitter about these questions, I can probably get you a quicker answer!\n\nReply\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Save my name, email, and website in this browser for the next time I comment.\n \n\nΔ \n\n\n\n\n\n\n\nEasily create beautiful, fully-customizable websites with the new WordPress Site Editor and the Ollie block theme. No coding skills required. Download for free today!\nFollow Ollie\nFollow Mike\n\n\n\n\nOllie Theme\n\nAbout Ollie\nOllie Demo\nDownload\nVisit Github\n\n\n\nResources\n\nOllie Docs\nContribute\nSubmit Issue\nSend Feedback\n\n\n\nLearn\n\nOllie Blog\nTheme Handbook\nVideos\nUpdates\n\n\n\n\n\n\n\n\n© 2023 OllieWP · Built with WordPress\n\nVisit Mike\nPrivacy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://olliewp.com/",
        "https://olliewp.com",
        "https://olliewp.com/blog",
        "https://olliewp.com/docs",
        "https://github.com/OllieWP/ollie",
        "https://twitter.com/buildwithollie",
        "https://olliewp.com/category/block-themes/",
        "https://olliewp.com/blog/",
        "https://twitter.com/mikemcalister",
        "https://olliewp.com/patterns-are-gonna-be-a-game-changer-for-wordpress/",
        "https://olliewp.com/spice-up-your-wordpress-content-with-block-styles/",
        "https://olliewp.com/global-styles-and-the-future-of-css-in-wordpress/",
        "https://github.com/OllieWP/ollie/",
        "https://olliewp.com/",
        "https://demo.olliewp.com",
        "https://github.com/OllieWP/ollie/",
        "https://demo.olliewp.com",
        "https://github.com/OllieWP/ollie/",
        "https://github.com/OllieWP/ollie/releases/latest/download/ollie.zip",
        "https://olliewp.com/patterns-are-gonna-be-a-game-changer-for-wordpress/",
        "https://demo.olliewp.com/patterns/",
        "https://demo.olliewp.com/patterns/",
        "https://demo.olliewp.com/",
        "https://demo.olliewp.com/about/",
        "https://demo.olliewp.com/features/",
        "https://demo.olliewp.com/pricing/",
        "https://demo.olliewp.com/download/",
        "https://demo.olliewp.com/link-page/",
        "https://demo.olliewp.com",
        "https://demo.olliewp.com/about",
        "https://demo.olliewp.com/features",
        "https://demo.olliewp.com/pricing",
        "https://demo.olliewp.com/download",
        "https://demo.olliewp.com/link-page/",
        "https://olliewp.com/global-styles-and-the-future-of-css-in-wordpress/",
        "https://olliewp.com/",
        "https://olliewp.com/",
        "https://demo.olliewp.com",
        "https://github.com/OllieWP/ollie/",
        "https://github.com/OllieWP/ollie/releases/latest/download/ollie.zip",
        "https://winningwp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-90",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=90#respond",
        "https://olliewp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-93",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=93#respond",
        "https://winningwp.com/",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-114",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=114#respond",
        "https://olliewp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-117",
        "https://olliewp.com/wp-content/uploads/2023/04/ollie-replace-header.mp4",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=117#respond",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-125",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-96",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=96#respond",
        "https://olliewp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-97",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=97#respond",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-134",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=134#respond",
        "https://olliewp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-173",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=173#respond",
        "https://winningwp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-149",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=149#respond",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-150",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=150#respond",
        "https://olliewp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-175",
        "https://demo.olliewp.com/adding-block-styles-to-your-wordpress-theme/",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=175#respond",
        "https://olliewp.com",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/#comment-174",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/?replytocom=174#respond",
        "/introducing-the-ollie-wordpress-block-theme/#respond",
        "https://twitter.com/buildwithollie",
        "https://twitter.com/mikemcalister",
        "https://olliewp.com",
        "https://demo.olliewp.com",
        "https://olliewp.com/#download",
        "https://github.com/OllieWP/ollie",
        "https://olliewp.com/docs",
        "https://github.com/OllieWP/ollie",
        "https://github.com/OllieWP/ollie/issues/new/choose",
        "https://github.com/OllieWP/ollie/issues/new/choose",
        "https://olliewp.com/blog",
        "https://developer.wordpress.org/themes/block-themes/",
        "https://learn.wordpress.org/tutorials/",
        "https://twitter.com/buildwithollie",
        "https://mikemcalister.com",
        "https://olliewp.com/privacy-policy"
    ]
}