{
    "title": "Clery – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Clery\n\t\t\t    \n                            CLERY Menu\n                        Show search box.Clery Act OverviewCrimes and GeographyCampus Security Authorities (CSAs)Timely Warnings & Emergency NotificationsAnnual Security & Fire Safety ReportClery Act OverviewCrimes and GeographyCampus Security Authorities (CSAs)Timely Warnings & Emergency NotificationsAnnual Security & Fire Safety Report\n        Our Office\n        Location Icon\n                                                                            Kendall, Room #220\n                                                                530-898-6184clery@csuchico.eduRegular Hours\n                                                                            8 a.m.–5 p.m.\n                                                                \n                                                                                Monday–Friday\n                                                                    Mailing Address\n                                                                            Clery Compliance\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0010\n                                                                    Current page:  CLERY\n                                        \n    \t\tClery Act Overview\n    \tThe Clery Act is a consumer protection law geared toward providing transparency about campus crime statistics and campus safety policies. Among other things, the Clery Act requires all colleges and universities that participate in federal student aid programs to disclose information about specific campus policies, and to publish crime statistics reported to Campus Security Authorities that occur on specific campus geography. We invite you to browse this website to learn more about the Clery Act. You'll learn how Chico State complies with the regulations by ensuring that appropriate safety programs are in place, and that the campus community has access to relevant information to stay safe.Clery Act HistoryIn April of 1986, at Lehigh University in Pennsylvania, a student named Jeanne Clery was raped and murdered in her dorm room. At that time, there was no requirement for universities to publish statistics about campus crime. Jeanne’s parents, Connie and Howard Clery, lobbied Congress to pass legislation that would help provide information to current and prospective members of campus communities to aid them in making informed decisions about their safety. The Clery Act was signed into law in 1990 and has undergone numerous amendments since that time.“The best education in the world is useless if a student doesn't survive with a healthy body and mind.”-Connie and Howard Clery                                                                         Jeanne Clery; photo provided by Clery CenterClery Center CollaborativeChico State partners with the Clery Center to improve our campus safety and compliance with Clery Act regulations. Each year, the Clery Center reviews Chico State’s Annual Security Report (PDF) and provides feedback. Read more about the Clery Center’s mission and collaborative efforts(opens in new window).Quick LinksCSA Reporting FormWellcat Safe PlaceUniversity Police DepartmentDaily Crime LogTitle IX and DHRStudent Conduct, Rights, and ResponsibilitiesCSU Policy (EO 1107)\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "crimes.shtml",
        "csa.shtml",
        "notifications.shtml",
        "annual-security-report.shtml",
        "index.shtml",
        "crimes.shtml",
        "csa.shtml",
        "notifications.shtml",
        "annual-security-report.shtml",
        "tel:530-898-6184",
        "mailto:clery@csuchico.edu",
        "csa.shtml",
        "_assets/documents/annual-security-report.pdf",
        "https://www.clerycenter.org/",
        "https://cm.maxient.com/reportingform.php?CSUChico&layout_id=8",
        "https://www.csuchico.edu/safeplace/index.shtml",
        "https://www.csuchico.edu/up/",
        "https://csucpd.crimegraphics.com/2013/default.aspx",
        "https://www.csuchico.edu/title-ix/",
        "https://www.csuchico.edu/scrr/",
        "https://calstate.policystat.com/policy/12290430/latest/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}