{
    "title": "ActivityPub – WordPress plugin | WordPress.org",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\n\nPlugins\n\n\n\n\nMy Favorites\nBeta Testing\nDevelopers\n\nSearch for:\n\nSearch plugins\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDownload\n\nActivityPub\nBy Matthias Pfefferle & Automattic\n\n\n\n\n\n\n\n\nDetails\nReviews\n\nInstallation\n\nDevelopment\n\n\nSupport\n\n\n\n\n\nDescription\nThis is BETA software, see the FAQ to see the current feature set or rather what is still planned.\nThe plugin implements the ActivityPub protocol for your blog, which means that your readers will be able to follow your blog posts on Mastodon and other federated platforms that support ActivityPub. In addition, replies to your posts on Mastodon and related platforms will automatically become comments on your blog post.\nThe plugin works with the following tested federated platforms, but there may be more that it works with as well:\n\nMastodon\nPleroma\nFriendica\nHubZilla\nPixelfed\nSocialHome\nMisskey\n\nHere’s what that means and what you can expect.\nOnce the ActivityPub plugin is installed, each author’s page on your WordPress blog will become its own federated instance. In other words, if you have two authors, Jane and Bob, on your website, example.com, then your authors would have their own author pages at example.com/author/jane and example.com/author/bob. Each of those author pages would now be available to Mastodon users (and all other federated platform users) as a profile that can be followed. Let’s break that down further. Let’s say you have a friend on Mastodon who tells you to follow them and they give you their profile name @janelivesheresomeofthetime@mastodon.social. You search for her name, see her profile, and click the follow button, right? From then on, everything Jane posts on her profile shows up in your Home feed. Okay, similarly, now that Jane has installed the ActivityPub plugin on her example.com site, her friends can also follow her on Mastodon by searching for @jane@example.com and clicking the Follow button on that profile.\nFrom now on, every blog post Jane publishes on example.com will show up on your Home feed because you follow her @jane@example.com profile.\nOf course, if no one follows your author instance, then no one will ever see the posts – including you! So the easiest way to even know if the plugin is working is to follow your new profile yourself. If you already have a Mastodon profile, just follow your new one from there.\nSome things to note:\n\nMany single-author blogs have chosen to turn off or redirect their author profile pages, usually via an SEO plugin like Yoast or Rank Math. This is usually done to avoid duplicate content with your blog’s home page. If your author page has been deactivated in this way, then ActivityPub won’t work for you. Instead, you can turn your author profile page back on, and then use the option in your SEO plugin to noindex the author page. This will enable the page to be live and ActivityPub will now work, but the live page won’t cause any duplicate content issues with search engines.\nOnce ActivityPub is installed, only new posts going forward will be available in the fediverse. Likewise, even if you’ve been using ActivityPub for a while, anyone who follows your site, will only see new posts you publish from that moment on. They will never see previously-published posts in their Home feed. This process is very similar to subscribing to a newsletter. If you subscribe to a newsletter, you will only receive future emails, but not the old archived ones. With ActivityPub, if someone follows your site, they will only receive new blog posts you publish from then on.\n\nSo what’s the process?\n\nInstall the ActivityPub plugin.\nGo to the plugin’s settings page and adjust the settings to your liking. Click the Save button when ready.\nMake sure your blog’s author profile page is active.\nGo to Mastodon or any other federated platform, search for your author’s new federated profile, and follow it. Your new profile will be in the form of @yourauthorname@yourwebsite.com, so that is what you’ll search for.\nOn your blog, publish a new post.\nFrom Mastodon, check to see if the new post appears in your Home feed.\n\nPlease note that it may take up to 15 minutes or so for the new post to show up in your federated feed. This is because the messages are sent to the federated platforms using a delayed cron. This avoids breaking the publishing process for those cases where users might have lots of followers. So please don’t assume that just because you didn’t see it show up right away that something is broken. Give it some time. In most cases, it will show up within a few minutes, and you’ll know everything is working as expected.\n\nInstallation\nFollow the normal instructions for installing WordPress plugins.\nAutomatic Plugin Installation\nTo add a WordPress Plugin using the built-in plugin installer:\n\nGo to Plugins > Add New.\nType “activitypub” into the Search Plugins box.\nFind the WordPress Plugin you wish to install.\n\nClick Details for more information about the Plugin and instructions you may wish to print or save to help setup the Plugin.\nClick Install Now to install the WordPress Plugin.\n\n\nThe resulting installation screen will list the installation as successful or note any problems during the install.\nIf successful, click Activate Plugin to activate it, or Return to Plugin Installer for further actions.\n\nManual Plugin Installation\nThere are a few cases when manually installing a WordPress Plugin is appropriate.\n\nIf you wish to control the placement and the process of installing a WordPress Plugin.\nIf your server does not permit automatic installation of a WordPress Plugin.\nIf you want to try the latest development version.\n\nInstallation of a WordPress Plugin manually requires FTP familiarity and the awareness that you may put your site at risk if you install a WordPress Plugin incompatible with the current version or from an unreliable source.\nBackup your site completely before proceeding.\nTo install a WordPress Plugin manually:\n\nDownload your WordPress Plugin to your desktop.\n\nDownload from the WordPress directory\nDownload from GitHub\n\n\nIf downloaded as a zip archive, extract the Plugin folder to your desktop.\nWith your FTP program, upload the Plugin folder to the wp-content/plugins folder in your WordPress directory online.\nGo to Plugins screen and find the newly uploaded Plugin in the list.\nClick Activate to activate it.\n\n\nFAQ\n\n\ntl;dr\n\n\nThis plugin connects your WordPress blog to popular social platforms like Mastodon, making your posts more accessible to a wider audience. Once installed, your blog’s author pages can be followed by users on these platforms, allowing them to receive your new posts in their feeds.\nHere’s how it works:\n\nInstall the plugin and adjust settings as needed.\nEnsure your blog’s author profile page is active.\nOn Mastodon or other supported platforms, search for and follow your author’s new profile (e.g., @yourauthorname@yourwebsite.com).\nPublish a new post on your blog and check if it appears in your Mastodon feed.\n\nPlease note that it may take up to 15 minutes for a new post to appear in your feed, as messages are sent on a delay to avoid overwhelming your followers. Be patient and give it some time.\n\n\nWhat is the status of this plugin?\n\n\nImplemented:\n\nprofile pages (JSON representation)\ncustom links\nfunctional inbox/outbox\nfollow (accept follows)\nshare posts\nreceive comments/reactions\n\nTo implement:\n\nsignature verification\nbetter WordPress integration\nbetter configuration possibilities\nthreaded comments support\n\n\n\nWhat is “ActivityPub for WordPress”\n\n\nActivityPub for WordPress extends WordPress with some Fediverse features, but it does not compete with platforms like Friendica or Mastodon. If you want to run a decentralized social network, please use Mastodon or GNU social.\n\n\nWhat if you are running your blog in a subdirectory?\n\n\nIn order for webfinger to work, it must be mapped to the root directory of the URL on which your blog resides.\nApache\nAdd the following to the .htaccess file in the root directory:\nRedirectMatch \"^\\/\\.well-known(.*)$\" \"\\/blog\\/\\.well-known$1\"\n\nWhere ‘blog’ is the path to the subdirectory at which your blog resides.\nNginx\nAdd the following to the site.conf in sites-available:\nlocation ~* /.well-known {\n    allow all;\n    try_files $uri $uri/ /blog/?$args;\n}\n\nWhere ‘blog’ is the path to the subdirectory at which your blog resides.\n\n\n\nReviews\n\n\n\n \n\n\n Why is the default ‘the full content’?\n\n\nPaul Schoe\nApril 29, 2023\n\n\nThis plugin is absolutely fabulous. I had never expected that connecting my WordPress site to the Fediverse would be SO SIMPLE. However, one thing surprised me. In the settings, the default is that it posts your 'full content' of your post to the Fediverse, rather than the more logical 400-character 'excerpt' Mastodon users won't be happy with getting posts of sometimes thousands of characters in their feed.  I therefore suggest making 'excerpt' the default and people can choose 'full content' if they really wish that.\n\n\n\n\n \n\n\n Promises to be a great plugin\n\n\nbymiki\nApril 12, 2023\n\n\nA great feature for wordpress, once they have fixed the bug with webfinger\n\n\n\n\n \n\n\n Great concept and responsive devs\n\n\nshawfactor\nJanuary 19, 2023\n1 reply\n\n\nThe indieweb and fediverse communities are doing great work and need to be acknowledged\n\n\n\nthis plugin works well and the devs are constantly improving it\n\n\n\n\n \n\n\n Brilliant\n\n\nseindal\nJanuary 12, 2023\n\n\nWith this plugin your posts appear automatically on Mastodon.\n\n\n\nReplies on Mastodon becomes comments on your post.\n\n\n\nReally, it couldn't be easier.\n\n\n\n\n \n\n\n Works beautifully\n\n\nshelleyp\nJanuary 1, 2023\n\n\nWas able to subscribe to my WP weblog from Mastodon, post, and then all the replies went back as comments to my weblog post. Just lovely.\n\n\n\n\n \n\n\n The best thing for your site and your web and social media presence.\n\n\nNicole6870\nDecember 15, 2022\n3 replies\n\n\n<p>I am changing my review because not only has the issue of what to do if your blog is in a subdirectory been solved, but the solution is a tiny simple little snippet of code. This is now within reach for the vast majority. Now that it is working, it works like a dream. Anybody who has to manage multiple social media presences should use this, and even if you just have one, this takes a few steps off your to-do list and will save you lots of time. Definitely install this on your site. BTW, this is also good because you really want to nurture your relationship with federated platforms. If you're concerned about both free speech for real and fighting the spread of disinformation, federated platforms are the present and the future.  Support this. Spend on this. Seriously.</p>\n\n\n\n\n\t\t\tRead all 15 reviews\t\t\n\nContributors & Developers\n“ActivityPub” is open source software. The following people have contributed to this plugin.Contributors\n\n\n \n\t\t\t\t\tMatthias Pfefferle\t\t\t\t\n\n\n \n\t\t\t\t\tDjango\t\t\t\t\n\n\n \n\t\t\t\t\tAlex Kirk\t\t\t\t\n\n\n \n\t\t\t\t\tAutomattic\t\t\t\t\n\n\n“ActivityPub” has been translated into 7 locales. Thank you to the translators for their contributions.Translate “ActivityPub” into your language.Interested in development?Browse the code, check out the SVN repository, or subscribe to the development log by RSS.\n\nChangelog\nProject maintained on GitHub at pfefferle/wordpress-activitypub.\n0.17.0\n\nFix type-selector\nAllow more HTML elements in Activity-Objects\n\n0.16.5\n\nReturn empty content/excerpt on password protected posts/pages\n\n0.16.4\n\nRemove scripts later in the queue, to also handle scripts added by blocks\nAdd published date to author profiles\n\n0.16.3\n\n“cc”, “to”, … fields can either be an array or a string\nRemove “style” and “script” HTML elements from content\n\n0.16.2\n\nFix fatal error in outbox\n\n0.16.1\n\nFix “update and create, posts appear blank on Mastodon” issue\n\n0.16.0\n\nAdd “Outgoing Mentions” (#213) props @akirk\nAdd configuration item for number of images to attach (#248) props @mexon\nUse shortcodes instead of custom templates, to setup the Activity Post-Content (#250) props @toolstack\nRemove custom REST Server, because the needed changes are now merged into Core.\nFix hashtags (#261) props @akirk\nChange priorites, to maybe fix the hashtag issue\n\n0.15.0\n\nEnable ActivityPub only for users that can publish_posts\nPersist only public Activities\nFix remote-delete\n\n0.14.3\n\nBetter error handling. props @akirk\n\n0.14.2\n\nFix Critical error when using Friends Plugin and adding new URL to follow. props @akirk\n\n0.14.1\n\nFix “WebFinger not compatible with PHP < 8.0”. props @mexon\n\n0.14.0\n\nFriends support: https://wordpress.org/plugins/friends/ props @akirk\nMassive guidance improvements. props mediaformat & @akirk\nAdd Custom Post Type support to outbox API. props blueset\nBetter hash-tag support. props bocops\nFix user-count (NodeInfo). props mediaformat\n\n0.13.4\n\nfix webfinger for email identifiers\n\n0.13.3\n\nfix: Create and Note should not have the same ActivityPub ID\n\n0.13.2\n\nfix Follow issue AGAIN\n\n0.13.1\n\nfix Inbox issue\n\n0.13.0\n\nadd Autor URL and WebFinger health checks\nfix NodeInfo endpoint\n\n0.12.0\n\nuse “pre_option_require_name_email” filter instead of “check_comment_flood”. props @akirk\nsave only comments/replies\ncheck for an explicit “undo -> follow” action. see https://wordpress.org/support/topic/qs-after-latest/\n\n0.11.2\n\nfix inconsistent %tags% placeholder\n\n0.11.1\n\nfix follow/unfollow actions\n\n0.11.0\n\nadd support for customizable post-content\nfirst try of a delete activity\ndo not require email for AP entries. props @akirk\nfix timezones bug. props @mediaformat\nfix digest header bug. props @mediaformat\n\n0.10.1\n\nfix inbox activities, like follow\nfix debug\n\n0.10.0\n\nadd image alt text to the ActivityStreams attachment property in a format that Mastodon can read. props @BenLubar\nuse the “summary” property for a title as Mastodon does. props @BenLubar\nsupport authorized fetch to avoid having comments from “Anonymous”. props @BenLubar\nadd new post type: “title and link only”. props @bgcarlisle\n\n0.9.1\n\ndisable shared inbox\ndisable delete activity\n\n0.9.0\n\nsome code refactorings\nfix #73\n\n0.8.3\n\nfixed accept header bug\n\n0.8.2\n\nadd all required accept header\nbetter/simpler accept-header handling\nadd debugging mechanism\nAdd setting to enable AP for different (public) Post-Types\nexplicit use of global functions\n\n0.8.1\n\nfixed PHP warnings\n\n0.8.0\n\nMoved followers list to user-menu\n\n0.7.4\n\nadded admin_email to metadata, to be able to “Manage your instance” on https://fediverse.network/manage/\n\n0.7.3\n\nrefactorings\nfixed PHP warnings\nbetter hashtag regex\n\n0.7.2\n\nfixed JSON representation of posts https://merveilles.town/@xuv/101907542498716956\n\n0.7.1\n\nfixed inbox problems with pleroma\n\n0.7.0\n\nfinally fixed pleroma compatibility\nadded “following” endpoint\nsimplified “followers” endpoint\nfixed default value problem\n\n0.6.0\n\nadd tags as hashtags to the end of each activity\nfixed pleroma following issue\nfollowers-list improvements\n\n0.5.1\n\nfixed name-collision that caused an infinite loop\n\n0.5.0\n\ncomplete refactoring\nfixed bug #30: Password-protected posts are federated\nonly send Activites when ActivityPub is enabled for this post-type\n\n0.4.4\n\nshow avatars\n\n0.4.3\n\nfinally fixed backlink in excerpt/summary posts\n\n0.4.2\n\nfixed backlink in excerpt/summary posts (thanks @depone)\n\n0.4.1\n\nfinally fixed contact list\n\n0.4.0\n\nadded settings to enable/disable hashtag support\nfixed follower list\nsend activities only for new posts, otherwise send updates\n\n0.3.2\n\nadded “followers” endpoint\nchange activity content from blog ‘excerpt’ to blog ‘content’\n\n0.3.1\n\nbetter json encoding\n\n0.3.0\n\nbasic hashtag support\ntemporarily deactivated likes and boosts\nadded support for actor objects\nfixed encoding issue\n\n0.2.1\n\ncustomizable backlink (permalink or shorturl)\nshow profile-identifiers also on profile settings\n\n0.2.0\n\nadded option to switch between content and excerpt\nremoved html and duplicate new-lines\n\n0.1.1\n\nfixed “excerpt” in AS JSON\nadded settings for the activity-summary and for the activity-object-type\n\n0.1.0\n\nadded basic WebFinger support\nadded basic NodeInfo support\nfully functional “follow” activity\nsend new posts to your followers\nreceive comments from your followers\n\n0.0.2\n\nrefactoring\nfunctional inbox\nnicer profile views\n\n0.0.1\n\ninitial\n\n\n\n\n\n\nCommunity Plugin\nContribute \nThis plugin is developed and supported by a community.\n\n\nMeta\n\n\n\t\t\t\tVersion: 0.17.0 \n\n\t\t\t\tLast updated: 1 month ago \n\n\t\t\t\tActive installations: 3,000+ \n\n\t\t\t\t\tWordPress Version:\t\t\t\t\t\n\t\t\t\t\t\t4.7 or higher\t\t\t\t\t\n\n\n\t\t\t\t\tTested up to: 6.1.1 \n\n\t\t\t\t\tPHP Version:\t\t\t\t\t\n\t\t\t\t\t\t5.6 or higher\t\t\t\t\t\n\n\n\t\t\t\t\tLanguages: \n\t\t\t\t\t\t\tSee all 8\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\tClose\t\t\t\t\t\t\t\n\nCatalan, Czech, Dutch, English (US), Frisian, German, Greek, and Spanish (Spain).\n\nTranslate into your language \n\n\n \nTags: activitypubfediverseostatus\n\nAdvanced View \n\nRatings See all\n\n \n\n\n\n5 stars\n\n\n\n14\n\n\n\n\n4 stars\n\n\n\n1\n\n\n\n\n3 stars\n\n\n\n0\n\n\n\n\n2 stars\n\n\n\n0\n\n\n\n\n1 star\n\n\n\n0\n\n\n\n\nLog in to submit a review.\n\nContributors\n\n\n \n\t\t\t\t\tMatthias Pfefferle\t\t\t\t\n\n\n \n\t\t\t\t\tDjango\t\t\t\t\n\n\n \n\t\t\t\t\tAlex Kirk\t\t\t\t\n\n\n \n\t\t\t\t\tAutomattic\t\t\t\t\n\n\nSupport Issues resolved in last two months:\n\n\n\n\n\n\t\t\t\t\t4 out of 20\t\t\t\t\n\n\nView support forum\n\n \n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fwordpress.org%2Fplugins%2Factivitypub%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/plugins/browse/favorites/",
        "https://wordpress.org/plugins/browse/beta/",
        "https://wordpress.org/plugins/developers/",
        "https://downloads.wordpress.org/plugin/activitypub.0.17.0.zip",
        "https://automattic.com/",
        "https://wordpress.org/plugins/activitypub/#description",
        "https://wordpress.org/plugins/activitypub/#reviews",
        "https://wordpress.org/plugins/activitypub/#installation",
        "https://wordpress.org/plugins/activitypub/#developers",
        "https://wordpress.org/support/plugin/activitypub/",
        "https://joinmastodon.org/",
        "https://pleroma.social/",
        "https://friendi.ca/",
        "https://hubzilla.org/",
        "https://pixelfed.org/",
        "https://socialhome.network/",
        "https://join.misskey.page/",
        "https://wordpress.org/support/article/managing-plugins/",
        "https://codex.wordpress.org/Administration_Screens#Add_New_Plugins",
        "https://codex.wordpress.org/Administration_Screens#Plugins",
        "https://codex.wordpress.org/Plugins_Add_New_Screen",
        "https://github.com/pfefferle/wordpress-activitypub",
        "https://wordpress.org/plugins/activitypub/",
        "https://github.com/pfefferle/wordpress-activitypub/releases",
        "https://codex.wordpress.org/Administration_Screens#Plugins",
        "https://joinmastodon.org/",
        "https://gnusocial.network/",
        "https://wordpress.org/support/topic/why-is-the-default-the-full-content/",
        "https://profiles.wordpress.org/paulschoe/",
        "https://wordpress.org/support/topic/promises-to-be-a-great-plugin/",
        "https://profiles.wordpress.org/bymiki/",
        "https://wordpress.org/support/topic/great-concept-and-responsive-devs/",
        "https://profiles.wordpress.org/shawfactor/",
        "https://wordpress.org/support/topic/brilliant-1551/",
        "https://profiles.wordpress.org/seindal/",
        "https://wordpress.org/support/topic/works-beautifully-175/",
        "https://profiles.wordpress.org/shelleyp/",
        "https://wordpress.org/support/topic/out-of-reach-for-the-vast-majority/",
        "https://profiles.wordpress.org/nicole6870/",
        "https://wordpress.org/support/plugin/activitypub/reviews/",
        "https://profiles.wordpress.org/pfefferle/",
        "https://profiles.wordpress.org/mediaformat/",
        "https://profiles.wordpress.org/akirk/",
        "https://profiles.wordpress.org/automattic/",
        "https://translate.wordpress.org/projects/wp-plugins/activitypub/contributors",
        "https://translate.wordpress.org/projects/wp-plugins/activitypub",
        "https://plugins.trac.wordpress.org/browser/activitypub/",
        "https://plugins.svn.wordpress.org/activitypub/",
        "https://plugins.trac.wordpress.org/log/activitypub/",
        "https://plugins.trac.wordpress.org/log/activitypub/?limit=100&mode=stop_on_copy&format=rss",
        "https://github.com/pfefferle/wordpress-activitypub",
        "https://github.com/pfefferle/wordpress-activitypub/pull/213",
        "https://github.com/akirk",
        "https://github.com/pfefferle/wordpress-activitypub/pull/248",
        "https://github.com/mexon",
        "https://github.com/pfefferle/wordpress-activitypub/pull/250",
        "https://github.com/toolstack",
        "https://github.com/pfefferle/wordpress-activitypub/pull/261",
        "https://github.com/akirk",
        "https://github.com/akirk",
        "https://github.com/akirk",
        "https://github.com/mexon",
        "https://github.com/akirk",
        "https://github.com/mediaformat",
        "https://github.com/akirk",
        "https://github.com/blueset",
        "https://github.com/bocops",
        "https://github.com/mediaformat",
        "https://github.com/akirk",
        "https://github.com/akirk",
        "https://github.com/pfefferle/wordpress-activitypub/issues/63",
        "https://github.com/mediaformat",
        "https://github.com/pfefferle/wordpress-activitypub/issues/104",
        "https://github.com/mediaformat",
        "https://github.com/BenLubar",
        "https://github.com/BenLubar",
        "https://github.com/BenLubar",
        "https://github.com/bgcarlisle",
        "https://github.com/pfefferle/wordpress-activitypub",
        "https://ca.wordpress.org/plugins/activitypub/",
        "https://cs.wordpress.org/plugins/activitypub/",
        "https://nl.wordpress.org/plugins/activitypub/",
        "https://wordpress.org/plugins/activitypub/",
        "https://fy.wordpress.org/plugins/activitypub/",
        "https://de.wordpress.org/plugins/activitypub/",
        "https://el.wordpress.org/plugins/activitypub/",
        "https://es.wordpress.org/plugins/activitypub/",
        "https://translate.wordpress.org/projects/wp-plugins/activitypub",
        "https://wordpress.org/plugins/tags/activitypub/",
        "https://wordpress.org/plugins/tags/fediverse/",
        "https://wordpress.org/plugins/tags/ostatus/",
        "https://wordpress.org/plugins/activitypub/advanced/",
        "https://wordpress.org/support/plugin/activitypub/reviews/",
        "https://wordpress.org/support/plugin/activitypub/reviews/?filter=5",
        "https://wordpress.org/support/plugin/activitypub/reviews/?filter=4",
        "https://wordpress.org/support/plugin/activitypub/reviews/?filter=3",
        "https://wordpress.org/support/plugin/activitypub/reviews/?filter=2",
        "https://wordpress.org/support/plugin/activitypub/reviews/?filter=1",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fwordpress.org%2Fsupport%2Fplugin%2Factivitypub%2Freviews%2F%23new-post&locale=en_US",
        "https://profiles.wordpress.org/pfefferle/",
        "https://profiles.wordpress.org/mediaformat/",
        "https://profiles.wordpress.org/akirk/",
        "https://profiles.wordpress.org/automattic/",
        "https://wordpress.org/support/plugin/activitypub/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}