{
    "title": "Panic over ChatGPT cheating ebbs as teachers start to see potential",
    "body": "\n\n\n\n\n \nSkip to main content\nTurn off refresh\n\n\n \n\nCurrently Reading\nChatGPT is giving students new ways to cheat. Here’s why some teachers aren’t panicking\n\n\n\n\nSubscribe\nSubscribe\n\ne-Edition\n\n\n\nSign In\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClimateDroughtFire TrackerQuake TrackerDrought MapAir Quality TrackerWildfiresWeatherWeather ForecastVideo & VisualsReader ToolsAudio ToursPlace an obituarySubscribeAbout UsNewsroom NewsChronicle StoreSeason of SharingTerms of UsePrivacy NoticeYour Privacy ChoicesAdvertise With UsBay AreaDataHousing CrisisPG&ETransitSF Homeless ProjectCOVID-19 MapGolden Gate ParkSan FranciscoCOVID-19CrimeHealthSportsGiantsWarriors49ersA'sSharksHigh SchoolCollegePoliticsTechUS & WorldCaliforniaOpinionsFoodTop WineriesTop RestaurantsRestaurantsWine, Beer & SpiritsTravelOutdoorsTahoeVault: Our S.F.Portals of the PastPodcastsThe DoodlerChronicledExtra SpicyFifth & MissionTotal SFFixing Our CityIt's All PoliticalObituariesIn-DepthReal EstateFind a HomeDatebookMovies & TVMusicTheaterArt & ExhibitsDanceClassicalBooksFestivalsPuzzlesComicsMembershipNewslettersAbout MembershipExclusive offersJoin Nowe-editionAppManage my account\n\n  \n \n\n\n\n\n\n\n\n\n\n\nMost Popular\n \n\n\n\n\n\n\n\n\n\nExclusive: One of S.F.’s biggest companies is vacating its huge downtown...\n \n\n\n\n\n\n\n\n\n\nBay Area housing project on the rocks after developer calls residents...\n \n\n\n\n\n\n\n\n\n\nTwo more S.F. tech companies have mass layoffs; one blames rise of AI\n \n\n\n\n\n\n\n\n\n\nUC admissions: What are the odds of getting off the wait list at UCLA,...\n \n\n\n\n\n\n\n\n\n\nAbrupt closure of S.F. wine startup leaves customers with thousands of...\n \n\n\n\n\n\n\n\n\n\nJordan Poole’s blooper-filled Game 6 gives Warriors reason to worry\n \n\n\n\n\n\n\n\n\n\n‘Very challenging at Stanford’: Transfers force Tara VanDerveer to adjust\n \n\n\n\n\n\n\n\n\n\nHow safe do you feel in S.F.? In wake of high-profile crimes, here’s...\n \n\n\n\n\n\n\n\n\n\nMissed the northern lights in California? They'll likely be back — here...\n \n\n\n\n\n\n\n\n\n\nMap shows major retail closures that hollowed out downtown S.F.\n \n\n\n\n\n\n\n\n\n\nWarriors face a dynastic threat from Kings in a Game 7 showdown\n \n\n\n\n\n\n\n\n\n  \nBay AreaChatGPT is giving students new ways to cheat. Here’s why some teachers aren’t panickingJill TuckerApril 23, 2023\n\nFacebook\nTwitter\nEmail\n\nComments\n\n\n\n\n \n\nAisling Prange, head of Academic Honesty at Roosevelt Middle School in San Francisco, teaches her seventh-grade English class.Lea Suzuki/The Chronicle\n\nWhen ChatGPT launched for free five months ago, the primary response among educators  — including in the Bay Area — was panic. \nThe online program can write long-form essays in a matter of seconds or solve algebraic equations step-by-step and create outlines, among other capabilities that led to instant anxiety among educators across the country when the free chatbot launched publicly in November.\n \nAs predicted, examples of cheating using ChatGPT popped up almost immediately in the Bay Area and elsewhere. At San Francisco’s academically competitive Lowell High School, an informal poll by the student newspaper found that 19% of students included in the survey appeared to be using the program to cut corners, saying they used “AI-powered writing software to complete classwork, essays, or tests.”\nBut in a relatively short period of time the panic started to ebb as teachers acknowledged that cheating is not new. Students have long conned their way to good grades — from crib notes scribbled on an arm to copying from the encyclopedia to texting test questions to friends and plagiarizing from the internet.\nAnd so now there’s a new way to cheat.\nBut with five months of exposure to the new technology, educators say ChatGPT and similar technologies have the potential to enrich and enliven teaching and learning rather than gut them. While educators remain on the lookout for ChatGPT cheaters, the opportunities in this technology are thrilling, they said.\n“This is a moment that’s going to go down in history,” said Old Dominion University educational technology Professor Helen Crompton, an expert in the field for more than 25 years. “This is a fantastic educational opportunity. We need to grab hold of it and be excited.”\n\nCrompton argues that not only does AI and ChatGPT offer opportunities to make teaching and learning more interesting and interactive, but it can also expose deficiencies in outdated forms of education. For example, some teachers overrely on essays about the same topics year after year, like the five-paragraph argumentative essay.  \nInstead of having students write that stereotypical essay, which ChatGPT could do in seconds about virtually any subject, the student could prompt the program to debate the topic, turning in the back-and-forth result to their teacher, demonstrating knowledge of the subject and the ability to present an argument.\nOr the teacher could prompt ChatGPT to write the argumentative essay and then have students critique it, improving on the technology’s version, which incorporates a massive amount of information and spits out a stereotypical and mediocre response that lacks voice, creativity and other aspects of individualistic thinking.\n\n\nEnglish teacher Aisling Prange, head of Academic Honesty at Roosevelt Middle School,  is fired up about the possibilities ChatGPT brings to her classroom.Lea Suzuki/The Chronicle\n\n“Students get burned out and tired of doing the same old stuff,” Crompton said. “They want to do something exciting.”\nAisling Prange, the English department head at Roosevelt Middle School in San Francisco, is fired up about the possibilities ChatGPT brings to her classroom.\n“It’s incredible technology so how can we use it?” Prange asked. \nIt seems there’s a place for it in project-based learning, she added, with students using the chatbots to come up with ideas or help write outlines or offer summaries of research. \nThat means, however, that class assignments need to incorporate what a chatbot can do, but also require using the human brain’s ability to reason and critique, something a machine can’t do.\n\n“I think it’s a big shift for educators who are more traditional,” she said, referring to the “read the book, write the essay” approach. \n“It’s not about learning the formulas anymore and applying them to the world,” she said. “I want students to feel proud of their own ideas and the way they’re expressing themselves.”\nWhile she hopes to incorporate ChatGPT into assignments in the future, Prange continues to worry about cheating using AI products or other methods. Noticing a rise in cheating this year, she and her school’s administrators sent a letter home advising parents and guardians that they were seeing plagiarism as well as use of ChatGPT, QuillBot, and other online AI programs in language arts classrooms.\nShe hopes parents will talk to their kids about the cons of cheating, something reinforced in her classes and schoolwide.\nRoosevelt’s principal, Emily Leicham, agreed, saying that while the way to cheat has changed, the need to educate students on why it’s a bad idea is a constant. \n“When you’re an educator you see all the tricks,” she said. “Being honest, that’s something we really really push with our kids now.”\nWhile Leichem and her staff are focused on teaching academic honesty to mitigate the possibility of cheating with ChatGPT, two big school districts — in Los Angeles and New York City — were among those that blocked access to the AI technology in an attempt to prevent it. Some colleges, where educators were equally concerned, tried the same approach.\n\nBut some experts think trying to make it go away won’t work. Furman University philosophy professor Darren Hudson Hick, one of the first in the country to catch a ChatGPT cheat, equated that tactic with the futile effort to ban the internet from classrooms 30 years ago, for fear students would plagiarize information or access inappropriate material.\n“This is 1993 all over again,” he said, referring to the fear around new technology. “What does AI mean for education a year from now, five years from now? Who knows.”\nHick was among the first educators in the country to catch a ChatGPT cheat in mid-December, about three weeks after the technology hit the internet. The South Carolina professor, like all K-12 and college educators across the country, didn’t have technology to combat the problem yet, just years of experience.\nOne student turned in her essay on philosopher David Hume and the paradox of horror, which was well written, he said, but made little sense. When he confronted her, the student subsequently admitted to using ChatGPT. Since then, Hick keeps an eye out for AI in student work. He warns his students about his policy on it, which helps deter cheating.\n“If I have a whiff of artificial intelligence on anything turned in, I have the option of tossing it out and on the spot giving an oral exam,” he said.\nIn recent months, educators have turned to technology to help identify AI-written work, using a variety of programs like TurnItIn or other screening tools to look for the footprint of artificial intelligence, including tone, word usage and other aspects to determine whether it is likely AI generated or not.\n \nBut those tools aren’t always accurate, and students are already finding ways to beat the AI detectors, including misspelling words, inserting typos and rewriting a handful of sentences.\nThe best defense against the technology is perhaps offense, educators say.\nAt Stanford University, Sarah Levine, assistant professor in the Graduate School of Education, said she’s seeing more excitement and optimism from her students, many of whom are K-12 teachers working on an advanced degree.\n“I’m hearing teachers are using it more and are getting excited about it,” she said, citing one teacher who used it to generate five college application essays about the same topic, but with different tone or style, helping students pay more attention to those elements in their writing.\nLevine said her students are finding that AI generated material is “mushy, vanilla or generic.”\nThat said, it has great potential to help students learn in K-12 classrooms, although it’s still a bit unclear how to use it ethically and effectively.\n“I’m really trying to figure it out myself,” she said. “It’s really pushing all of us to rethink why we teach what we teach.”\nSan Francisco seventh-grader Zoie Hon thinks so too. She remembers when she first heard about the artificial intelligence program ChatGPT, which can generate human-like responses to questions or prompts.\n“I thought it was really cool that robots could behave like humans could,” she said. But what if, she pondered, this was the precursor to AI taking over the world, a la the Terminator, even though ChatGPT denies such an apocalyptic scenario, writing in a response to the idea that AI “doesn’t have the capacity to take over the world on its own.” \nIt can also help students cheat, the Roosevelt Middle School student acknowledged, but besides that and the possibility of machine-based world domination, she thinks ChatGPT is “pretty cool,” given that it was able to write a funny limerick summing up her conversation with it as part of a class writing assignment on the potential dangers of artificial intelligence.\nHer teachers were impressed with her research, as well as the machine-generated poem that summed up Zoie’s conversation with the program. \nBut the seventh-grader acknowledged she’s still wary of AI.\n“I think it probably excites me more than it scares me,” she said, but “I think it really depends on who’s using it and for what purpose.”\nReach Jill Tucker: jtucker@sfchronicle.com Twitter: @jilltucker\n \n\n\n\n\n\n\n\n\nFifth & Mission\n\n\n\n\nThe Chronicle’s flagship news podcast. Listen and subscribe on your favorite app. Click the player below for the latest episode.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWritten By  Jill Tucker\n\n\nReach Jill on\n  \nJill Tucker has covered education in California for 22 years, writing stories that range from issues facing Bay Area school districts to broader national policy debates. Her work has generated changes to state law and spurred political and community action to address local needs.\n\nShe is a frequent guest on KQED’s “Newroom\" television show and \"Forum\" radio show. A Bay Area native, Jill earned a master’s degree in journalism at the University of Colorado, Boulder and a bachelor’s degree from the UC Santa Barbara. In between, she spent two years as a Peace Corps volunteer teaching English in Cape Verde, West Africa.\n \nView Comments\n\n\n\n\n\n\n\nTop of the News\n\n\n\n\nRegulators rush to sell S.F.’s First Republic Bank amid fears of collapseThe Federal Deposit Insurance Corp. is in confidential talks with banks to acquire the troubled institution, and final bids are due Sunday, according to published reports. By Elena Kadvany\nStanford preschool teacher held on suspicion of murderBy Elena Kadvany\nS.F. has one of most spectacular sites in the world. It’s often overlookedBy Carl Nolte\nHousing project on the rocks after developer calls residents ‘communists’By J.K. Dineen\nDynasty on the ropes? Warriors predictions, analysis ahead of Game 7By Sporting Green Staff\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n\n\n\nReturn to Top\n\n\n\n\n\n\nAbout\n\nOur Company\nTerms of Use\nPrivacy Notice\nCA Notice at Collection\nYour CA Privacy Rights (Shine the Light)\nDAA Industry Opt Out\nCareers\nAdvertising\n\n\n\nNewsroom\n\nEthics Policy\nEndorsement Process\nNews Tips\nNewsroom News\n\n\n\nContact\n\nCustomer Service\nFAQ\nNewsroom Contacts\n\n\n\nServices\n\nSubscriber Services\ne-Edition\nReprints & Permissions\nCorporate Subscriptions\nApp\nArchives\nMembership\nPlace an Obituary\nStore\nSubscription Offers\nsfgate.com\n\n\n\nYour Privacy Choices (Opt Out of Sale/Targeted Ads)\n\n\n \n\n\n\n\n©2023 Hearst Communications, Inc.\n\n\n\n\n\n\n\n\n ",
    "links": [
        "#content",
        "#",
        "/",
        "https://subscription.sfchronicle.com/checkout/1223/2586?siteID=SFC&origin=button&ipid=wcm",
        "https://subscription.sfchronicle.com/checkout/1223/2586?siteID=SFC&origin=button&ipid=wcm",
        "/e-edition",
        "https://www.sfchronicle.com/climate/",
        "https://www.sfchronicle.com/drought/",
        "https://www.sfchronicle.com/projects/california-fire-map/",
        "https://www.sfchronicle.com/projects/earthquakes/",
        "https://www.sfchronicle.com/projects/drought-map-water-restrictions-bay-area/",
        "https://www.sfchronicle.com/projects/california-air-quality-map/",
        "https://www.sfchronicle.com/california-wildfires/",
        "https://www.sfchronicle.com/weather/",
        "https://www.sfchronicle.com/weather-forecast/",
        "/video-visuals/",
        "/reader-tools/",
        "https://tickets.sfchronicle.com/e/audio-tours",
        "https://ezads.sfchron.com/sf-adportal/obits/",
        "https://subscription.sfchronicle.com/checkout/1223/2586?siteID=SFC&origin=hamburger",
        "https://www.hearst.com/newspapers/san-francisco-chronicle",
        "/about/newsroomnews/",
        "https://sfchronicle.myshopify.com/",
        "https://blog.sfchronicle.com/storystudio/season-of-sharing/",
        "https://www.sfchronicle.com/terms_of_use/",
        "https://www.sfchronicle.com/privacy_policy/",
        "/mydata/",
        "https://marketing.sfgate.com/advertise-with-us-today?utm_source=sfchronicle",
        "/bayarea/",
        "/data/",
        "https://www.sfchronicle.com/bayareahousingcrisis/",
        "https://www.sfchronicle.com/pge/",
        "https://www.sfchronicle.com/transit/",
        "https://projects.sfchronicle.com/sf-homeless/landing/",
        "https://www.sfchronicle.com/projects/coronavirus-map/",
        "https://www.sfchronicle.com/goldengatepark/",
        "/sf/",
        "https://www.sfchronicle.com/coronavirus/",
        "/crime/",
        "/health/",
        "/sports/",
        "/sports/giants/",
        "/sports/warriors/",
        "/sports/49ers/",
        "/sports/athletics/",
        "/sports/sharks/",
        "/sports/high-school/",
        "/sports/college/",
        "https://www.sfchronicle.com/politics/",
        "/tech/",
        "/us-world/",
        "/california/",
        "/opinion/",
        "/food/",
        "https://www.sfchronicle.com/projects/best-wineries-napa-sonoma-bay-area-wine-country/",
        "https://www.sfchronicle.com/projects/best-sf-restaurants-bay-area/",
        "/food/restaurants/",
        "https://www.sfchronicle.com/food/wine/",
        "/culture/travel/",
        "https://www.sfchronicle.com/outdoors/",
        "https://www.sfchronicle.com/tahoe/",
        "https://www.sfchronicle.com/oursf/",
        "https://www.sfchronicle.com/vault/portalsofthepast/",
        "https://www.sfchronicle.com/projects/podcasts/",
        "https://www.sfchronicle.com/projects/podcasts/the-doodler/",
        "https://www.sfchronicle.com/projects/podcasts/chronicled/kamala-harris/",
        "/projects/podcasts/extra-spicy",
        "/projects/podcasts/fifth-and-mission",
        "/projects/podcasts/total-sf",
        "https://www.sfchronicle.com/projects/podcasts/fixing-our-city/",
        "/projects/podcasts/its-all-political",
        "http://www.legacy.com/obituaries/sfgate/",
        "/in-depth-projects/2022/",
        "/realestate/",
        "https://www.sfchronicle.com/projects/sf-bay-area-housing-where-to-live/",
        "https://datebook.sfchronicle.com/",
        "https://datebook.sfchronicle.com/category/movies-tv",
        "https://datebook.sfchronicle.com/category/music",
        "https://datebook.sfchronicle.com/category/theater",
        "https://datebook.sfchronicle.com/category/art-exhibits",
        "https://datebook.sfchronicle.com/category/dance",
        "https://datebook.sfchronicle.com/category/classical",
        "https://datebook.sfchronicle.com/category/books",
        "https://datebook.sfchronicle.com/category/festivals",
        "/puzzles/",
        "https://www.sfchronicle.com/comics/",
        "/membership/",
        "http://link.sfchronicle.com/join/signup",
        "/membership/faq/",
        "/membership/#offers",
        "https://subscription.sfchronicle.com/checkout/1223/2586?siteID=SFC&origin=hamburger&ipid=wcm&variant=joinnow",
        "/e-edition/",
        "/mobile-apps/",
        "/account",
        "/sf/article/company-vacating-huge-downtown-s-f-headquarters-17925460.php",
        "/sf/article/company-vacating-huge-downtown-s-f-headquarters-17925460.php",
        "/bayarea/article/marin-city-housing-project-17915786.php",
        "/bayarea/article/marin-city-housing-project-17915786.php",
        "/tech/article/two-s-f-tech-companies-mass-layoffs-17923693.php",
        "/tech/article/two-s-f-tech-companies-mass-layoffs-17923693.php",
        "/california/article/uc-admission-waitlist-data-17908732.php",
        "/california/article/uc-admission-waitlist-data-17908732.php",
        "/food/wine/article/underground-cellar-wine-17925327.php",
        "/food/wine/article/underground-cellar-wine-17925327.php",
        "/sports/warriors/article/jordan-poole-s-blooper-filled-game-6-gives-17926005.php",
        "/sports/warriors/article/jordan-poole-s-blooper-filled-game-6-gives-17926005.php",
        "/sports/college/article/stanford-s-tara-vanderveer-reveals-adjustments-17926183.php",
        "/sports/college/article/stanford-s-tara-vanderveer-reveals-adjustments-17926183.php",
        "/bayarea/article/sf-public-safety-survey-17904901.php",
        "/bayarea/article/sf-public-safety-survey-17904901.php",
        "/california/article/missed-northern-lights-opportunities-17923763.php",
        "/california/article/missed-northern-lights-opportunities-17923763.php",
        "/sf/article/san-francisco-retail-closures-17923551.php",
        "/sf/article/san-francisco-retail-closures-17923551.php",
        "/sports/annkillion/article/warriors-face-dynastic-threat-kings-game-7-17925913.php",
        "/sports/annkillion/article/warriors-face-dynastic-threat-kings-game-7-17925913.php",
        "https://www.sfchronicle.com/bayarea/",
        "https://www.sfchronicle.com/author/jill-tucker/",
        "https://www.sfchronicle.com/author/jill-tucker/",
        "https://www.sfchronicle.com/bayarea/articleComments/panic-chatgpt-cheating-ebbs-teachers-start-see-17867032.php",
        "https://thelowell.org/13027/features/a-new-way-to-cheat/",
        "mailto:jtucker@sfchronicle.com",
        "https://www.sfchronicle.com/projects/podcasts/fifth-and-mission/",
        "https://podfollow.com/fifth/view",
        "https://www.sfchronicle.com/author/jill-tucker/",
        "https://www.sfchronicle.com/author/jill-tucker/",
        "https://www.facebook.com/SFChronicle/",
        "https://twitter.com/jilltucker",
        "/bayarea/article/first-republic-bank-17994980.php",
        "/bayarea/article/first-republic-bank-17994980.php",
        "/crime/article/stanford-preschool-murder-arrest-17971967.php",
        "/crime/article/stanford-preschool-murder-arrest-17971967.php",
        "/bayarea/nativeson/article/spectacular-s-f-site-often-overshadowed-17916213.php",
        "/bayarea/nativeson/article/spectacular-s-f-site-often-overshadowed-17916213.php",
        "/bayarea/article/marin-city-housing-project-17915786.php",
        "/bayarea/article/marin-city-housing-project-17915786.php",
        "/sports/warriors/article/warriors-vs-kings-dynasty-ropes-game-7-17926467.php",
        "/sports/warriors/article/warriors-vs-kings-dynasty-ropes-game-7-17926467.php",
        "/",
        "https://www.facebook.com/SFChronicle/",
        "https://twitter.com/sfchronicle",
        "https://www.instagram.com/sfchronicle/",
        "https://www.linkedin.com/company/sfchronicle",
        "#content",
        "http://www.hearst.com/newspapers/san-francisco-chronicle",
        "https://www.sfchronicle.com/terms_of_use/",
        "https://www.sfchronicle.com/privacy_policy",
        "https://www.sfchronicle.com/privacy_policy/#caprivacyrights",
        "https://www.sfchronicle.com/privacy_policy/#shinethelight",
        "https://www.sfchronicle.com/privacy_policy/#daaoptout",
        "https://eevd.fa.us6.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_11007",
        "https://marketing.sfgate.com/advertise-with-us-today",
        "https://www.sfchronicle.com/file/759/0/7590-7528-Hearst_Newspaper_Group_Standards_and_Ethics_Policy.pdf",
        "https://www.sfchronicle.com/opinion/article/How-The-Chronicle-s-endorsement-process-works-14499467.php",
        "https://newstips.sfchronicle.com/",
        "https://www.sfchronicle.com/about/newsroomnews/",
        "https://www.sfchronicle.com/customer_service",
        "https://www.sfchronicle.com/faq",
        "https://www.sfchronicle.com/newsroom_contacts",
        "https://subscription.sfchronicle.com/",
        "https://www.sfchronicle.com/e-edition",
        "https://www.parsintl.com/publication/sfchronicle/",
        "https://www.sfchronicle.com/corporatesubscriptions/",
        "https://www.sfchronicle.com/mobile-apps/",
        "https://www.sfchronicle.com/archive/search/subscriber/",
        "https://www.sfchronicle.com/membership",
        "https://ezads.sfchron.com/sf-adportal/obits/",
        "https://sfchronicle.myshopify.com/",
        "https://subscription.sfchronicle.com/checkout/1223/2586?siteID=SFC&origin=footer",
        "https://www.sfgate.com/",
        "https://www.sfchronicle.com/mydata/"
    ]
}