{
    "title": "Nurturing nurse executives | UCI News | UCI",
    "body": "\n\n\n\n\n\nSkip to main content\n\n\n\n\n\n\n\n\n\nToggle primary navigation\n\n\n\n\nUCI homepage\n\nArts & HumanitiesToggle dropdown: Arts & Humanities\n\nArts\nHumanities\n\n\nAthletics\nCampus LifeToggle dropdown: Campus Life\n\nAdministration\nStudents\n\n\nHealthToggle dropdown: Health\n\nHospital\nPublic Health\nNursing\nSchool of Medicine\nPharmaceutical Science\n\n\nScience & TechToggle dropdown: Science & Tech\n\nEnvironment/Energy\n\n\nSociety & CommunityToggle dropdown: Society & Community\n\nEducation\n\n\n \n\n\n\n\n\n\n \n\n\n\nSearch\n\n\nWeb\nPeople\n\n\n\n\n\n\n\n\n\n\n\n\n\nNurturing nurse executives\nTo help fill a leadership gap, The Paul Merage School of Business is launching an online certificate program for chief nursing officers\n\n                \n\tby Pat Harriman, UCI | \n\n                April 10, 2023            \n\n Maritza Salazar Campo, UCI assistant professor of organization and management in The Paul Merage School of Business, and Patrick Patton, system chief nurse executive at UC San Francisco Medical Center, led the effort to develop the curriculum for UCI’s chief nursing officer certificate program, which provides clinical leaders with the skills they need for an executive healthcare career.\n\nThe Paul Merage School of Business / UCI; courtesy of Pat Patton\n\n\nThe COVID-19 pandemic put extreme stress on society, healthcare and nursing, with repercussions that will be felt for decades. Many nurses took early retirement, and others exited the profession altogether, leaving numerous institutions facing personnel challenges and succession issues, resulting in a shortage of executive leadership.\nIn response, UCI’s Paul Merage School of Business will launch an online chief nursing officer certificate program on June 14, in partnership with Emeritus, a prominent educational platform designed to prepare individuals for executive roles.\n“The focus of the program is to give people who have engaged in clinical leadership the means to develop the skill set to become the next generation of executives in healthcare,” says Maritza Salazar Campo, assistant professor of organization and management in the business school.\nShe worked closely with UCI alumnus Pat Patton, system chief nurse executive at UC San Francisco Medical Center, who served as UCI chief nursing officer from 2016 to 2020, to develop the program.\n“This is exactly what nurse leaders need,” Patton says.\nHere, they provide insights into what makes the UCI program unique, why it’s important, how it benefits graduates and its impact on patient care.\nHow has the program responded to the challenges brought about by COVID-19?\nMSC: We’ve seen a lot of shifts with the pandemic. There’s a bit of an empty bench in some institutions, and we really wanted to fill that need and make sure there were nurses ready to step into leadership roles. We wanted to create a skill set for those individuals who are interested in progressing from clinical to organizational executive positions.\nPP: It’s a much-needed program – not only in nursing but in all leadership roles. We always talk about evidence-based practice in nursing and in hospitals, but we don’t talk a lot about evidence-based management, and that’s what this program is about.\nWhat makes the UCI program unique?\nMSC: Our curriculum came from guidance from current executives at various health systems, which sets us apart from other programs. We’re making sure that there’s a seamless bridge from the content chief nursing officers believe is essential for future leaders and our participants. We wanted to mix our business expertise with that of healthcare leaders so that our program’s content would be readily applicable to the real experience of the working CNO.\nOur program also offers flexibility that makes it approachable, accessible and cutting-edge by the modality in which we’re offering it, because there are parts of the curriculum that are asynchronous. That being said, there are still the means to create a meaningful professional network and gain hands-on experience through homework exercises that make sure you take concepts right into practice. It’s important because the world is different than it was even a couple of years ago, with an increase in online learning. Our program responds to that change and connects with our participants who have very busy clinical schedules.\nPP: We aren’t the only or the first or anything like that, but it comes around to that value aspect of the curriculum design. Regional programs are the way to start. People like to stay local, and they know UCI, trust UCI, love UCI and will join our program because they know UCI is going to give them value.\nHow have the responsibilities of the chief nursing officer changed over time?\nMSC: The number of audiences they are answering to in the nursing workforce is amplified. CNOs must represent all the diversity in the workforce they head – from the most junior of nurses to charge nurses to specialty procedure areas – and all the various needs they have. They have to bring respect to the vocation of nursing, and they’re constantly advocating, negotiating, positioning and convincing. This is change management. This is leadership. There’s so much to it, and our program codifies those skills so that they’re ready to listen, to understand and to advocate.\nPP: COVID changed CNO responsibilities as challenges arose and the healthcare system evolved. Instead of being assigned by the CEO or chief operating officer to do certain things, we’ve had to lead the way and inform the CEO or COO of the right thing to do, based on clinical efforts that were changing – sometimes daily.\nAlso, due to the way things happened to the financial situations in many hospitals across the country, it’s up to nurse executives to look at their patient care models and provide care in different ways than they ever have before, because to maintain financial viability, CNOs have to lead the way.\nWhy is this program important?\nMSC: The program gives a certain respect and credibility to the CNO role and strategies that make CNOs impactful. For instance, we feature one nurse who talks about the negotiation involved with accepting a CNO role. She said that if she was not a door away from the chief medical officer, she would not take the job, because she wants to be seen as an equal partner. There’s sort of a tone throughout the program that emphasizes the value CNOs bring to the table.\nPP: There’s a real empowerment that occurs from beginning to end of the program. Unless the CMO and CNO are on the same level, there’s no respect in that organization for nursing. You have to be advocating together and working as colleagues.\nHow will completing the program benefit graduates?\nMSC: It depends on the particular student perspective and point in their career. There are individuals who aspire to executive leadership in their healthcare system and are thinking they would be ready for the next step if their toolkit was rounded out; this helps them achieve that goal. There are also those who are being viewed by the organization as next in line, and they want to prepare for that opportunity. The third type is existing CNOs who might be stumbling a bit and want some refinement. They’re having success but are committed to engaging in conversation and staying cutting-edge. All three are welcomed into the program, which will meet each of their needs.\nPP: Leadership development is important, and it’s amazing what’s included in the 18 modules that have been put together and the learning that goes along with them. Time is going to be a factor, making it difficult to get away to attend a conference or meeting, but this program provides the opportunity to take advantage of an education that will enable the nursing leader to come in and do their job better next time.\nHow does this benefit patients?\nMSC: Inherently, in career progression, you’re leading from your line of service. You’re leading from a particular function but at executive suite-level leadership. You’re sitting in an entirely different place. You’re now across the organization, you’re facing outside the organization, so much of what the program does is help you shift your vision so that you’re well positioned to lead an organization.\nPP: Nurses need to educate themselves in leadership principles, because then they provide better leadership to their nurses, who will then deliver better care to their patients. There have been so many instances of burnout and turnover and talk of retention strategies that anything CNOs can do to help put more tools in their toolkit, the better we all will do. Most nurse executives would agree with this statement: I’m going to take better care of my nurses, who are going to take better care of my patients.\nIf you want to learn more about supporting this or other activities at UCI, please visit the Brilliant Future website at https://brilliantfuture.uci.edu. Publicly launched on Oct. 4, 2019, the Brilliant Future campaign aims to raise awareness and support for UCI. By engaging 75,000 alumni and garnering $2 billion in philanthropic investment, UCI seeks to reach new heights of excellence in student success, health and wellness, research and more. The Sue & Bill Gross School of Nursing plays a vital role in the success of the campaign. Learn more by visiting https://brilliantfuture.uci.edu/sue-and-bill-gross-school-of-nursing.\n\n\n\nTweet\n\n\n\n\nShare\n0\n\n\n\n\nReddit\n\n\n\n\n+1\n\n\n\n\nLinkedIn\n0\n\n\n\n\nEmail\n\n\nRelated PostsAntibiotic resistance: The hidden healthcare crisisFebruary 22, 2022Scientists discover a way Earth’s atmosphere cleans itselfApril 7, 2023\n\nGetting the lead outFebruary 22, 2010\n\nUCI, TU Munich and TU Braunschweig launch joint technology development projectMarch 12, 2018 \n\n\nRelated Links \n\n\nThe Paul Merage School of Business\n\nhttps://merage.uci.edu\n\n\n\nChief nursing officer certificate program\n\nhttps://ldi-online.merage.uci.edu/chief-nursing-officer-program\n\n\n\nMaritza Salazar Campo faculty profile\n\nhttps://merage.uci.edu/research-faculty/faculty-directory/Maritza-Salazar-Campo.html\n\n\n\nPat Patton profile\n\nhttps://nursing.ucsfmedicalcenter.org/cne\n\n\n\nRecent Posts \n\n\n\n\nUCI biomedical engineer Kyriacos Athanasiou wins $6 million CIRM grant\nMay 1, 2023\n\n\n\n\n\n\n\nA 400th birthday bash under glass\nApril 28, 2023\n\n\n\n\n\n\n\n\n\nUC Irvine to host Team Kids Innovative Thinkers Forum IV\nApril 27, 2023\n\n\n\n\n\n\n\nBuild a business, save the world\nApril 26, 2023\n\n\nKeywordsadvocacybusinesscertificate programcollaborationfacultyhealthcareleadershipnursingonline educationpandemic \n\n\n\n\n\n\n\n\n\nFacebook\nTwitter\nYouTube\nFlickr\nMedium\n \n\nUCI Today\nUCI Search\n \n\n\n\n\n\nFeedback\nPrivacy Notice\n \n\n\nStrategic Communications & Public Affairs120 Theory, Suite 100Irvine, CA 92697-5615949-824-6922 \n\n\n\n\n\n\n© 2023 UC Regents\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content-main",
        "https://uci.edu/",
        "https://news.uci.edu/category/art-and-humanities/",
        "https://news.uci.edu/category/arts/",
        "https://news.uci.edu/category/humanities/",
        "https://news.uci.edu/category/athletics/",
        "https://news.uci.edu/category/campus-life/",
        "https://news.uci.edu/category/campus-life/administration/",
        "https://news.uci.edu/category/campus-life/students/",
        "https://news.uci.edu/category/health/",
        "https://news.uci.edu/category/health/hospital/",
        "https://news.uci.edu/category/health/public-health/",
        "https://news.uci.edu/category/health/nursing/",
        "https://news.uci.edu/category/health/school-of-medicine/",
        "https://news.uci.edu/category/health/pharmaceutical-sciences/",
        "https://news.uci.edu/category/science-and-tech/",
        "https://news.uci.edu/category/science-and-tech/environment-and-energy/",
        "https://news.uci.edu/category/society-and-community/",
        "https://news.uci.edu/category/society-and-community/education/",
        "https://news.uci.edu",
        "https://brilliantfuture.uci.edu",
        "https://brilliantfuture.uci.edu/sue-and-bill-gross-school-of-nursing/",
        "https://twitter.com/intent/tweet?text=Nurturing+nurse+executives: https://news.uci.edu/2023/04/10/nurturing-nurse-executives/",
        "http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.uci.edu%2F2023%2F04%2F10%2Fnurturing-nurse-executives%2F",
        "http://reddit.com/submit?url=https://news.uci.edu/2023/04/10/nurturing-nurse-executives/",
        "http://plus.google.com/share?url=https://news.uci.edu/2023/04/10/nurturing-nurse-executives/",
        "https://www.linkedin.com/shareArticle?mini=true&url=https://news.uci.edu/2023/04/10/nurturing-nurse-executives/&title=Nurturing nurse executives",
        "mailto:?subject=Nurturing nurse executives&body=Hey, checkout this web page: - https://news.uci.edu/2023/04/10/nurturing-nurse-executives/",
        "https://news.uci.edu/2022/02/22/antibiotic-resistance-the-hidden-healthcare-crisis/",
        "https://news.uci.edu/2022/02/22/antibiotic-resistance-the-hidden-healthcare-crisis/",
        "https://news.uci.edu/2023/04/07/scientists-discover-a-way-earths-atmosphere-cleans-itself/",
        "https://news.uci.edu/2023/04/07/scientists-discover-a-way-earths-atmosphere-cleans-itself/",
        "https://news.uci.edu/2010/02/22/getting-the-lead-out/",
        "https://news.uci.edu/2010/02/22/getting-the-lead-out/",
        "https://news.uci.edu/2018/03/12/uci-tu-munich-and-tu-braunschweig-launch-joint-technology-development-project/",
        "https://news.uci.edu/2018/03/12/uci-tu-munich-and-tu-braunschweig-launch-joint-technology-development-project/",
        "https://merage.uci.edu",
        "https://ldi-online.merage.uci.edu/chief-nursing-officer-program",
        "https://merage.uci.edu/research-faculty/faculty-directory/Maritza-Salazar-Campo.html",
        "https://nursing.ucsfmedicalcenter.org/cne",
        "https://news.uci.edu/2023/05/01/uci-biomedical-engineer-kyriacos-athanasiou-wins-6-million-cirm-grant/",
        "https://news.uci.edu/2023/05/01/uci-biomedical-engineer-kyriacos-athanasiou-wins-6-million-cirm-grant/",
        "https://news.uci.edu/2023/04/28/a-400th-birthday-bash-under-glass/",
        "https://news.uci.edu/2023/04/28/a-400th-birthday-bash-under-glass/",
        "https://news.uci.edu/2023/04/27/uc-irvine-to-host-team-kids-innovative-thinkers-forum-iv/",
        "https://news.uci.edu/2023/04/27/uc-irvine-to-host-team-kids-innovative-thinkers-forum-iv/",
        "https://news.uci.edu/2023/04/26/build-a-business-save-the-world/",
        "https://news.uci.edu/2023/04/26/build-a-business-save-the-world/",
        "https://news.uci.edu/tag/advocacy/",
        "https://news.uci.edu/tag/business/",
        "https://news.uci.edu/tag/certificate-program/",
        "https://news.uci.edu/tag/collaboration/",
        "https://news.uci.edu/tag/faculty/",
        "https://news.uci.edu/tag/healthcare/",
        "https://news.uci.edu/tag/leadership/",
        "https://news.uci.edu/tag/nursing/",
        "https://news.uci.edu/tag/online-education/",
        "https://news.uci.edu/tag/pandemic/",
        "https://www.facebook.com/UCIrvine",
        "https://twitter.com/UCIrvineNews",
        "https://www.youtube.com/user/ucirvine",
        "http://www.flickr.com/photos/ucirvine/",
        "https://medium.com/@UCIrvine",
        "http://today.uci.edu/",
        "http://search.uci.edu/",
        "http://forms.communications.uci.edu/uci-feedback/",
        "http://uci.edu/privacy/",
        "//uci.edu/copyright"
    ]
}