{
    "title": "Make WordPress Plugins – Resources for WordPress.org plugin developers",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Plugins\n\n\nHandbook\n \n\n\n\nHide welcome box\n\n\n\n\nWelcome to the official blog for the PluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party Review Team.\nThe review team acts as gate-keepers and fresh eyes on newly submitted plugins, as well as reviewing any reported security or guideline violations.\nQuick Links\nHandbook\nReporting Plugin Issues\nPlugin Developer Resources\nPlugin Directory Resources\n\n\nCommunication\nWe can be reached by email at plugins＠wordpress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/, or via the #pluginreview channel on Slack.\nWe are currently adding new team members as invite only. Please stay tuned!Login to Reply\n\n\n\n\n\n\n\n\n\n\n\n \nJonathan Desrosiers\n\n1:16 pm on April 19, 2023 \n\n\n\nTags: make.wordpress.org/community ( 8 ), p2-xpost ( 58 )   \n\t\t\t\t\n\nX-post: Cultivating More Effective Contributing on Contributor Days\n\n\nX-comment from +make.wordpress.org/community: Comment on Cultivating More Effective Contributing on Contributor DaysLogin to Reply\n\n\n\n\n\n\n\n\n\n\n \nIpstenu (Mika Epstein)\n\n11:24 pm on March 21, 2023 \n\n\n\nTags: guidelines ( 27 ), reminder ( 30 )   \n\t\t\t\t\n\nUse of Code Generators Must Remain GPL Compatible\n\n\ntl;dr – If you use a tool to generate code (be that a website that generates settings pages, or something complex like an AI to build the whole pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party), remember that YOU are responsible for licensing.\nAll code hosted on WordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ has to be GPLGPL GPL is an acronym for GNU Public License. It is the standard license WordPress uses for Open Source licensing https://wordpress.org/about/license/. The GPL is a ‘copyleft’ license https://www.gnu.org/licenses/copyleft.en.html. This means that derivative work can only be distributed under the same license terms. This is in distinction to permissive free software licenses, of which the BSD license and the MIT License are widely used examples. Compatible. This is not in doubt. More and more people are using tools to build code for them, based on bare-bones input. With the advent of ChatGPT, this has become more popular.\nTo be clear here: There is no guideline AGAINST using generated code.\nYou’re welcome to use whatever tool you want to build plugins. That said, you are 100% responsible for that code if you chose to host it here. This is not a change to any guideline, merely a reminder that if you claim it’s your code, you are responsible for it.\nBut the important bit here is that if means if ChatGPT, for example, built your plugin, you have to verify that all the code used is GPL compatible. Just like you are expected to validate licenses on libraries and code-snippets, everything in your plugin has to be GPL compatible. Should we determine that your code is a copy of someone else’s or includes code from non-GPL plugins, your submission will be rejected and any live plugins will be closed. \nSadly this has already become a small issue, as people asked an AI to build a ‘scroll to top’ plugin and it literally copied code from another, existing, plugin hosted on WordPress.org. Actually five times. And they were all rejected since it was pretty obvious.\nNow before someone asks, yes it’s fine to fork code. You have to credit them, however, and that’s something those AIs have been pretty bad at doing. Also remember that the AI can tell you how to submit a plugin and be wrong. And by wrong I mean totally, 100%, that was really some bad advice someone got wrong. Make sure you double check. Robots won’t take our jobs yet.\nIf you submit code, it’s your responsibility. Nothing’s changed.\n#guidelines, #reminderLogin to Reply\n\n\n\n\n\n\n\n\n\n\n \nIpstenu (Mika Epstein)\n\n11:00 am on March 10, 2023 \n\n\n\nTags: announcement ( 8 ), team reps ( 5 )   \n\t\t\t\t\n\nAdvance Notice of Retirement\n\n\ntl;dr: I will be stepping down from pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party reviews by 1 July, 2023.\nI will be stepping down from plugin reviews this year. I have been a part of this team for over a decade (and the rep for the majority of the time) and recognize a departure like this can be confusing, and could cause people jump to a whole lot of assumptions about the why.\nThis is a personal decision and has nothing to do with my passion for WordPress. It is a 100% personal, non-WordPress related, decision I made long ago (I told the team in July ’22). Suffice to say there is life ‘stuff’ going on and I cannot devote the time I once could to plugin reviews.\nMany people have noticed and complained, with varying degrees of empathy, about the sudden uptick in delays with reviews (be they new plugins or security related). Those delays are directly related to that ‘stuff’ going on. I simply am not available as much as I was, and out of fairness to myself and the community, it’s time for me to retire from plugins.\nWe’re trying to figure out an onboarding doc, some demo plugins to help people test, getting people in a place where they can fill in the gaps. But this is not a fast process. We’ve actually never had real onboarding (I was thrown into the fire when I stepped in), and it’s going to be a challenge get a team to the place where they have as much weird plugin knowledge and gotchas as I have from my 10 years of experience.\nThere will absolutely be a learning curve for the people who step in after me. Things will be missed, things will be confusing, and mistakes will happen. I ask everyone be kind and patient.\nI understand it became a one-woman show and I apologize for not asking for help and stepping down sooner before it became a crisis. At that point, it was impossible to set up a flag for help without causing these kinds of delays. But things like this happen out of your control, even when you plan. None of us expected the world to spiral like it did in 2019/20.\nWhat’s next for me and WordPress? Writing and managing my plugins, developing code, and being around for some questions. I won’t vanish in the night, but after a decade? I think it will be good for us all to have someone fresh in there.\nSome quick answers:\nI’m not sick or dying. \nWe don’t have an announcement of the new rep.\nWe are still working on onboarding and figuring that out.\nWe have reached out to people and they are actively being onboarded right now.\nSo again, I ask we all please be patient with all the changes coming. Once we sort out onboarding, we hope to be able to invite even more people, just like you, to the team!\n#announcement, #team-repsLogin to Reply\n\n\n\n\n\n\n\n\n\n\n \nJonathan Bossenger\n\n12:59 pm on March 8, 2023 \n\n\n\nTags: make.wordpress.org/training ( 2 ), p2-xpost ( 58 )   \n\t\t\t\t\n\nX-post: Introduction to WordPress Development: A proposed learning path\n\n\nX-comment from +make.wordpress.org/training: Comment on Introduction to WordPress Development: A proposed learning pathLogin to Reply\n\n\n\n\n\n\n\n\n\n\n \nJulia Golomb\n\n1:02 am on February 8, 2023 \n\n\n\nTags: make.wordpress.org/community ( 8 ), p2-xpost ( 58 )   \n\t\t\t\t\n\nX-post: Apply to Attend the 2023 Community Summit\n\n\nX-comment from +make.wordpress.org/community: Comment on Apply to Attend the 2023 Community Summit\n\n\n\n\n\n\n\n\n\n\n \nSam Suresh\n\n3:01 pm on February 6, 2023 \n\n\n\nTags: make.wordpress.org/community ( 8 ), p2-xpost ( 58 )   \n\t\t\t\t\n\nX-post: Community Booth at WordCamp Asia 2023\n\n\nX-post from +make.wordpress.org/community: Community Booth at WordCamp Asia 2023\n\n\n\n\n\n\n\n\n\n\n \nIpstenu (Mika Epstein)\n\n8:15 pm on February 3, 2023 \n\n\n\nTags: api ( 4 ), twitter   \n\t\t\t\t\n\nTwitter API Changes\n\n\ntl;dr: Twitter will begin charging for APIAPI An API or Application Programming Interface is a software intermediary that allows programs to interact with each other and share data in limited, clearly defined ways. access, possibly as early as the 9th of February. If your pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party integrates with the API (be it v1.1 or v2), PLEASE make sure you look into the changes and how they might impact you!\nYesterday Twitter announced it will be charging for access to the API.\n\nStarting February 9, we will no longer support free access to the Twitter API, both v2 and v1.1. A paid basic tier will be available instead 🧵— Twitter Dev (@TwitterDev) February 2, 2023Estimated cost is ~$100/month, with a requirement of a valid ID, however there is no information yet as to how much traffic that entails. Since information is not going to be provided until next week (giving everyone a whopping max 3 days to figure this out), I wanted to make sure everyone was as notified as can be.\nThis will likely impact:\nAuto-posting\nLogin with Twitter\nAnalytics\nManagement Tools\nScripted Interactions (auto-blocking etc)\nAccess to search is already a pay-only service.\nIf your plugin (or the related service) does any of those, you will have to investigate if this change impacts you. If you are impacted, you will need to update (or close) your plugin accordingly. I know a lot of free plugins will have some hard choices to make here.\nFor plugin users, if a plugin suddenly breaks on/around the 9th, please be generous and kind to the developers. They really got blindsided by this, and it’s a lot to sort out in a short amount of time.\n#api, #twitter\n\n\n\n\n\n\n\n\n\n\n \nIpstenu (Mika Epstein)\n\n5:28 pm on January 13, 2023 \n\n\n\nTags: community support   \n\t\t\t\t\n\nLooking for your (intentionally) wrong plugins\n\n\ntl;dr: Do you have demo plugins that are dangerous on purpose? We want to see them!\nOne of the behind-the-scenes steps going on right now is figuring out HOW to onboard and make sure people are good at looking through plugins, finding the security/guideline issues, and can explain what they are and why they’re bad. While most of the explanation we have covered in pre-defined replies, you should know why something is wrong 🙂\nIn order to do this, we need some intentionally busted plugins so people can get experience in looking for ‘wrong’ in a safe situation.\nBy ‘wrong’ I mean…\nPlugins that don’t sanitize/escape\nShortcodes not checking for validity/security\nSQL prepare() issues\nUsing script tags instead of wp_enqueue()\nUsing curl/file_remote_get instead of the HTTPHTTP HTTP is an acronym for Hyper Text Transfer Protocol. HTTP  is the underlying protocol used by the World Wide Web and this protocol defines how messages are formatted and transmitted, and what actions Web servers and browsers should take in response to various commands. APIAPI An API or Application Programming Interface is a software intermediary that allows programs to interact with each other and share data in limited, clearly defined ways.\nTrademarks (Starting your pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party name with “Microsoft” for example)\nThis is an incomplete list. I doubt anyone can make a plugin with 100% of all the things we look for since that changes nearly every day as people come up with new and inventive ways to be dangerous. Of course if you can, I’d love to see that too!\nWhile we certainly can use some submitted/closed plugins for this, it would be nice to have a set of “These are some busted plugins to practice on”\nI know some of you are clever folks and have things like that for fun, and right now, we want to see them! Email them (either zip or link to your repo) to plugins@wordpress.org with the subject “Demo Plugin for Reviewers” (we make heavy use of email filtering, so that subject is important!).\n\n#community-support\n\n\n\n\n\n\n\n\n\n\n \nIpstenu (Mika Epstein)\n\n8:36 pm on December 21, 2022 \n\n\n\nTags: code of conduct, guidelines ( 27 )   \n\t\t\t\t\n\nPlugin Guideline Update: Community Code of Conduct\n\n\ntl;dr: All representatives of a pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party are required to comply with the Community Code of Conduct.\nOne of the longstanding open tickets for the Plugin Guidelines has been adding in the Community Code of Conduct.\nWith the announcement of the Incident Team, we have updated the guidelines to indicate that all representatives of a plugin must comply with the Community Code of Conduct.\nThe updates can be found in the “Developer Expectations” (where we list out the guidelines/CoCs you must comply with) and in Guideline #9 (Developers and their plugins must not do anything illegal, dishonest, or morally offensive.)\nEffectively? Yes, you actually do have to follow the Community Code of Conduct if you want to be part of the community.\nThis shouldn’t be a surprise to anyone.\n#code-of-conduct, #guidelines\n\n\n\n\n\n\n\n\n\n\n \nSamuel Wood (Otto)\n\n5:52 pm on December 16, 2022 \n\n\n\nTags: plugins ( 2 ), themes   \n\t\t\t\t\n\nPlugins/themes categorization\n\n\nAfter State of the WordState of the Word This is the annual report given by Matt Mullenweg, founder of WordPress at WordCamp US. It looks at what we’ve done, what we’re doing, and the future of WordPress. https://wordpress.tv/tag/state-of-the-word/., you may have noticed a couple new things for plugins and themes.\n\n\n\n\n\n\nThis is the start of a broader categorization of plugins and themes. The eventual goal of which is to help users to better find plugins or themes that fit their needs.\nCategories\nSo we started looking at basic categories for plugins and themes, and how we would integrate that into wordpress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/.\nOne thing we noticed immediately was that there are a lot of commercial plugins and themes. They’re not the majority, but there are a lot of them that have a lot of users.\nThe other thing we noticed was there were a lot of community based plugins and themes, which are open sourceOpen Source Open Source denotes software for which the original source code is made freely available and may be redistributed and modified.  Open Source **must be** delivered via a licensing model, see GPL. on GithubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/ or some other repository system.\nIn both cases, it became very clear that we didn’t have any easy way to link back to those systems. We have support forums for all of the plugins, but we often get questions about the commercial version of a pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party. Similarly, we don’t have any obvious way to link back to a github, for example, to provide users a way to contribute to that community.\nSo we introduced a new taxonomyTaxonomy A taxonomy is a way to group things together. In WordPress, some common taxonomies are category, link, tag, or post format. https://codex.wordpress.org/Taxonomies#Default_Taxonomies. to our systems, and now plugins and theme authors can opt into it, if they want.\nHow to opt-in\nTo opt in a plugin or theme, email plugins@wordpress.org, or themes@wordpress.org, and simply ask to opt into it. This is a manual process for now. In the future, we will be adding a method for plugins and themes to do it themselves.\nOnce your plugin or theme is added, you will get a new feature (on the advanced tab for plugins, or at the bottom of the listing page for themes). For both cases, it’s a simple URLURL A specific web address of a website or web page on the Internet, such as a website’s URL www.wordpress.org entry.\nFor commercial, this will show up as a support link. For community, this will show up as a contribute link.\nMore to come…\nAnd, of course, this is in no way final. We plan to use this and other categories in the future to improve the overall directory system as a whole. In what ways, we don’t exactly know just yet. We value your input, and look forward to seeing what ideas the community has. 🙂 \n#plugins, #themes\n\n\n\n\n\n\n\nPost navigation\n← Older posts\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\nEmail Updates\n\n\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 2,587 other subscribers\t\t\t\t\n\nHelp TopicsPlugin Guidelines\nDeveloper FAQ\nUsing Subversion\nUsing Plugin Assets\nHow Your Readme.txt works\nRecent UpdatesRecent CommentsNo RepliesRecent UpdatesRecent CommentsNo RepliesRecent Activity\n\n\n\t\t\tTeam Pledges\n\t\t\n\n0 people have pledged time to contribute to Plugins Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/plugins/",
        "https://make.wordpress.org/plugins/handbook/",
        "https://make.wordpress.org/plugins/handbook",
        "https://developer.wordpress.org/plugins/wordpress-org/plugin-security/reporting-plugin-security-issues/",
        "https://developer.wordpress.org/plugins/",
        "https://developer.wordpress.org/plugins/wordpress-org/",
        "https://wordpress.org/",
        "https://wordpress.slack.com/messages/pluginreview",
        "https://make.wordpress.org/chat/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2Fwelcome%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/desrosj/",
        "https://profiles.wordpress.org/desrosj/",
        "https://make.wordpress.org/plugins/tag/make-wordpress-org-community/",
        "https://make.wordpress.org/plugins/tag/p2-xpost/",
        "https://make.wordpress.org/plugins/2023/04/19/xpost-cultivating-more-effective-contributing-on-contributor-days/",
        "https://make.wordpress.org/community/",
        "https://make.wordpress.org/community/2023/04/19/cultivating-more-effective-contributing-on-contributor-days/#comment-30834",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F2023%2F04%2F19%2Fxpost-cultivating-more-effective-contributing-on-contributor-days%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/ipstenu/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://make.wordpress.org/plugins/tag/guidelines/",
        "https://make.wordpress.org/plugins/tag/reminder/",
        "https://make.wordpress.org/plugins/2023/03/21/use-of-code-generators-must-remain-gpl-compatible/",
        "https://wordpress.org/",
        "https://wordpress.org/about/license/",
        "https://www.gnu.org/licenses/copyleft.en.html",
        "https://make.wordpress.org/plugins/tag/guidelines/",
        "https://make.wordpress.org/plugins/tag/reminder/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F2023%2F03%2F21%2Fuse-of-code-generators-must-remain-gpl-compatible%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/ipstenu/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://make.wordpress.org/plugins/tag/announcement/",
        "https://make.wordpress.org/plugins/tag/team-reps/",
        "https://make.wordpress.org/plugins/2023/03/10/advance-notice-of-retirement/",
        "https://make.wordpress.org/plugins/tag/announcement/",
        "https://make.wordpress.org/plugins/tag/team-reps/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F2023%2F03%2F10%2Fadvance-notice-of-retirement%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/psykro/",
        "https://profiles.wordpress.org/psykro/",
        "https://make.wordpress.org/plugins/tag/make-wordpress-org-training/",
        "https://make.wordpress.org/plugins/tag/p2-xpost/",
        "https://make.wordpress.org/plugins/2023/03/08/xpost-introduction-to-wordpress-development-a-proposed-learning-path/",
        "https://make.wordpress.org/training/",
        "https://make.wordpress.org/training/2023/03/08/introduction-to-wordpress-development-a-proposed-learning-path/#comment-3724",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fplugins%2F2023%2F03%2F08%2Fxpost-introduction-to-wordpress-development-a-proposed-learning-path%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/juliarosia/",
        "https://profiles.wordpress.org/juliarosia/",
        "https://make.wordpress.org/plugins/tag/make-wordpress-org-community/",
        "https://make.wordpress.org/plugins/tag/p2-xpost/",
        "https://make.wordpress.org/plugins/2023/02/08/xpost-apply-to-attend-the-2023-community-summit/",
        "https://make.wordpress.org/community/",
        "https://make.wordpress.org/community/2023/02/08/apply-to-attend-the-2023-community-summit/#comment-30688",
        "https://profiles.wordpress.org/samsuresh/",
        "https://profiles.wordpress.org/samsuresh/",
        "https://make.wordpress.org/plugins/tag/make-wordpress-org-community/",
        "https://make.wordpress.org/plugins/tag/p2-xpost/",
        "https://make.wordpress.org/plugins/2023/02/06/xpost-community-booth-at-wordcamp-asia-2023/",
        "https://make.wordpress.org/community/",
        "https://make.wordpress.org/community/2023/02/06/community-booth-at-wordcamp-asia-2023/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://make.wordpress.org/plugins/tag/api/",
        "https://make.wordpress.org/plugins/2023/02/03/twitter-api-changes/",
        "https://twitter.com/TwitterDev/status/1621026986784337922?ref_src=twsrc%5Etfw",
        "https://make.wordpress.org/plugins/tag/api/",
        "https://make.wordpress.org/plugins/tag/twitter/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://make.wordpress.org/plugins/2023/01/13/looking-for-your-intentionally-wrong-plugins/",
        "https://make.wordpress.org/plugins/tag/community-support/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://profiles.wordpress.org/ipstenu/",
        "https://make.wordpress.org/plugins/tag/guidelines/",
        "https://make.wordpress.org/plugins/2022/12/21/plugin-guideline-update-community-code-of-conduct/",
        "https://make.wordpress.org/handbook/community-code-of-conduct/",
        "https://make.wordpress.org/project/2022/12/21/announcement-new-wordpress-incident-response-team/#comment-205",
        "https://make.wordpress.org/handbook/community-code-of-conduct/",
        "https://make.wordpress.org/plugins/tag/code-of-conduct/",
        "https://make.wordpress.org/plugins/tag/guidelines/",
        "https://profiles.wordpress.org/otto42/",
        "https://profiles.wordpress.org/otto42/",
        "https://make.wordpress.org/plugins/tag/plugins/",
        "https://make.wordpress.org/plugins/2022/12/16/plugins-themes-categorization/",
        "https://wordpress.tv/tag/state-of-the-word/",
        "https://make.wordpress.org/plugins/files/2022/12/community.png",
        "https://make.wordpress.org/plugins/files/2022/12/commercial.png",
        "https://wordpress.org/",
        "https://github.com/",
        "https://codex.wordpress.org/Taxonomies#Default_Taxonomies",
        "https://make.wordpress.org/plugins/files/2022/12/commsetting.png",
        "https://make.wordpress.org/plugins/tag/plugins/",
        "https://make.wordpress.org/plugins/tag/themes/",
        "https://make.wordpress.org/plugins/page/2/",
        "#",
        "https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/",
        "https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/",
        "https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/",
        "https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/",
        "https://developer.wordpress.org/plugins/wordpress-org/how-your-readme-txt-works/",
        "https://make.wordpress.org/plugins/",
        "https://make.wordpress.org/plugins/?o2_recent_comments=1",
        "https://make.wordpress.org/plugins/?replies=none",
        "https://make.wordpress.org/plugins/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}