{
    "title": "Home // Brilliant Future // UCI",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\n\n\n\n\nWho We Are\n\n\n\n\nWhat We Do\n\t\t\t\t\t\n\n\n\n\n\n\n        \t\t\t\t\t\t    American Dream\n                                \n\n                                    UCI is the nation's No. 1 university doing the most to advance upward mobility.\n                                \n\n\n\n\n\n\n        \t\t\t\t\t\t    Health & Wellness\n                                \n\n                                    We redefine how medical breakthroughs are achieved, how patients are treated and how communities are empowered.\n                                \n\n\n\n\n\n\n        \t\t\t\t\t\t    Research\n                                \n\n                                    UCI researchers are working on advances in science, medicine and innovation in record time.\n                                \n\n\n\n\n\n\n        \t\t\t\t\t\t    Human Experience\n                                \n\n                                    UCI is deepening the world's understanding of the many form of being human takes today, while renewing our shared sense of humanity in this diverse and digital age.\n                                \n\n\n\n\n\n\nOC Community\n\n\n\nYour Impact\n\n\n\nJoin Us\n\n\n\n\n\nSearch\n\n\nShow/Hide primary navigation\n\n\n\n\nClose\n\n\n\n\n\nHome\n\n\n\n\n\n                    Watch Video\n                    \n\n\n\nStop At Nothing\n\nTo be at the forefront of medicine.\nTo create a brilliant future.\nTo lead the way to a cure for cancer.\nTo inspire change in your community.\n\n\n                            Watch Video\n                            \n\nAs one of the nation’s premier public research universities and Orange County’s only academic health system, we stop at nothing to improve lives through groundbreaking research, academic achievement, thoughtful public service, exceptional patient care and cutting-edge treatments.\n\n\n\n\n\n\n\n\n\n\nUCI is fiercely dedicated to enhancing lives in our community and beyond through rigorous academics and cutting-edge discoveries. Here are a few of our latest accomplishments.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccelerating World-Changing Research\n\n\n\nUCI pioneered an interdisciplinary approach like no other, and our model of extreme collaboration puts us ahead of the curve. Our researchers are working on what matters to all of us: saving the planet; securing data privacy; solving mysteries of the brain; living longer, happier lives; and making our region one of the most prosperous, global innovation hubs.\n\n\n\n\nAt the Heart of O.C.'s Medical Technology Ecosystem\nUCI’s Edwards Lifesciences Foundation Cardiovascular Innovation and Research Center enters new era with latest philanthropic gift\n\n\n\nPaying It Forward\nUC Irvine alumni Paul and Jo Butterworth pledge $35.5 million to support students and research in the Donald Bren School of Information and Computer Sciences\n\n\n\n\n\nSee more about how UCI is leading the way in\n\n\n\n    \nResearch\n\n\n\n\n\n\n\n\nTRANSFORMING HEALTHCARE AND WELLNESS\n\n\n\nLeveraging the strength of the entirety of UCI’s academic enterprise, we continue to redefine how new medical breakthroughs are discovered; how personalized, compassionate healthcare is taught; how patients are treated; and how communities are empowered for mental and physical health.\n\n\n\n\nPromoting Health Equity for All O.C. Residents\nIrvine Health Foundation's $14 million grant will assist in establishing the UCI School of Population and Public Health\n\n\n\nA Vision Visionary\nUCI’s acclaimed Donald Bren Professor of Ophthalmology, Kris Palczewski, is blazing a trail of innovative research\n\n\n\n\n\nSee more about how UCI is leading the way in\n\n\n\n    \nHealth and Wellness\n\n\n\n\n\n\n\n\nMaking a Local Impact\n\n\n\nThrough a multitude of public service projects, arts programs, off-campus lectures, legal aid initiatives, wellness clinics, youth outreach efforts and community partnerships – to name but a few – UCI demonstrates its commitment to engaging with and improving the surrounding community.\n\n\n\n\nUCI’s Global Economic Impact Starts Locally\n$7 Billion in annual economic impact to Orange County\n\n\n\nPartners in Community\nHow UCI is preserving our local natural habitats and raising the bar in sustainability\n\n\n\n\n\nLearn more about how UCI is dedicated to\n\n\n\n    \nCommunity\n\n\n\n\n\n\n\n\nAdvancing the American Dream\n\n\n\nAt UCI we make a world-class education available to all talented, hardworking students, regardless of background. In so doing, we remind the country that great universities can reinvigorate the American dream by becoming the most powerful engines of social mobility ever created.\n\n\n\n\nHer Place To Shine\nThe idea of a deaf opera singer might seem improbable, even impossible, but Leslie Lopez is used to defying the odds\n\n\n\nUCI Receives Most Applications In Campus History\nSchool is top UC choice for in-state, first-generation students for 4th consecutive year\n\n\n\n\n\nLearn more about UCI's commitment to the \n\n\n\n    \nAmerican Dream\n\n\n\n\n\n\n\n\nExploring the Human Experience\n\n\n\nFrom illuminating the human experience in all its diversity to the evolution of artificial intelligence and machine learning through human narratives and knowledge, UCI is deepening the world’s understanding of what it means to be human.\n\n\n\n\nA Fresh Perspective on the AAPI Experience\nUCI students employ photovoice technique to document reality in O.C.’s Asian American and Pacific Islander community during pandemic\n\n\n\nA New Home for California Art\nLocation chosen for Jack and Shanaz Langson Institute and Museum of California Art. UCI’s North Campus site provides outdoor vistas to complement indoor masterpieces.\n\n\n\n\n\nLearn more about UCI's commitment to the \n\n\n\n    \nHuman Experience\n\n\n\n\n\n\n\n\n\n\nMake a Gift\nUCI’s Brilliant Future campaign is not just about our brilliant future. It’s about yours.\n\n\n    \nTogether, let's advance the dream\n\n\n\nWhy UCI?\nUCI's collaborative community is fiercely dedicated to saving and improving lives in Orange County and beyond.\n\n\n    \nDiscover UCI\n\n\n\nOC Community\nUCI strives to improve the lives of our students and members of our community every day.\n\n\n    \nHow is UCI changing lives?\n\n\n\n\n\n\n\nFacebook\n\nTwitter\n\nLinkedIn\n\nInstagram\n\n\nUCI Homepage\n        |\n        Privacy Notice\n\n© 2023 UC Regents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "index.php",
        "who-we-are.php",
        "american-dream/index.php",
        "health-and-wellness/index.php",
        "research/index.php",
        "human-experience/index.php",
        "serving-oc.php",
        "your-impact.php",
        "join-us.php",
        "#",
        "#",
        "research/engineering/Edwards-Lifesciences-CIRC.php",
        "research/innovation/Paying-it-Forward.php",
        "https://uci.edu/brilliant/research/index.php",
        "health-and-wellness/Irvine-Health-Foundation-Gift.php",
        "health-and-wellness/medical-research/Vision-Visionary.php",
        "https://uci.edu/brilliant/health-and-wellness/index.php",
        "community/impact/economic-impact.php",
        "community/community-partners/partners-in-community.php",
        "serving-oc.php",
        "american-dream/student-success/Leslie-Lopez.php",
        "american-dream/upward-mobility/uci-receives-most-applications-in-campus-history1.php",
        "https://uci.edu/brilliant/american-dream/index.php",
        "human-experience/humanities/a-fresh-perspective-on-the-AAPI-experience.php",
        "human-experience/art/langson-imca-north-campus.php",
        "https://uci.edu/brilliant/human-experience/#art",
        "https://brilliantfuture.uci.edu/",
        "who-we-are.php",
        "serving-oc.php",
        "https://www.facebook.com/UCIrvine",
        "https://twitter.com/ucirvine",
        "https://www.linkedin.com/school/university-of-california-irvine/",
        "https://www.instagram.com/ucirvine/",
        "https://uci.edu/",
        "https://uci.edu/privacy",
        "https://uci.edu/copyright"
    ]
}