{
    "title": "News - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\nNews \n\n\n\n \nDeep Look into America’s Relationship with Slavery Named Book in Common for 2023-24 \n\n\t\tConfronting America's legacy of slavery, the selection for the 2023-24 Book in Common is Clint Smith's “How the Word is Passed.”\t\n\n\n\n\n \nIn the Midst of a Successful Career of Catching Bad Guys, Military Vet  Pursues Online MBA \n\n\t\tAfter a long and successful career first in the military and then the financial industry, Rio Miner enrolled in Chico State's online MBA program to further his career and fill in the gaps in his business acumen.\t\n\n\n\n\n \nChico State Receives Transformational Gift to Support New College of Business Building \n\n\t\tAlum Jon Krabbenschmidt (Business Administration, ’76) wants to see Glenn Hall become a state-of-the-art building for business students—and he is committing a pair of $5 million toward its construction.\t\n\n\n\n\n \nChico State College of Agriculture Names New Director for University Farm \n\n\t\tRicardo Orellana's international background, leadership, and diverse agriculture experience will strengthen partnerships and support the program in meeting the needs of agriculture in the 21st century.\t\n\n\n\n\n \nNew Transport Program Provides Students Rides to Sacramento Airport During Breaks \n\n\t\tStudents leaving campus during extended breaks can sign up for Wildcat Rides, a new program shuttling students from campus to the Sacramento bus and train station and the Sacramento Airport. \t\n\n\n\n\n \nThrough Partnership, Chico State to Provide Income-Eligible Students with Discounted Tablets \n\n\t\tChico State is partnering with a telecom company to offer Android tablets and free or low-cost data plans to students and community members who demonstrate a need for this service.\t\n\n\n\n\n \nChico State to Honor César Chávez Day with Events This Week \n\n\t\tChico State will recognize the efforts and sacrifice of activist César Chávez with more than a half dozen events on campus and in our community this week.\t\n\n\n\n\n \nIntroducing Delaney Sarantopulos: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tA \"roll-of-the-dice\" decision to attend Chico State came up aces for Delaney Sarantopulos and the University, which has benefited greatly from her service-based leadership.\t\n\n\n\n\n \nIntroducing Josephine Hernandez: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tAnimal science major Josephine Hernandez is an empathetic leader committed to inspiring future agricultural students and giving back to her field. \t\n\n\n\n\n \nStudents Can Help Create Real Change in Moonlit Safety Walk \n\n\t\tStudents can take an active role in their safety by participating in a Moonlit Safety Walk.\t\n\n\n\n\n \nIntroducing Madeline Litman: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tWhile at Chico State, Madeline Litman's work ethic, perseverance, and maturity have led to leadership roles in student clubs, a stellar academic career, and now a prestigious Rawlins Merit Scholarship.     \t\n\n\n\n\n \nChico State Announces 2023 Faculty and Staff Hall of Honor Inductees \n\n\t\tChico State announced tickets are now available for its 2023 Hall of Honors ceremony. The Hall of Honor  recognizes the “best of the best” of the University’s retired faculty and staff.\t\n\n\n\n\n \nIntroducing Hannah Scholzen: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tCivil engineering student and soon-to-be graduate, Hannah Scholzen, is a model of perseverance and leadership in her field.\t\n\n\n\n\n \nDistinguished Alum and Retired Agriculture Educator Roy Beck \n\n\t\tRoy Beck put himself through college by working at the University Farm. He went on to teach agricultural education for 42 years and still advocates on behalf of his beloved discipline.\t\n\n\n\n\n \nChico State’s Annual Giving Day—24 Hours, 100 Worthy Causes \n\n\t\tOn Wednesday, March 1, from midnight to 11:59 p.m., the University will host Chico State Giving Day, its annual 24-hour fundraising effort to benefit dozens of campus causes.\t\n\n\n\n\n \nIntroducing Theodore Greenfield: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tTheodore Greenfield, a father of two and elementary school band instructor, hopes to become a high school math teacher to share his love for the subject.\t\n\n\n\n\n \nIntroducing Kyle Mason: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tFueled by a passion for science, first-generation student Kyle Mason is living out his life's dream and earning a college degree.\t\n\n\n\n\n \nIntroducing Yanetli Navarro-Hernandez: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tConstruction Industry Management student Yanetli Navarro-Hernandez wants to be a role model and encourage more women to pursue careers in construction management.\t\n\n\n\n\n \nIntroducing Peyton Arnold: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tPeyton Arnold has studied the impacts of feeding cover crops to livestock and served as vice president of the Chico State Sheep Association, but she's most passionate about poultry. \t\n\n\n\n\n \nDistinguished Alumna, Educator, and School Director Melanie Mello \n\n\t\tFormer exchange student and decorated educator Melanie Mello has been named a Chico State distinguished alumni of the College of Humanities and Fine Arts.\t\n\n\n\n\n \nIntroducing Manraj Singh Randhawa: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tNursing student Manraj Singh Randhawa has a grand vision for his life. The Yuba City Sikh community, the Chico State School of Nursing, and more, are reaping the benefits of that vision.\t\n\n\n\n\n \nChico State College of Business Earns AACSB Reaccreditation \n\n\t\tChico State's College of Business has been reaccredited by the Association to Advance Collegiate Schools of Business International, the highest standard of achievement for business schools.\t\n\n\n\n\n \nIntroducing Stephanie Gaito: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tSocial work master’s student Stephanie Gaito (Social Work, ’22) is passionate about serving rural areas and giving them the proper representation they deserve.\t\n\n\n\n\n \nChico State to Break Ground on First Net-Zero Building with Future Home for College of Behavioral and Social Sciences \n\n\t\tIn what will be the first net-zero building on campus and only the third in the entire CSU, Chico State will break ground on the new building to host the College of Behavioral and Social Sciences.\t\n\n\n\n\n \nChico State Hosts Events Honoring Dr. Martin Luther King Jr, Black History Month \n\n\t\tChico State is collaborating with the City of Chico for the community’s 42nd annual celebration of Dr. Martin Luther King, Jr.\t\n\n\n\n\n \nGateway Science Museum Exhibit Takes Visitors on a Water Drop’s Extreme Journey \n\n\t\tThe Gateway Science Museum's newest exhibit, \"Water's Extreme Journey,\" explores the water cycle, while water cycle works, while asking critical questions about the choices we make in our everyday lives.\t\n\n\n\n\n \nChico State Helps Pave Way for Alumna Now Living in Israel \n\n\t\tIn November, alumna Ashira Solomon was invited to be the presenter and moderator for the Reykjavík Global Forum – Women Political Leaders in Iceland.\t\n\n\n\n\n \nBig Chico Creek Ecological Reserve Partners with CalTrout, Mechoopda for Native Fish Passage Restoration Project in Bidwell Park \n\n\t\tThe University's Big Chico Creek Ecological Reserve is partnering with agencies, such as CalTrout and the Mechoopda Indian Tribe, on a native fish passage restoration project in Bidwell Park.\t\n\n\n\n\n \nChico State Announces New Interim Provost and Vice President for Academic Affairs \n\n\t\tStephen Perez, a longtime educator and administrator in the California State University system, will serve as interim provost and vice president for Academic Affairs.\t\n\n\n\n\n \nStudent-Athlete Captures CalHOPE Courage Award \n\n\t\tGretta Kirkby, winner of the CalHOPE Courage Award, is using the opportunity to remind her peers to reach out for help if they need it. \t\n\n\n\n\n \nProvost Debra Larson Announces Her Retirement \n\n\t\tProvost Debra Larson is retiring immediately, citing health and family reasons. \t\n\n\n\n\n \nChico State Brightens Holiday Season for Butte County Families Through ‘Joy of Giving’ \n\n\t\tChico State’s University Farm Pavilion lit up with smiles and holiday cheer on Tuesday evening, as the University came together for the 32nd Joy of Giving.\t\n\n\n\n\n \nChico State Professor Helps Reshape How CSUs Teach About Climate Change \n\n\t\tChico State Professor Mark Stemen's Faculty Learning Community earns coveted sustainability award for helping CSUs integrate climate change topics in classrooms.\t\n\n\n\n\n \nChico State Hires New Chief Diversity Officer \n\n\t\tAfter a months-long nationwide search, Chico State has selected Joseph Morales as its Chief Diversity Officer.\t\n\n\n\n\n \nUniversity Faculty Awarded Prestigious Lantis Endowments \n\n\t\tChico State faculty shine as three professors are celebrated for their achievements in research and contributions to their fields.\t\n\n\n\n\n \nBasket Brigade One of Many Opportunities To Volunteer This Month \n\n\t\tWednesday night's Basket Brigade is one of many opportunities to pitch in and make a difference in the weeks surrounding Thanksgiving.\t\n\n\n\n\n \nThe Orion Honored by the Associated Collegiate Press \n\n\t\tThe Orion, Chico State’s student news organization, was recognized as one of the top 100 student publications in the nation by Associated Collegiate Press.\t\n\n\n\n\n \nChico State Provost Inducted into Michigan Tech’s Academy for Engineering Education Leadership \n\n\t\tChico State's Debra Larson has been inducted into Michigan Tech's Academy for Engineering Education Leadership.\t\n\n\n\n\n \nThe Princeton Review Honors Chico State as One of its Green Colleges \n\n\t\tThe Princeton Review recently listed Chico State on its 2023 Guide to Green Colleges.\t\n\n\n\n\n \nChico State University Farm Celebrates 60th Anniversary on November 5 \n\n\t\tAs Chico State's University Farm marks its 60th anniversary, it will host a free event to the public to celebrate its impact of serving the North State on Saturday, November 5.\t\n\n\n\nPosts navigation\n1\n2\n3\n…\n10\nNext\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/2023-book-in-common/",
        "https://today.csuchico.edu/rio-miner-online-mba/",
        "https://today.csuchico.edu/business-building-5-million-gift/",
        "https://today.csuchico.edu/new-director-university-farm/",
        "https://today.csuchico.edu/wildcat-rides/",
        "https://today.csuchico.edu/chico-state-discounted-tablets/",
        "https://today.csuchico.edu/2023-cesar-chavez-day/",
        "https://today.csuchico.edu/rawlins-delaney-sarantopulos/",
        "https://today.csuchico.edu/rawlins-josephine-hernandez/",
        "https://today.csuchico.edu/chico-state-safety-walk/",
        "https://today.csuchico.edu/rawlins-madeline-litman/",
        "https://today.csuchico.edu/2023-hall-of-honor-inductees/",
        "https://today.csuchico.edu/rawlings-hannah-scholzen/",
        "https://today.csuchico.edu/distinguished-alum-roy-beck/",
        "https://today.csuchico.edu/giving-day-2023/",
        "https://today.csuchico.edu/rawlins-theodore-greenfield/",
        "https://today.csuchico.edu/rawlins-kyle-mason/",
        "https://today.csuchico.edu/rawlins-yanetli-navarro-hernandez/",
        "https://today.csuchico.edu/rawlins-peyton-arnold/",
        "https://today.csuchico.edu/mello-distinguished-alum/",
        "https://today.csuchico.edu/rawlins-manraj-randhawa/",
        "https://today.csuchico.edu/chico-state-college-of-business-earns-aacsb-reaccreditation/",
        "https://today.csuchico.edu/rawlins-stephanie-gaito/",
        "https://today.csuchico.edu/new-bss-building-first-net-zero/",
        "https://today.csuchico.edu/2023-black-history-month/",
        "https://today.csuchico.edu/gateway-exhibit-water-journey/",
        "https://today.csuchico.edu/university-paves-way-for-alumna-in-israel/",
        "https://today.csuchico.edu/bccer-partners-native-fish-passage/",
        "https://today.csuchico.edu/stephen-perez-interim-provost/",
        "https://today.csuchico.edu/student-athlete-captures-calhope-courage-award/",
        "https://today.csuchico.edu/provost-announces-retirement/",
        "https://today.csuchico.edu/joy-of-giving-2022/",
        "https://today.csuchico.edu/mark-stemen-flc/",
        "https://today.csuchico.edu/chico-state-chief-diversity-officer/",
        "https://today.csuchico.edu/lantis-endowments-2022/",
        "https://today.csuchico.edu/basket-brigade/",
        "https://today.csuchico.edu/the-orion-wins-acp-award/",
        "https://today.csuchico.edu/debra-larson-michigan-tech-honor/",
        "https://today.csuchico.edu/princeton-review-green-school/",
        "https://today.csuchico.edu/university-farm-60th-anniversary/",
        "https://today.csuchico.edu/category/news/page/2/",
        "https://today.csuchico.edu/category/news/page/3/",
        "https://today.csuchico.edu/category/news/page/10/",
        "https://today.csuchico.edu/category/news/page/2/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}