{
    "title": "વર્ડપ્રેસ ડેશબોર્ડને જાણવું | Learn WordPress ",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tLearn\t\t\t\t\t\tWordPress\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\tTutorials\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tOnline Workshops\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tCourses\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tLesson Plans\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tContribute\t\t\t\t\t\t\t\t\n\n\nSearch for:\n\n\n\n\n\t\t\tSearch\t\t\n\n\n\n\n\n\n\n\n\n\nLearn Home,  » Tutorials,  » વર્ડપ્રેસ ડેશબોર્ડને જાણવું \n\n\n\n\n\nવર્ડપ્રેસ ડેશબોર્ડને જાણવું\n\n\n\n\n \n\n\nઆ વર્કશોપમાં, આપણે વર્ડપ્રેસ ડેશબોર્ડ સાથે પરિચય કરીશું. વર્ડપ્રેસ યાત્રા શરૂ કરવા માટે તમારે જાણવાની જરૂર છે તે બધું આપણે ટૂંકમાં જોશું.\nતમે શું શીખશો.\n\nવર્ડપ્રેસ ડેશબોર્ડ અને તેને કેવી રીતે નેવિગેટ કરવું તેથી પોતાને પરિચિત કરો.\nતમારા વર્ડપ્રેસ ડેશબોર્ડ પર દેખાતી વસ્તુઓ ને નિયંત્રિત કરો.\nપોસ્ટ  અને પેજ વચ્ચેના તફાવત પર સ્પષ્ટતા.\nતમારી મીડિયા લાઇબ્રેરીમાં મીડિયા ઉમેરો અને મેનેજ કરો.\nપોસ્ટ ટિપ્પણીઓ નિયંત્રણ કરો.\nસાઇટ એડિટર અને કસ્ટમાઇઝર વચ્ચેનો તફાવત.\nયુઝર ની ભૂમિકાઓ ઉમેરો અને નિયંત્રણ કરો.\nસમજૂતી પ્રશ્નો\nમારી સાઇટના આગળ ના દેખાવ અને વર્ડપ્રેસ ડેશબોર્ડ વચ્ચે શું તફાવત છે?\nતમે તમારી સાઇટ પર નવા વપરાશકર્તાઓ અથવા સેવા આપનારાઓને ક્યાં ઉમેરી શકો છો?\nપ્લગીન ઉપયોગ કરવાના ફાયદા શું છે?\n\nસમજણના પ્રશ્નો\n\nમારી સાઇટના ફ્રન્ટ એન્ડ અને વર્ડપ્રેસ ડેશબોર્ડ વચ્ચે શું તફાવત છે?\nતમે તમારી સાઇટ પર નવા વપરાશકર્તાઓ અથવા યોગદાનકર્તાઓને ક્યાં ઉમેરી શકો છો?\nપ્લગઇન્સનો ઉપયોગ કરવાના ફાયદા શું છે?\n\nસંદર્ભો\nUser roles and capabilities\nManaging Settings: General\nManaging Settings: Writing\nManaging Settings: Reading\nManaging Settings: Discussion\nManaging Settings: Permalinks\nManaging Settings: Privacy \nઅનુલિપિ\nવર્ડપ્રેસ શીખવા માટે આપનું સ્વાગત છે. ડેશબોર્ડથી વધુ પરિચિત થતાંની સાથે અમારી સાથે જોડાઓ. તમારી સાઇટ પર લોગ ઇન કરવા માટે, વેબ બ્રાઉઝર સર્ચ બારમાં નીચેના દાખલ કરો, તમારી વિગતો ભરો અને લોગીન પર ક્લિક કરો. એકવાર અમે ડેશબોર્ડમાં લોગીન થઈ ગયા પછી, અમે ટોચ પર એડમિન બાર જોઈ શકીએ છીએ, અને જ્યારે તમે વર્ડપ્રેસ આઇકોન પર ફરશો, ત્યારે ચાર લિંક્સ સાથેનો ગતિશીલ મેનૂ દેખાય છે. WordPress.org મુખ્ય વર્ડપ્રેસ સાઇટ પર લિંક્સ. સત્તાવાર વર્ડપ્રેસ સપોર્ટ ડોક્યુમેન્ટ સાથે ડોક્યુમેન્ટ લિંક્સ.wordpress.org ના સપોર્ટ ક્ષેત્રની સપોર્ટ લિંક્સ અને wordpress.org પર સપોર્ટ ફોરમની પ્રતિક્રિયા લિંક્સ જે વિનંતીઓ અને પ્રતિસાદને સમર્પિત છે.\nએડમિન બાર પરનું આગલું ચિહ્ન તમારી સાઇટ માટેનું હોમ આઇકોન છે અને આ પર ક્લિક કરવાથી તમે તમારી સાઇટના જાહેર-સામનો કરતા હોમપેજ પર લઈ જાઓ છો, અને જ્યારે તમે ફરીથી તેના પર ક્લિક કરો છો, ત્યારે તે તમને તમારા ડેશબોર્ડ પર લઈ જશે. પછી ત્યાં બે સૂચના ચિહ્નો છે: નવી ટિપ્પણીઓ અને અપડેટ્સ અહીં દેખાશે. હોવરિંગ ઓવર ન્યૂ પોસ્ટ્સ, મીડિયા આઇટમ્સ, પૃષ્ઠો અથવા નવા વપરાશકર્તાઓ ઉમેરવા જેવી નવી આઇટમ્સ બનાવવા માટે લિંક્સનું મેનૂ લાવે છે, અને આ સૂચિની વાસ્તવિક સામગ્રી તમારી વપરાશકર્તા ભૂમિકા પર આધારિત છે. અને એડમિન બારના જમણા ખૂણામાં બધી રીતે તમે તમારું વપરાશકર્તા નામ અને અવતાર જોશો, અને આ મેનૂમાંથી, તમારું નામ અથવા સંપાદન પ્રોફાઇલ પર ક્લિક કરીને, તે તમને સંપાદન પ્રોફાઇલ પૃષ્ઠ પર લઈ જશે. ડાર્ક ગ્રે એડમિન બારની નીચે જ બે ટેબ્સ , સ્ક્રીન વિકલ્પો ટેબ્સ અને સહાય ટેબ્સ છે. મોટાભાગના વહીવટી પૃષ્ઠો પર સ્ક્રીન વિકલ્પો ટેબ્સ દેખાય છે, અને તે તમને તે પૃષ્ઠ પર દેખાતા વસ્તુઓ નિયંત્રિત કરવાની મંજૂરી આપે છે.\nડેશબોર્ડના મુખ્ય ભાગમાં, તમને સંખ્યાબંધ વહીવટી વિજેટો અથવા પેનલ્સ મળશે, અને તમે જોયું છે કે સ્ક્રીન વિકલ્પો ટેબ્સ માં ચેકબોક્સનો ઉપયોગ કરીને આ કેવી રીતે બતાવી શકાય છે અથવા છુપાવી શકાય છે. અને જ્યાં તમે ઇચ્છો ત્યાં તેમને ખેંચીને અને છોડીને તેમની સ્થિતિ પણ બદલી શકાય છે. એક નોંધ તરીકે, આ ફક્ત વર્ડપ્રેસ ડેશબોર્ડ ગોઠવણીઓમાંથી એક છે. ડેશબોર્ડ વ્યૂ તમારી પાસે કયા પ્લગઈનો છે અને તમારી હોસ્ટિંગ કંપની છે અને તમે તેને વ્યક્તિગત રૂપે કેવી રીતે ગોઠવો છો તેના આધારે બદલાશે. ક્વિક ડ્રાફ્ટ વિજેટનો ઉપયોગ કરતી વખતે, આ ફોરમમાં દાખલ કરેલી કોઈપણ વસ્તુને ડ્રાફ્ટ પોસ્ટ તરીકે સાચવવામાં આવશે, એટલે કે, તે સાચવવામાં આવશે પરંતુ તમારી સાઇટ પર પ્રકાશિત થશે નહીં. તમે પાછા આવવા અને પછીથી સમાપ્ત કરવા માંગતા હો તે પોસ્ટ્સ માટે ઝડપી વિચારોને જોટ કરવા માટે આ ખૂબ જ સરળ છે. એક નજર વિજેટ તમને હાલમાં તમારી સાઇટ પર છે તે પૃષ્ઠો, પોસ્ટ્સ અને ટિપ્પણીઓની સંખ્યા માટે ઝડપી કુલ આપે છે. તે વર્તમાન થીમ અને વર્ડપ્રેસનું સંસ્કરણ પણ પ્રદર્શિત કરે છે જેનો તમે ઉપયોગ કરી રહ્યાં છો. પ્રવૃત્તિ તમારી તાજેતરની પોસ્ટ્સ અને ટિપ્પણીઓ બતાવે છે. અને વર્ડપ્રેસ ઇવેન્ટ્સ અને ન્યૂઝ પેનલ એ વર્ડપ્રેસ સમુદાયમાં સામેલ થવાની એક સરસ રીત છે. તમારા સ્થાનના આધારે, તમે વિવિધ વર્ડપ્રેસ સંબંધિત ઇવેન્ટ્સ અને મીટઅપ્સની સૂચિ જોશો.\nહવે એડમિન વિસ્તારમાં ફરવાની સૌથી સામાન્ય રીત ડાબી સાઇડબારમાં નેવિગેશન લિંક્સનો ઉપયોગ કરીને છે. આમાંના કેટલાકનો ઉપયોગ અન્ય કરતા વધુ વખત થાય છે, ખાસ કરીને પોસ્ટ્સ, પૃષ્ઠો અને ટિપ્પણીઓ. તે ધ્યાનમાં રાખીને, તમે જોશો કે વધુ સામગ્રી કેન્દ્રિત મેનૂ આઇટમ્સ ટોચનાં વિભાગમાં સ્થિત છે, જ્યારે કાર્યક્ષમતા, દેખાવ અને અન્ય સેટિંગ્સ પર કેન્દ્રિત મેનૂ આઇટમ્સ તળિયે નીચે એક સાથે જૂથ થયેલ છે.\nઆગળ, ચાલો પોસ્ટ્સ વિશે વાત કરીએ. પોસ્ટ્સ તે છે જે તમારા બ્લોગને બ્લોગ બનાવે છે. તે તમારા બ્લોગ પૃષ્ઠ પરની સામગ્રીના વ્યક્તિગત ટુકડાઓ છે. જ્યારે તમે કોઈ પોસ્ટ પ્રકાશિત કરો છો, ત્યારે તે સામાન્ય રીતે તમારા પોસ્ટ્સ પૃષ્ઠ પર વિપરીત ઘટનાક્રમમાં દેખાશે જેથી જ્યારે મુલાકાતીઓ તમારી સાઇટ પર આવે, ત્યારે તેઓ હંમેશાં નવીનતમ પોસ્ટ્સ સાથે રજૂ કરવામાં આવશે, અને તમે નવી સામગ્રી ઉમેરશો ત્યારે પોસ્ટ્સ સમય જતાં બદલાશે. બીજી બાજુ, પૃષ્ઠો વધુ સ્થિર સામગ્રી માટે છે. જ્યારે તમે ક્વિક એડિટ પર ક્લિક કરો છો, ત્યારે તમે ઝડપથી કેટેગરીઝ, ટેગ્સ અને અન્ય ઘણી વસ્તુઓ બદલી શકો છો. કચરાપેટી પોસ્ટને કચરાપેટીમાં ખસેડે છે, અને તમે 30 દિવસ સુધી કચરાપેટીમાં મૂકી હોય તે કંઈપણ પુન સ્થાપન કરી શકો છો. તમે બહુવિધ વસ્તુઓ પર ક્રિયાઓ કરવા માટે પોસ્ટ્સની બાજુમાં ચેકબોક્સનો ઉપયોગ કરી શકો છો. તમે તારીખ, મહિના અને વર્ષ અને કેટેગરીઝ દ્વારા પોસ્ટ્સની સૂચિ પણ ફિલ્ટર કરી શકો છો. છેલ્લે, તમે શબ્દો અથવા શબ્દસમૂહો શોધી શકો છો જે તમારી પોસ્ટ્સમાં સમાયેલ હોઈ શકે છે. આપણે મીડિયા પર નજર કરીએ તે પહેલાં, ચાલો પૃષ્ઠો વિશે વાત કરીએ. તેથી એક પૃષ્ઠ સ્થિર સામગ્રી માટે છે અને પૃષ્ઠ સામાન્ય રીતે હંમેશાં સમાન રહેશે, તેમ છતાં, પોસ્ટની જેમ, જ્યારે તમે ઇચ્છો ત્યારે તમે તેને અપડેટ કરી શકો છો. પૃષ્ઠો, પૃષ્ઠ, સંપર્ક પૃષ્ઠ અથવા તમારી સાઇટ અથવા કંપનીના ઇતિહાસ જેવી કંઈક જેવી ઉપયોગી વસ્તુઓ છે.\nમીડિયા લાઇબ્રેરીમાં તમારી બધી મીડિયા ફાઇલો, છબીઓ, ઓડીઓ ફાઇલો, એક્સેલ સ્પ્રેડશીટ્સથી પીડીએફ દસ્તાવેજો છે. તમે ગ્રીડ વ્યૂ અથવા સૂચિ દૃશ્યમાં આઇટમ્સ પ્રદર્શિત કરી શકો છો. જ્યારે તમે નવું ઉમેરો પસંદ કરો અને પસંદ કરો ફાઇલો પર ક્લિક કરો, ત્યારે તમે તમારા કમ્પ્યુટરથી મીડિયા અપલોડ કરી શકો છો, અથવા ટોચ પર બહુવિધ ફાઇલો ખેંચી અને છોડી શકો છો. મીડિયા લાઇબ્રેરી માટે એકમાત્ર બલ્ક ક્રિયા મીડિયા આઇટમ્સને કાયમી ધોરણે કાઢી નાખવાની છે.\nઆગળ, અમે ટિપ્પણીઓ વિશે વાત કરીશું. જ્યારે તમે ટિપ્પણીઓ પર ક્લિક કરો છો, ત્યારે તમે તમારી સાઇટ પરની બધી ટિપ્પણીઓની સૂચિ જોશો. જેમ જેમ તમે દરેક ટિપ્પણી પર હોવર કરો છો, ત્યારે તમે તમારા માટે ઉપલબ્ધ વિવિધ વિકલ્પો જોઈ શકો છો, જેમ કે મંજૂરી, અનપેન્ડ, જવાબ, ઝડપી સંપાદન, સંપાદન, સ્પામ અને કચરો. ડાબી બાજુ, તમે જોઈ શકો છો કે ટિપ્પણીમાં તેમના નામ, તેમના ગ્રેવાત અને તેમના ઇમેઇલ સરનામાં જેવી માહિતી છે. જ્યારે તમે તમારા કર્સરને જમણી તરફ ખસેડો છો, ત્યારે તમે પણ જોઈ શકો છો કે આ ટિપ્પણી કઈ પોસ્ટ અથવા પૃષ્ઠ પર બાકી છે. અને જમણી તરફની બધી રીતે, તમને તે તારીખ અને સમય મળશે કે ટિપ્પણી સબમિટ કરવામાં આવી હતી.\nદેખાવ વિભાગમાં, તમે તમારી સાઇટની થીમ બદલી શકો છો. જો તમે બ્લોક-આધારિત થીમનો ઉપયોગ કરી રહ્યાં છો, તો તમારી પાસે સાઇટ સંપાદકની મંજૂરી હશે, જે તમને એકંદર સાઇટ સ્ટ્રક્ચર બનાવવાની મંજૂરી આપશે. સાઇટ સંપાદક અને સંપૂર્ણ સાઇટ સંપાદન વિશે વધુ જાણવા માટે સંસાધનોની નીચેની લિંક્સ તપાસો. પરંતુ જો તમે ક્લાસિક થીમનો ઉપયોગ કરી રહ્યાં છો, તો તમારી પાસે કસ્ટમાઇઝર, વિજેટો અને તેથી આગળની મંજૂરી હશે. જ્યારે તમે પ્લગઇન્સ મેનૂ ખોલો છો અને નવું ઉમેરો પર ક્લિક કરો છો, ત્યારે તમે તમારી સાઇટ માટે પ્લગઈનો ઇન્સ્ટોલ, મેનેજ અને અનઇન્સ્ટોલ કરી શકશો. વપરાશકર્તાઓ મેનૂ આઇટમ હેઠળ, તમે તમારી સાઇટ પર વપરાશકર્તાઓનું સંચાલન કરી શકો છો. વિવિધ ભૂમિકાઓ સબ્સ્ક્રાઇબર, ફાળો આપનાર, લેખક, સંપાદક અને એડમિનિસ્ટ્રેટર છે, અને તમે નીચે આપેલા સંસાધનોથી આ ભૂમિકાઓ વિશે વધુ શીખી શકો છો. સેટિંગ્સ વિશે વધુ જાણવા માટે, સંસાધનોની નીચેની લિંક્સને પણ અનુસરો. અમે સેટિંગ્સ વર્કશોપ્સની શ્રેણી પ્રકાશિત કરી છે.\nતમે વર્ડપ્રેસ શીખવાનું અને ઉપયોગ કરવાનું પ્રારંભ કરો છો એ માટે શુભકામના. વધુ વર્કશોપ અને તાલીમ સામગ્રી માટે લર્ન વર્ડપ્રેસ ની મુલાકાત લો.\n\n\n\n\nWorkshop Details\n\n\nLength\n\n\t\t\t\t\t\t\t7 mins\t\t\t\t\t\t\n\n\nTopic\n\nGetting Started \n\n\nRelated Version\n\n6.0 \n\n\nLanguage\n\nગુજરાતી \n\n\nSubtitles\n\nEnglish, ગુજરાતી \n\n\nTranscript\n\n\n\t\t\t\t\t\t\t\tView\t\t\t\t\t\t\t\n\n\n\nPrint View\n\n\n\t\t\t\t\t\t\t\tView\t\t\t\t\t\t\t\n\n\n\n\n\n\t\t\t\tJoin a live Online Workshop\t\t\t\n\n\n\n\n\n\n\nPractise your skills on a private demo site\n\n\nSuggestions\n\nFound a typo, grammar error or outdated screenshot?\n\n\nLet us know!\n\n\n\n\n\n\n\nThis work is licensed under a Creative Commons Attribution-ShareAlike 4.0 International License.\n\n \n\n \n \n\n\nPresenters\n\n\n\n\n \n\nWes Theron\n\n\t\t\t\t\t@west7\t\t\t\t\n\n\n\n\nI am an Instructional Designer for the WordPress open-source project sponsored by Automattic. I am a strong supporter of the open-source movement. I have a background in education and content development.  I am a husband, father, dreamer and lifelong learner.\n\n\n\n\nOther Contributors\n\nRonak J Vanpariya \n\n \n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n",
    "links": [
        "#main",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Flearn.wordpress.org%2Ftutorial%2Fgu-getting-to-know-the-wordpress-dashboard%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/tutorials/",
        "https://learn.wordpress.org/online-workshops/",
        "https://learn.wordpress.org/courses/",
        "https://learn.wordpress.org/lesson-plans/",
        "https://learn.wordpress.org/contribute/",
        "https://learn.wordpress.org",
        "https://learn.wordpress.org/tutorials",
        "https://wordpress.org/support/article/roles-and-capabilities/",
        "https://learn.wordpress.org/workshop/managing-settings-general/",
        "https://learn.wordpress.org/workshop/managing-settings-writing/",
        "https://learn.wordpress.org/workshop/managing-settings-reading/",
        "https://learn.wordpress.org/workshop/managing-settings-discussion/",
        "https://learn.wordpress.org/workshop/managing-settings-permalinks/",
        "https://learn.wordpress.org/workshop/manage-settings-privacy/",
        "https://learn.wordpress.org/tutorials/?topic=14603",
        "https://learn.wordpress.org/tutorials/?wp_version=12484",
        "https://learn.wordpress.org/tutorials/?language=gu",
        "https://learn.wordpress.org/tutorials/?captions=en_US",
        "https://learn.wordpress.org/tutorials/?captions=gu",
        "#transcript",
        "#",
        "https://learn.wordpress.org/online-workshops/",
        "https://developer.wordpress.org/playground/demo/?step=playground&theme=twentytwentythree",
        "https://learn.wordpress.org/report-content-errors/",
        "http://creativecommons.org/licenses/by-sa/4.0/",
        "http://creativecommons.org/licenses/by-sa/4.0/",
        "https://profiles.wordpress.org/west7/",
        "https://profiles.wordpress.org/vanpariyar/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}