{
    "title": "Become a WordPress contributor – WordPress.org Documentation",
    "body": "\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\nDocumentationWordPress overviewAbout WordPressBecome a WordPress contributor\n\n\n\n\n\n\nForumsDevelopersGet Involved\n\n\n\n\n\n\n\n\n\nBecome a WordPress contributor\n\nSearch documentation\n\n\n\nIn this articleDocumentation\nTranslation\nWordPress Support Forum\nWordPress Chat on Slack\nWordPress Development\n\nDevelopment Planning\nTesting WordPress\nReporting Bugs\nFixing Bugs and Other Programming\n\nShow You Care\nDonating Money\n\n↑ Back to top\n\n\nThank you for contributing to the project we all love! Your participation is vital to the WordPress project.\nWordPress is a user-driven project, and all developments and enhancements depend on users like you! Please consider contributing to the project and the WordPress Community in one or more of the ways outlined below. Contributions from users like you keep the project vibrant, alive, and on the path of progress.\nWhether you’re a budding developer, a pixel-perfect designer, or just like helping out, we’re always looking for people to help make WordPress even better. Below is an overview of ways to get involved and help out. If you want to dive right in, visit https://make.wordpress.org/.\nDocumentation\nAll of the WordPress user and developer documentation has been produced by users like you and me! The many different ways in which you can volunteer your time and effort to improve the quality and scope of documentation are outlined in Documentation Contributor Handbook.\nThe slack channel #docs is the forum for discussing all issues related to documentation.\nTranslation\nTranslating WordPress describes the process of translating the WordPress software, so that people can use WordPress for blogs in languages other than English. This article tells you how to find and join the teams that are translating WordPress.\nThe slack channel #polyglots is for questions, suggestions and discussions related to translating WordPress; please feel free to join in.\nTo get involved with the Translation team, please review https://make.wordpress.org/polyglots/.\nWordPress Support Forum\nAnother valuable contribution you can make is donating some of your time to help other users of WordPress. All WordPress related support at the WordPress Support Forum is provided free of cost, and the involvement of users is essential to maintain this.\nIf you’d like to help, read visit https://make.wordpress.org/support/ for more information.\nWordPress Chat on Slack\nSlack has replaced IRC as a way to organize and get work done on WordPress. The community is vibrant, responsive, and very active. Please join us on our Slack channel and start getting involved today.\nThere is a weekly meetup of core developers in #core on Slack. Agendas, minutes, and discussion between meetups all take place on the WordPress Development Blog.\nWhile the IRC Live chat is still active, our Slack Channel is where we are getting work done. Please join us on http://chat.wordpress.org\nWordPress Development\nYou can help with the development of the WordPress software, whether or not you are a software developer.\nDevelopment Planning\nOne way to participate in WordPress development is to suggest features and participate in the development planning process. Even if you aren’t a developer, you can help build consensus and formalize proposals, boiling down long email threads and IRC logs to their essence, so that developers can quickly ascertain what the community is hoping to achieve with a particular feature.\nTesting WordPress\nAnother valuable contribution a non-developer (or developer) can make to WordPress development is to test WordPress. Before every stable release of WordPress, pre-release versions are made to enable testing. You can download the pre-releases and test them, so that the WordPress developers can fix problems before the new version is made available to the public. If you would like to get involved in this effort, join the wp-testers mailing list, where new releases are announced and discussed.\nIf you want to be on the bleeding edge of development, even before pre-release versions are put together, you can also check out the latest software from the WordPress Subversion (SVN) repository, as outlined in Using Subversion. Or, you can get the “nightly build” (which is created from the Subversion repository, and available as a zip file) at https://wordpress.org/nightly-builds/wordpress-latest.zip — almost as up-to-date as the instantaneous Subversion repository.\nIf you find bugs while testing pre-release or already-released versions of WordPress, see the section just below.\nReporting Bugs\nAnother way you can contribute to WordPress development is by reporting any problems you find with the WordPress software. The process of reporting bugs is described in Reporting Bugs — please start by reading that article. Once you have understood the bug reporting process, you can search the WordPress Trac database to see if your issue has already been reported, and if not, file a new report. Your help with reporting bugs will be highly appreciated.\nFixing Bugs and Other Programming\nIf you are a software developer, you can also help the development of WordPress by fixing problems that have been reported by you or another person in the WordPress Trac database. This process is also known as “patching”, and is described in Reporting Bugs. That article also has some suggestions on how to find bugs to fix.\nYou can also subscribe to the wp-hackers mailing list to participate in discussions regarding WordPress development. All contributions, ideas and suggestions are welcome at the mailing list. Sometimes, requests are also made on the list asking for the help of volunteers to assist in the improvement and development of specific functionality.\nIf you are not familiar with the patching process or how to use Subversion, we recommend OpenHatch Training Missions as an easy learning tool.\nOccasionally there are also bug scrubs in the #core Slack channel. They are usually announced ahead of time on the make/core blog, and more details about what a bug scrub involves is available in the core team handbook.\nYou may also be interested to read this page on How does code make it into WordPress. It details how bug fixes, code and new features are included into the next releases of WordPress.\nShow You Care\nIf you enjoy WordPress or find it to be useful, put a link to WordPress on your site. You can do this with a text link, or use one of the many WordPress logos on your site with a link to http://wordpress.org. Show you care.\nDonating Money\nThe WordPress Community exists because everyone takes part in some way, by giving their time, energy, and sometimes even money, because they believe in the valuable services WordPress provides. We invite you to join the community in whatever way you feel is appropriate, and donating money to WordPress Theme and Plugin authors and developers who give so freely of their creativity and expertise by offering their services for free to all WordPress users is a good place to start.\nIf you use a WordPress Theme or Plugin and your WordPress blog depends upon it, contact the author and find out how you can give back and support their continued efforts. It takes a lot of time and energy to create and then support Themes and Plugins, keeping them updated as WordPress changes and bugs are found. Many take donations or appreciate it when you blog about their Plugin or Theme. Others offer their Plugins and Themes as experiential portfolios– you play with it, you like it, you hire them. Most clearly indicate how they appreciate compensation for their hard work – give back to WordPress by giving back to them.\nThe more the WordPress Community supports the programmers, developers, testers, and challengers, the stronger and better WordPress becomes. Sometimes that means donating money, sometimes it means saying thank you.\nJust remember, every contribution counts, no matter what it looks like. It takes every one of us to make WordPress better.\n\n\n\n\nWas this article helpful? How could it be improved? Cancel replyLog in to submit feedback. If you need support with something that wasn't covered by this article, please post your question in the support forums. \n\n\n\nFirst published\nFebruary 17, 2019\n\n\nLast updated\nJanuary 11, 2023\n\n\n\n\n\n\n\n\n\nGet more help\nCan’t find what you need? Lean on the experience of the WordPress community.\n\n\n\nAsk questions in the support forums ↗︎\nCheck out the developer documentation ↗︎\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/documentation",
        "https://wordpress.org/documentation/overview/",
        "https://wordpress.org/documentation/category/about-wp/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/docs/",
        "#documentation",
        "#translation",
        "#wordpress-support-forum",
        "#wordpress-chat-on-slack",
        "#wordpress-development",
        "#development-planning",
        "#testing-wordpress",
        "#reporting-bugs",
        "#fixing-bugs-and-other-programming",
        "#show-you-care",
        "#donating-money",
        "#wp--skip-link--target",
        "https://make.wordpress.org/",
        "#documentation",
        "https://make.wordpress.org/docs/handbook/",
        "https://wordpress.slack.com/messages/C02RP4WU5",
        "#translation",
        "https://make.wordpress.org/polyglots/handbook/",
        "http://wordpress.slack.com/messages/polyglots/",
        "https://make.wordpress.org/polyglots/",
        "#wordpress-support-forum",
        "https://www.wordpress.org/support",
        "https://make.wordpress.org/support/",
        "#wordpress-chat-on-slack",
        "https://make.wordpress.org/chat/",
        "http://wpdevel.wordpress.com/weekly-developer-chats/",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/chat/",
        "#wordpress-development",
        "https://make.wordpress.org/",
        "#development-planning",
        "https://codex.wordpress.org/Development_Planning",
        "#testing-wordpress",
        "https://codex.wordpress.org/Mailing_Lists#Testers",
        "https://codex.wordpress.org/Using_Subversion",
        "https://wordpress.org/nightly-builds/wordpress-latest.zip",
        "#reporting-bugs",
        "https://codex.wordpress.org/Reporting_Bugs",
        "https://trac.wordpress.org/",
        "#fixing-bugs-and-other-programming",
        "https://trac.wordpress.org/",
        "https://make.wordpress.org/core/handbook/testing/reporting-bugs/",
        "https://codex.wordpress.org/Mailing_Lists#Hackers",
        "http://openhatch.org/missions/",
        "https://wordpress.slack.com/messages/core/",
        "https://make.wordpress.org/chat/",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/core/handbook/testing/bug-gardening/",
        "https://codex.wordpress.org/How_does_code_make_it_into_WordPress",
        "#show-you-care",
        "https://wordpress.org/about/logos/",
        "https://www.wordpress.org/",
        "#donating-money",
        "/documentation/article/become-a-wordpress-contributor/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fwordpress.org%2Fdocumentation%2Farticle%2Fbecome-a-wordpress-contributor%2F&locale=en_US",
        "https://wordpress.org/support/forums/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}