{
    "title": "Frequently Asked Questions | Strategic Plan | SDSU",
    "body": "\n\n\n\n\n\nskip to main content\nClose Menu\n\n\n\n\n\n\n\nSan Diego State University\n\nStrategic Plan\n\n\n\n\n\n\nDisability Services\nCampus Directory\nInformation for…\n\nFuture Students\nCurrent Students\nFaculty/Staff\nAlumni\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSan Diego State University\n\nStrategic Plan\n\n\nMenu\n\n\n\n\n\n\n\n\nFAQ\n\n\n\n\n\nSkip site navigation\n\n\n\nPlan and Process\n\n\nTimeline and Updates\n\n\nTeams\n\n\nCampus Events\n\n\nCommunications and Documents\n\n\nFAQ\n\n\n\n\nFrequently Asked Questions\n\n\n\n\n\n\nThe Strategic Planning Process\nQ: What is a strategic plan?\nA: A strategic plan is an organizational strategy and vision document. It provides\n                  a roadmap for the organization's key priorities over a period of time. SDSU’s strategic\n                  plan, to be implemented during a five-year period, from 2020 to 2025, will inform\n                  institution priority-setting and decision-making around five core themes, as indicated\n                  in the plan. Embedded in the plan are also the university’s position statements and\n                  its newly defined mission statement.\n               \nQ: Why did the university choose “We Rise We Defy” as a title for the strategic plan?\nA: The title evokes the university’s mission and charge to always seek the best solutions\n                  for its students, faculty and staff and the regional and global communities it serves.\n                  “We Rise We Defy” is a commitment to adopting sustainable and responsive solutions\n                  that serve to improve individual lives and communities. Defying expectations is also\n                  part of the university’s history. SDSU is a community of innovators, creative problem\n                  solvers and community-minded advocates of the public good. Our students, faculty and\n                  staff, working in partnership with organizations and companies across the border and\n                  around the world, are known for achievements in public health, engineering, and the\n                  arts. “We Rise We Defy” is meant to evoke the significant contributions they make\n                  while looking toward a future in which the university community will continue to innovate\n                  for the benefit of the campus, the region and the world. \n               \nQ: How were the strategic priorities selected?\nA: In September 2019, SDSU officially launched its planning process, ultimately leading\n                  to development of the “We Rise We Defy” strategic plan. All levels of the university\n                  were involved in the comprehensive, months-long effort to define the future for SDSU,\n                  SDSU Imperial Valley, SDSU Georgia, SDSU Mission Valley, SDSU Global Campus and the\n                  university’s microsite offerings. The university's planning process, as designed,\n                  represents the first comprehensive initiative around the development of a university-wide\n                  strategic plan, and was led by the Strategic Planning Steering Committee with support\n                  from nationally-recognized experts. \n               \nTo develop the strategic plan’s five priorities and the more than 50 associated activities,\n                  the university developed a number of sub-committees and working groups focused on\n                  data and assessment, mission and vision and also diversity, equity and inclusion.\n                  All planning and plan development were uniquely attentive to the University Senate\n                  resolution in support of planning for diversity, equity and inclusion (DEI), ultimately\n                  resulting in a single SDSU strategic plan in which DEI initiatives are embedded. The\n                  university’s strategic planning groups also held a series of campus events and discussion\n                  groups, accepted regular feedback from the campus and general community and reviewed\n                  historic performance data, benchmarking data and the university’s previous strategic\n                  plan and mission statement. \n               \nQ: What is the intended outcome for the strategic planning process?\nA: The university’s strategic priorities will be developed over time and through university-wide\n                  conversations that will include students, faculty and staff. As the strategic planning\n                  process is launching in September 2019, no predefined goals are limiting the process.\n                  The strategic planning process and, ultimately the decision-making process, requires\n                  broad campus participation.\n               \nAs we work together to build a long-term plan and strategy for SDSU, the university\n                  is committed to ensuring that this process is open, transparent, interactive and inclusive\n                  for all members of our campus community. Please visit this site frequently for updated\n                  information throughout the process. Also, while a great number of ideas will be shared,\n                  not all ideas will be reflected in the final plan. While not all ideals will be strategic,\n                  many ideas are important and needed throughout this process.\n               \nQ: Who is leading the strategic planning process?\nA: SDSU Provost and Senior Vice President Salvador Hector Ochoa and J. Luke Wood,\n                  SDSU Chief Diversity Officer, are co-leading the strategic planning process. Students,\n                  faculty, staff are involved in the committee and will be deeply engaged in the process\n                  in the months ahead. Ochoa and Wood are leading a team of more than three dozen students,\n                  faculty and staff broadly representing all campus divisions and colleges, and other\n                  campus units, to include Associated Students and Athletics.\n               \nQ: How were the implementation team co-chairs selected?\nA: All implementation team members were identified by either the University Senate,\n                  Associated Students or campus leaders based on their individual content expertise\n                  and ability to implement the strategic plan activities to fulfill the university’s\n                  goals. Member recommendations were then shared with the Strategic Planning Executive\n                  Committee, and formal invitations to serve were then shared with individual students,\n                  faculty, staff, alumni and community members. Each had the option to accept or decline.\n                  With only a few exceptions, all agreed to commit to serve as either co-chairs or general\n                  implementation team members. \n               \nQ: What have past strategic plans at SDSU looked like?\nA: Prior to “We Rise We Defy,” the university had only led two major strategic planning\n                  efforts: “Building on Excellence”, under the leadership of then-President Elliot Hirshman,\n                  and \"Shared Vision\", which was designed specifically for SDSU's growth under the leadership\n                  of then-President Stephen Weber.\n               \nQ: Who are the university’s consultants?\nA: SDSU has hired Emeritus Consulting Group LLC as lead consultants for the process.\n                  Emeritus is partnering with AASCU-Penson Center for Professional Development to help\n                  guide the process.\n               \nThe Emeritus Consulting Group, with more than 50 years of collective experience advising\n                  organizations, will help the university to develop approaches that will enable the\n                  university to define its strategic priorities.\n               \nAASCU-Penson Center for Professional Development consultants will work with administration\n                  and key leadership teams to manage and oversee the strategic planning process. The\n                  team will also consult on identifying and creating avenues for the success of students,\n                  faculty, staff and the overall organization. The team is comprised of former college\n                  and university presidents and chancellors who support campuses nationwide on efforts\n                  related to strategic planning, leadership assessment, organizational and board development,\n                  academic planning, financial and administrative evaluations, fundraising and other\n                  areas.\n               \nQ: Why did the university hire consultants?\nA: SDSU is committed to a strategic planning process that is both dynamic and transformative,\n                  with input from all levels of the university. This is not meant to be a process fully\n                  lead by campus leadership or administration. For these reasons, SDSU is drawing on\n                  expertise from within and outside of the organization to develop a contemporary and\n                  forward-looking planning process that will help to generate broad and deep campus\n                  engagement.\n               \nThe consultant team members are affiliated with Emeritus Consulting Group LLC and\n                  AASCU-Penson Center for Professional Development. The role of both teams is to provide\n                  objective third-party perspective and to support the SDSU Strategic Planning Steering\n                  Committee to create an inclusive, university-wide plan and approach that will generate\n                  ideas and action plans responsive to the needs and concerns of the SDSU community.\n                  The consultants, who bring decades of experience and expertise within and outside\n                  of the higher education sector and a level of impartiality, will help ensure that\n                  the university allows every member of the campus community to be involved in the strategic\n                  planning process. The involvement of consultants also helps support the university’s\n                  strategic planning process in a way that reduces workload for the students, faculty,\n                  staff and administrators involved in the planning process.\n               \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5500 Campanile DriveSan Diego, CA 92182\n619-594-5200\n\n\n\n\n\n\n\n\nA-Z Index\n\n\nCampus Directory\n\n\nMaps\n\n\nParking\n\n\n\n\n\n\nEmployment\n\n\nMedia Relations\n\n\nGive to SDSU\n\n\nCanvas\n\n\n\n\n\n\nGeneral Contact\n\n\nNetwork Status\n\n\nStrategic Plan\n\n\nNewsletter Sign Up\n\n\n\n\n\n\n\n\n\n\nCopyright © 2023 San Diego State University\n\n\n\n\nRequires SDSUid\n indicates links which require an SDSUid.\n\n\n\nAccessibility\n\n\nSDSU Digital Privacy Statement\n\n\nFeedback\n\n\n\n\n \n\n\nDocument Readers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLast Updated 7/8/21\n",
    "links": [
        "#maincontent",
        "#",
        "/",
        "/strategic-plan/",
        "https://newscenter.sdsu.edu/student_affairs/sds/",
        "https://directory.sdsu.edu/",
        "#",
        "https://admissions.sdsu.edu/",
        "https://newscenter.sdsu.edu/home/currentstudents.aspx",
        "https://www.sdsu.edu/faculty-staff",
        "http://www.sdsualumni.org/",
        "https://www.facebook.com/SanDiegoState",
        "https://twitter.com/sdsu",
        "https://www.youtube.com/user/SDSUVideo",
        "https://instagram.com/sandiegostateuniversity",
        "https://communities.sdsu.edu/",
        "/",
        "/strategic-plan/",
        "#siteNavigation",
        "#post-site-nav",
        "https://www.sdsu.edu/strategic-plan/process",
        "https://www.sdsu.edu/strategic-plan/updates",
        "https://www.sdsu.edu/strategic-plan/teams",
        "https://www.sdsu.edu/strategic-plan/events",
        "https://www.sdsu.edu/strategic-plan/communications",
        "https://www.sdsu.edu/strategic-plan/faq",
        "https://www.sdsu.edu/",
        "tel:1-619-594-5200",
        "/departments/",
        "https://directory.sdsu.edu/",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/campus/parkingtrans/permits",
        "https://bfa.sdsu.edu/hr/jobs",
        "https://brand.sdsu.edu/stratcomm/media-relations",
        "https://give.sdsu.edu/",
        "https://canvas.sdsu.edu/",
        "/contact/",
        "https://status.sdsu.edu/",
        "/strategic-plan/",
        "https://www.sdsu.edu/newscenter-newsletter-signup",
        "https://it.sdsu.edu/sdsuid",
        "https://accessibility.sdsu.edu/",
        "https://sdsu.edu/digitalprivacy",
        "https://www.sdsu.edu/feedback?utm_source=www&utm_medium=web&utm_campaign=analytics",
        "https://www.sdsu.edu/document-readers",
        "https://www.facebook.com/SanDiegoState",
        "https://twitter.com/sdsu",
        "https://www.youtube.com/user/SDSUVideo",
        "https://instagram.com/sandiegostateuniversity",
        "https://communities.sdsu.edu/",
        "https://a.cms.omniupdate.com/11/?skin=sdsu&account=prod&site=www&action=de&path=/strategic-plan/faq/index.pcf"
    ]
}