{
    "title": "Mother, Son Turned Classmates Learn From Each Other - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nMother, Son Turned Classmates Learn From Each Other\n\nAlmendra Lawrence\nApril 28, 2023\n\n\n\n\n(Photos by Jason Halley / University Photographer) \n\n\n\nChico State has been a second home to countless families who’ve shared and cherished the Wildcat experience. For these families—and more than 177,000 alumni—Chico State is not just a university or campus. It is the branches of the family tree. This is one of six profiles of families who are rooted in their Wildcat connection.\nEvone LaCombe and her son, Kevin, were familiar with seeing each other at school. She worked for the Willows Unified School District while Kevin (Kinesiology, ’22) was a high school student. She also coached his 8th grade and junior varsity basketball teams, as well as his JV and varsity track teams.\nHowever, it was wholly different when the mother and son attended Chico State as undergraduates at the same time.\nKevin, 23, and Evone, 53, were overlapping kinesiology students for two semesters—an experience the duo called unique and inspiring.\n“It was an interesting experience during my final years here to see my mom on campus and taking classes,” he said. “I never saw that happening.”\nWhen Kevin enrolled at Chico State in 2018, his mom was at home after retiring for medical reasons. Thirteen years ago, Evone was diagnosed with lupus and had to be hospitalized. Once in remission and with medication, she wanted to advance the career she had to cut short.\n“I had to give up coaching and then eventually my job because of my health, but I made the decision that I wasn’t going to sit around and do nothing,” she said. “I started taking a couple of classes at Butte College, and once I finished, I transferred to Chico State and the kinesiology program because I’ve always wanted to be a PE teacher.”\nIt was amusing at times, Kevin said, running into his mom around campus, but also motivating and helpful.\nFor an online “Biomechanics” class they shared, Kevin drove from Chico to his mom’s home in Willows to study alongside her. Their approaches to the class format and material were different, but they learned things from each other during their time as classmates. While Kevin kept his camera off during online classes and was experiencing a bout of senioritis, Evone turned on her camera and was elated to be in college.\n\n\nDriven and passionate about learning, the mother of three said that when there is something she wants to achieve, she makes it happen.\nKevin said it’s impressive to see his mom restart school and thrive in her new environment. She’s “starting from scratch” and excelling in the classroom, he said. She is always networking in the department and it’s great to see people in the program are eager to help her.\n“I’m inspired by my mom,” he said. “First off, she moved up from working in the cafeteria to overseeing the nutrition program for the (Willows) School District—she leveled up in that career. Then she had to stop (working) after her illness but went on to pursue something else that she’s always wanted to do.”\nFor Evone, she often thinks about what she lost because it gives her perspective.\n“It’s a blessing to be healthy again and to be able to pursue a career in kinesiology because I couldn’t exercise for several years and that’s what I’ve always done,” she said. “When people ask me what my hobby was, it was working out.”\nBoth Kevin and Evone said they recognize that their shared college experience was rare and special, and they cherish the memories they created during their two semesters together.\nEvone distinctly remembers attending Kevin’s graduation last year. She not only experienced a surge of pride to watch her son receive his diploma, but it served as a source of inspiration to push harder to finish her own college degree.\nKevin, in turn, said he is eagerly anticipating the opportunity to cheer on his mom when it’s her turn to don her cap and gown this May.\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tAlmendra Lawrence\t\t\n\n\n\t\tAlmendra (Journalism, '11) is a bilingual content producer that helps empower and inspire audiences through storytelling. She also assists with editing and communications project management. She is a proud alumna and former editor-in-chief of The Orion.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/acarpizo/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://today.csuchico.edu/mother-son-turned-classmates-learn-from-each-other/?share=facebook",
        "https://today.csuchico.edu/mother-son-turned-classmates-learn-from-each-other/?share=twitter",
        "https://today.csuchico.edu/mother-son-turned-classmates-learn-from-each-other/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Mother%2C%20Son%20Turned%20Classmates%20Learn%20From%20Each%20Other&body=https%3A%2F%2Ftoday.csuchico.edu%2Fmother-son-turned-classmates-learn-from-each-other%2F&share=email",
        "https://today.csuchico.edu/mother-son-turned-classmates-learn-from-each-other/#print",
        "#",
        "https://today.csuchico.edu/author/acarpizo/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}