{
    "title": "Programs - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\nPrograms \n\n\n\n \nExpanded CalFresh Eligibility Brings Food Access to More Chico State Students \n\n\t\tMore Chico State students can now qualify for CalFresh benefits to access food, thanks to expanded eligibility requirements.\t\n\n\n\n\n \nPitch-Perfect Wildcats \n\n\t\tThirteen sets of siblings have donned the cardinal and white of the Wildcats, and the men's soccer program’s legacy is becoming intergenerational.\t\n\n\n\n\n \nStudents Travel, Grow, and Build Friendships Through Speech and Debate Team \n\n\t\tThe speech and debate team, which doubles as a club and a course, offers team members space to grow far beyond the competition stage. \t\n\n\n\n\n \nIn the Midst of a Successful Career of Catching Bad Guys, Military Vet  Pursues Online MBA \n\n\t\tAfter a long and successful career first in the military and then the financial industry, Rio Miner enrolled in Chico State's online MBA program to further his career and fill in the gaps in his business acumen.\t\n\n\n\n\n \nConstruction Management Student Gets Solid Start to Future \n\n\t\tSenior construction management major Mateus Avalos went from novice to leader in the program—securing three internships and helping lead community service projects in his hometown of Chico.\t\n\n\n\n\n \nNew Transport Program Provides Students Rides to Sacramento Airport During Breaks \n\n\t\tStudents leaving campus during extended breaks can sign up for Wildcat Rides, a new program shuttling students from campus to the Sacramento bus and train station and the Sacramento Airport. \t\n\n\n\n\n \nTitle IX at 50: Current Wildcat Calling Attention to Women Who Paved the Way \n\n\t\tThe legacy of Title IX at Chico State is filled with stories of inspiring women. Mia Mendoza knows many of them by heart after spending this year sharing them with Chico State’s student-athletes and fans to honor the 50th anniversary of the landmark legislation.\t\n\n\n\n\n \nKinesiology Major Finds Groove in Adapted Physical Education \n\n\t\tFrom hating PE to aspiring to change how it is taught, Drew Jones’ passion for adapted physical education has taken her on a journey of service-learning opportunities and to pursue her teaching credential.\t\n\n\n\n\n \nStudents, Faculty Embrace New Fossils from Ever-Growing ‘Miocene Zoo’ Site \n\n\t\tChico State continues to lead the way in making scientific determinations from the findings at a Northern California site.\t\n\n\n\n\n \nOffice Hours with Concrete Industry Management Professor Mohammed Albahttiti \n\n\t\tCIM Professor Mohammed Albahttiti empowers students through hands-on service-learning projects that connect theory with real-world application. \t\n\n\n\n\n \nSoccer Programs Win Big on Small Screen \n\n\t\tThe Chico State women's and men's soccer programs shine in episode four of The Rivalries, a documentary series produced for the LG Championships channel available to watch now. \t\n\n\n\n\n \nNew Study Explores Drivers of Homelessness and Impact on Public Lands \n\n\t\tJesse Engebretson’s research aims to uncover ways state and federal governments can better serve unhoused communities who are increasingly pushed out of urban areas.\t\n\n\n\n\n \nChico State Freshman Impresses Coaches on The Voice \n\n\t\tSophia Hoffman overcame a processing disorder to make it to Chico State—now she is turning heads on international television.\t\n\n\n\n\n \nStudents Embrace Trip to UAE as Moment of Cultural Education, Community \n\n\t\tA donor-funded trip to study adapted physical education and communication disorders was both educational and rewarding. \t\n\n\n\n\n \nFive Questions with Kinesiology Alumna and Adapted Physical Education Teacher Taylor Guy \n\n\t\tAs an adapted physical education teacher, kinesiology alumna Taylor Guy is passionate about making sports accessible to her students and helping them find an activity they enjoy promoting lifelong physical activity.\t\n\n\n\n\n \nIntroducing Madeline Litman: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tWhile at Chico State, Madeline Litman's work ethic, perseverance, and maturity have led to leadership roles in student clubs, a stellar academic career, and now a prestigious Rawlins Merit Scholarship.     \t\n\n\n\n\n \nDigital Media Classes Cultivate Creativity \n\n\t\tBlending stop-motion animation, film, and art, Josh Funk's digital media classes prove to be extremely popular—and fun.\t\n\n\n\n\n \nIntroducing Theodore Greenfield: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tTheodore Greenfield, a father of two and elementary school band instructor, hopes to become a high school math teacher to share his love for the subject.\t\n\n\n\n\n \n‘Living my dream’: Chico State Alumna Forges Path in Hollywood \n\n\t\tHannah Hull (Media Arts, '20) shares about her \"wild ride\" from Chico State to Hollywood, where she's been working on sets of films and television shows.\t\n\n\n\n\n \nAux Talks Strikes a Chord for Connection \n\n\t\tSing. Laugh. Dance. Connect. Experience the power of the aux cord Thursday from 2–3 p.m. in Trinity Commons. It's Aux Talks and it's a whole lot of fun!\t\n\n\n\n\n \nSchool of Education Launches Mobile Classroom Project \n\n\t\tThe SOE's newly retrofitted classroom on-the-go RV makes its first trip into the community. \t\n\n\n\n\n \nChico State Program Encourages Students to Give Back Home \n\n\t\tChico State's Giving Back Home program offers support and resources to students looking to make a difference in their hometowns. \t\n\n\n\n\n \n5 Questions with Author, Alum, and Superhero While he Sleeps, Narcippa Teague \n\n\t\tChico State graduate and former men's basketball player Narcippa Teague shares about his new children's book and new outlook on life.\t\n\n\n\n\n \nBFA Graduate Drawn to Chico State’s Art Program \n\n\t\tInspired by his culture, BFA graduate Joel Solis dedicated his culminating exhibition to Latino street vendors around Butte County. \t\n\n\n\n\n \nConcrete Industry Management Students Take the Lead on Community Service Project \n\n\t\tStudents from Chico State’s Concrete Industry Management program have managed the construction of a new parking lot at the Chico Islamic Center.\t\n\n\n\n\n \nStudent-Athlete Captures CalHOPE Courage Award \n\n\t\tGretta Kirkby, winner of the CalHOPE Courage Award, is using the opportunity to remind her peers to reach out for help if they need it. \t\n\n\n\n\n \nCan Psychedelic Drugs Treat Mental Illness? One Grad Student’s Quest to Find Out \n\n\t\tChico State graduate student Ty Weber is collecting data to research whether psychedelic drugs may be helpful in treating mental health disorders.\t\n\n\n\n\n \nUpdate: Rory Abberton Runs into the Chico State Record Books \n\n\t\tChico State cross-country runner Rory Abberton, who detailed his journey as a student-athlete for Chico State Today last week, earned his first all-American honors in his final race.\t\n\n\n\n\n \nRunning Down My Dream at Chico State \n\n\t\tChico State student-athlete Rory Abberton will run his final collegiate cross country race at Friday’s NCAA Division II Championships. He considers the path he took to get there, and those who helped along the way.\t\n\n\n\n\n \nBiology Student Among First to Research Fish’s Unusual Schooling Pattern \n\n\t\tCole Schmitt has been working with the National Systemics Laboratory and the Smithsonian Museum of Natural History, studying the vertical schooling behavior of the cutlassfish.\t\n\n\n\n\n \nA Space for Students to Practice Self-Care \n\n\t\tWith high rates of depression and anxiety among college students nationwide, Chico State has added an on-campus resource to help our Wildcats get to graduation, both healthy and happy.\t\n\n\n\n\n \nOffice Hours: Astronomer and Physics Professor Kendall Hall \n\n\t\tAstronomer and physics professor Kendall Hall is taking fear out of physics and making it fun for all.\t\n\n\n\n\n \nAhart Herbarium Rooted in Goal to Study Plants Over Time \n\n\t\tBoasting more than 125,000 dried and mounted specimens, the University’s Ahart Herbarium is the most complete repository of plant specimens from northeastern California and its collection is now available to naturalists around the globe.\t\n\n\n\n\n \n‘Latinx and Immigration’ Class Dives Deeper into Lived Experiences \n\n\t\tWith a course as relevant and impactful as \"Latinx and Immigration,\" MCGS faculty Gabby Medina Falzone is also preparing her students for their post-graduation goals.\t\n\n\n\n\n \nExhibit Honors Historically Black Sorority’s Return to Chico State \n\n\t\tThe Pi Xi chapter of Delta Sigma Theta Sorority, Inc. has returned to Chico State and was recently honored in a pop-up exhibit at the Valene L. Smith Museum of Anthropology.\t\n\n\n\n\n \nInterior Architecture Students Design Free Floor Plans for Wildfire Survivors \n\n\t\tUnder the guidance of interior architecture professor Rouben Mohiuddin, 30 design students have worked on floor plans that have now been used to build more than a dozen homes in the Camp Fire footprint.\t\n\n\n\n\n \nThree-Year, $13.4 Million Grant for School of Education Will Help Ease Future Teachers’ Financial Burdens \n\n\t\tThe School of Education has received a three-year, $13.4 million grant to help ease the financial burden of North State students working toward their goal of becoming a teacher.\t\n\n\n\n\n \nUltracold Atom Lab Attempting to Cross ‘Unreachable’ Threshold \n\n\t\tWith the ultra-high vacuum chamber up and running, the University's ultracold atom chamber is ready to cool atoms to near absolute zero so they display their true quantum nature.\t\n\n\n\n\n \nBaseball Voyage Marked by Strong Arm, Strong Voice \n\n\t\tLuke Barker’s focus has been on making it to the big leagues, but when he spotted some serious inequities, he decided to say something.\t\n\n\n\n\n \nStudent Researchers Share Insight into Summer Projects \n\n\t\tCSC² has supported nearly 300 students in undergraduate research projects across the three colleges. \t\n\n\n\nPosts navigation\n1\n2\n3\n…\n8\nNext\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/pitch-perfect-wildcats/",
        "https://today.csuchico.edu/friendships-through-speech-debate/",
        "https://today.csuchico.edu/rio-miner-online-mba/",
        "https://today.csuchico.edu/mateus-avalos/",
        "https://today.csuchico.edu/wildcat-rides/",
        "https://today.csuchico.edu/title-ix-at-50/",
        "https://today.csuchico.edu/drew-jones/",
        "https://today.csuchico.edu/students-faculty-embrace-new-fossils-from-ever-growing-miocene-zoo-site/",
        "https://today.csuchico.edu/office-hours-with-concrete-industry-management-professor-mohammed-albahttiti/",
        "https://today.csuchico.edu/soccer-programs-win-big-on-small-screen/",
        "https://today.csuchico.edu/study-homelessness-and-public-lands/",
        "https://today.csuchico.edu/sophia-hoffman-the-voice/",
        "https://today.csuchico.edu/2023-uae-trip/",
        "https://today.csuchico.edu/five-questions-with-taylor-guy/",
        "https://today.csuchico.edu/rawlins-madeline-litman/",
        "https://today.csuchico.edu/digital-media-classes/",
        "https://today.csuchico.edu/rawlins-theodore-greenfield/",
        "https://today.csuchico.edu/media-arts-hannah-hull/",
        "https://today.csuchico.edu/aux-talks/",
        "https://today.csuchico.edu/soe-mobile-classroom/",
        "https://today.csuchico.edu/giving-back-home/",
        "https://today.csuchico.edu/5-questions-with-narcippa-teague/",
        "https://today.csuchico.edu/bfa-joel-solis/",
        "https://today.csuchico.edu/cim-students-take-lead-on-community-service-project/",
        "https://today.csuchico.edu/student-athlete-captures-calhope-courage-award/",
        "https://today.csuchico.edu/psychedelics-as-therapeutics/",
        "https://today.csuchico.edu/rory-abberton-all-american/",
        "https://today.csuchico.edu/rory-abberton-chico-state/",
        "https://today.csuchico.edu/biology-student-among-first-to-research-fishs-unusual-schooling-pattern/",
        "https://today.csuchico.edu/the-well/",
        "https://today.csuchico.edu/office-hours-kendall-hall/",
        "https://today.csuchico.edu/herbarium/",
        "https://today.csuchico.edu/latinx-and-immigration/",
        "https://today.csuchico.edu/exhibit-honors-historically-black-sorority/",
        "https://today.csuchico.edu/reimagining-home-update/",
        "https://today.csuchico.edu/school-of-education-13-million-grant/",
        "https://today.csuchico.edu/ultracold-atom-lab-update/",
        "https://today.csuchico.edu/luke-barker-strong-voice/",
        "https://today.csuchico.edu/csc2-student-researchers/",
        "https://today.csuchico.edu/category/programs/page/2/",
        "https://today.csuchico.edu/category/programs/page/3/",
        "https://today.csuchico.edu/category/programs/page/8/",
        "https://today.csuchico.edu/category/programs/page/2/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}