{
    "title": "Identical Twins Follow Different Dreams - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nIdentical Twins Follow Different Dreams\n\nNeesa Sonoquie\nApril 28, 2023\n\n\n\n\n(Photos by Jason Halley / University Photographer) \n\n\n\nChico State has been a second home to countless families who’ve shared and cherished the Wildcat experience. For these families—and more than 177,000 alumni—Chico State is not just a university or campus. It is the branches of the family tree. This is one of six profiles of families who are rooted in their Wildcat connection.\nFor Vanessa and Viviana Mendoza, the decision to go to college was complicated. The twin sisters would be the first in their family to pursue higher education, and their parents were not supportive.\n“They’re a little bit traditional, in the sense that they want the woman to stay home, get married, and have kids,” said Viviana (Nutrition and Food Sciences, ’22). “But we wanted to get a college education, travel the world, and introduce a new perspective of how women should be valued and treated.”\nWhen they enrolled at Chico State as freshmen in 2017, their relationship with their parents suffered, and the sisters had to depend upon each other to get by. After a lifetime of living as a unit, they continued to share almost everything while in school—a room, a car, and finances. Without assistance from family, they worked multiple jobs and relied upon the University’s many student support programs to keep college a possibility.\n“Although I valued my parents’ beliefs and traditional values, I knew the only way to achieve the ‘American Dream’ was to be ambitious and make the scary choices that eventually led me to Chico State,” Vanessa said.\nThey still credit their father for their strong work ethic and passion for learning. He was always studying, reading, and watching documentaries, and he taught them how to read in Spanish.\n“He unconsciously instilled education in us and didn’t give us the option not to work hard—he wanted us to get ahead,” said Viviana. “As an immigrant he would never let us forget how lucky we were to have papers and to be born in the United States.”\nViviana now works on campus as a program advisor for Upward Bound—an achievement that has allowed her parents to accept that good things can come from college. They attended her graduation, and have since said that they are proud of her and Vanessa, who will be graduating in May with majors in both animal science and Spanish.\n“I think representation is important,” said Viviana. “I want to inspire other young women to pursue their dreams and show them what is possible even if you don’t have your family’s approval.”\n\n\nAs they face a future that might soon separate them, they are deeply grateful for the support they have been able to provide each other up to now. But early on, there were some growing pains. As children they were often dressed the same, expected to participate in the same activities, and referred to only as “the twins.” Consequently, they became overly dependent upon one another.\nGoing to college allowed them to develop separate identities, said Viviana, as their majors were vastly different so they rarely shared the same classroom, and they were able to make their own friends. Then, in spring of 2018, they fulfilled a long-time dream of studying abroad. A semester in Costa Rica improved their Spanish and fostered their newfound independence. They lived with different families and grew the confidence to start doing things without each other.\n“We still very much identify as twins,” said Vanessa. “But I want people to recognize that we are different people.”\nWhen asked to describe what they love about one another, both women began to tear up.\n“Vivi’s always rooting for me, and I can count on her 100% for anything,” said Vanessa. “It’s beautiful to have that with somebody.”\nViviana said that without her twin sister she may never have even graduated college, and would likely have turned out an entirely different person.\n“I was always the follower and Vanessa was the leader,” she said. “She helped me find out who I was and to be brave and experience new things.”\nThe next chapter in their educational journey is still unwritten—both women plan to attend graduate school, and Vanessa is considering moving out of state. But no matter what the future holds, their bond as twins (and Wildcats) will keep them close, they agree, as they work toward their next big dreams.\n“We’ve had to grow up fast,” said Viviana. “But having each other, near or far, has always motivated us to keep going.”\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tNeesa Sonoquie\t\t\n\n\n\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/nsonoquie/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://today.csuchico.edu/identical-twins-follow-different-dreams/?share=facebook",
        "https://today.csuchico.edu/identical-twins-follow-different-dreams/?share=twitter",
        "https://today.csuchico.edu/identical-twins-follow-different-dreams/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Identical%20Twins%20Follow%20Different%20Dreams&body=https%3A%2F%2Ftoday.csuchico.edu%2Fidentical-twins-follow-different-dreams%2F&share=email",
        "https://today.csuchico.edu/identical-twins-follow-different-dreams/#print",
        "#",
        "https://today.csuchico.edu/author/nsonoquie/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}