{
    "title": "People of WordPress: Monika Rao – WordPress News",
    "body": "\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\n\nNews\n\n\n\n\n\nCategories\n\n\n\n\nAll Posts\nAwards\n\nCommunity\n\nDesign\n\nDevelopment\n\nDocumentation\n\nEvents\n\nFeatures\n\nGeneral\n\nInterviews\n\nMeta\n\nMonth in WordPress\n\nPodcast\nReleases\n\nSecurity\n\nStore\n\nTesting\n\nUpdates\n\nWordCamp\n\n\n\n\n\n\n\n\n\n\nApril 30, 2023\n\t\t\tBy Abha Thakor\n\t\t\tin Features, General, Interviews\n\nPeople of WordPress: Monika Rao\n\n\n\n\nThis month we feature Monika Rao, a Product and Quality Assurance Manager from India. She finds contributing to the WordPress project a way to deepen her technical skills and further her web career.\nThe People of WordPress series shares inspiring stories of how people’s lives can change for the better through WordPress and its global community of contributors.\n\nMonika was born in Udaipur, in the state of Rajasthan, India. At that time, she recalls, there was some resistance to girls’ education in certain subjects. Thanks to her parents’ support and encouragement, she graduated in Computer Science Engineering. Following graduation, she went on to work for an international firm. However, she felt she wanted to work in her home area and so returned to work for a firm based in Udaipur itself.\nMonika started her career journey with WordPress in 2015, and was fascinated as she learnt more of the technology. A few years later, she moved into a  role as a WordPress Quality Analyst, enabling her to dive further into the software. \n“From that moment, I decided to make it an integral part of my ever-learning professional career,” she said.\nThe more Monika researched WordPress, the more she found it was not just a tool to simplify website building but also a platform where you could “meet new people, share your thoughts, learn from them and improve yourself through the process.”\nWhen she first started working with WordPress, she found she had many questions, ranging from what are themes and plugins to what is a WordCamp. As her knowledge grew, she knew one day she wanted to be able to contribute to both the code and the community supporting it.\nBecoming part of WordPress\nMonika started contributing to WordPress in 2015 with Theme Review. In this area, she was able to work alongside WordPress code experts and, at the same time, learn the concepts of theme development. She saw this as a great opportunity to learn and improve her development skills. \nShe was also very interested in testing from the beginning, so she started contributing to Core. Her first contribution was to the WordPress 4.7 release in 2016. She remembers the day she first saw her name in the WordPress contributor list. This encouraged her to make more contributions including to core and the community team, and each time she felt more like part of the community.\nThus inspired, Monika delved into making the software more easily available in her native Hindi language through joining other contributors to the Polyglots team. She went on to become a General Translation Editor for the Hindi language, and has continued to contribute in this area.\nMonika and other panelists at WordCamp Udaipur 2017\nAs she became involved with the WordPress community, she looked for ways of sharing it with others in her home city. In 2017 she was part of the organizing team for WordCamp Udaipur 2017 and there shared her contributing journey with others. This was her first WordCamp, and she describes the experience as ‘superb’. It enabled her to connect to both those new to WordPress and those already working with it. \n\n“It was a great moment for me speaking in front of hundreds of people and everyone cherished my journey. It inspired me to continue my contribution to other teams too.” \nMonika Rao\nShe went on to be an organizer for WordCamp Udaipur 2018 and WordCamp India 2021. She also contributes to the Meta and Theme review teams. \nContributing to WordPress software releases\n2019 was a big year for Monika. She got married and joined a new firm where she could work more on WordPress, learning about marketing and design.\nIn November 2019, the WordPress Executive Director Josepha Haden put out a call for an all-women and non-binary release squad. Monika said: “I’ve always felt that not enough women take part in WordPress, so I decided to jump in.” She took on the role of Test Lead.\n\n“It was a wonderful journey— worth every second and this was a proud moment for me when I saw my name on the WordPress Noteworthy list. You feel proud when you see your small contributions in use by 40 per cent of the web.”\nMonika Rao\nMonika was part of the notable contributors for the WordPress 5.6 release\nAs a Test Lead, her priority was ensuring the release would be stable and, more importantly, ready for production sites. To effectively manage all the testing, test scrubs were run weekly, highlighting the key testing areas to help get the entire team involved. The scrubs also played an important role in picking up tickets needing immediate resolution.Monika also continued her role in the WordPress 5.7 release, and focused more on the core software. She believes being part of the Core and Test teams is a good way to watch and learn, as well as take part in the different elements that make up a release.\n\n“Skills you have will eventually fade away unless you work on them and sharpen them. So don’t underestimate the value of any skill. It will eventually help you somehow in your career.”\nMonika Rao\nShe added: “I owe my skills and knowledge to WordPress and its lovely community. The best part about this platform is that it is free and provides ample opportunities to improve your skills and build a career. The wider WordPress community is highly supportive, and it provides numerous additional resources, such as online forums, tutorials, and meetups, to help people learn and grow. With the help of WordPress, anyone can learn how to create websites, develop plugins, and contribute to the community.”\nThis route for learning has helped Monika in choosing the direction of her career and in keeping her skills up-to-date. In October 2021, she joined a company specializing in producing WordPress plugins and services for online businesses.\nEveryone can contribute to WordPress\nMonika pictured during her travels\nMonika is determined more people, especially other women, have opportunities to contribute to open source in general. \n\n“Many people are using WordPress, but they don’t all know about contribution. Therefore, my future goal is to help people, especially women, contribute more to WordPress.”\nMonika Rao\n“When I first started contributing to WordPress, I thought that being from a testing background, I may not be able to contribute much. However, I soon realized that there are various different areas where I could easily contribute and develop my skills,” said Monika.\n“So, I would encourage anyone who is interested in contributing to WordPress to find their own area of interest, regardless of their background, be it marketing, content writing, designing, or any other field. The WordPress community welcomes contributions from people of all backgrounds and skill-sets. So, don’t hesitate to dive in and contribute in a way that suits your interests and skills.”\nShare the stories\nHelp share these stories of open source contributors and continue to grow the community. Meet more WordPressers in the People of WordPress series.\nContributors\nThanks to Monika Rao (@monikarao) for sharing her adventures in open source.\nThank you to Abha Thakor (@webcommsat) and the late Surendra Thakor (@sthakor) for interviews and writing this feature, and to Meher Bala (@meher), Chloe Bringmann (@cbringmann), Mary Baum (@marybaum) for work on photographs and review.\nThe People of WordPress series thanks Josepha Haden (@chanthaboune) and Topher DeRosia (@topher1kenobe) for their support.\n\nThis People of WordPress feature is inspired by an essay originally published on HeroPress.com, a community initiative created by Topher DeRosia. It highlights people in the WordPress community who have overcome barriers and whose stories might otherwise go unheard. #HeroPress \n\nShare this:TwitterFacebookEmailLike this:Like Loading…\n\n\n\n\n\n\nPrevious The Month in WordPress – March 2023\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fwordpress.org%2Fnews%2F2023%2F04%2Fpeople-of-wordpress-monika-rao%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/news",
        "https://wordpress.org/news/all-posts/",
        "https://wordpress.org/news/category/awards/",
        "https://wordpress.org/news/category/community/",
        "https://wordpress.org/news/category/design/",
        "https://wordpress.org/news/category/development/",
        "https://wordpress.org/news/category/documentation/",
        "https://wordpress.org/news/category/events/",
        "https://wordpress.org/news/category/features/",
        "https://wordpress.org/news/category/general/",
        "https://wordpress.org/news/category/interviews/",
        "https://wordpress.org/news/category/meta/",
        "https://wordpress.org/news/category/month-in-wordpress/",
        "https://wordpress.org/news/podcast/",
        "https://wordpress.org/news/category/releases/",
        "https://wordpress.org/news/category/security/",
        "https://wordpress.org/news/category/store/",
        "https://wordpress.org/news/category/testing/",
        "https://wordpress.org/news/category/updates/",
        "https://wordpress.org/news/category/wordcamp/",
        "https://profiles.wordpress.org/webcommsat/",
        "https://wordpress.org/news/category/features/",
        "https://wordpress.org/news/category/general/",
        "https://wordpress.org/news/category/interviews/",
        "https://udaipur.wordcamp.org/2017",
        "https://udaipur.wordcamp.org/2018/",
        "https://india.wordcamp.org/2021/",
        "https://wordpress.org/news/category/newsletter/interviews/",
        "https://profiles.wordpress.org/monikarao/",
        "https://profiles.wordpress.org/webcommsat/",
        "https://profiles.wordpress.org/sthakor/",
        "https://profiles.wordpress.org/meher/",
        "https://profiles.wordpress.org/cbringmann/",
        "https://profiles.wordpress.org/marybaum/",
        "https://profiles.wordpress.org/chanthaboune/",
        "https://profiles.wordpress.org/topher1kenobe/",
        "https://heropress.com/",
        "https://wordpress.org/news/2023/04/people-of-wordpress-monika-rao/?share=twitter",
        "https://wordpress.org/news/2023/04/people-of-wordpress-monika-rao/?share=facebook",
        "mailto:?subject=%5BShared%20Post%5D%20People%20of%20WordPress%3A%20Monika%20Rao&body=https%3A%2F%2Fwordpress.org%2Fnews%2F2023%2F04%2Fpeople-of-wordpress-monika-rao%2F&share=email",
        "https://wordpress.org/news/2023/04/the-month-in-wordpress-march-2023/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}