{
    "title": "Your Right to Know - Consumer Information | California State University, Northridge",
    "body": "\n\n\n\n\n\n\nCurrent Students\n\n\n\n\nSkip to Content\n\n\n☰\nMobile menu\n\n\n\n\nUser menu\n\nSkip to ContentAccessibilityDirectoryCalendarA to ZWebmail\n\n \n\n\n\n\nEnter the terms you wish to search for. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Portal\n          \n\n\n\n            Webmail\n          \n\n\n\n            Directory\n          \n\n\n\n            Canvas\n          \n\n\n\n\nNavigation\n\nHomeContactCatalogRegistrationGraduationAdvisingCalendarsFinancial Aid\n\n\nCurrent Students\n\nHome\nContact\nCatalog\nRegistration\nGraduation\nAdvising\nCalendars\nFinancial Aid\n\n\n\n\n\n\n\n\n\n\nYour Right to Know - Consumer Information\n\n\n\n\n\n\n\n\n\n Notice of Required DisclosuresThe Higher Education Act of 1965 (HEA), as amended by the Higher Education Opportunity Act of 2008 (HEOA), includes many disclosure and reporting requirements that are intended to assist current and prospective students and their families to access and compare information about higher education institutions. Official statutory sources in which disclosure and reporting requirements are described include:U.S. Code: Title 20, Education, Chapter 28 – Higher Education Resources and Student AssistanceU.S. Code: Title 20, Education, Chapter 31 – General Provisions Concerning EducationHigher Education Opportunity Act of 2008 (Public Law 110-315) (.pdf)In addition, the U.S. Code of Federal Regulations, Title 34, Part 668.41 - Student Assistance General Provisions mandate that a Notice of Required Disclosures be provided to all enrolled students on an annual basis and to all prospective students. Following is a list of California State University, Northridge required disclosures and summary descriptions. Upon request, a paper copy of any of these disclosures is available through the Office of Vice President for Student Affairs in Valera Hall (VH), Room 310. The request may also be submitted by emailing student.affairs@csun.edu or calling (818) 677-2391.\n \n\n    Academic Programs Leading to Licensure or Credentialing  \n\nAdmission into programs leading to licensure and credentialing does not guarantee that students will obtain a license or credential. Licensure and credentialing requirements are set by agencies that are not controlled by or affiliated with the CSU and requirements can change at any time. For example, licensure or credentialing requirements can include evidence of the right to work in the United States (e.g., social security number or taxpayer identification number) or successfully passing a criminal background check.Students are responsible for determining whether they can meet licensure or credentialing requirements. The CSU will not refund tuition, fees, or any associated costs, to students who determine subsequent to admission that they cannot meet licensure or credentialing requirements. Information concerning licensure and credentialing requirements is available from the CSUN department offering the academic program.For \"Professional Licensure Notifications,\" see the notice directly below, which is also published at California State University Accreditation and State Authorization.Notice to Students RE: Professional Licensure and CertificationCalifornia State University programs for professions that require licensure or certification are intended to prepare the student to meet California licensure and certification requirements. Admission into programs for professions that require licensure and certification does not guarantee that students will obtain a license or certificate. Licensure and certification requirements are set by agencies that are not controlled by or affiliated with the California State University and licensure and certification requirements can change at any time.The California State University has not determined whether its programs meet other states’ educational or professional requirements for licensure and certification. Students enrolled in a California State University program who are planning to pursue licensure or certification in other states are responsible for determining whether they will meet their state’s requirements for licensure or certification. This disclosure is made pursuant to 34 CFR §668.43(a)(5)(v)(C).\n\n\n    Admission to California State University, Northridge  \n\nProspective students interested in applying for admission to California State University, Northridge (CSUN) may obtain information about eligibility requirements, application filing periods and deadlines, and the application process by visiting the Prospective Students website.Select the link for your student group—freshman, transfer student, graduate student (including credential, master's and doctoral programs), student veterans and dependents, international student, or returning CSUN student. Each student page provides admission details.Resources:New Admissions and Financial Aid website (in progress)Office of Admissions, Records and Registration Contact PageStudent Outreach and Pre-Admission Services\n\n\n    Annual Campus Safety Plan Report  \n\nThe 2022 Annual Campus Safety Plan Report (PDF) is published each year by December 15 on the California State University, Northridge home page.The safety and well-being of all members of our university community are of utmost importance to California State University, Northridge (CSUN). We encourage all university community members to review our 2022 Annual Campus Safety Plan Report (PDF). By providing campus safety and security information, the report assists students, employees, and visitors with making informed decisions about individual personal safety.The \"Annual Campus Safety Plan Report\" is published in compliance with state law: California Education Code, Chapter 15.5 of the Donahoe Higher Education Act. It is a separate and distinct report from the Annual Security Report - ASR (PDF), which is required under the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act (the Clery Act). For ASR details, see the next row on this page.The 2022 Annual Campus Safety Plan Report (PDF) includes the following campus security and personal safety information:the availability and location of police & security guard personnel;methods in summoning assistance of police personnel;special safeguards for facilities or activities on campus;actions taken within the last 18 months to increase campus safety; andchanges in safety precautions on campus planned within the next 24 months.California State University campuses are required by California Education Code 67380(a)(1)(A) to compile records of all occurrences reported to campus police, campus security personnel, or campus safety authorities of, and arrests for, crimes that are committed on campus and that involve violence, hate violence, theft, destruction of property, illegal drugs, or alcohol intoxication, and to make this information available within two business days if requested by students, prospective students, employees or the media.If you wish to request crime information, please contact Erika Breazile at erika.breazile@csun.edu. You can also access the 2020 Annual Systemwide Hate Crimes Report (PDF) to the CSU Board of Trustees.A paper copy of the \"2022 Annual Campus Safety Plan Report\" is available upon request by contacting the California State University, Northridge Department of Police Services, located at 9222 Darby Avenue, Northridge, CA 91330-8282; phone (818) 677-5343; or email to erika.breazile@csun.edu.\n\n\n    Annual Clery Security Report (ASR)  \n\nPursuant to the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, CSUN makes available the most current 2022 Annual Security Report (ASR) (PDF). The ASR contains the current security and safety-related policy statements, emergency preparedness and evacuation information, crime prevention and sexual assault prevention information, and information about drug and alcohol prevention programming. The ASR also contains statistics of Clery Act crimes for California State University, Northridge (CSUN) for 2019-2021. The ASR is published annually by September 15.A paper copy of the ASR is available upon request by contacting the Department of Police Services, located at California State University, Northridge; 9222 Darby Avenue, Northridge, CA 91330-8282.Related topics on this page:Campus Security PersonnelDrug and Alcohol Abuse Prevention ProgramDrug Violations and ConsequencesFire SafetyMissing Student NotificationTitle IX Notice of NondiscriminationRelated links: California State University (CSU) Executive Order 1097 Revised August 14, 2020Rights and Options for Survivors of Sexual Misconduct (PDF)Back to Top\n\n\n    Athletic Participation Rates and Financial Support Data  \n\nEquity in Athletics Disclosure Analysis (EADA)This annual disclosure provides information on the number and gender of full-time undergraduates participating in the intercollegiate athletic competitions and on each team. Also included is the information on coaches, coach salaries, and the revenues and expenses associated with each sport. Effective June 1, 2006 additional information may be obtained from Institutional Research.To view the EADA participation rates, coaching staff and salaries, and financial support data, take these steps:Visit the Office of Postsecondary Education EADA Athletics page.Select the \"Get Data for One School\" box.On the search criteria page in the Name field, enter Northridge and select the \"Continue.\"On the results page, select the California State University-Northridge link and then \"Continue\" again to view data.Questions? Please contact the CSUN Athletics Office at (818) 677-3208.Back to Top\n\n\n    Campus Security Personnel  \n\nCampus Security PersonnelThis disclosure provides a directory of personnel for the CSUN Department of Police Services, a law enforcement agency accredited by the International Association of Campus Law Enforcement Administrators (IACLEA).Back to Top\n\n\n    College Navigator  \n\nCollege NavigatorThe College Navigator, provided by the U.S. Department of Education Institute of Education Sciences, helps prospective students find the right college. The website allows users to refine their search and export results, build a list of schools and compare them, and save their session.  Interactive features include school location maps and cost calculators. Additional resources to prepare for college and careers are also provided. All colleges and universities receiving federal financial aid are required to contribute data to the College Navigator.Back to Top \n\n\n    Completion/Graduation Rates for Student Athletes  \n\nCompletion/Graduation Rates for CSUN Student Athletes, 2020-21 (PDF)The Graduation Rates Institution Report above gives graduation information about the most recent six-year graduating class of students and student-athletes who entered as freshmen in 2014-15.This disclosure provides information on the completion or graduation rate, by race and gender within each sport, of a cohort of certificate- or degree-seeking, full-time undergraduates who received athletically-related aid and completed their program within 150% (or 6 years) of the normal time for graduation or completion.The Higher Education Act of 1998 and its 2008 reauthorization require CSUN to provide this information to a student and the student’s parents at the time the institution offers the student athletically-related student aid. Students who did not receive the disclosure should contact the CSUN Athletics Department.Questions? Please contact the CSUN Athletics Office at (818) 677-3208.Back to Top\n\n\n    Copyright Infringement  \n\nThe purpose of the University Policies and Procedures on Copyrighted Materials (PDF) document is to establish uniform policies and campus wide procedures that assure campus compliance with all state and federal laws applying to copyrighted material. This policy applies to all copyrighted materials that in any way use campus-computing resources, including unauthorized peer-to-peer file sharing.Resources:CSUN University Catalog - Civil and Criminal Penalties for Violation of Federal Copyright LawsLegal File-Sharing FAQsLegal File-Sharing ResourcesStudent Notice on Peer-to-Peer File SharingUniversity Policies and Procedures on ComputingQuestions? Please contact the Office of Information Security at (818) 677-6100.Back to Top\n\n\n    Costs and Consumer Information  \n\nThe following resources are provided to assist students and their families with calculating the likely costs of attendance:California State University (CSU) Net Price Cost Calculator - all campusesCalifornia State University, Northridge (CSUN) Net Price Cost CalculatorCost of Attendance – CSUN Financial Aid and Scholarship DepartmentThe average net price of attending CSUN — the total cost of attendance minus the average amount of federal, state/local government, or institutional grant or scholarship aid — is available on the U.S. Department of Education College Navigator website.For a helpful overview, visit Admissions - Cost and Financial Aid.Back to Top\n\n\n    Discrimination, Harassment and Retaliation  \n\nCalifornia State University, Northridge is committed to maintaining an inclusive environment in which all individuals are treated with dignity and respect.  All students have the right to participate fully in university programs and activities free from discrimination, harassment, or retaliation on the basis of a protected status (i.e., age, disability, gender, gender identity/expression, genetic information, nationality, race or ethnicity, religion, sexual orientation, and veteran or military status).CSUN’s policy and procedures regarding discrimination, harassment and retaliation against students align with systemwide CSU Executive Order 1097.Questions? Please contact the Office of Equity and Compliance at (818) 677-2077.\n\n\n    Drug and Alcohol Abuse Prevention Program (DAAPP)  \n\nThe following disclosures provide information on California State University, Northridge compliance with Title 34 C.F.R. 86 and 668.41 that require notice to all students, faculty and employees concerning its drug and alcohol abuse prevention program.Disclosures and annual notices emailed to students and employees:Disclosure for Students: DAAPP Disclosure for Students: Campus Policy; Health Risks: Where to Get Help; and PenaltiesDisclosure for Employees: Alcohol and Other Drug Information – Office of Human Resources CSUN makes available upon request the results of a biennial review of the University’s Drug and Alcohol Abuse Prevention Program that:Determines program effectiveness and implements needed changes,Determines the number of drug and alcohol-related violations and fatalities (if any) on campus or as part of campus activities that are reported to campus officials,Determines the number and type of sanctions imposed, andEnsures sanctions are consistently enforced.For the most recent biennial program review, please contact:Marianne Link, Assistant Director, Health Promotion and AdministrationKlotz Student Health CenterEmail: shcinfo@csun.edu Phone: (818) 677-3666Additional Resources:Alcohol Awareness – Department of Police ServicesCSU Executive Order 1098 – Student Conduct ProceduresDrug Awareness – Department of Police ServicesDrug Free Workplace Policy (PDF) – Office of Human ResourcesAlcohol and Other Drug Information – Office of Human ResourcesHealth Education – Alcohol, Tobacco, & Other Drugs Misuse PreventionNational College Health Assessment (NCHA) Report - Student Health Center - most recent CSUN student health dataUse of Alcohol and Illicit Drugs Policy (PDF)Back to Top\n\n\n    Emergency Management  \n\nEmergency Management at CSUNCampus guides, resources and policies regarding immediate emergency response and evacuation procedures.Questions? Please contact the Department of Police Services at (818) 677-5973.Back to Top\n\n\n    Faculty Personnel  \n\nThe faculty members of California State University, Northridge are listed in the online University Catalog:Current faculty membersEmeriti faculty membersBack to Top\n\n\n    Family Educational Rights and Privacy Act (FERPA)  \n\nThis disclosure informs students of their rights and the University's policies and procedures concerning access to and privacy of student educational records. Information on FERPA is published in the following locations:\"Student Records Administration\" at Student Affairs - Policies and ProceduresUniversity Policies & Procedures for Student Records Administration (PDF)University Catalog - Privacy Rights of Students in Education RecordsQuestions? Please contact the Office of the Vice President for Student Affairs (818) 677-2391.Back to Top\n\n\n    Financial Assistance  \n\nThis disclosure provides information on all available federal, state, local, private, and institutional financial need-based and non-need-based assistance programs.Financial Assistance Available to Students:Each link below includes student eligibility requirements:CSUN, Federal, and State GrantsLoansFederal Work-StudyPrivate Education LoansScholarship OpportunitiesFinancial Aid Planning Resources: Student Financial Aid PoliciesAward and Planning Guide - Information on payments, procedures, withdrawals, refunds and rights and responsibilitiesCost of AttendanceStudent Eligibility Requirements Criteria for Coordination of AidFactors Affecting Financial Aid EligibilityDisbursements: Method and FrequencyStudy Abroad - information on international and national student exchanges and special student groupsFederal Student Aid home pageLoan Entrance Counseling must be completed before loan funds can be released.Loan Agreement for a Subsidized/Unsubsidized Loan - Master Promissory Note Information (MPN)Loan Exit Counseling must be completed when leaving school or dropping below half-time enrollment to understand student loan obligations and to be prepared for repayment.Teacher Education Assistance for College and Higher Education (TEACH) GrantsTerms and conditions for Federal Direct LoansWithdrawal policy and return of Title IV aidCalifornia State University (CSU) \"Student Lending Code of Conduct\"The California State University \"Student Lending Code of Conduct\" is a disclosure sent annually to CSU employees who assist students with student loans. The Code of Conduct lists the employee actions that are prohibited in order to prevent any conflict of interest with an employee’s responsibilities with respect to student loans. Please note that CSU employees are not permitted to recommend a specific lender to any student. It is the student’s responsibility to research loans and lenders and to make their own decisions regarding borrowing. Read the CSU Student Lending - Code of Conduct (PDF).Questions? Please contact the Financial Aid and Scholarship Department at (818) 677-4085.Back to Top\n\n\n    Fire Safety  \n\nPursuant to the Higher Education Opportunity Act, the 2022 Annual Fire Safety Report (AFSR) (PDF) is now available for viewing. The purpose of this report is to disclose statistics for fires that occurred within California State University, Northridge (CSUN) housing facilities for 2019-2021, and to distribute fire safety policies and procedures intended to promote safety on campus.The Annual Fire Safety Report (AFSR) contains the following:Important fire safety information and procedures;Policies and rules regarding fire safety in residential housing facilities;A description of each on-campus student housing facility fire safety system and number of fire drills held during the previous calendar year; andFire statistics for incidents that occurred in on-campus residence facilities for the previous three years.A paper copy of the AFSR is available upon request by contacting the Office of Student Housing, located at 17950 Lassen St., Northridge, CA 91325, or by calling (818) 677-6116.Back to Top\n\n\n    General Information Contacts  \n\nEach of the disclosures on this web page links to relevant offices that include contact information for additional specific information and paper copies upon request. The following California State University, Northridge links may be especially helpful:Accreditation and Licensure by the Western Association of Schools and Colleges (WASC)Accreditation of the University and Its ProgramsAthleticsCampus Security - Department of Police ServicesDisability Resources and Educational ServicesEquity and Compliance OfficeFinancial Assistance - Financial AidUniversity Relations and AdvancementSee also Institutional Information for CSUN on this page.Back to Top\n\n\n    Health Center (Klotz Student Health Center)  \n\nCSUN's Klotz Student Health Center offers students free visits with experts in college health who practice Family Medicine, Pediatrics, Internal Medicine, Gynecology, Rheumatology, Neurology, Travel Medicine, and Sports Medicine. Klotz also offers specialty services in Physical Therapy, Chiropractic, Nutrition, Optometry, Acupuncture, and Sexual and Reproductive Health.  The Center has a clinical laboratory, a retail pharmacy, and an X-ray department.  The Health Promotion Department offers health promotion and education programs to maximize good health, reduce risks, and enhance wellness; and support students’ academic and professional success.ResourcesImmunization RequirementsKlotz Student Health Center - University Catalog OverviewNational College Health Assessment (NCHA) - Most recent report for CSU, Northridge Questions? Please contact the Klotz Student Health Center at (818) 677-3666.Back to Top\n\n\n    Housing - Residential Life  \n\nAnnual Clery Fire Safety Report for Student Housing (PDF)Annual Clery Security Report (ASR) (PDF)Daily Crime LogsStudent Housing Rules and RegulationsStudent Housing Safety and SecurityQuestions? Please contact Student Housing and Conference Services at (818) 677-2160.Back to Top\n\n\n    Identity Theft  \n\nThis disclosure certifies that the CSU, Northridge Financial Aid and Scholarships Department has systems to identify and resolve discrepancies in information received from different sources including the use of false identities. Suspected violators will be referred to the Inspector General of the U.S. Department of Education.Identify Theft - CSUN Department of Police ServicesBack to Top\n\n\n    Immunization  \n\nTo promote public health and safety, the California State University (CSU) has long-established immunization requirements. Under the direction of the CSU Chancellor’s Office, students must meet the immunization standards by the end of their first and/or second semesters to avoid holds on class registration.Visit Klotz Student Health Center Immunizations for additional information and updates, including:A current list of required immunizationsRequirements for students enrolled in health care fields of study or teacher education programsA tutorial on how to upload proof of immunization or immunity through CSUN’s “myHealth Patient Portal”Immunization registration hold informationResourcesUniversity Catalog - Health Screening (CSU Immunization Requirements) CSU Interim COVID-19 Vaccination Policy View Holds How-To Guide\n\n\n    Institutional Information for CSUN  \n\nThis disclosure provides general information related to CSUN including, but not limited to: cost of attendance, procedures to withdraw from school, refund policies, return of Title IV funds, academic programs, accrediting agencies, special services for students with disabilities, study abroad, and availability of employees responsible for the dissemination of this information. To request a paper copy of any disclosure, please contact the appropriate office(s) listed below.Primary Source - University Catalog:Both the current and archived University Catalog editions are available online.CSUN Profile Provides an at-a-glance snap shot of CSUN data taken at fall Census each year. Data includes enrollment characteristics, student origin, faculty and staff, majors, degrees conferred, and tuition and financial aid.Specific Information and OfficesMore specific information is available through the following links or by calling (818) 677-1200 to connect to the desired department or office.Academic Programs - Undergraduate Degrees. Contact Undergraduate Studies at (818) 677-2969Academic Programs - Graduate Degrees. Contact Graduate Studies at (818) 677-2138Accreditation: Institutional Plans for Improving Academic Programs - Contact Undergraduate Studies at (818) 677-2969 or Graduate Studies (818) 677-2138Accreditation of Individual CSUN Academic Programs by National Societies and AssociationsCareer Center - (818) 677-2878Disability Resources and Educational Services - (818) 677-2684Faculty and Administration - Contact Faculty Affairs (818) 677-2962Institutional Research - Information about CSUN's current and new students, enrollment summaries, University profiles and more.Master Plan Update 2005: Envision 2035 (PDF) - Facilities Planning Office (818) 677-2561NCOD: Deaf and Hard of Hearing Services - (818) 677-2054 V/TTYRefunds - Contact University Cash Services (818) 677-8000, option 1Student Financial Aid Refund and Repayment Requirements (Title IV Returns) – Contact the Financial Aid and Scholarship Department (818) 677-4085Study Abroad – Contact Financial Aid and Scholarships (818) 677-4085Tuition and Other Fees - Contact University Cash Services (818) 677-8000, option 1Withdrawals - Contact Admissions and Records (818) 677-3700, Undergraduate Studies (818) 677-2969, or Graduate Studies (818) 677-2138.Back to Top\n\n\n    Instructional Facilities  \n\nCurrent and prospective students and their parents can become familiar with CSUN's instructional, laboratory and physical facilities on the following websites:CSUN Campus Tours — in-person, virtual and self-guided options CSUN University Catalog — College and Department OverviewsCSUN University Library:Building and Floor MapsLearning Commons — computers, device checkout, charging lockers, study areas and rooms, regular and 3D printing, scanning, research consultation, creative maker studio, assistive technology, IT helpLibrary Tours Virtual Library Resources/ServicesUniversity Licensing Photo Gallery and select ClassroomsNew building plans include Sierra Annex, Academic Building for a New Era.Check out our Student Technology Resources!In the recent public health situation when most instruction was virtual and now as we return to in-person classes and hybrids, CSUN's Information Technology (IT) division supports students, faculty and staff with robust resources for online learning, including the Canvas learning management system. Back to Top\n\n\n    Missing Student Notification  \n\nConsistent with the Higher Education Opportunity Act of 2008 (HEOA), California State University has adopted policies and procedures for students who reside in on-campus housing and have been determined after an investigation by campus security officials to be missing for 24 hours. Among other provisions, the policy allows students residing in on-campus housing to designate a confidential contact to be notified if they are determined missing for more than 24 hours.Missing Student Notification Policy (PDF) in Department of Police Services Annual Security Report (ASR, Clery Act) (PDF)University Procedures for Responding to Reports of Missing Persons (PDF) (Student Affairs)Back to Top\n\n\n    Mission Statement  \n\nCalifornia State University, Northridge exists to enable students to realize their educational goals. The University’s first priority is to promote the welfare and intellectual progress of students. For the full text, please see CSUN Mission, Values and Vision.Back to Top\n\n\n    Placement and Post-Graduate Study  \n\nInformation on the careers, employment, and further education plans of graduates of CSUN degree and certificate programs is available on the following web pages.Job Placement of CSUN Graduates CSUN Alumni Earnings - “CSU, Northridge – Labor Market Outcomes”:For the years 1995-2005, the report analyzes:Annual alumni earnings at 2, 5 and 10 years after education exit for 6 “paths” of CSUN enrolleesEarnings by industry 5 years after education exit for CSUN bachelor’s graduates, CSUN students who did not earn a degree from any institution, and CSUN students completing graduate programsFor study methodology, sources of information and timeframe, please see CSUN Alumni Earnings and the Center for Studies in Higher Education publication YES, BUT CAN THEY EARN A LIVING? Methods for Creating an Effective System of Measuring Labor Market Outcomes in Higher Education by Richard W. Moore, Kenneth Chapman, Bettina Huber and Mark Shors – CSHE.5.13 (April 2013). Graduate and Professional Education Placement for CSUN GraduatesAnnual Survey of CSUN Graduating Seniors (2011 to present): A comprehensive survey of the immediate educational and employment plans of each year's bachelor's degree recipients during their first post-graduation year.From the survey landing page, select the appropriate tab to view:Immediate Post-Graduation Plans: graduates’ immediate plans for employment, further education, volunteer work, public service, military service and/or to raise a familyPlans for Paid Employment: graduates’ anticipated employment sector and the certainty of their plansPlans for Further Education: graduates' plans to pursue further study, the academic discipline in which further study is planned, the highest degree planned, and the certainty of their plansFor older survey findings, timeframe and methodology, please see \"Post-Graduation Plans,\" 2009 to 2013, on the CSUN by the Numbers legacy reports website.Career ResourcesCareer Center - Offers career and placement services to students during and after their enrollment.Career Placement - Request data from CSUN's Office of Institutional Resources.University Catalog - Career options are included in the academic program descriptions.Further EducationInformation on the types of graduate and professional education in which CSUN bachelor's degree recipients enroll is available at:Annual Survey - Degree Plans of CSUN Graduating Seniors (2011 to present): Graduates’ plans to pursue more education, the academic discipline in which further study is planned, the highest degree planned, and the certainty of their plansCurrent Graduate Students by College:  Headcounts for all current graduate students can be viewed at CSUN Counts - Characteristics of Current Students. This Institutional Research \"dashboard\" allows users to filter graduate student data by college, department and other characteristics for multiple years, including the most recent year.Degree Recipients: This \"Build Your Own Report\" page lets you select the parameters you want to see and filter the results by degree type, program, ethnicity, gender, GPA at exit, time to degree, honors received, and more.University Catalog - Graduate Studies - Descriptions of CSUN's post-graduate certificate, master's and doctoral degree programs of studyBack to Top\n\n\n    Required Reports: Completion/Graduation, Continuation/Retention, and Transfer-Out Rates  \n\nThe California State University, Northridge (CSUN) Office of Institutional Research provides information on student completion/graduation rates, continuation/retention rates, and transfer-out rates through the following resources:CSUN Counts > Standard Dashboards > \"Graduation Rates\"CSUN by the Numbers Legacy Reports > \"Interactive Graduation and Retention\"Build Your Own Reports - Degree RecipientsThe interactive CSUN Counts Graduation Rates report allows users to filter the data by the following parameters:Years to graduation by cohort (e.g., 6 years = 150% time)Student entry level (e.g., first-time freshman)Cohort periodCollege nameDepartment nameGenderEthnicityEthnicity groupPell Grant recipientFreshman athleteFreshman housingFreshman program (e.g., Freshman Connection, EOP, and University 100 enrollments)For more information, please contact the CSUN Office of Institutional Research.Back to Top\n\n\n    Social Security Number Use  \n\nThe University uses the Social Security numbers of students and/or parents in accordance with federal and state regulations.For more information, see the University Catalog policy Use of Social Security Number.Back to Top\n\n\n    State Law Violation Complaint Procedure  \n\nThe California State University takes very seriously complaints and concerns regarding any of its campuses. Students or student applicants who have a complaint regarding California State University, Northridge (CSUN) may present their complaint as follows:If your complaint concerns CSUN’s compliance with academic program quality and accrediting standards, you may present your complaint to the Western Association of Schools and Colleges (WASC). WASC is the agency that accredits the CSU's academic program.If your complaint concerns an alleged violation by CSUN of a state law, including laws prohibiting fraud and false advertising, you may present your claim to Dr. William Watkins, Vice President for Student Affairs and Dean of Students, who serves as the President’s designee for such matters. Dr. Watkins can be emailed at William.Watkins@csun.edu. You will be provided guidance on the appropriate campus process for addressing your particular issue.If you believe that your complaint warrants further attention after you have exhausted all the steps outlined by the president’s designee, or by WASC, you may file an appeal with the Associate Vice Chancellor, Academic Affairs at the CSU Office of the Chancellor. This procedure should not be construed to limit any right that you may have to take civil or criminal legal action to resolve your complaint.Please see also CSUN University Catalog - Student Complaint Procedure (Complaints Regarding the CSU)Back to Top\n\n\n    Student Activities  \n\nEnjoy CSUN campus life, get involved in and outside of the classroom, explore opportunities, socialize, build skills, and stay healthy through our bountiful student services and activities. Here are a few places to get started.Matadors Forward Student Life and Services - Career fairs and events, sport clubs, student government, volunteering, affinity groups, clubs (anime, gaming, international), speaker series, performing arts, and much more! Matadors Rising: Student Success ResourcesProspective Students - Explore CSUN Webinars and EventsStudent Engagement and SupportYOU@CSUN - A comprehensive, well-being platform to enhance health, happiness and academic success. Connect to peers, campus resources, opportunities and information 24/7. Succeed, Thrive, Matter! Watch the one-minute video.The University publishes campus-wide news, events, distinctions, student and faculty achievements, opportunities and student action items through electronic communications and social media such as:CSUN Today - Search or filter news and achievements by topic.CSUN Today for Students email publicationCSUN social media channels:FacebookInstagramLinkedInTwitterYouTube\n\n\n    Student Body Diversity  \n\nThe Office of Institutional Research at California State University, Northridge (CSUN) provides a series of CSUN Counts Dashboards, including tips for dashboard navigation (PDF). Currently there are three public dashboard categories:Standard DashboardsBuild Your Own ReportsRegistration ReportsThese dashboards report student body diversity in terms of gender, self-identified members of ethnic groups, Federal Pell Grant recipients, and many other characteristics, including academic program, class level, attendance status, and more.To view the characteristics of all CSUN undergraduate students as percentages:Go to Build Your Own Reports > Characteristics of All Undergraduate Students.Start by selecting what you want to see on rows and columns.Then from the “Data Type Selection” drop-down menu, choose “Percent (of Headcount).” For more information, please contact the CSUN Office of Institutional Research.\n\n\n    Teacher Preparation Programs  \n\nThe Annual Report Card on California Teacher Preparation Programs, also referred to as \"Title II\" or the \"Institutional Report Card,\" is mandated by Title II of the federal Higher Education Act to provide information on the quality of teacher preparation programs — including the teacher certification examination pass rate — to the U.S. Department of Education each year. Data for teacher preparation programs within the California State University, including Northridge, are prepared and reported by the California Commission on Teacher Credentialing (CTC) and released by October 31 each year.Visit the CTC Title II landing page for the most recent and prior year annual reports in PDF and EXCEL. The most recent reports are:Annual Report Card on California Teacher Preparation Programs for the Academic Year 2020-2021 (PDF)Annual Report Card on California Teacher Preparation Programs, 2020-2021, Appendix (EXCEL DOWNLOAD)Visit the CTC Data and Reports landing page for:CTC Title II Data Dashboards, Glossary and InstructionsApproved Institutions and Programs – Explore California State University, Northridge and other CTC-approved institutions’ profile, credential programs listing, units and time to completion, enrolled candidate demographics, completion rate, credential authorizations and more. The most recent data is available for the 2020-2021 academic year.You can also look up California State University, Northridge and other Commission-approved institutions on the CTC’s Reports by Institution page. Here you can view data for the most recent Title II report year or view data from prior academic years back to 2014-2015. For more information about CSUN's teacher preparation programs, please visit the CSUN Credential Office.Back to Top\n\n\n    Textbook Information  \n\nThe CSUN online Schedule of Classes displays, to the maximum extent practicable, the following information for each class section: textbook title, the International Standards Book Number (ISBN), and the manufacturer's suggested retail price for required and recommended textbooks and supplemental materials.Learn more with the View Textbooks in Class Search How-To Guide.Questions? Contact the CSUN Campus Store at (818) 677-2932.Back to Top\n\n\n    Title IX - Prohibiting Sexual Harassment and Sexual Violence  \n\nIn accordance with Title IX of the Education Amendments of 1972, California State University, Northridge prohibits discrimination on the basis of gender (or sex), gender identity (including transgender), gender expression or sexual orientation—as these terms are defined in CSU policy—in academic, educational, extracurricular, and intercollegiate athletic programs and activities. Title IX protects all people regardless of their gender, gender identity, gender expression or sexual orientation from gender discrimination, which includes sexual harassment and violence.The University has designated a Title IX Coordinator to monitor and oversee all Title IX compliance, and to coordinate the efforts of CSUN to comply with all applicable federal and state laws prohibiting discrimination on these bases. The campus Title IX Coordinator is available to explain and discuss the right to file a criminal complaint (for example, in cases of sexual misconduct); the university’s complaint process, including the investigation process; how confidentiality is handled; available resources, both on and off campus; and other related matters. Inquiries concerning the application of Title IX to university programs and activities may be referred to:Barrett Morris, CSUN Title IX Coordinator Office of Equity and Compliance, Valera Hall (VH), Room 285Email: equityanddiversity@csun.eduPhone: (818) 677-2077Read CSUN's policy prohibiting sex discrimination, including sexual harassment and sexual violence at: Title IX Notice of Non-Discrimination (PDF) and more about your rights and options, including how to help a survivor at: Rights and Options for Survivors of Sexual Misconduct (PDF).Additional CSUN resources:Access Title IX Training How-To GuideDepartment of Police Services - Assault ResourcesEquity and Diversity Title IX InformationUniversity Catalog - Nondiscrimination Policy and Complaint ProceduresBack to Top\n\n\n    Transfer of Credit Information  \n\nCalifornia State University, Northridge (CSUN) publishes policies for the transfer of credit to CSUN from other institutions in the University Catalog, including:Transfer Policies of CSU CampusesCredit for Work Taken at Community CollegesTransfer Work for Graduate Programs PolicyTransferable courses are those designated for baccalaureate credit by the regionally accredited college or university offering the courses and accepted as such by the campus to which the applicant seeks admission. Review the undergraduate transfer course information for the number of units that can be transferred to CSUN and used to meet degree requirements.Specific course work transferred to CSUN graduate programs is subject to the approval of the graduate coordinator of the individual academic department offering the program and the associate vice president of the Office of Graduate Studies. Read more at Transfer Work for Graduate Programs Policy.Articulation Agreements: ASSIST at www.assist.org - ASSIST shows how lower-division course credits earned at one public California college or university can be applied when transferred to another. ASSIST is the official repository of articulation agreements for California public colleges and universities.Associate Degrees for Transfer [Student Transfer Achievement Reform (STAR) Act (SB 1440)] - California Community College students who earn a verified Associate Degree for Transfer (AA-T or AS-T) in a major that has been approved by CSUN for transfer are given priority admission consideration, junior standing at admission, and the ability to complete remaining bachelor's degree requirements within 60 semester units. Read more in the \"Associate Degrees for Transfer\" section of Transfer Policies of CSU Campuses.Back to Top\n\n\n    Voter Registration  \n\nThe Office of the Secretary of State and the campuses of the California State University, including CSUN, are committed to making voter information forms and online registration available. For voter registration and information, visit the California Secretary of State Voter Registration website.CSUN students will also find a \"Voter Registration\" link by logging in to the CSUN Portal and, from the Top Tools section, selecting the SOLAR Student Center.Back to Top\n\n\n    Withdrawal from the Institution  \n\nStudents who find it necessary to cancel their registration or to withdraw from all classes after enrolling for any academic term are required to follow the University's official withdrawal procedures. Failure to follow formal procedures may result in an obligation to pay tuition and other fees, the assignment of failing grades in all courses, and the need to apply for re-admission to the University.Students withdrawing before or during the Late Registration Period of an academic term or semester should do so by using the online, self-service registration system before the deadlines published in the Registration Calendar. ResourcesWithdrawal Policies:Withdrawals - Undergraduate PolicyWithdrawals - Graduate PolicyWithdrawals - Student InitiatedWithdrawal Procedures:Change in Academic Schedule after Start of Classes (Late Changes)Precautions for Withdrawal:Effects of Withdrawal on Financial Aid and ScholarshipsPrecautions for Reducing the Number of Enrolled Units Back to Top\n\n\n\n\n\n\n\n\n\nCurrent Student Home \n\nPlan Your Degree \n\nRegister for Classes \n\nRecords & Transcripts \n\nHow-To Guides \n\nApply to Graduate \n\nStudent Forms \n\nAcademic Advising \n\nManage Your Finances \n\nResources & Services \n\nYour Right to Know - Consumer Information \n\nEnrollment Programs \n\nContact Records & Registration \n\n\n\n\n\n\n\n\n\n\n\n\n              Current Students\n            © California State University, Northridge\n    \n18111 Nordhoff Street, Northridge, CA 91330\nPhone: (818) 677-1200\n    /\n    Contact Us\n\n\n\n\nAccessibility\nEmergency Information\nUniversity Policies & Procedures\n\n\n        Title IX\n\n\n\n\n\n\nTerms and Conditions for Use\nPrivacy Policy\nDocument Reader\n\n\n\n\nCalifornia State University\n\n\n\n\n\n\n",
    "links": [
        "/",
        "/current-students",
        "#main-content",
        "#main-content",
        "https://www.csun.edu/accessibility",
        "http://www.csun.edu/peoplefinder",
        "http://www.csun.edu/calendar",
        "http://www.csun.edu/atoz/",
        "http://www.csun.edu/webmail",
        "https://auth.csun.edu/cas/login?service=https://mynorthridge.csun.edu/psp/PANRPRD/?cmd=login&languageCd=ENG",
        "http://www.csun.edu/webmail",
        "http://www.csun.edu/peoplefinder",
        "https://canvas.csun.edu/",
        "https://www.csun.edu/current-students",
        "https://www.csun.edu/current-students/contact-page",
        "https://catalog.csun.edu",
        "https://www.csun.edu/current-students/register",
        "https://www.csun.edu/current-students/graduation",
        "https://www.csun.edu/advising",
        "/current-students/calendars",
        "https://www.csun.edu/financialaid",
        "https://www.csun.edu/current-students",
        "https://www.csun.edu/current-students/contact-page",
        "https://catalog.csun.edu",
        "https://www.csun.edu/current-students/register",
        "https://www.csun.edu/current-students/graduation",
        "https://www.csun.edu/advising",
        "/current-students/calendars",
        "https://www.csun.edu/financialaid",
        "https://www.govinfo.gov/content/pkg/USCODE-2008-title20/html/USCODE-2008-title20-chap28.htm",
        "https://www.govinfo.gov/content/pkg/USCODE-2008-title20/html/USCODE-2008-title20-chap31.htm",
        "https://www.govinfo.gov/content/pkg/PLAW-110publ315/pdf/PLAW-110publ315.pdf",
        "https://www.ecfr.gov/current/title-34/subtitle-B/chapter-VI/part-668/subpart-D/section-668.41",
        "mailto:student.affairs@csun.edu",
        "https://www.csun.edu/academic",
        "https://www2.calstate.edu/csu-system/about-the-csu/accreditation",
        "https://www.federalregister.gov/documents/2019/11/01/2019-23129/student-assistance-general-provisions-the-secretarys-recognition-of-accrediting-agencies-the",
        "https://www.csun.edu/prospective-students",
        "https://www.csun.edu/admissions-financial-aid",
        "https://www.csun.edu/current-students/contact-page",
        "https://www.csun.edu/outreach",
        "https://www.csun.edu/sites/default/files/annual-campus-safety-plan.pdf",
        "https://www.csun.edu",
        "https://www.csun.edu/sites/default/files/annual-campus-safety-plan.pdf",
        "https://www.csun.edu/sites/default/files/clery-report.pdf",
        "https://www.csun.edu/sites/default/files/annual-campus-safety-plan.pdf",
        "mailto:erika.breazile@csun.edu",
        "https://www.calstate.edu/systemwide-campus-safety-security/Documents/Annual_SWReport_Hatecrimes_2020.pdf",
        "mailto:erika.breazile@csun.edu",
        "https://www.csun.edu/sites/default/files/clery-report.pdf",
        "https://calstate.policystat.com/policy/8453516/latest/",
        "https://www.csun.edu/sites/default/files/Rights%20and%20Options%20for%20Survivors.pdf",
        "#top",
        "https://www.csun.edu/institutional-research",
        "https://ope.ed.gov/athletics/",
        "http://www.gomatadors.com/sports/2015/6/22/GEN_20140101203.aspx",
        "#top",
        "https://www.csun.edu/police/department-directory",
        "#top",
        "http://nces.ed.gov/collegenavigator/",
        "https://nces.ed.gov/collegenavigator/",
        "https://nces.ed.gov/collegenavigator/",
        "#top",
        "https://web3.ncaa.org/aprsearch/public_reports/inst2021/101.pdf",
        "http://www.gomatadors.com/sports/2015/6/22/GEN_20140101203.aspx",
        "#top",
        "https://www.csun.edu/sites/default/files/500-54.pdf",
        "https://catalog.csun.edu/policies/civil-and-criminal-penalties-for-violation-of-federal-copyright-laws/",
        "https://www.csun.edu/it/file-share-faqs",
        "https://www.csun.edu/it/file-share-res",
        "https://www.csun.edu/studentaffairs/student-notice-illegal-downloading-and-peer-peer-file-sharing-copyrighted-materials",
        "https://www.csun.edu/studentaffairs/policies-and-procedures#Computing",
        "https://www.csun.edu/it/security",
        "#top",
        "https://www2.calstate.edu/attend/paying-for-college/pages/csu-costs.aspx",
        "https://www.csun.edu/financialaid/net-price-calculator",
        "https://www.csun.edu/financialaid/cost-attendance",
        "https://nces.ed.gov/collegenavigator/",
        "https://www.csun.edu/admissions-financial-aid/cost-financial-aid",
        "#top",
        "https://calstate.policystat.com/policy/10958812/latest/",
        "https://www.csun.edu/eqd",
        "https://www.csun.edu/studentaffairs/drug-and-alcohol-abuse-prevention-program-daapp-information-students",
        "https://www.csun.edu/hr/alcohol-and-other-drug-information",
        "https://www.csun.edu/shc",
        "mailto:shcinfo@csun.edu",
        "https://www.csun.edu/police/alcohol-awareness",
        "https://calstate.policystat.com/policy/8453518/latest/",
        "https://www.csun.edu/police/drug-awareness",
        "https://www.csun.edu/sites/default/files/540-50_0.pdf",
        "https://www.csun.edu/hr/alcohol-and-other-drug-information",
        "https://www.csun.edu/shc/programs-and-services",
        "https://www.csun.edu/shc/national-college-health-assessment",
        "https://www.csun.edu/sites/default/files/900-06-policy_1.pdf",
        "#top",
        "https://www.csun.edu/emergency/",
        "https://www.csun.edu/police/",
        "#top",
        "https://catalog.csun.edu/faculty/",
        "https://catalog.csun.edu/emeriti/",
        "#top",
        "https://www.csun.edu/studentaffairs/policies-and-procedures#StudentRecordsAdministration",
        "https://www.csun.edu/sites/default/files/650-30.pdf",
        "https://catalog.csun.edu/policies/privacy-rights-of-students-in-education-records/",
        "https://www.csun.edu/studentaffairs/",
        "#top",
        "https://www.csun.edu/financialaid/grants",
        "https://www.csun.edu/financialaid/loans",
        "https://www.csun.edu/financialaid/federal-work-study",
        "https://www.csun.edu/financialaid/private-education-loans",
        "https://www.csun.edu/financialaid/scholarships",
        "https://www.csun.edu/financialaid/financial-aid-process#Policies",
        "https://www.csun.edu/financialaid/award-and-planning-guide",
        "https://www.csun.edu/financialaid/cost-attendance",
        "https://www.csun.edu/financialaid/financial-aid-process#Apply",
        "https://www.csun.edu/financialaid/financial-aid-process#Coordinate",
        "https://www.csun.edu/financialaid/what-affects-my-aid",
        "https://www.csun.edu/financialaid/financial-aid-process#ReceiveAidPayment",
        "https://www.csun.edu/financialaid/study-abroad",
        "https://studentaid.gov/",
        "https://studentaid.gov/entrance-counseling/",
        "https://studentaid.gov/mpn/",
        "https://studentaid.gov/exit-counseling/",
        "https://www.csun.edu/financialaid/federal-grants",
        "https://www.csun.edu/financialaid/federal-direct-loan",
        "https://www.csun.edu/financialaid/what-affects-my-aid#WithdrawalFromTheUniversity",
        "https://www2.calstate.edu/attend/paying-for-college/financial-aid/Documents/CSU_CodeofConduct_StudentLending.pdf",
        "https://www.csun.edu/financialaid/",
        "#top",
        "https://www.csun.edu/sites/default/files/Annual-Fire-Safety-Report.pdf",
        "#top",
        "https://www.csun.edu/wasc",
        "https://catalog.csun.edu/about/accreditation/",
        "http://www.gomatadors.com/",
        "https://www.csun.edu/police/",
        "https://www.csun.edu/dres",
        "https://www.csun.edu/eqd/",
        "https://www.csun.edu/financialaid/",
        "https://www.csun.edu/advancement",
        "#top",
        "https://www.csun.edu/shc/immunizations",
        "https://catalog.csun.edu/groups/student-health-center-klotz/",
        "https://www.csun.edu/shc/national-college-health-assessment",
        "https://www.csun.edu/shc",
        "#top",
        "https://www.csun.edu/sites/default/files/Annual-Fire-Safety-Report.pdf",
        "https://www.csun.edu/sites/default/files/clery-report.pdf",
        "https://www.csun.edu/police/daily-crime-log",
        "https://www.csun.edu/housing/student-housing-rules-and-regulations",
        "https://www.csun.edu/housing/safety-and-security",
        "https://www.csun.edu/housing",
        "#top",
        "https://www.csun.edu/police/identity-theft",
        "#top",
        "https://www.csun.edu/shc/immunizations",
        "https://catalog.csun.edu/policies/health-screening-csu-immunization-requirements/",
        "https://catalog.csun.edu/policies/csu-interim-covid-19-vaccination-policy/",
        "https://www.csun.edu/current-students/view-holds",
        "https://catalog.csun.edu/",
        "https://www.csun.edu/institutional-research/csun-profiles",
        "https://catalog.csun.edu/programs/major/",
        "https://catalog.csun.edu/graduate-studies/masters/",
        "https://www.csun.edu/wasc/",
        "https://catalog.csun.edu/about/accreditation/",
        "https://www.csun.edu/career",
        "https://www.csun.edu/dres",
        "https://catalog.csun.edu/faculty/",
        "https://www.csun.edu/faculty-affairs",
        "https://www.csun.edu/institutional-research",
        "https://www.csun.edu/envision2035/master_plan/finalmasterplan.pdf",
        "https://www.csun.edu/facilities/",
        "https://www.csun.edu/ncod/",
        "https://www.csun.edu/stufin/ucs-refund-information",
        "https://www.csun.edu/financialaid/what-affects-my-aid",
        "https://www.csun.edu/financialaid/study-abroad",
        "https://www.csun.edu/stufin/tuition",
        "https://www.csun.edu/process-repository/withdrawals-administrative-and-student-initiated",
        "#top",
        "https://www.csun.edu/outreach/campus-tours",
        "https://catalog.csun.edu/about/colleges/",
        "https://library.csun.edu/About",
        "https://library.csun.edu/About/BuildingInformation",
        "https://library.csun.edu/learning-commons",
        "https://library.csun.edu/library-tours",
        "https://library.csun.edu/FindResources",
        "https://www.csun.edu/licensing",
        "https://www.csun.edu/licensing/classrooms",
        "https://csunshinetoday.csun.edu/university-news/csun-plans-spring-2022-groundbreaking-for-sierra-annex-academic-building-for-a-new-era/",
        "https://www.csun.edu/it/students",
        "https://www.csun.edu/it",
        "https://www.csun.edu/it/canvas",
        "#top",
        "https://www.csun.edu/sites/default/files/clery-report.pdf#page=67",
        "https://www.csun.edu/sites/default/files/clery-report.pdf",
        "https://www.csun.edu/sites/default/files/missing_persons_procedure.pdf",
        "#top",
        "https://www.csun.edu/president/mission",
        "#top",
        "https://www.csun.edu/institutional-research/alumni-earnings",
        "https://www.csun.edu/institutional-research/alumni-earnings",
        "https://www.cshe.berkeley.edu/publications/yes-can-they-earn-living-methods-creating-effective-system-measuring-labor-market",
        "https://www.csun.edu/counts/survey_annual_survey_of_csun_graduating_seniors.php",
        "http://irqry.csun.edu:8080/openweb/csunnumbersindex.html",
        "https://www.csun.edu/career",
        "https://catalog.csun.edu/policies/career-placement/",
        "https://catalog.csun.edu/",
        "https://www.csun.edu/counts/survey_annual_survey_of_csun_graduating_seniors.php",
        "https://www.csun.edu/counts/all_current_graduate_students.php",
        "https://www.csun.edu/counts/byor_all_degree_recipients.php",
        "https://catalog.csun.edu/graduate-studies/masters/",
        "#top",
        "https://www.csun.edu/counts/standard.php",
        "http://irqry.csun.edu:8080/openweb/csunnumbersindex.html",
        "https://www.csun.edu/counts/byor_all_degree_recipients.php",
        "https://www.csun.edu/counts/graduation-rates.php",
        "https://www.csun.edu/institutional-research",
        "#top",
        "https://catalog.csun.edu/policies/use-of-social-security-number/",
        "#top",
        "https://www.wscuc.org/resources/comments/",
        "mailto:William.Watkins@csun.edu",
        "https://catalog.csun.edu/policies/student-complaint-procedure-complaints-regarding-the-csu/",
        "#top",
        "https://www.csun.edu/sls",
        "https://www.csun.edu/matadorsrising/matadors-rising-student-success-resources",
        "https://www.csun.edu/outreach",
        "https://www.csun.edu/student-success/student-engagement-support",
        "https://www.csun.edu/youcsun",
        "http://csuntoday.csun.edu/",
        "https://csunshinetoday.csun.edu/csun-weekly-archives-students/",
        "https://www.facebook.com/calstatenorthridge",
        "https://www.instagram.com/csun_edu/",
        "https://www.linkedin.com/school/california-state-university-northridge/",
        "https://twitter.com/csunorthridge",
        "https://www.youtube.com/user/CalStateNorthridge",
        "https://www.csun.edu/counts/index.php",
        "https://www.csun.edu/sites/default/files/CSUN_counts_guide.pdf",
        "https://www.csun.edu/counts/byor_all_undergraduates_students.php",
        "https://www.csun.edu/institutional-research",
        "https://www.ctc.ca.gov/",
        "https://www.ctc.ca.gov/educator-prep/title2",
        "https://www.ctc.ca.gov/docs/default-source/commission/reports/titleii-2020-2021-annualrprt.pdf",
        "https://www.ctc.ca.gov/docs/default-source/commission/reports/titleii-2020-2021-annualrprt-appendix.xlsx",
        "https://www.ctc.ca.gov/commission/reports/default",
        "https://www.ctc.ca.gov/commission/reports/data/approved-institutions-and-programs",
        "https://www.ctc.ca.gov/commission/reports/data/reports-by-institution",
        "https://www.csun.edu/eisner-education/credential-office",
        "#top",
        "https://www.csun.edu/class-search",
        "https://www.csun.edu/current-students/find-textbooks",
        "https://www.bkstr.com/csunorthridgestore/home",
        "#top",
        "https://www.csun.edu/eqd/",
        "mailto:equityanddiversity@csun.edu",
        "https://www.csun.edu/sites/default/files/EO-1095_07082019.pdf",
        "https://www.csun.edu/sites/default/files/Rights%20and%20Options%20for%20Survivors.pdf",
        "https://www.csun.edu/current-students/access-title-ix-training",
        "https://www.csun.edu/police/assault/",
        "https://www.csun.edu/eqd/title-ix",
        "https://catalog.csun.edu/policies/nondiscrimination-policy-and-complaint-procedures/",
        "#top",
        "https://catalog.csun.edu/",
        "https://catalog.csun.edu/policies/transfer-policies-of-csu-campuses/",
        "https://catalog.csun.edu/policies/credit-for-work-taken-at-community-colleges/",
        "https://catalog.csun.edu/policies/transfer-work-for-graduate-programs/",
        "https://www.csun.edu/current-students/records-transcripts/transfer-course",
        "https://catalog.csun.edu/policies/transfer-work-for-graduate-programs/",
        "https://assist.org/",
        "https://www.csun.edu/prospective-students/apply-associate-degree-transfer-student",
        "https://catalog.csun.edu/policies/transfer-policies-of-csu-campuses/",
        "#top",
        "http://www.sos.ca.gov/elections/voter-registration/",
        "#top",
        "https://www.csun.edu/current-students/registration-calendar",
        "https://catalog.csun.edu/policies/withdrawals-undergraduate-policy/",
        "https://catalog.csun.edu/policies/withdrawals-graduate-policy/",
        "https://www.csun.edu/process-repository/withdrawals-administrative-and-student-initiated",
        "https://www.csun.edu/current-students/register/late-register",
        "https://www.csun.edu/financialaid/what-affects-my-aid",
        "https://www.csun.edu/current-students/register/late-register/change-deadlines",
        "#top",
        "https://www.csun.edu/current-students",
        "https://www.csun.edu/current-students/plan-your-degree",
        "https://www.csun.edu/current-students/register",
        "https://www.csun.edu/current-students/records-transcripts",
        "https://www.csun.edu/current-students/how-guides",
        "https://www.csun.edu/current-students/graduation",
        "https://www.csun.edu/current-students/forms",
        "https://www.csun.edu/current-students/advising",
        "https://www.csun.edu/current-students/finances",
        "https://www.csun.edu/current-students/resources-services",
        "https://www.csun.edu/current-students/your-right-to-know",
        "https://www.csun.edu/current-students/enrollment-programs",
        "https://www.csun.edu/current-students/contact-page",
        "tel:+18186771200",
        "https://www.csun.edu/contact",
        "https://www.csun.edu/accessibility",
        "https://www.csun.edu/emergency/",
        "https://www.csun.edu/afvp/university-policies-procedures/",
        "https://www.csun.edu/eqd/title-ix-gender-equity-and-sexual-misconduct",
        "https://www.csun.edu/sites/default/files/900-12.pdf",
        "/it/privacy",
        "/it/document-viewers",
        "https://www.calstate.edu/"
    ]
}