{
    "title": "Dropbox.com",
    "body": " Skip to main contentWhy Dropbox?OverviewGet inspiredWhat customers sayApp integrationsResourcesBetter with DropboxShare filesStore and organizeSync your devicesProtect and secure dataConnect remote teamsKeep work movingAlways-on backupSign a documentTrack document analyticsProductsDo more than store with DropboxDropboxStore, share, and access files across devicesBackupAutomatically back up your devicesSignRequest and add signatures to documentsDocSendSend documents securely and track activityCaptureCreate screen recordings and video messagesReplayReview and approve videos fasterAdvance accessPreview new product experiencesSolutionsRolesCreatives SalesMarketingHRITTeam LeadPersonalIndustriesConstructionTechnologyManufacturingMediaPricingContactSupportHelp centerCommunity forumsContact salesEmail800-620-5395Get appDesktop appMobile appSign upLoginGet startedWhy Dropbox?OverviewGet inspiredWhat customers sayApp integrationsResourcesBetter with DropboxShare filesStore and organizeSync your devicesProtect and secure dataConnect remote teamsKeep work movingAlways-on backupSign a documentTrack document analyticsProductsDo more than store with DropboxDropboxStore, share, and access files across devicesBackupAutomatically back up your devicesSignRequest and add signatures to documentsDocSendSend documents securely and track activityCaptureCreate screen recordings and video messagesReplayReview and approve videos fasterAdvance accessPreview new product experiencesSolutionsRolesCreatives SalesMarketingHRITTeam LeadPersonalIndustriesConstructionTechnologyManufacturingMediaPricingContactSupportHelp centerCommunity forumsContact salesEmail800-620-5395Get appDesktop appMobile appGet startedJoin over 700 million registered users who trust DropboxEasy to use, reliable, private, and secure. It’s no wonder Dropbox is the choice for storing and sharing your most important files.Find your planSee what sets Dropbox apartYour files, not oursWith Dropbox, your files belong to you, not us, so you can be sure we’re not reselling your data.All your files in one placeStore computer backups, photo libraries, thousands of documents—all your files, in the same place. One-of-a-kind functionalityStore files as large as 2 TB each, sync at light speed, and allow anyone to preview nearly 200 file types.Ease of use and security2/3 of surveyed users say Dropbox keeps their files more secure and we’re a leader in ease of use.A set of products to help you do moreDropboxSecurely store, organize, and share all your files.      Learn moreSignStreamline your document workflows with legally-binding eSignatures.Learn moreDocSendSecurely share your documents with real-time insights, so you know what's most impactful.Learn moreBackupAutomatically back up important files on your devices to the cloud and easily restore them.Learn moreCaptureGet your message across with screenshots, GIFs, or videos recorded right on your screen.Learn moreTransferQuickly and securely deliver large files—up to 100 GB—to anyone.    Learn morePaperCreate collaborative documents to coordinate work and drive projects forward.Learn morePasswordsAutomatically store unlimited passwords in one central, secure place.Learn moreWhat else can Dropbox help you do?Dropbox brings everything—traditional files, cloud content, and web shortcuts—together in one place.Get 2 GB of cloud storage for free with Dropbox BasicSave and access your files from any device, and share them with anyone. Discover what Dropbox can do for you- get a free account, no strings attached!Learn moreDropbox Plus has room for all your content with space to spare Safeguard your photos, personal docs, work files, and much more. Save everything with 2,000 GB of space—and get some handy tools to help you stay organized.Learn moreDropbox Family is a place for everyone with space for everythingShare 2,000 GB of storage between 6 people. Each family plan member gets their own private Dropbox account for less than the price of two Plus plans.Learn moreMake life easier for you and your clients with Dropbox ProfessionalGet our full suite of premium productivity and sharing tools—plus 3,000 GB of space. Dropbox Professional makes it easier for you to work with colleagues and clients.Learn moreStreamline your document workflow with Dropbox SignSave yourself time and hassle with Dropbox Sign. You can sign legally-binding agreements with a few clicks. And it's just as easy to request a signature from someone else.Learn moreCentralize, secure, and easily access your work with Dropbox StandardSafeguard sensitive and confidential info. Automate time-consuming processes with powerful admin and collaboration tools. And easily recover your work if something ever goes wrong. Minimum 3 users per plan.Learn moreDocSend lets you track, analyze, and optimize your contentSafely share business-critical documents and get real-time performance insights. DocSend helps you manage and optimize your company’s most important content.Learn moreProactively detect threats to your team’s content with Dropbox AdvancedAlways-on security monitoring and alerts. Extended 1-year version history and file recovery. Plus all the storage space you need. Dropbox Advanced is a secure collaboration solution for your entire team. Minimum 3 users per plan.Learn moreHow will you use Dropbox?For WorkWork efficiently with teammates and clients, stay in sync on projects, and keep company data safe—all in one place.Get Dropbox for workFor personal useKeep everything that’s important to you and your family shareable and safe in one place. Back up files in the cloud, share photos and videos, and more.Get Dropbox for personal useGet more out of Dropbox by connecting with the tools you loveLearn more about partner integrationsZoomEnhance remote collaboration with Zoom instant meetings and video recordings.SlackBring Slack conversations and Dropbox content together to keep teams in sync.Adobe Creative CloudEasily and securely send files to clients and vendors from within Adobe Photoshop.Microsoft OfficeEasily access, edit, and share Office docs online in Dropbox.Google WorkspaceCreate, edit, and share Google Docs, Sheets, and Slides in Dropbox.TrelloCollaborate on team projects in Trello with Dropbox content.CanvasUpload course files or assignments straight from Dropbox to Canvas.AsanaTrack all of your team’s work with Asana while keeping Dropbox content alongside.Trusted by over 700 million registered users and 600,000 teamsView more customer stories“Dropbox has been tremendously helpful for social media. I can hop on anytime and pull whatever photo is inspiring me to post.”Read the full storyMary Ashley Krogh (MAK), Illustrator and Graphic Designer“Dropbox increased our team’s collaboration while working from home, which has increased our flexibility and could revolutionize our office culture.”Read the full storyAdam Montgomery, Senior Manager of Programming, Sundance Film Festival“We’re a grass-roots nonprofit. When we use a tool that the rest of the design world uses, it helps professionalize our organization.”Read the full storyAnn Kappes, Director of Art Partnerships at Creativity Explored“Dropbox easily allows me to transfer what’s in my mind to another person.”Read the full storyMurray Bell, Founder and Executive Creative Director of Semi Permanent“Our team is working remotely—everyone's in a different time zone. Dropbox is a great hub for us to all work at once and seamlessly share files.”Read the full storySophia Chang, Illustrator and Designer“Dropbox version control is very important. You may want to go back to an earlier version because there's an idea in there that you really like.”Read the full storySahir Zaveri, CEO of King Children“Creative growth happens when you don’t have to worry about managing storage.”Read the full storyAndi Scull, Founder and Creative Director, HOPE Organization01/07For all things worth sharing.Refer a friendDropboxDesktop appMobile appIntegrationsFeaturesSolutionsDo more than storeSecurityAdvance accessProductsPlusProfessionalBusinessEnterpriseDropbox SignDocSendPlansProduct updatesSupportHelp centerContact usPrivacy & termsCookie policyCookies & CCPA preferencesSitemapLearning resourcesCommunityBlogDevelopersCommunity forumsReferralsReseller partnersIntegration partnersCompanyAbout usJobsInvestor relationsESGFind a partner  ",
    "links": [
        "#main-content",
        "/",
        "https://experience.dropbox.com",
        "https://experience.dropbox.com/customer-stories",
        "https://www.dropbox.com/app-integrations",
        "https://experience.dropbox.com/resources",
        "https://www.dropbox.com/features/share",
        "https://www.dropbox.com/features/cloud-storage",
        "https://www.dropbox.com/features/sync",
        "https://www.dropbox.com/features/security",
        "https://www.dropbox.com/features/content-collaboration",
        "https://www.dropbox.com/features/productivity",
        "https://www.dropbox.com/backup",
        "https://www.dropbox.com/features/productivity/sign-a-document-online",
        "/docsend",
        "https://www.dropbox.com/dropbox",
        "https://www.dropbox.com/backup",
        "https://www.dropbox.com/hellosign",
        "/docsend",
        "https://www.dropbox.com/capture?_tk=nav",
        "https://www.dropbox.com/replay",
        "https://www.dropbox.com/advance-access",
        "https://experience.dropbox.com/roles/creatives",
        "https://experience.dropbox.com/roles/sales",
        "https://experience.dropbox.com/roles/marketing",
        "https://experience.dropbox.com/roles/human-resources",
        "https://experience.dropbox.com/roles/itdm",
        "https://experience.dropbox.com/roles/team-leads",
        "https://experience.dropbox.com/roles/personal",
        "https://www.dropbox.com/business/solutions/construction",
        "https://www.dropbox.com/business/solutions/technology",
        "https://www.dropbox.com/business/solutions/manufacturing",
        "https://www.dropbox.com/business/solutions/media",
        "/plans",
        "https://help.dropbox.com/",
        "https://www.dropboxforum.com/",
        "https://experience.dropbox.com/contact",
        "tel:8006205395",
        "https://www.dropbox.com/desktop",
        "https://www.dropbox.com/mobile",
        "/register",
        "/login",
        "/plans",
        "https://experience.dropbox.com",
        "https://experience.dropbox.com/customer-stories",
        "https://www.dropbox.com/app-integrations",
        "https://experience.dropbox.com/resources",
        "https://www.dropbox.com/features/share",
        "https://www.dropbox.com/features/cloud-storage",
        "https://www.dropbox.com/features/sync",
        "https://www.dropbox.com/features/security",
        "https://www.dropbox.com/features/content-collaboration",
        "https://www.dropbox.com/features/productivity",
        "https://www.dropbox.com/backup",
        "https://www.dropbox.com/features/productivity/sign-a-document-online",
        "/docsend",
        "https://www.dropbox.com/dropbox",
        "https://www.dropbox.com/backup",
        "https://www.dropbox.com/hellosign",
        "/docsend",
        "https://www.dropbox.com/capture?_tk=nav",
        "https://www.dropbox.com/replay",
        "https://www.dropbox.com/advance-access",
        "https://experience.dropbox.com/roles/creatives",
        "https://experience.dropbox.com/roles/sales",
        "https://experience.dropbox.com/roles/marketing",
        "https://experience.dropbox.com/roles/human-resources",
        "https://experience.dropbox.com/roles/itdm",
        "https://experience.dropbox.com/roles/team-leads",
        "https://experience.dropbox.com/roles/personal",
        "https://www.dropbox.com/business/solutions/construction",
        "https://www.dropbox.com/business/solutions/technology",
        "https://www.dropbox.com/business/solutions/manufacturing",
        "https://www.dropbox.com/business/solutions/media",
        "/plans",
        "https://help.dropbox.com/",
        "https://www.dropboxforum.com/",
        "https://experience.dropbox.com/contact",
        "tel:8006205395",
        "https://www.dropbox.com/desktop",
        "https://www.dropbox.com/mobile",
        "/plans",
        "https://www.dropbox.com/plans",
        "https://www.dropbox.com/dropbox",
        "https://www.hellosign.com/",
        "https://www.docsend.com/",
        "https://www.dropbox.com/backup",
        "https://www.dropbox.com/capture",
        "https://www.dropbox.com/transfer/about",
        "https://www.dropbox.com/paper/guide",
        "https://www.dropbox.com/features/security/passwords",
        "https://www.dropbox.com/basic",
        "https://www.dropbox.com/plus",
        "https://www.dropbox.com/family",
        "https://www.dropbox.com/pro",
        "https://www.dropbox.com/hellosign",
        "https://www.dropbox.com/business",
        "https://www.docsend.com/dropbox-integration/?utm_source=dropbox%20referral&utm_medium=referral&utm_campaign=hp-jtbd&signup_source=hp-jtbd",
        "https://www.dropbox.com/business",
        "https://www.dropbox.com/business",
        "https://www.dropbox.com/individual",
        "https://www.dropbox.com/app-integrations",
        "https://www.dropbox.com/business/customers",
        "https://experience.dropbox.com/resources/bound-for-nowhere-customer-story",
        "https://experience.dropbox.com/resources/sundance-success-story",
        "https://experience.dropbox.com/resources/creativity-explored-customer-story",
        "https://experience.dropbox.com/resources/semi-permanent-success-story",
        "https://experience.dropbox.com/drop-in-video-series/sophia-chang",
        "https://experience.dropbox.com/drop-in-video-series/king-children",
        "https://experience.dropbox.com/resources/hope-gallery-success-story",
        "https://www.dropbox.com/refer",
        "/desktop",
        "/mobile?trigger=on",
        "/app-integrations",
        "/features",
        "/business/solutions",
        "https://experience.dropbox.com",
        "/features/security",
        "/advance-access",
        "/plus",
        "/pro",
        "/business",
        "/enterprise",
        "https://www.hellosign.com?utm_source=dropbox&utm_medium=referral&utm_campaign=global_footer",
        "https://www.docsend.com/?utm_medium=Referral&utm_source=Dropbox%20Web%20Referral&utm_campaign=dbx-footer",
        "/plans?trigger=nr",
        "/product-updates",
        "https://help.dropbox.com/",
        "/contact",
        "/terms",
        "https://help.dropbox.com/accounts-billing/security/cookies",
        "#manage-cookies",
        "https://experience.dropbox.com/sitemap",
        "https://learn.dropbox.com",
        "https://blog.dropbox.com/",
        "https://www.dropbox.com/developers",
        "https://www.dropboxforum.com/",
        "/referrals",
        "https://www.dropbox.com/business/partners",
        "https://www.dropbox.com/app-integrations",
        "/about",
        "/jobs",
        "https://investors.dropbox.com/",
        "/esg",
        "https://experience.dropbox.com/partner-locator",
        "https://twitter.com/Dropbox",
        "https://www.facebook.com/Dropbox/",
        "https://www.youtube.com/user/dropbox"
    ]
}