{
    "title": "FSE Program Exploration: Build a block theme – Make WordPress Test",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Test\n\n\nTriage & Testing Issues\nHandbook\nGlossary\n \n\n\n\nHide welcome box\n\n\n\n\nThe Test Team helps manage testing and triage across the WordPress ecosystem. They focus on user testing of the editing experience and WordPress dashboard, replicating and documenting bug reports, and supporting a culture of review and triage across the project.\nIf you’d like to help test Full Site Editing, please join the FSE Outreach Program. You can find current calls for testing for this program here and you can join the fun in #fse-outreach-experiment.\n\n\nThe team gathers in #core-test. Please drop by any time with questions or to help out.Login to Reply\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nannezazu\n\n7:47 pm on March 29, 2023 \n\n\n\nTags: fse-exploration ( 5 ), fse-outreach-program ( 90 )   \n\t\t\t\t\n\nFSE Program Exploration: Build a block theme\n\n\nWith WordPress 6.2 released, this exploration seeks to explore the Site Editor as a design tool, asking folks to create a blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. theme without any code directly in the editor using the current tools. The aim is to both find gaps in functionality and to get feedback on the experience of using the Site Editor in this design centric way, as we look to expand the number of block themes. \nThe focus of this exploration is to think with a more open minded, “what can I build today?” approach. If you’ve never built a block theme, consider this an invitation to give it a try. Tooling has come a long way and the power of what’s being built is that it allows more folks to dive into the future (and present) of WordPress. For this experience, you’ll use the Create Block Theme pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party to facilitate the creation and export process so you can keep what you create! Feel free to read these brief instructions for how to get started or follow the steps below.\nIn the near future, expect a more formal call for testing once more, dedicated to some of the newer functionality being worked on as part of the remaining major phase 2 items. \nExploration Instructions\nTo use a prebuilt test site: \nOpen this link only once: https://app.instawp.io/launch?t=fse-block-theme-exploration&d=v1  Please do not repeatedly open this link as it creates a new site each time.\nThis will launch a site for you to use for up to 5 days. \nSave the link to your site so you can access it again during the test. \nTo set up your own test site: \nHave a test site using the latest version of WordPress. It’s important this is not a production/live site. \nInstall and activate the Create Block Theme plugin.\nInstall and activate GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ 15.4 (or the latest version). \nCreate the base of your theme\nNavigate to Appearance > Create Block Theme.\nChoose either “Create blank theme” to start completely from scratch or you can use the currently active block theme by choosing the “Clone” option. Note: You are welcome to use a block theme of your choosing if you Clone!\nFill out the information for either option. Feel free to keep this pretty simple since this is just for testing and not official block theme launching purposes. When done, select “Generate”.\nHead to Appearance > Themes and activate the theme you just created.\nConfigure your fonts\nHead to Appearance > Manage Theme Fonts.\nFrom here, you can add a Google font or a Local font if you have any you’d like to use. This will install the fonts (download them) as part of the theme but these fonts still need to be applied. \nOnce added, you can then manage the font weights. \nAfter you’re done, head to Appearance > Editor and open Styles to configure these fonts for use on your theme under Typography. \nMake your changes and export\nHead to Appearance > Editor and begin customizing as you’d like! \nHere are some high level ideas: \nUse the Styles interface to make global changes to the Layout, Typography, and more. Use the Stylebook to see your changes at a glance to individual blocks. \nUse the design tools built into each block to make individual changes. \nCreate new templates or template parts. \nAdd or remove different blocks from current templates or template parts. \nExport your theme\nWhen you’re done making your changes, head to Appearance > Create Block Theme.\nFrom there, choose the “Export” option. This option will automatically include user changes so you don’t have to overwrite them first.\nPlease share feedback by April 26th, 2023\nWhat to notice\nWhile you’re welcome to share feedback on any aspect of the experience, here are a few specific questions to focus your feedback. \nDid the experience crash at any point?\nDid the saving experience work properly? \nWhat did you find particularly confusing or frustrating about the experience?\nWhat did you especially enjoy or appreciate about the experience? \nWhat did you need to use Custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. for, if at all? \nWas there anything you weren’t able to accomplish that you’d like to see considered? \nAs always, thank you for participating in this exercise. If anything is blocking you from doing so, just say so either in #fse-outreach-experiment, in the comments of this post, or over DM in slackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. to @annezazu (that’s me!). \n#fse-exploration, #fse-outreach-programShare this:Click to share on Twitter (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to share on Pocket (Opens in new window)Login to Reply\n\n\n\n\n\n\n\n\n\n\n\n\nNomad Skateboarding\n\n3:01 am on March 31, 2023 \n\n\n\n\nSo excited for this! Very much looking forward to learning from, and viewing others, design ideas.\n\n\n\n\n\n\n\n\nSarah Norris\n\n3:07 pm on March 31, 2023 \n\n\n\n\nLooking forward to seeing everyone’s designs and feedback!\n\n\n\n\n\n\n\n\nwesatintellitonic\n\n6:10 pm on April 3, 2023 \n\n\n\n\nI created an InstaWP site through the link and put quite a bit of work into a theme a few days ago — should have one day left out of the five, but have been logged out before exporting the new blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. theme with (seemingly) no way to reset the password, since there is no email address associated with the default user — the site itself is still there, I just can’t log in to it — does anyone happen to know whether there is a way to reset the user/password or otherwise get into the backend on one of these temp sites?\n\n\n\n\n\n\n\n\nPaal Joachim Romdahl\n\n12:51 pm on April 4, 2023 \n\n\n\n\nHey Wes.\nI took direct contact with Vikas at InstaWP and he told me that you have chatted with him and that this has been resolved.\n\n\n\n\n\n\n\n\nannezazu\n\n2:35 pm on April 6, 2023 \n\n\n\n\nCatching up here. Thank you all for diving in and helping each other resolve this! Hugely appreciated when I was out earlier this week.\n\n\n\n\n\n\n\n\n\n\n\n\nPaal Joachim Romdahl\n\n3:11 pm on April 4, 2023 \n\n\n\n\nAnother very very long video. It gives an overview of what I experienced. https://youtu.be/tniEqn9q0fk\nThe Create a BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party is very very cool! I used Twenty Twenty Two theme adjusted the height of the headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. and footer and then Cloned it to become a new theme. Downloaded the theme and uploaded it and activated the new custom theme.\nHow the heck do I delete pre existing templates? Such as Two Page templates Page (Large Header) and Page (No Separators). As well as the extra Single Post (No Seperators) template.\nI find the list of templates a bit confusing. It should show the most common ones in the top. Less used further down. Here it shows in an alphabetical order. There should be hints along the way to help users get to the correct template.\nSwitching a Header Template. What about using the Transform To menu to switch a Reusable block to another Reusable block, and one type of pattern with another similar type. Be it Header, Footer etc. Being able to easily transform from one type of Header pattern to another.\nHow do I keep the Footer on the bottom of the page independent of how much content is on the page/post?\nPost Content block.\nI thought that adjusting the content in here would adjust the post content, well add additional post content to all pages. It did not show up that way.\nApply globally.\nI have a specific header that I want to add to all templates. I also have a specific footer that I want to add to all templates. It looks like I can apply globally a specific Group which will be added to other Group blocks.\n\n\n\n\n\n\n\n\nPaal Joachim Romdahl\n\n8:42 pm on April 4, 2023 \n\n\n\n\nTwo more comments.\nThe Post Content blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience..\nIn the Page Template I changed the text inside the Page Content block and expected to see the text added to all the pages, but it was only added to the front page. There is obviously something I am missing here…\nSwitching out the current HeaderHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. of Footer.\nI add a Header pattern and now I have one official Header template part where I see it has the Header template part label.\nThe other newly added Header pattern does not have the Header template label but is in a Row. How do I make the new pattern become the Header template part?\n\n\n\n\n\n\n\n\nannezazu\n\n3:44 pm on April 6, 2023 \n\n\n\n\n@paaljoachim thanks so much for diving into this 21st effort for the FSE Outreach Program. I’ll include your video for folks to watch in the recap.\nHow the heck do I delete pre existing templates? Such as Two Page templates Page (Large HeaderHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes.) and Page (No Separators). As well as the extra Single Post (No Seperators) template.\nOpened this! https://github.com/WordPress/gutenberg/issues/49640\nI find the list of templates a bit confusing. It should show the most common ones in the top. Less used further down. Here it shows in an alphabetical order. There should be hints along the way to help users get to the correct template.\nAgreed completely. This should help loads: https://github.com/WordPress/gutenberg/issues/48651#issuecomment-1499238649\nSwitching a Header Template. What about using the Transform To menu to switch a Reusable blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. to another Reusable block, and one type of pattern with another similar type. Be it Header, Footer etc. Being able to easily transform from one type of Header pattern to another.\nYes! These two issues touch on exactly that:\nhttps://github.com/WordPress/gutenberg/issues/44581\n&\nhttps://github.com/WordPress/gutenberg/issues/44582\nAlso noting that you can use the “replace” option to do that for template parts! I’ve added a comment to this issue open about moving that “replace” option to the transform menu:\nhttps://github.com/WordPress/gutenberg/issues/42425\nHow do I keep the Footer on the bottom of the page independent of how much content is on the page/post?\nCheck this out: https://make.wordpress.org/core/2023/03/06/minimum-height-dimensions-block-support/\n“The feature allows users to set a Group or Post Content block to have a minimum height, similar to the control that exists for the Cover block. An example use case is to ensure that a post content area has a minimum height, forcing a footer area to render lower on the page, even if a page has little content. For this reason, it can be quite useful to use viewport relative units when setting minimum height, e.g. 100vh for a block that takes up the entire height of the viewport.”\nThe Post Content block.\nIn the Page Template I changed the text inside the Page Content block and expected to see the text added to all the pages, but it was only added to the front page. There is obviously something I am missing here…\nIn watching your video, I see you paused and then restarted recording after making some unknown changes there: https://youtu.be/tniEqn9q0fk?t=1556 I think what you did is somehow edit the post content block placeholder text.  I am not sure how you did that though 😀 This doesn’t change the functionality of the block which is to display the post/page content. Can you clarify what you did there?\nI add a Header pattern and now I have one official Header template part where I see it has the Header template part label.\nThe other newly added Header pattern does not have the Header template label but is in a Row. How do I make the new pattern become the Header template part?\nAh when you added in a header pattern, it didn’t automatically convert to a header template part block. Instead it remained as a pattern. This comes up as part of this problem:\nhttps://github.com/WordPress/gutenberg/issues/41397\nI’ll add a note there with a link to your video where this happens! Great usability feedback.\n\n\n\n\n\n\n\n\nPaal Joachim Romdahl\n\n8:17 pm on April 7, 2023 \n\n\n\n\nThank you Anne!\nI am going through your excellent feedback.\nA few additional comments.\nMinimum height is very helpful, but it will not keep the footer sticked/fixed to the bottom of the viewport in the browser. It would be helpful to have the footer fixed to the bottom of the screen. Kind of like having a sticky headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. which I have not looked at so much yet.\nPost Content blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience..\nI am drawing a blank on this one. As I removed the test site and took it back to an earlier stage I was not able to replicate this issue. I will need to come back to this on at a later stage.\n\n\n\n\n\n\n\n\nannezazu\n\n12:41 am on April 11, 2023 \n\n\n\n\nMinimum height is very helpful, but it will not keep the footer sticked/fixed to the bottom of the viewport in the browser. It would be helpful to have the footer fixed to the bottom of the screen. Kind of like having a sticky headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. which I have not looked at so much yet.\n\nCurious what you think of this discussion around ways to accomplish what I think you’re describing:\nhttps://github.com/WordPress/gutenberg/issues/45117#issuecomment-1418395790 I do think as part of the follow up tasks work needs to be done to make accomplishing this easier! I imagine patterns might play a role here.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMatthew\n\n12:19 pm on April 6, 2023 \n\n\n\n\nIs there a Steemit pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party in 2023?\n\n\n\n\n\n\n\n\nannezazu\n\n2:38 pm on April 6, 2023 \n\n\n\n\nHey @dsy3t! I’m not quite sure what you’re asking here as it relates to this exploration. Can you clarify? If you’re looking for a specific pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party, please head here: https://wordpress.org/plugins/\n\n\n\n\n\n\n\n\n\n\nJamesKoussertari\n\n2:05 pm on April 6, 2023 \n\n\n\n\nI wrote a comprehensive guide recently on building WordPress BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Themes. It includes a section about limitations I came across when building my first block theme:\nhttps://gutenbergmarket.com/news/a-comprehensive-guide-to-building-wordpress-block-themes\n\n\n\n\n\n\n\n\nannezazu\n\n4:17 pm on April 6, 2023 \n\n\n\n\n@jameskoussertari thank you so much for dropping this link here and sharing both your feedback and insights so openly for others to learn from. To address the specific limitations section:\nLacking Responsive Abilities\nI’ll definitely note this in the recap but also wanted to be sure you saw this recent article on the topic:\nhttps://developer.wordpress.org/news/2023/02/intrinsic-design-theming-and-rethinking-how-to-design-with-wordpress/\nPatterns are a fantastic way to provide clients and users prebuilt layouts for rapid website creation. Unfortunately though, they lack one important feature, which would take them from being great to absolutely amazing. This missing feature is the ability to sync and edit patterns globally, without altering the content within them.\nAs you noted, this is the best issue to follow on that front: https://github.com/WordPress/gutenberg/issues/48458 I’ll mention this in the recap as well.\nIt’s also a shame that we have to introduce another div to the markup to achieve this.\nSticky positioning was added to a template part block and later reverted. Back to the drawing board for now but you can see this is a big part of active discussion to resolve as part of the follow up items for this functionality: https://github.com/WordPress/gutenberg/issues/47043\nIt’s very frustrating when you need to override a coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. style, as currently you cannot do this in theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML. which would be the cleanest way to do this. Unfortunately, it’s just not possible to do this in theme.json yet.\nPerhaps I’m misunderstanding but would this not do the trick? https://make.wordpress.org/core/2023/03/07/miscellaneous-editor-changes-in-wordpress-6-2/#edit-block-style-variations-from-theme-json\nSemi related for custom variations:\nhttps://github.com/WordPress/gutenberg/issues/49602\nText Colour Gradients\nI couldn’t find a GitHubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/ issue for this! Opened an issue either way to get more insight:\nhttps://github.com/WordPress/gutenberg/issues/49642\nFor the rest, I see you nicely connect everything to current issues. Thank you!\n\n\n\n\n\n\n\n\nJamesKoussertari\n\n3:23 pm on April 10, 2023 \n\n\n\n\nHi Anne,\nThanks so much for taking the time to read through my article and getting back to me. I am glad it may help in the recap.\nIn response to intrinsic design, I am all for it but even then I believe responsive control will still be needed in certain situations. Every page builder and website building tool out there offers this feature, so I don’t think WordPress can do without it just yet. One basic example is simply having control over how the columns collapse down from desktop > tablet > mobile. For example, you might want columns to collapse 4 > 2 > 1 or 4 > 2 > 2. Currently you’d have to hack the CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. to do this.\nRegarding overriding blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. style variations with theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML., you are absolutely correct that it is in fact possible. I was following an issue on githubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/ which seemed as if it was not possible yet. I have just updated the issue to include the solution thanks to you pointing me in the right direction:\nhttps://github.com/WordPress/gutenberg/issues/34853. I will also update my guide and remove that from the limitations section and over to the golden nuggets section 🙂\nThanks again.\n\n\n\n\n\n\n\n\nannezazu\n\n12:44 am on April 11, 2023 \n\n\n\n\nThanks for following up and for updating your guide! It’s incredibly helpful to have folks like yourself sharing more broadly.\nOne basic example is simply having control over how the columns collapse down from desktop > tablet > mobile. For example, you might want columns to collapse 4 > 2 > 1 or 4 > 2 > 2. Currently you’d have to hack the CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. to do this.\nAgreed. I think there will need to be a bit of both, depending. Ideally, we can fit as much as possible intrinsically! For good measure, an issue related to your example: https://github.com/WordPress/gutenberg/issues/40870\nAlso, since this is your first contribution to the FSE Outreach Program, expect a Test Contributor badge on your WordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ profile when this test is done.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMarcy\n\n4:33 pm on April 7, 2023 \n\n\n\n\nI’m just getting started, but I’m getting errors when I try to change the Content Widths under Global Styles > Layout.\nI also can’t change the Padding or BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Spacing.\n(I started with a Blank theme in Create Block Theme pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party on my own fresh WP install with content from a previous experiment.)\nImages of where this is:\nhttps://drive.google.com/file/d/1dgrmcSbTgLiieHc2PuxO1CRV23rcGr09/view?usp=share_link\nhttps://drive.google.com/file/d/1Z6Dva_xFPABtpROWz6c07MIAdNrJX2r6/view?usp=share_link\nThis is the error with different numbers at the end, depending on when I try.\nTypeError: Cannot convert undefined or null to object\n    at Function.entries ()\n    at er (http://wp62.test/wp-content/plugins/gutenberg/build/block-editor/index.min.js?ver=65c2a14c9bcef52f178e:7:19441)\nI can add Layout Settings on individual Group Blocks inside the Template and Template Parts (index.htmlHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites., only right now, and header.html and footer.html.\n\n\n\n\n\n\n\n\nannezazu\n\n5:24 pm on April 7, 2023 \n\n\n\n\nExcellent find! I can replicate and I’ve reported it here:\nhttps://github.com/WordPress/gutenberg/issues/49666\nFor now, proceed as you can without adjusting those variables until that’s resolved (hopefully soon). Thank you for the detailed reporting.\n\n\n\n\n\n\n\n\nMarcy\n\n5:40 pm on April 7, 2023 \n\n\n\n\nThank you, Anne!\n\n\n\n\n\n\n\n\nPaal Joachim Romdahl\n\n12:29 pm on April 11, 2023 \n\n\n\n\nHi Marcy.\nBecause of your error report a bug was discovered\nand has now been fixed. The fix is backported to GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party version 15.5.1. Which is now available for download.\nhttps://github.com/WordPress/gutenberg/issues/49666#issuecomment-1502543325\n\n\n\n\n\n\n\n\nMarcy\n\n10:43 pm on April 13, 2023 \n\n\n\n\nThank you, Paal! I have the latest GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ and have tried using the Layouts in Global Styles and they work great now.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMarcy\n\n6:38 pm on April 18, 2023 \n\n\n\n\nI have removed my first theme using Create BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party as I was having issues with the blockGap or Block Spacing. I couldn’t tell where I was actually trying to set it, as it seemed to work differently on different templates.\nSo I wanted to start over to make sure I had all the Global Settings set before adding additional templates.\nBut now the Manage Theme Fonts in Create Block Theme Ver 1.8.1  plugin is not working as expected. I can add Google Fonts or Local Fonts and they appear under “Manage Theme Fonts”. I can even see them added multiple times.\nBut they are not appearing as choices in the Global Styles screen under Typography > Text or Typography > Headings\n\n\n\n\n\n\n\n\nannezazu\n\n4:23 am on April 19, 2023 \n\n\n\n\nHey there! I can’t replicate this. To try to do so, I tried both replicating with 1.8.1 and the prior version. I noticed no difference in uploading a Google font. Which font are you trying to add? I wonder if it’s specific to the font itself somehow.\n\n\n\n\n\n\n\n\nMarcy\n\n5:05 pm on April 20, 2023 \n\n\n\n\nThanks, Anne. I deleted and started over and now I see all the Google Fonts that I added.\nI suspect that when I started the second time that my theme was not really connected to Create BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme. I must have done something and not started with Blank, as I meant to do.\n\n\n\n\n\n\n\n\n\n\n\n\nfranzaurus\n\n5:13 pm on April 19, 2023 \n\n\n\n\nI started exploring blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. themes building using Carolina Nymark’s No-Code theme generator as a starting point, and then built upon it in the Site Editor. I appreciated the generator’s simple setting options, which didn’t overwhelm me with too many choices, as I am still learning the many elements of theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML.. The generated theme only consisted of an index template without any template parts, but its theme.json had automatically enabled useRootPaddingAwareAlignments, which allowed full-width sections/elements to be stretched outside of the group’s constraint. During the building process, I used the overwrite function of Create Block Theme (CBT) to save all the changes to the theme.json file to make it the single source of truth for the final theme.\nSince I’m not a designer but would love to have a proper spacing layout, good hierarchy of headings, and a harmonious color palette, I then copied some of those elements from a couple of themes. For spacing values (spacing.spacingSizes and styles.spacing.blockGap), I copied them from the Frost theme and adopted the predefined font size values of headings & paragraphs from the Beaumont theme. As for the color palette, I sought a monochromatic color scheme, which I generated from W3School’s color schemes.\nI previously wrote custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. to set the site-title & post-title’s text-decoration to none, but later found out that it can be done in theme.json. So my theme doesn’t use custom CSS anymore.\nFor this theme, I created the following templates & template parts:\nTemplates:\n1. Home template\n2. Single template\n3. Page template\n4. No Title (custom template, need to be manually registered in theme.json)\n5. CategoryCategory The 'category' taxonomy lets you group posts / content together that share a common bond. Categories are pre-defined and broad ranging. template\nTemplate parts:\n1. headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. (applied to single & page templates)\n2. footer (applied to single & page templates)\n3. centered-header-with-logo (applied to home template)\n4. left-aligned-footer (applied to home template)\n5. post-metaMeta Meta is a term that refers to the inside workings of a group. For us, this is the team that works on internal WordPress sites like WordCamp Central and Make WordPress. (applied to single template)\nFor font, I used Inter variable font Inter-VariableFont_slnt,wght.ttf which I uploaded using Create Block Theme pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party.\nOne particularly confusing or frustrating about the experience is when using CBT to overwrite some templates (front page, home, custom template). I summarized the process in the following steps.\n\nAdding Custom template named Home\nOverwrote the theme via CBT. Noticed that it created wp-custom-template-home template instead of home. I understand that this problem has been reported, and I have commented on the issue there https://github.com/WordPress/create-block-theme/issues/184#issuecomment-1442778292 \nRenamed wp-custom-template-home.htmlHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites. to home.html via Visual Studio Code.\nAdding a block paragraph and cover block\nOverwrote the theme via CBT\nThe blocks codes are now saved to home.html\nNow add a pattern from coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress.’s pattern collections.\nOverwrote the theme via CBT\nObserve how the home.html now consists only a reference to home.php pattern in which the blocks code are now reside.\nUpon editing the home template, the image referenced in the pattern is gone. Attempting to recover the block effort is failed.\n\nThe aforementioned problem also happened if I added and overwrote a front-page template, but without the template renaming effort (it correctly named front-page.html), but there were some additional error messages showed up. Although the errors didn’t fail the overwriting process.\n( ! ) Warning: rename() expects parameter 1 to be a valid path, object given in …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php on line 147\n( ! ) Warning: Cannot modify header information – headers already sent by (output started at …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php:147) in …\\wp-admin\\includes\\misc.php on line 1431\n( ! ) Warning: Cannot modify header information – headers already sent by (output started at …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php:147) in …\\wp-includes\\functions.php on line 6896\n( ! ) Warning: Cannot modify header information – headers already sent by (output started at …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php:147) in …\\wp-admin\\admin-header.php on line 9\nInterestingly, I found the above problem does not happen if I added and overwrote single or page templates via CBT.\nBesides templates, I experimented with pattern creation. With the help of Pattern Manager plugin, I managed to copy one of the core’s patterns named Quote and renamed it as quote-with-circle-image.php. The process went smoothly until I inserted the pattern at the home template and overwrote the theme using CBT. The following error messages appears after the overwriting process and the referenced image disappeared.\n( ! ) Warning: rename() expects parameter 1 to be a valid path, object given in …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php on line 147\n( ! ) Warning: rename() expects parameter 1 to be a valid path, object given in …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php on line 147\n( ! ) Warning: Cannot modify header information – headers already sent by (output started at …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php:147) in …\\wp-admin\\includes\\misc.php on line 1431\n( ! ) Warning: Cannot modify header information – headers already sent by (output started at …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php:147) in …\\wp-includes\\functions.php on line 6896\n( ! ) Warning: Cannot modify header information – headers already sent by (output started at …\\wp-content\\plugins\\create-block-theme\\admin\\create-theme\\theme-media.php:147) in …\\wp-admin\\admin-header.php on line 9\nAfter examining the troubled templates and patterns, I found that the image path was going to the theme’s root assets/images folder. Copying the required images to the said folder solved the problem. Learning from this, I wondered if the image copying could be done during the CBT overwriting process and whether the overwriting process of templates that used core’s patterns could output the result to the HTML template only instead of the HTML + PHPPHP PHP (recursive acronym for PHP: Hypertext Preprocessor) is a widely-used open source general-purpose scripting language that is especially suited for web development and can be embedded into HTML. http://php.net/manual/en/intro-whatis.php. pattern to minimize confusion.\nFor the interested folks, I put the codes here, and the resulted live site here.\n\n\n\n\n\n\n\n\nJeff Ong\n\n7:16 pm on April 20, 2023 \n\n\n\n\nThank you for the detailed notes, it’s very helpful for debugging!\nRegarding your experience using CBT:\nSteps 1 – 3 should be addressed by this recent addition to GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/: https://github.com/WordPress/gutenberg/pull/47389. In 15.7 you should be able to add the home template from the list of templates in the site editor.\n\n  I found that the image path was going to the theme’s root assets/images folder. Copying the required images to the said folder solved the problem.\n\nThis sounds like an issue with CBT that I’m trying but can’t quite replicate. It’s peculiar that it only happens with the home template as well. Which pattern did you add? May I also ask some details about your environment — operating system, WordPress, and pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party versions specifically 🙂\n\n  I wondered if the image copying could be done during the CBT overwriting process and whether the overwriting process of templates that used coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress.’s patterns could output the result to the HTMLHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites. template only instead of the HTML + PHPPHP PHP (recursive acronym for PHP: Hypertext Preprocessor) is a widely-used open source general-purpose scripting language that is especially suited for web development and can be embedded into HTML. http://php.net/manual/en/intro-whatis.php. pattern to minimize confusion.\n\nIf the template contains media, the content of the template is automatically moved to a pattern in order to serve the assets locally when the theme is exported / used in another site or environment.\nThere is a good case to be made that overwriting the theme should not necessarily trigger this feature to move the template contents to a pattern. I opened an issue here.\nThanks again.\n\n\n\n\n\n\n\n\nfranzaurus\n\n6:38 pm on April 21, 2023 \n\n\n\n\nMay I also ask some details about your environment — operating system, WordPress, and pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party versions specifically 🙂\nThere is a good case to be made that overwriting the theme should not necessarily trigger this feature to move the template contents to a pattern. I opened an issue here.\nThanks so much for opening an issue for my suggestion.\nMy testing environment includes Windows 11, WordPress 6.2, Create BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme 1.8.1 & GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ 15.5.1.\nI understand that the export function is made to serve the theme portability. However, after exploring further, I find that there is different behavior when exporting via CBT or natively in the Site Editor. For this test, I used the Quote pattern that was inserted into a front page template.\nIf exported via Site Editor.\nThe process only creates front-page.htmlHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites., which contains the quote block codes. The image is served online (from http://s.w.org).\nhttps://i.imgur.com/bbgD2gU.png\nIf exported via Create Block Theme.\nThe process creates the following files:\n1. assets/images/portrait.jpg\n2. front-page.php\n3. front-page.html\nhttps://i.imgur.com/mzafq6L.png\nThe resulting theme from both methods can be used on another site. The failure only happen if the overwrite function is selected during theme development. The previous error messages will show up, and the images will disappeared. This is because, during overwriting, Create Block Theme does not copy the required images to the assets/images folder.https://i.imgur.com/F3ceXjx.png\nhttps://i.imgur.com/bfEYWvu.png\nIMHO, I still think having fewer theme files (the Site Editor export method) and locally serving the theme’s assets (inside the assets/images folder) would make a good theme in terms of size, maintainability and privacy issues.\nThanks 🙂\n\n\n\n\n\n\n\n\n\n\n\n\nannezazu\n\n6:16 pm on April 20, 2023 \n\n\n\n\n@franz00 thanks for diving in! If I’m counting correctly, this is your fourth contribution to the FSE Outreach Program. I appreciate your consistent feedback.\nSince I’m not a designer but would love to have a proper spacing layout, good hierarchy of headings, and a harmonious color palette, I then copied some of those elements from a couple of themes. For spacing values (spacing.spacingSizes and styles.spacing.blockGap), I copied them from the Frost theme and adopted the predefined font size values of headings & paragraphs from the Beaumont theme. As for the color palette, I sought a monochromatic color scheme, which I generated from W3School’s color schemes.\nLove this. Great way to manually mix and match!\nI previously wrote custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. to set the site-title & post-title’s text-decoration to none, but later found out that it can be done in theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML.. So my theme doesn’t use custom CSS anymore.\nGreat call out! I’ll include this in the recap.\nAfter examining the troubled templates and patterns, I found that the image path was going to the theme’s root assets/images folder. Copying the required images to the said folder solved the problem. Learning from this, I wondered if the image copying could be done during the CBT overwriting process and whether the overwriting process of templates that used coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress.’s patterns could output the result to the HTMLHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites. template only instead of the HTML + PHPPHP PHP (recursive acronym for PHP: Hypertext Preprocessor) is a widely-used open source general-purpose scripting language that is especially suited for web development and can be embedded into HTML. http://php.net/manual/en/intro-whatis.php. pattern to minimize confusion.\nI’ll note this in the recap as well for future CBT improvements. I agree this would be great to evolve.  In terms of the other errors/pain points you ran into around template creation, I’m going to flag this for some of the folks who have worked on the Create BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party to see what might be the root cause. I can’t tell if it’s the tool not being used as designed or if it’s a bug of some sort 🙂\n\n\n\n\n\n\n\n\nMarcy\n\n11:43 pm on April 20, 2023 \n\n\n\n\nThird time, it all seemed to work well.  I  bolded my comments for the items to save time reading.\nI used my own WP install and imported posts from another Exploration, and created a few pages.\nThese are some of the changes made:\n1. Started with “Create blank theme” in Create BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party.\nOver the week or so that I worked, both GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ and CBT plugin updated, so there were changes to some things while I worked. ( I like the link to Global Styles in the Appearance > Editor menu.)\n\nAdded 2 Google Fonts – Lora and Open Sans and used Global Style to add them to Text and Headings. This worked really well (as long as CBT plugin “knows” the theme.)\n\n2a. Added four additional colors to the basic WP color palette.\n\nEdited the Layout widths in GS, but this time I left the Block Spacing at the default 24px because I had issues previously. I’ll try editing it again later, as I think I found what was not working for me, and it wasn’t the actual Block Spacing.\n\nEdited the Buttons Block (I find it a bit odd to have some of the Button styles with the Global Typography and Colors, and then again down below in the Blocks, but I guess I don’t have a suggestion, as many people would just want to change button colors and typography, and not padding or spacing , etc.)\n\n\nEdited the Quote Block to make the typography larger. (I also tried to add Custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. for the size of the “cite” but it didn’t change, and it had in an earlier test, so I must have different selectors, and will track it down later.)\n\n\nAfter that I worked on editing the HeaderHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. and  Footer. I named the first Group in each under the HTMLHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites. Element to be\n\n\n<\nheader> and\n<\nfooter> respectively. I think that CBT plugin should already have them named with these HTML elements.\nFor the header, I uploaded a logo and removed the Site Title and TagTag Tag is one of the pre-defined taxonomies in WordPress. Users can add tags to their WordPress posts along with categories. However, while a category may cover a broad range of topics, tags are smaller in scope and focused to specific topics. Think of them as keywords used for topics discussed in a particular post. line and edited the menu in the header and not over in the Navigation, although they both changed. I added a bottom border and made the max width of the inner Row to be my wide width.\nI did similar to the footer for the width. I added a Row with the copyright and the Login/Out, reduced the top spacer size and added a top border.\nI did not try to create a new Header/Footer at this time.\n\nChanges to index.html were to put the Query LoopLoop The Loop is PHP code used by WordPress to display posts. Using The Loop, WordPress processes each post to be displayed on the current page, and formats it according to how it matches specified criteria within The Loop tags. Any HTML or PHP code in the Loop will be processed on each post. https://codex.wordpress.org/The_Loop. in a Group Block with the HTML Element  and add top and bottom padding.\n\nCreated a new Page Template using the Index to start. Removed the Query Block and added a Post Title and Post Content to the Group Block with  from step 7.\n\n\nNext I added a Custom Template – Page with No Title based on the Page Template and removed the Post Title.\nI created a “Front Page”  in Pages > Add New and used this Template for it. I’ve used a Front Page Template in the past, and that’s what I would normally do, but tried something different.\n\n\nNext was the “Single Item: Post” template baed on Index again. I added Post Title, Post Content, Featured ImageFeatured image A featured image is the main image used on your blog archive page and is pulled when the post or page is shared on social media. The image can be used to display in widget areas on your site or in a summary list of posts. and copied the Row Block from the  Query Loop with the Post Author, Date, Cats, and Tags (just to save time). And deleted the Query Loop.  I added a Comments Block. No issues with that.\n\n\nThen I exported the theme using CBT plugin.\nAll of that went well.\n\n\nI duplicated the site, activated the Twenty Twenty-Two theme, and deleted the original theme that I had from CBT plugin that came along with the cloned site.\n\n\nI imported the theme I created with the CBT plugin and activated on the second site. And it all went really well, and looked exactly the same.\n\n\n I also made a small edit to the Page Template with no issues.\nAnd created a new header template part to use only with the Page template. I used one of the available header patterns. That also worked with no issues.\nAnd also made some other changes.\nI hope to also try using it on a different site that is not a clone of the site I used to build the theme.\nAdditional Comments:\n1. I like the direct link to “Styles” from Appearance > Editor.\nAlthough at times, I still don’t “see” that I am in Global Styles when I want to be in the Template or Block Styles. I don’t have any suggestions at this time; I think it’s a matter of getting used to what I see.\n\n\nI would like the CBT plugin to add HTML Elements to the templates and parts that it creates (unless WordPress is moving away from using them.)\n\n\nI’ll have to try CBT plugin starting with another Block Theme to see if it helps more with development.\nI’ve been starting themes with the Theme Generator on Full Site Editing\nAnd then editing theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML. directly, especially for the block styles.\nI hope to use Global Styles more for this.\n\n\nOverall, it think that CBT plugin works really well for creating a new blank theme, adding Google Fonts, and exporting a theme that can be used  on another site.\n\n\nOne other thing I noticed when I was changing Templates on a page is that my choices were “Default Template” and “Page No Title”.\nI’m not sure I like the use of “Default Template”.  Yes, the Page Template is the default template for a Page, but I’d like to see what it is.\nAt first glance, I thought it was trying to use Index, and that Page Template was missing.\n\n\n\n\n\n\n\n\n\n\nMarcy\n\n6:09 pm on April 21, 2023 \n\n\n\n\nI see now that I do not need to add \n\n and \n\n to groups; that is already done.\nI only need to add , if I choose to.\n\n\n\n\n\n\n\n\nMarcy\n\n6:10 pm on April 21, 2023 \n\n\n\n\nThat was headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes., footer and main HTMLHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites. elements. I’m losing code.\n\n\n\n\n\n\n\n\nannezazu\n\n6:57 pm on April 22, 2023 \n\n\n\n\nThanks so much @antigone7 for the follow up comments for this exploration. It’s really helpful to have a sense of what you explored and the path you followed so, while I might not comment on as much since items don’t necessarily need the same kind of follow up, know I’m appreciative and will incorporate what you shared in the write up.\n( I like the link to Global Styles in the Appearance > Editor menu.)\nAgreed! I’ll note this as usability feedback.\n(I find it a bit odd to have some of the Button styles with the Global Typography and Colors, and then again down below in the Blocks, but I guess I don’t have a suggestion, as many people would just want to change button colors and typography, and not padding or spacing , etc.)\nNoted this feedback on a related issue on improving the information architecture of that UIUI UI is an acronym for User Interface - the layout of the page the user interacts with. Think ‘how are they doing that’ and less about what they are doing.: https://github.com/WordPress/gutenberg/issues/47369#issuecomment-1518729328\nI think that CBT pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party should already have them named with these HTMLHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites. elements.\nI’m a bit confused here. I’m assuming you’re talking about the Group blocks inside a template part? If so, it’s intentional they aren’t named with HTML elements as I imagine that’s covered by the Template Part blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. it’s inside.\n For more context, when you’re editing a template part on its own you won’t see the broader Template Part block that contains what’s visible. Let me know if I’m misunderstanding something here though!\nI’m not sure I like the use of “Default Template”. Yes, the Page Template is the default template for a Page, but I’d like to see what it is.\nAt first glance, I thought it was trying to use Index, and that Page Template was missing.\nThe “Default” terminology has come up before here:\nhttps://github.com/WordPress/gutenberg/issues/41449 Agreed on this being a confusing label!\n\n\n\n\n\n\n\n\nMarcy\n\n10:15 pm on April 26, 2023 \n\n\n\n\nThank you, so much Anne!\nRegarding this:\nI’m a bit confused here. I’m assuming you’re talking about the Group blocks inside a template part? If so, it’s intentional they aren’t named with HTMLHTML HTML is an acronym for Hyper Text Markup Language. It is a markup language that is used in the development of web pages and websites. elements as I imagine that’s covered by the Template Part blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. it’s inside.\nI think I’m the one who was confused. I think that I just got hung up on something that doesn’t matter.\n\n\n\n\n\n\n\n\nannezazu\n\n1:08 pm on April 27, 2023 \n\n\n\n\n😀 Happens to the best of us. Thanks for following up either way.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDavid Viña\n\n7:37 am on April 21, 2023 \n\n\n\n\nHi team!\nIt’s my first contribution in this area, but I hope to do many more why I love to create webs with blocks 💪\nI did previously a BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme with code and created some sections with the Site Editor and copy/paste the code. But this advance is grateful! It’s incredible, can create a Block Theme no writing any code 🙌\nRegarding my experience creating the Block Theme following these instructions. I create a theme from a Create blank theme option.\nConfigure fonts\nWhen I tried to add Theme Fonts, I arrived to a page where I can view the preview of the fonts, but I was searching how work why it was confuse to me. I think that in this point, it is necessary in the first once a wizard, similar to the editor. Here a screenshot\nhttps://drive.google.com/file/d/1TRXfDiAp6XLWuCLi2zpmeucKgbZXWbNb/view?usp=share_link\nIn this steep, also I detect this message:\nhttps://drive.google.com/file/d/1sgDlcJx55-WZox7_rJb0ceOFX9DIzoqR/view?usp=share_link\nIn the Editor \nWhen I entered the Editor, it appears a lot of time the spinner, but don’t load anything. With the inspector, I detected that I had duplicate content (the URLURL A specific web address of a website or web page on the Internet, such as a website’s URL www.wordpress.org http://test-fse.soivigol.dev/?_wp-find-template=true) that was loaded from a domain without HTTPSHTTPS HTTPS is an acronym for Hyper Text Transfer Protocol Secure. HTTPS  is the secure version of HTTP, the protocol over which data is sent between your browser and the website that you are connected to. The 'S' at the end of HTTPS stands for 'Secure'. It means all communications between your browser and the website are encrypted. This is especially helpful for protecting sensitive data like banking information., but my site was loaded with HTTPS). This error is mine why in the settings -> General I had the WordPress URL without httpHTTP HTTP is an acronym for Hyper Text Transfer Protocol. HTTP  is the underlying protocol used by the World Wide Web and this protocol defines how messages are formatted and transmitted, and what actions Web servers and browsers should take in response to various commands.. No problem for me why I review the console.log, but if some user has the same problem, I think should show a notice about this problem (or others similar). But, leaving the spinner without response is confused or frustrating.\nWhen I had inserted a menu, appear a new item ( Navigation) in the Navigation SidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme.. It’s ok for me. But, I think that will be interesting to have here the option to customizerCustomizer Tool built into WordPress core that hooks into most modern themes. You can use it to preview and modify many of your site’s appearance settings. the logo, icon and more settings relatives to logo that now we have in the Icon Block. For example, creating a new menu item in the Navigation Sidebar similar to the Navigation.\nI tried to insert a logo in the headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes., but then I removed it. Now, when I click in “Save” button, I have the option to save data of the Logo and Icon. If I click, I get an error. Here a screenshots. I had reload the page to continue.\nhttps://drive.google.com/file/d/1UOA7wTtVEFUelWEuTCqedSXure8zE6En/view?usp=share_link\nhttps://drive.google.com/file/d/1mtftUk4rldzX1DDh3_ndb7M1z3CprSA9/view?usp=share_link\nI didn’t have to use the Custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site.. But for this, I have wrapped the featured imageFeatured image A featured image is the main image used on your blog archive page and is pulled when the post or page is shared on social media. The image can be used to display in widget areas on your site or in a summary list of posts. in a group block to give it margin. I think that it is a good idea to can insert Custom CSS, why in this case, it is a better practice to set an Additional Class in the Featured Image Block and give it style with a few CSS lines. It’s interesting to have this option, but the location is difficult to reach. I had a frustration until to I found.\nThe rest of things worked fine. As expected.\nExport Theme and install in other installation \nI modified the default color palette, for example, in the Luminous Vivid Orange I modified this color to #FFAF76, but when I install in other installation how a new theme, the color is restored to default. Is this feature normal? I don’t know, but I hoped to export all colors modified.\nI hope that my comments will be too helpful!\n\n\n\n\n\n\n\n\nannezazu\n\n7:13 pm on April 22, 2023 \n\n\n\n\nIt’s my first contribution in this area, but I hope to do many more why I love to create webs with blocks 💪\nI did previously a BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme with code and created some sections with the Site Editor and copy/paste the code. But this advance is grateful! It’s incredible, can create a Block Theme no writing any code 🙌\n@soivigol Thanks so much for your very first contribution and for all of the excitement around the world of blocks! You’ll receive a Test Contributor badge when this test wraps up for your efforts. I hope to see your name continue to appear here.\nWhen I tried to add Theme Fonts, I arrived to a page where I can view the preview of the fonts, but I was searching how work why it was confuse to me. I think that in this point, it is necessary in the first once a wizard, similar to the editor.\nGreat feedback. The Create Block Theme pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party provides some functionality that doesn’t exist yet in the Site Editor and WordPress coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. experience. However, work is underway to learn from how fonts are managed in the CBT plugin and you can see what’s being explored here: https://github.com/WordPress/gutenberg/issues/45271\nI’ve noted that we’ll want to update the welcome module for Styles when this is added: https://github.com/WordPress/gutenberg/issues/45271#issuecomment-1518734181\nThis error is mine why in the settings -> General I had the WordPress URLURL A specific web address of a website or web page on the Internet, such as a website’s URL www.wordpress.org without httpHTTP HTTP is an acronym for Hyper Text Transfer Protocol. HTTP  is the underlying protocol used by the World Wide Web and this protocol defines how messages are formatted and transmitted, and what actions Web servers and browsers should take in response to various commands..\nDid you purposefully change this to HTTP? I just want to make sure I understand what led to this before opening an issue. Great find and I agree.\nI tried to insert a logo in the headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes., but then I removed it. Now, when I click in “Save” button, I have the option to save data of the Logo and Icon. If I click, I get an error. Here a screenshots. \nI tried to replicate this but couldn’t! To do so, I did the following:\n\nAdded a photo to the site logo block.\n\nUsed the “Replace” option to then choose “Reset”.\n\nAn option to save was then never presented since I had removed the image and there were no changes.\n\n\nI didn’t have to use the Custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site.. But for this, I have wrapped the featured imageFeatured image A featured image is the main image used on your blog archive page and is pulled when the post or page is shared on social media. The image can be used to display in widget areas on your site or in a summary list of posts. in a group block to give it margin. I think that it is a good idea to can insert Custom CSS, why in this case, it is a better practice to set an Additional Class in the Featured Image Block and give it style with a few CSS lines. It’s interesting to have this option, but the location is difficult to reach. I had a frustration until to I found.\nGreat usability feedback. I’ll include this in the write up. For context, these Custom CSS options are meant to be gap fillers until the Site Editor can accomplish even more things. As a result, they are a bit harder to find somewhat intentionally.\nI modified the default color palette, for example, in the Luminous Vivid Orange I modified this color to #FFAF76, but when I install in other installation how a new theme, the color is restored to default. Is this feature normal? I don’t know, but I hoped to export all colors modified.\nMy expectation would be the same as yours and that changing colors would move over with you. Can you share which option you chose for the Create Block Theme so I can try to replicate (Clone, Create a child themeChild theme A Child Theme is a customized theme based upon a Parent Theme. It’s considered best practice to create a child theme if you want to modify the CSS of your theme. https://developer.wordpress.org/themes/advanced-topics/child-themes/., etc)?\n\n\n\n\n\n\n\n\nDavid Viña\n\n6:34 pm on April 23, 2023 \n\n\n\n\nYou’ll receive a Test Contributor badge when this test wraps up for your efforts. I hope to see your name continue to appear here.\nGood news! Thanks, Anne. I will try to participate in more explorations 💪\n<\nblockquote>work is underway to learn from how fonts are managed in the CBT plugin and you can see what’s being explored here: https://github.com/WordPress/gutenberg/issues/45271.[/quote]\nSounds good! Thanks for sharing this.\nDid you purposefully change this to HTTPHTTP HTTP is an acronym for Hyper Text Transfer Protocol. HTTP  is the underlying protocol used by the World Wide Web and this protocol defines how messages are formatted and transmitted, and what actions Web servers and browsers should take in response to various commands.? I just want to make sure I understand what led to this before opening an issue. Great find and I agree.\nNo. It was casual. I explain better this point.\nI did the test on my own server. I created the installation with the options of the server panel and after, I installed the SSLSSL Secure Socket Layer - Encryption from the server to the browser and back. Prevents prying eyes from seeing what you are sending between your browser and the server. with the redirect to HTTPSHTTPS HTTPS is an acronym for Hyper Text Transfer Protocol Secure. HTTPS  is the secure version of HTTP, the protocol over which data is sent between your browser and the website that you are connected to. The 'S' at the end of HTTPS stands for 'Secure'. It means all communications between your browser and the website are encrypted. This is especially helpful for protecting sensitive data like banking information. option.\nWhen I went to the WordPress Dashboard, I entered with HTTPS (by the redirection). Usually, I change the URLURL A specific web address of a website or web page on the Internet, such as a website’s URL www.wordpress.org in Settings ⇾ General and WordPress Address (URL) and Site Address (URL). But in this case, I didn’t do this step. Then I went directly to the Editor’s site and I found with the issue.\nI think that the people will have the HTTPS activated, but if someone doesn’t have it, will have this error. I tried again reproduce this issue and follow passing.\nI created another test installation to try with HTTP in the settings but with the HTTPS in the URL, and I obtain the same issue.\n tried to replicate this but couldn’t! To do so, I did the following\nI think that went a casual issue. I have tried to reply to this error, but I couldn’t either. Sorry for the inconvenience.\nCan you share which option you chose for the Create BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme so I can try to replicate (Clone, Create a child themeChild theme A Child Theme is a customized theme based upon a Parent Theme. It’s considered best practice to create a child theme if you want to modify the CSS of your theme. https://developer.wordpress.org/themes/advanced-topics/child-themes/., etc)?\nI used the option “Create blank theme” and I export from the option in Editor Site.\nIt’s strange. In the new installation where I tried the theme created, I installed the CBT pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party and I used the option to [Export the activated theme with user changes] (same theme created with the other option) and now the colors were conserved. I hope I explained well.\n\n\n\n\n\n\n\n\nannezazu\n\n10:52 am on April 25, 2023 \n\n\n\n\nI think that the people will have the HTTPSHTTPS HTTPS is an acronym for Hyper Text Transfer Protocol Secure. HTTPS  is the secure version of HTTP, the protocol over which data is sent between your browser and the website that you are connected to. The 'S' at the end of HTTPS stands for 'Secure'. It means all communications between your browser and the website are encrypted. This is especially helpful for protecting sensitive data like banking information. activated, but if someone doesn’t have it, will have this error. I tried again reproduce this issue and follow passing.\nThanks so much for clarifying this! Makes perfect sense. In this case, I’m going to hold off on opening an issue for now. It’s not necessarily something that can be fixed in the editor and it’s tricky to properly identify the exact problem. I’m going to double check this thinking with a few folks though to be safe and note it in the recap as well.\nI think that went a casual issue. I have tried to reply to this error, but I couldn’t either. Sorry for the inconvenience.\nNo worries at all 😀 Thanks for trying to replicate.\nused the option “Create blank theme” and I export from the option in Editor Site.\nIt’s strange. In the new installation where I tried the theme created, I installed the CBT pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party and I used the option to [Export the activated theme with user changes] (same theme created with the other option) and now the colors were conserved. I hope I explained well.\nGot it! To make sure I understand, you first created a blank theme. You made color changes and exported the theme using the Site Editor’s export tool rather than the CBT plugin. This didn’t keep your color changes when you installed the theme on a new site. However, when you used the CBT plugin and used the export functionality, the color changes were kept. Is that correct? Thanks for going back and forth with this on me!\n\n\n\n\n\n\n\n\nDavid Viña\n\n9:12 pm on April 25, 2023 \n\n\n\n\nGot it! To make sure I understand, you first created a blank theme. You made color changes and exported the theme using the Site Editor’s export tool rather than the CBT pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party. This didn’t keep your color changes when you installed the theme on a new site. However, when you used the CBT plugin and used the export functionality, the color changes were kept. Is that correct? Thanks for going back and forth with this on me!\nThe color changes were kept up with the option “Export current theme” in the new site.\n\n\n\n\n\n\n\n\nannezazu\n\n1:09 pm on April 27, 2023 \n\n\n\n\nGot it. Thank you for following up! That’s expected behavior. I’ll still flag this for folks working on the pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party though as usability feedback since this is meant as a community tool.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFabian Todt\n\n12:51 pm on April 21, 2023 \n\n\n\n\nSo, that’s my first time using FSE/the theme editor (since I normally build custom themes) – so take everything I say with a grain of salt, since I’m probably thinking about it more in terms of a developer and maybe not a site builder and maybe some things are out of scope of this outreach. Here goes:\nI created a new site via instawp, created a new empty blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. theme. That worked great.\nI uploaded one font (it was a google font which I had downloaded previously). The font-weights were correctly recognized.\nWhen I saved and returned to the previous screen a “System font” was added as well. How would I go about specifying a fallback font? Eg I normally use “Helvetica, Arial, sans-serif” as fallbacks for font-family – I guess this is only possible via custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site.?\nFor the first time ever I opened the theme editor. I expected to see the right sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme. (InspectorControls) open instantly, but I first had to click in the site to open it. I opened global styles and started to style my site. I could select the uploaded fonts in typography settings (see above about fallback fonts).\nStyling buttons (the block and elements) is split into “typography” and “colors”. This hierarchy may make sense and it’s a way how many plugins in the past implemented in the customizerCustomizer Tool built into WordPress core that hooks into most modern themes. You can use it to preview and modify many of your site’s appearance settings.. Still another way may be “I want to style buttons, now show me all controls to style buttons”. At the moment one has to go into typography for text and then into color for colors.\nTop level color styles: I’m assuming this is styles “elements” and the text above (“different global elements on the site”) confirms that. I can’t define hover/focus styles for buttons – which I would have to do via CSS.\nTop level typography styles: The icons for the different entries sometimes communicate current state (eg the background color on the button item), but other settings (eg removing text-decoration underline from link) does not change that. So the list is kind of mixed of current styles and base-styles. The text Aa icon seems to have a different font (the one i defined?) than heading and captions (allthough heading / captions do inherit that font).\nWhen I open the styles for specific blocks and style the button block, the slider for its border radius is set to 0 allthough it has a border-radius (coming from coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. styles I guess). I have to move the slider up and down to get it to become 0.\nIn the storybook the text blocks do not contain any links. So to check the link styles I had to go to Design > Custom Link (the navigation block). It would be great to include a dummy lin in the paragraph block example data.\nWhen saving I get the “Are you ready to save?” screen to check which entities should be saved, even if only one entity (“Global Styles”) needs to be saved. But I guess that makes sense, since accidently publishing styles which are not perfect yet, is bad 😅\nAfter saving I have to click the WordPress dashboard icon once to get to an “overview” and then a second time to go back to wp-admin.\nI’ve exported and downloaded the theme. It contains all files I expected. The theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML. contained the styles I defined but also contained a lot of styles which I don’t know where they are coming from. Eg layout definitions constrained and basestyles with some rules for floating etc?\nI guess this is only usable for first creating your theme, since always exporting and saving to disk is cumbersome. Especially if you use theme.json to set settings for the block editor or custom CSS – it would overwrite those. Allthough that’s something I would need to test in a local dev environment with a custom theme.\nNothing crashed while using it 🙂\nThat was just a short test of using it on the instawp instance, but it was interesting to see.\n\n\n\n\n\n\n\n\nannezazu\n\n1:35 pm on April 25, 2023 \n\n\n\n\nThanks so much for your very first contribution @gaambo! It’s very helpful to have both fresh takes and perspectives from folks with different backgrounds. Expect a Test Contributor badge at the end of this as a thank you for your efforts.\nWhen I saved and returned to the previous screen a “System font” was added as well. How would I go about specifying a fallback font? Eg I normally use “Helvetica, Arial, sans-serif” as fallbacks for font-family – I guess this is only possible via custom CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site.?\nAsked here: https://github.com/WordPress/gutenberg/issues/45271#issuecomment-1521619384 You can set this via theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML. manually but I want to see if it’s done automatically when uploading fonts.\nStyling buttons (the blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. and elements) is split into “typography” and “colors”. This hierarchy may make sense and it’s a way how many plugins in the past implemented in the customizerCustomizer Tool built into WordPress core that hooks into most modern themes. You can use it to preview and modify many of your site’s appearance settings.. Still another way may be “I want to style buttons, now show me all controls to style buttons”. At the moment one has to go into typography for text and then into color for colors.\nEdited to add your feedback to a current issue on exactly this topic around the information architecture. Thanks so much:\nhttps://github.com/WordPress/gutenberg/issues/47369#issuecomment-1518729328\nTop level color styles: I’m assuming this is styles “elements” and the text above (“different global elements on the site”) confirms that. I can’t define hover/focus styles for buttons – which I would have to do via CSS.\nThat’s correct right now! There’s an effort to bring this into the Site Editor here: https://github.com/WordPress/gutenberg/issues/38277\nTop level typography styles: The icons for the different entries sometimes communicate current state (eg the background color on the button item), but other settings (eg removing text-decoration underline from link) does not change that. So the list is kind of mixed of current styles and base-styles. The text Aa icon seems to have a different font (the one i defined?) than heading and captions (allthough heading / captions do inherit that font).\nI’ll include this in the usability feedback of the recap post. I don’t think we’ll end up having it be a perfect 1:1 reflection but I think it’s worth mentioning. Right now, the main way we do this for individual blocks at least is through this preview mechanism or the style book: https://github.com/WordPress/gutenberg/issues/42919\nWhen I open the styles for specific blocks and style the button block, the slider for its border radius is set to 0 although it has a border-radius (coming from coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. styles I guess). I have to move the slider up and down to get it to become 0.\nExcellent feedback. This relates to the broader experience here: https://github.com/WordPress/gutenberg/issues/43082 I’ll note it in the recap!\nIn the storybook the text blocks do not contain any links. So to check the link styles I had to go to Design > Custom Link (the navigation block). It would be great to include a dummy lin in the paragraph block example data.\nGreat feedback! Opened an issue here: https://github.com/WordPress/gutenberg/issues/50058\nWhen saving I get the “Are you ready to save?” screen to check which entities should be saved, even if only one entity (“Global Styles”) needs to be saved. But I guess that makes sense, since accidently publishing styles which are not perfect yet, is bad 😅\nI’ve added this feedback here to a related issue: https://github.com/WordPress/gutenberg/issues/38714#issuecomment-1521641996 The friction is intentional but I know not everyone wants it.\nI’ve exported and downloaded the theme. It contains all files I expected. The theme.json contained the styles I defined but also contained a lot of styles which I don’t know where they are coming from. Eg layout definitions constrained and basestyles with some rules for floating etc?\nYou aren’t alone here! Noted on an issue opened by someone else: https://github.com/WordPress/create-block-theme/issues/324#issuecomment-1521802659\n\n\n\n\n\n\n\n\n\n\nMarcy\n\n5:50 pm on April 21, 2023 \n\n\n\n\nThere is an empty style sheet added when a blank theme is created with  CBT pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party. But adding CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. to it doesn’t work until a functions.php is added to enqueue it.\nI think that style.css should automatically be enqueued or that a functions.php with the enqueue should be included.\nI am trying to use only the editor, but think that if the stylesheet is there, it should be usable.\nThe Custom CSS that wasn’t working for me yesterday is fine today. I did leave the site and then login again when it worked. When it didn’t work, I had been working on the same open site for awhile.\n\n\n\n\n\n\n\n\nannezazu\n\n7:16 pm on April 22, 2023 \n\n\n\n\nThere is an empty style sheet added when a blank theme is created with CBT pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party. But adding CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. to it doesn’t work until a functions.php is added to enqueue it.\nI think that style.css should automatically be enqueued or that a functions.php with the enqueue should be included.\nI am trying to use only the editor, but think that if the stylesheet is there, it should be usable.\nOpened an issue here: https://github.com/WordPress/create-block-theme/issues/334 Excellent feedback!\n\n\n\n\n\n\n\n\nannezazu\n\n7:51 pm on April 22, 2023 \n\n\n\n\nLooping back here to note that this is done to provide theme information! Tied to this, I also wanted to share this resource on block specific CSS and using theme.json. If you do so, it’ll appear under the CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. settings for that individual blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. too!\n\n\n\n\n\n\n\n\n\n\n\n\nJessica Lyschik\n\n7:35 pm on April 21, 2023 \n\n\n\n\nSetup: local WP 6.2 install, Create BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. Theme (1.8.1) pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party, GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ (15.6.1)\nWith the Create Blocks theme creating a completely blank theme, I had the issue of finding why the headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. was full width and the footer was not, and specifically finding the block that had the full width assigned.\nWhat I found confusing is that for typography, there’s the preset font sizes (S, M, L, XL) but there’s no interface to change those preset sizes globally from the editor. Same for the defaults of Padding, Margin, Block Spacing and similar items.\nWhen arranging the site title and site tagline next to each other with the Row variation, there’s no setting for the CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. property align-items, which with the value baseline would allow the smaller site tagline to be nicely aligned with the site title. I can add an extra class for this and it works in the backend, but in the frontend my class is overwritten by the default is-layout-flex class, which has align-items: center. In the backend, the order of the classes is correct, while in the frontend the custom classes load too early and are overwritten by the WP default classes, so I have to use !important here.\nFor the social icons block, it would be nice to have an exact size adjustment like for fonts, instead of just “Small”, “Normal”, “Large” and “Huge”.\nI had adjusted the font size under Styles -> Typography -> Text to be higher than the default one, however it would not apply to all blocks in the content. I had to manually update Post Date, Categories and Tags. For the Post Author and Post Content blocks changing the font size to a custom of 21px did not have any effect on the block. For the post content block, the font size is set at the surrounding div, but does not apply to the paragraph child elements, as there’s a default CSS p { font-size: 16px }, which came from a the font size setting in the Paragraph block, as I found out after some testing. I wonder where the 16px from came from, either from the Create Block Theme or some default setting in WP?\nFor the Pagination blocks, it would be great if the next Next Post and Previous Post could be changed to something else.\nI chose a Google Font at the exact step in the instructions and it worked fine. When I wanted to change the font later on, I can add new fonts to WP through the “Manage Theme Fonts” page, however the newly fonts there don’t show properly (they are added, but the font always falls back to the default system serif font). Also, the list of available fonts does not update in the site editor, I do still have the old font in there, even if I deleted it from the font management page. The font files are added to the assets folder so they are “physically” there, however they’re not loading in WP or the site editor. I’ve checked the Custom Styles entry in the wp_posts table and the old font is there, but none of the new fonts are.\nIt took me a while to figure out that you need to switch at the top between the Styles and Settings if you’re stuck in one of these sections and want to change the individual block settings instead of the global styles for a particular block.\nI do not find it super intuitive to see if I’m editing styles on a global level, for a specific block type or for that one block that is currently selected. The interfaces look all the same, but except for the headline there’s no real difference. I wonder if it could be more highlighted at which level I’m currently changing settings.\n\n\n\n\n\n\n\n\nannezazu\n\n3:37 pm on April 28, 2023 \n\n\n\n\nHey @luminuu! Thanks so much for yet another contribution to the outreach program. It’s always helpful to get your detailed insights.\nWith the Create Blocks theme creating a completely blank theme, I had the issue of finding why the headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. was full width and the footer was not, and specifically finding the blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. that had the full width assigned.\nI’m curious what you think but, rather than opening an issue, this feels related to a different request to have empty templates when starting out: https://github.com/WordPress/create-block-theme/issues/80 This would allow you to set what you want rather than wrestling with what’s there. Let me know though if you’d prefer an issue is created to make both full width.\nWhat I found confusing is that for typography, there’s the preset font sizes (S, M, L, XL) but there’s no interface to change those preset sizes globally from the editor. Same for the defaults of Padding, Margin, Block Spacing and similar items.\nNoted here: https://github.com/WordPress/gutenberg/issues/43443#issuecomment-1525687396\nWhen arranging the site title and site tagline next to each other with the Row variation, there’s no setting for the CSSCSS CSS is an acronym for cascading style sheets. This is what controls the design or look and feel of a site. property align-items, which with the value baseline would allow the smaller site tagline to be nicely aligned with the site title. I can add an extra class for this and it works in the backend, but in the frontend my class is overwritten by the default is-layout-flex class, which has align-items: center. In the backend, the order of the classes is correct, while in the frontend the custom classes load too early and are overwritten by the WP default classes, so I have to use !important here.\nI’m going to chat with some of the experts working on Layout here as I’m not sure if it makes the most sense to open a new issue for this, note it as general usability feedback, or comment on a current issue. I’ll loopLoop The Loop is PHP code used by WordPress to display posts. Using The Loop, WordPress processes each post to be displayed on the current page, and formats it according to how it matches specified criteria within The Loop tags. Any HTML or PHP code in the Loop will be processed on each post. https://codex.wordpress.org/The_Loop. back here either way and include it in the recap.\nFor the social icons block, it would be nice to have an exact size adjustment like for fonts, instead of just “Small”, “Normal”, “Large” and “Huge”.\nNoted here on a related issue: https://github.com/WordPress/gutenberg/issues/39467#issuecomment-1527740221\nI had adjusted the font size under Styles -> Typography -> Text to be higher than the default one, however it would not apply to all blocks in the content. I had to manually update Post Date, Categories and Tags. For the Post Author and Post Content blocks changing the font size to a custom of 21px did not have any effect on the block. For the post content block, the font size is set at the surrounding div, but does not apply to the paragraph child elements, as there’s a default CSS p { font-size: 16px }, which came from a the font size setting in the Paragraph block, as I found out after some testing. I wonder where the 16px from came from, either from the Create Block Theme or some default setting in WP?\nNoted here on a related issue: https://github.com/WordPress/gutenberg/issues/45086#issuecomment-1527745839 with this issue looking into possible ways of showing the “levels” of styles: https://github.com/WordPress/gutenberg/issues/49278\nFor the Pagination blocks, it would be great if the next Next Post and Previous Post could be changed to something else.\nNoted here on a related issue about expanding the options of these blocks: https://github.com/WordPress/gutenberg/issues/49266\nI chose a Google Font at the exact step in the instructions and it worked fine. When I wanted to change the font later on, I can add new fonts to WP through the “Manage Theme Fonts” page, however the newly fonts there don’t show properly (they are added, but the font always falls back to the default system serif font). Also, the list of available fonts does not update in the site editor, I do still have the old font in there, even if I deleted it from the font management page. The font files are added to the assets folder so they are “physically” there, however they’re not loading in WP or the site editor. I’ve checked the Custom Styles entry in the wp_posts table and the old font is there, but none of the new fonts are.\nOpened an issue here for investigation: https://github.com/WordPress/create-block-theme/issues/343 Thanks for the detailed report.\n\n\n\n\n\n\n\n\n\n\nCourtney Robertson\n\n2:00 pm on April 27, 2023 \n\n\n\n\nI didn’t finish quite in time, but will have something in today to share.\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \n\n\n\nPost navigation\n← Test Chat Summary: 28 March 2023 Hallway Hangout: Let’s chat about Moving to the Site Editor →\n\n\n\n\n\n\n\nSearchTesting Plugins\n\nDesign Experiments\n\nGutenberg\n\nBeta Testing\n\nBeta Plugins\nEmail Updates\n\n\nSubscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSign me up!\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 36 other subscribers\t\t\t\t\n\nCategories\n\nCall for Testing\n\nCore E2E\n\nKibble\n\nMeetings\n\nNUX\n\nstatus\n\nSummary\n\nUsability Testing\n\nVisual Record\n\nWeek in Test\n\n\n\n\n\n\t\t\tTeam Pledges\n\t\t\n\n809 people have pledged time to contribute to Test Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2F2023%2F03%2F29%2Ffse-program-exploration-build-a-block-theme%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/test/",
        "https://make.wordpress.org/test/handbook/triage/",
        "http://make.wordpress.org/test/handbook/",
        "https://make.wordpress.org/test/handbook/glossary/",
        "https://make.wordpress.org/test/handbook/full-site-editing-outreach-experiment/",
        "https://make.wordpress.org/test/tag/fse-testing-call/",
        "https://wordpress.slack.com/archives/C015GUFFC00",
        "https://wordpress.slack.com/messages/core-test/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2Fwelcome%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/annezazu/",
        "https://make.wordpress.org/test/tag/fse-exploration/",
        "https://make.wordpress.org/test/tag/fse-outreach-program/",
        "https://wordpress.org/news/2023/03/dolphy/",
        "https://developer.wordpress.org/themes/basics/tools-resources/#block-themes",
        "https://make.wordpress.org/core/2023/02/04/phase-2-finale/",
        "https://app.instawp.io/launch?t=fse-block-theme-exploration&d=v1",
        "https://wordpress.org/gutenberg/",
        "https://wordpress.slack.com/archives/C015GUFFC00",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://profiles.wordpress.org/annezazu/",
        "https://make.wordpress.org/test/tag/fse-exploration/",
        "https://make.wordpress.org/test/tag/fse-outreach-program/",
        "https://make.wordpress.org/test/2023/03/29/fse-program-exploration-build-a-block-theme/?share=twitter",
        "https://make.wordpress.org/test/2023/03/29/fse-program-exploration-build-a-block-theme/?share=facebook",
        "https://make.wordpress.org/test/2023/03/29/fse-program-exploration-build-a-block-theme/?share=linkedin",
        "https://make.wordpress.org/test/2023/03/29/fse-program-exploration-build-a-block-theme/?share=pocket",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2F2023%2F03%2F29%2Ffse-program-exploration-build-a-block-theme%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/nomadskateboarding/",
        "https://profiles.wordpress.org/mikachan/",
        "https://profiles.wordpress.org/wesatintellitonic/",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://youtu.be/tniEqn9q0fk",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://github.com/WordPress/gutenberg/issues/49640",
        "https://github.com/WordPress/gutenberg/issues/48651#issuecomment-1499238649",
        "https://github.com/WordPress/gutenberg/issues/44581",
        "https://github.com/WordPress/gutenberg/issues/44582",
        "https://github.com/WordPress/gutenberg/issues/42425",
        "https://make.wordpress.org/core/2023/03/06/minimum-height-dimensions-block-support/",
        "https://youtu.be/tniEqn9q0fk?t=1556",
        "https://github.com/WordPress/gutenberg/issues/41397",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://profiles.wordpress.org/annezazu/",
        "https://github.com/WordPress/gutenberg/issues/45117#issuecomment-1418395790",
        "https://profiles.wordpress.org/dsy3t/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/dsy3t/",
        "https://wordpress.org/plugins/",
        "https://profiles.wordpress.org/jameskoussertari/",
        "https://gutenbergmarket.com/news/a-comprehensive-guide-to-building-wordpress-block-themes",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/jameskoussertari/",
        "https://developer.wordpress.org/news/2023/02/intrinsic-design-theming-and-rethinking-how-to-design-with-wordpress/",
        "https://github.com/WordPress/gutenberg/issues/48458",
        "https://github.com/WordPress/gutenberg/pull/49085",
        "https://github.com/WordPress/gutenberg/pull/49219",
        "https://github.com/WordPress/gutenberg/issues/47043",
        "https://make.wordpress.org/core/2023/03/07/miscellaneous-editor-changes-in-wordpress-6-2/#edit-block-style-variations-from-theme-json",
        "https://github.com/WordPress/gutenberg/issues/49602",
        "https://github.com/",
        "https://github.com/WordPress/gutenberg/issues/49642",
        "https://profiles.wordpress.org/jameskoussertari/",
        "https://github.com/",
        "https://github.com/WordPress/gutenberg/issues/34853",
        "https://profiles.wordpress.org/annezazu/",
        "https://github.com/WordPress/gutenberg/issues/40870",
        "https://wordpress.org/",
        "https://profiles.wordpress.org/antigone7/",
        "https://drive.google.com/file/d/1dgrmcSbTgLiieHc2PuxO1CRV23rcGr09/view?usp=share_link",
        "https://drive.google.com/file/d/1Z6Dva_xFPABtpROWz6c07MIAdNrJX2r6/view?usp=share_link",
        "http://wp62.test/wp-content/plugins/gutenberg/build/block-editor/index.min.js?ver=65c2a14c9bcef52f178e:7:19441",
        "https://profiles.wordpress.org/annezazu/",
        "https://github.com/WordPress/gutenberg/issues/49666",
        "https://profiles.wordpress.org/antigone7/",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://wordpress.org/gutenberg/",
        "https://github.com/WordPress/gutenberg/issues/49666#issuecomment-1502543325",
        "https://profiles.wordpress.org/antigone7/",
        "https://wordpress.org/gutenberg/",
        "https://profiles.wordpress.org/antigone7/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/antigone7/",
        "https://profiles.wordpress.org/franz00/",
        "https://fullsiteediting.com/block-theme-generator/",
        "https://github.com/wpengine/frost/blob/trunk/theme.json",
        "https://github.com/andersnoren/beaumont/blob/main/theme.json",
        "https://www.w3schools.com/colors/colors_monochromatic.asp",
        "https://github.com/WordPress/create-block-theme/issues/184#issuecomment-1442778292",
        "https://wordpress.org/plugins/pattern-manager/",
        "http://php.net/manual/en/intro-whatis.php",
        "https://github.com/franzaurus/nocode-gen",
        "https://bbt.dwrf.my.id/",
        "https://profiles.wordpress.org/jffng/",
        "https://wordpress.org/gutenberg/",
        "https://github.com/WordPress/gutenberg/pull/47389",
        "http://php.net/manual/en/intro-whatis.php",
        "https://github.com/WordPress/create-block-theme/issues/333",
        "https://profiles.wordpress.org/franz00/",
        "https://wordpress.org/gutenberg/",
        "http://s.w.org",
        "https://i.imgur.com/bbgD2gU.png",
        "https://i.imgur.com/mzafq6L.png",
        "https://i.imgur.com/F3ceXjx.png",
        "https://i.imgur.com/bfEYWvu.png",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/franz00/",
        "http://php.net/manual/en/intro-whatis.php",
        "https://profiles.wordpress.org/antigone7/",
        "https://wordpress.org/gutenberg/",
        "https://codex.wordpress.org/The_Loop",
        "https://fullsiteediting.com/block-theme-generator/",
        "https://profiles.wordpress.org/antigone7/",
        "https://profiles.wordpress.org/antigone7/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/antigone7/",
        "https://github.com/WordPress/gutenberg/issues/47369#issuecomment-1518729328",
        "https://github.com/WordPress/gutenberg/issues/41449",
        "https://profiles.wordpress.org/antigone7/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/soivigol/",
        "https://drive.google.com/file/d/1TRXfDiAp6XLWuCLi2zpmeucKgbZXWbNb/view?usp=share_link",
        "https://drive.google.com/file/d/1sgDlcJx55-WZox7_rJb0ceOFX9DIzoqR/view?usp=share_link",
        "http://test-fse.soivigol.dev/?_wp-find-template=true",
        "https://drive.google.com/file/d/1UOA7wTtVEFUelWEuTCqedSXure8zE6En/view?usp=share_link",
        "https://drive.google.com/file/d/1mtftUk4rldzX1DDh3_ndb7M1z3CprSA9/view?usp=share_link",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/soivigol/",
        "https://github.com/WordPress/gutenberg/issues/45271",
        "https://github.com/WordPress/gutenberg/issues/45271#issuecomment-1518734181",
        "https://developer.wordpress.org/themes/advanced-topics/child-themes/",
        "https://profiles.wordpress.org/soivigol/",
        "https://developer.wordpress.org/themes/advanced-topics/child-themes/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/soivigol/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/gaambo/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/gaambo/",
        "https://github.com/WordPress/gutenberg/issues/45271#issuecomment-1521619384",
        "https://github.com/WordPress/gutenberg/issues/47369#issuecomment-1518729328",
        "https://github.com/WordPress/gutenberg/issues/38277",
        "https://github.com/WordPress/gutenberg/issues/42919",
        "https://github.com/WordPress/gutenberg/issues/43082",
        "https://github.com/WordPress/gutenberg/issues/50058",
        "https://github.com/WordPress/gutenberg/issues/38714#issuecomment-1521641996",
        "https://github.com/WordPress/create-block-theme/issues/324#issuecomment-1521802659",
        "https://profiles.wordpress.org/antigone7/",
        "https://profiles.wordpress.org/annezazu/",
        "https://github.com/WordPress/create-block-theme/issues/334",
        "https://profiles.wordpress.org/annezazu/",
        "https://developer.wordpress.org/news/2023/04/per-block-css-with-theme-json/",
        "https://profiles.wordpress.org/luminuu/",
        "https://wordpress.org/gutenberg/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/luminuu/",
        "https://github.com/WordPress/create-block-theme/issues/80",
        "https://github.com/WordPress/gutenberg/issues/43443#issuecomment-1525687396",
        "https://codex.wordpress.org/The_Loop",
        "https://github.com/WordPress/gutenberg/issues/39467#issuecomment-1527740221",
        "https://github.com/WordPress/gutenberg/issues/45086#issuecomment-1527745839",
        "https://github.com/WordPress/gutenberg/issues/49278",
        "https://github.com/WordPress/gutenberg/issues/49266",
        "https://github.com/WordPress/create-block-theme/issues/343",
        "https://profiles.wordpress.org/courane01/",
        "/test/2023/03/29/fse-program-exploration-build-a-block-theme/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2F2023%2F03%2F29%2Ffse-program-exploration-build-a-block-theme%2F&locale=en_US",
        "https://make.wordpress.org/test/2023/03/28/test-chat-summary-28-march-2023/",
        "https://make.wordpress.org/test/2023/04/04/hallway-hangout-lets-chat-about-moving-to-the-site-editor/",
        "#",
        "https://github.com/WordPress/design-experiments/",
        "https://wordpress.org/plugins/gutenberg/",
        "https://wordpress.org/plugins/wordpress-beta-tester/",
        "https://wordpress.org/plugins/browse/beta/",
        "https://make.wordpress.org/test/category/call-for-testing/",
        "https://make.wordpress.org/test/category/core-e2e/",
        "https://make.wordpress.org/test/category/kibble/",
        "https://make.wordpress.org/test/category/meetings/",
        "https://make.wordpress.org/test/category/nux/",
        "https://make.wordpress.org/test/category/status/",
        "https://make.wordpress.org/test/category/summary/",
        "https://make.wordpress.org/test/category/usability-testing/",
        "https://make.wordpress.org/test/category/visual-record/",
        "https://make.wordpress.org/test/category/week-in-test/",
        "https://make.wordpress.org/test/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}