{
    "title": "History | Watershed Review",
    "body": "\n\n\n\n\n\n\n\nWatershed Review\nEst. 2012\n\n\n\n\nMenu\n\nSkip to content\n\nHomeAbout This Blog\nHistory\nSubmit\n\n\n\n\n\n\nHistory \n\nA magazine does have this “ life” to it (proper to it), does have streets, can show lights, movie houses, bars….\nCharles Olson\n \nA magazine, then, is a place, has a geography, and a history, a demographic, a shape. The geography, demographic, and shape of Watershed are changing radically with this first on-line issue, but its history stays the same. The history of a magazine is part of its identity (proper to its identity) as is the history of any place.\nIt began humbly and somewhat unexpectedly as a 1-unit project in the first class in Literary Editing and Publishing in the English Department at California State University, Chico, spring 1977.  I had been working, in addition to my teaching, as an editor at Dustbooks, a small press in Paradise, California,  and although the Small Press (independent, mostly literary small publishers) was at the time at best scorned as ephemera, and at worse confused with vanity publishing, my experience there qualified me to create and teach a course, suddenly demanded by higher-ups, in editing and publishing. It was probably intended to be “scholarly” editing, the study of, for example, Ezra Pound’s extensive editing of T.S. Eliot’s “The Wasteland.” But my experience had taught me the excitement and pleasure of editing as a practice, the ongoing activities by which a manuscript is selected, edited, and turned into a book or magazine. I insisted the class have a 1-unit practicum. Most students accepted internships with various newsletters and small printer/publishers, but two held out for creating one issue of a literary magazine, a possibility I had announced without really believing in it.\nWe had no budget, but I guaranteed them, Casey Huff and Jennifer Scott, $300 for paper and printing, everything else had to be work, what most small presses were used to substituting for money and machinery. The title, arrived at after a discussion with the members of the class, was Trial Impression, a printing term used for the first papers printed on a letterpress to check the pressure of the type against the paper. This trial made a good impression, a respectable number of submissions from local writers, an issue that arrived before the end of the semester, eagerly received. We didn’t sell out, because we didn’t sell it. The money, which was to have come from my salary, came in the end from the English Department budget, thanks to one of the best secretaries in the University, Ginger Rush. But the conditions of that money were that it couldn’t be sold, so we gave it away at a table in Taylor Hall.\nThere hadn’t been a literary magazine at the University since the demise of Sweet Thief, some years before I arrived on campus in 1972. It had been published in the heady days in which John Gardner taught in the English Department and Raymond Carver enrolled to study with him. So when we saw that first issue come back from the University Print Shop with a small drawing of a Gutenberg Press and just the title on the cover, we began to plot a way to keep it going. The second issue, which appeared in the fall semester, was done with a few enthusiasts, including Casey Huff, who continued with the magazine and afterwards with the Certificate in Literary Editing and Publishing until its demise in the recent, drastic budget cuts, eventually becoming its coordinator. Another enthusiast, Ken Connor, who became a novelist and journalist/editor with a column at the San Francisco Chronicle, was part of the team and also made us a small light table for layout which served wonderfully until we were able to afford a larger one. We borrowed money from Associated Students for that issue and the one that followed and began to sell it at the end of each semester. Once we discovered that a literary magazine qualified for Instructionally Related Activities Funds, Trial Impression became a regular part of the class, with two issues each academic year.\nSince it was a practicum and the editors were the students in the class, who were just learning how to evaluate manuscripts and edit them, the magazine was under my supervision, so to speak. I established rules for them and for myself: the student editors had the final say; I reserved for myself the right to cry if, when I saw the final selections I thought something terrible had been perpetrated, or something wonderful ignored. They had to listen to my arguments, but did not have to follow my suggestions. (Both Casey and I remember crying about a chicken poem chosen by two different groups in two successive semesters. Each time they heeded our protests. The third time it was chosen we gave in and the poem was published.) I didn’t attend selection meetings, lest they look to me when the choices became difficult, but was always nearby to be called in case of crisis or bloodshed. The submissions had to be read anonymously, and the students had to write constructive rejection letters to everyone who was not accepted except for faculty, in which case, I wrote.\nI also tried during class time to convey some principles of my own: don’t assign points to each work except as a personal way of ranking. If you all simply add up your numbers, you will have a magazine of all 6s or 7s, much less interesting than a magazine with some 10s, even if that means there are also some 2s and 3s. That is, find what you really love, and be prepared to fight for it, even if it means bargaining with someone who has chosen something you hate. All of this was designed, in my mind, to produce two important results: teach students to apply aesthetic principles and produce the best magazine possible given our constraints.\nOne of the cardinal principles of print periodicals is that they must become a habit to be successful, part of a regular schedule in the lives of their readers. Trial Impression hung in until eventually people began to ask when it was coming out, and when they could send submissions.\nSeveral classes of student editors longed to change the name, feeling that the impression of tentativeness and beginnings was behind us. Reluctantly, I agreed, saying they could make the change if they could all agree on a new title. It took several years, but one, quite stunning class of students, many of them also writers, agreed on Watershed and with two subsequent issues carrying the rubric “formerly Trial Impression” it was done.\nThe magazine chugged along with some special issues, theme issues, and in the good old days when we had writers come to campus to read, and hosted the Arts festival that brought many notables to campus, the students could ask guest writers for something for Trial Impression/Watershed. Thus we have published Buckminster Fuller, Gary Snyder, and Diane di Prima, among others. We did some large anniversary issues, the twentieth with a retrospective of “The Best of the Last 20 Years,” and we published work from the other CSU campuses in the short-lived Consortium MFA. In 2007, a special double issue celebrated the magazine’s thirtieth anniversary.\nThe magazine has been shepherded by others, both temporarily when I was on leave, and then permanently when I retired; Casey Huff, Carole Oles, and Beth Spencer (editor/publisher of Bear Star Press) among them. It has always been a joy, a job both difficult, fraught with traps, always subject to the vicissitudes of printers (and administrators), and rewarding in ways quite different from teaching literature. When the certificate program was killed by budget cuts, Watershed continued along with its class for a semester, but, in the end, when the class too was cut in 2011, it disappeared.\nWhat you are about to read now, Watershed Review, is its new incarnation, an on-line literary journal seeking to reach a much greater audience than the magazine had when it was a practicum, but building on its history and legacy for energy, enthusiasm, aesthetic integrity, and taste. It is a new joy for those of us who worked on its earlier identity. It is delineating its new geography, shaping itself anew, seeking a new and expanded demographic, writing a history that begins now. All of us to whom the publication has meant a great deal for the last 36 years salute this rebirth and look forward to the new developments we could not even have imagined as we bent over that small light table, lining up columns of galley and correcting the last mistakes with white-out.\n \nEllen L. Walker\nChico, California\n2013\n \n \n \n \n\n\n \nShare this:TwitterFacebookLike this:Like Loading... \n\n\n\n\t\t\tOne thought on “History”\t\t\n\n\n\n\n\n Darlene Bryant Koenig says: \n\n\n\n\t\t\t\t\t\t\tMay 29, 2013 at 10:27 pm\t\t\t\t\t\t\n\n\n\n\nI, too, remember that first one-unit class — all of us gathered at a big rectangular table, thumbing through the stacks of literary magazines Ellen had brought in for inspiration (or maybe just to show us the challenge we were up against). \nI also remember the thrill of suggesting its first name. I had just begun working at a newspaper, and my first sensory jolt each morning was walking through the back door into a press room filled with the combined smell of ink, paper and coffee. Among other things, that job gave me the printing bug (if not the money to feed myself), and its historic terms were like passwords into a secret club of somewhat grimy members. Trial Impression felt right in lots of ways then, though the later change to Watershed was just as perfect.\nBecause I live far from Chico now, I appreciate that Watershed is just a link — if not in ink — away.\n\n\nReply \n\n\n\n\nLeave a Reply Cancel reply\n\n\nEnter your comment here...\n\n\n\n\nFill in your details below or click an icon to log in:\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n\n\n \n \n\n\nEmail (required) (Address never made public)\n\n\n\nName (required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\tYou are commenting using your WordPress.com account.\t\t\t\n\t\t\t\t( Log Out / \n\t\t\t\tChange )\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\tYou are commenting using your Facebook account.\t\t\t\n\t\t\t\t( Log Out / \n\t\t\t\tChange )\n\t\t\t\n\n\n\n\n\n\nCancel\nConnecting to %s\n\n\n\n\n Notify me of new comments via email. Notify me of new posts via email.\n \n\n\n\nΔ \n\n\n\n\n\n\nBlogroll\n\nDiscuss\nGet Inspired\nGet Polling\nGet Support\nLearn WordPress.com\nTheme Showcase\nWordPress Planet\nWordPress.com News\n\n\nTopics\n\nIntern Spotlight\n\nUncategorized\n\n\nUpcoming Events No upcoming events\nArchives\n\nMay 2022\nMarch 2022\nMay 2020\nOctober 2019\nMay 2019\nApril 2019\nOctober 2018\nJanuary 2018\nDecember 2017\nOctober 2017\nSeptember 2017\nApril 2017\nNovember 2016\nOctober 2016\nSeptember 2016\nDecember 2015\nOctober 2015\nSeptember 2015\nApril 2015\nMarch 2015\nFebruary 2015\nNovember 2014\nOctober 2014\nSeptember 2014\nApril 2014\nFebruary 2014\nNovember 2013\nOctober 2013\nAugust 2013\nApril 2013\nMarch 2013\nFebruary 2013\nJanuary 2013\n\n \n\nFollow me on TwitterMy Tweets \n\n\n\n\nCreate a free website or blog at WordPress.com.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\tPrivacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. \nTo find out more, including how to control cookies, see here:\n\t\t\t\t\n\t\t\tCookie Policy\t\t\n\n\n \n\n\n\nFollow\n\n\nFollowing\n\n\n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\nJoin 44 other followers\n\n\n\n\n\n\n\n \n\n\t\t\t\t\t\t\t\t\t\t\t\tSign me up\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tAlready have a WordPress.com account? Log in now. \n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\n\n Customize\n\n\n\n\nFollow\n\n\nFollowing\n\n\nSign up\nLog in\nCopy shortlink\n\n\n\t\t\t\t\t\t\t\t\t\t\tReport this content\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tView post in Reader\t\t\t\t\t\t\t\t\t\t\n\n\nManage subscriptions\n\nCollapse this bar\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n%d bloggers like this:\t\t\n\n\n \n\n\n",
    "links": [
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/",
        "#content",
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/about/",
        "https://watershedcsuc.wordpress.com/history/",
        "https://watershedcsuc.wordpress.com/submit/",
        "https://watershedcsuc.wordpress.com/history/?share=twitter",
        "https://watershedcsuc.wordpress.com/history/?share=facebook",
        "https://watershedcsuc.wordpress.com/history/#comment-56",
        "https://watershedcsuc.wordpress.com/history/?replytocom=56#respond",
        "/history/#respond",
        "#comment-form-guest",
        "#comment-form-load-service:WordPress.com",
        "#comment-form-load-service:Facebook",
        "https://gravatar.com/site/signup/",
        "javascript:HighlanderComments.doExternalLogout( 'wordpress' );",
        "#",
        "javascript:HighlanderComments.doExternalLogout( 'facebook' );",
        "#",
        "javascript:HighlanderComments.cancelExternalWindow();",
        "http://en.forums.wordpress.com/",
        "http://www.plinky.com/",
        "http://polldaddy.com/",
        "http://en.support.wordpress.com/",
        "http://learn.wordpress.com/",
        "http://theme.wordpress.com/",
        "http://planet.wordpress.org/",
        "http://en.blog.wordpress.com/",
        "https://watershedcsuc.wordpress.com/category/intern-spotlight/",
        "https://watershedcsuc.wordpress.com/category/uncategorized/",
        "https://watershedcsuc.wordpress.com/2022/05/",
        "https://watershedcsuc.wordpress.com/2022/03/",
        "https://watershedcsuc.wordpress.com/2020/05/",
        "https://watershedcsuc.wordpress.com/2019/10/",
        "https://watershedcsuc.wordpress.com/2019/05/",
        "https://watershedcsuc.wordpress.com/2019/04/",
        "https://watershedcsuc.wordpress.com/2018/10/",
        "https://watershedcsuc.wordpress.com/2018/01/",
        "https://watershedcsuc.wordpress.com/2017/12/",
        "https://watershedcsuc.wordpress.com/2017/10/",
        "https://watershedcsuc.wordpress.com/2017/09/",
        "https://watershedcsuc.wordpress.com/2017/04/",
        "https://watershedcsuc.wordpress.com/2016/11/",
        "https://watershedcsuc.wordpress.com/2016/10/",
        "https://watershedcsuc.wordpress.com/2016/09/",
        "https://watershedcsuc.wordpress.com/2015/12/",
        "https://watershedcsuc.wordpress.com/2015/10/",
        "https://watershedcsuc.wordpress.com/2015/09/",
        "https://watershedcsuc.wordpress.com/2015/04/",
        "https://watershedcsuc.wordpress.com/2015/03/",
        "https://watershedcsuc.wordpress.com/2015/02/",
        "https://watershedcsuc.wordpress.com/2014/11/",
        "https://watershedcsuc.wordpress.com/2014/10/",
        "https://watershedcsuc.wordpress.com/2014/09/",
        "https://watershedcsuc.wordpress.com/2014/04/",
        "https://watershedcsuc.wordpress.com/2014/02/",
        "https://watershedcsuc.wordpress.com/2013/11/",
        "https://watershedcsuc.wordpress.com/2013/10/",
        "https://watershedcsuc.wordpress.com/2013/08/",
        "https://watershedcsuc.wordpress.com/2013/04/",
        "https://watershedcsuc.wordpress.com/2013/03/",
        "https://watershedcsuc.wordpress.com/2013/02/",
        "https://watershedcsuc.wordpress.com/2013/01/",
        "https://twitter.com/466661251926335488",
        "https://wordpress.com/?ref=footer_website",
        "https://automattic.com/cookies/",
        "",
        "",
        "https://watershedcsuc.wordpress.com",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2Fhistory%2F&signup_flow=account",
        "https://watershedcsuc.wordpress.com",
        "https://watershedcsuc.wordpress.com/wp-admin/customize.php?url=https%3A%2F%2Fwatershedcsuc.wordpress.com%2Fhistory%2F",
        "",
        "",
        "https://wordpress.com/start/",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2Fhistory%2F&signup_flow=account",
        "https://wp.me/P2GWv4-1U",
        "http://en.wordpress.com/abuse/?report_url=https://watershedcsuc.wordpress.com/history/",
        "https://wordpress.com/read/blogs/39787326/posts/118",
        "https://subscribe.wordpress.com/",
        ""
    ]
}