{
    "title": "Computing and Communications Services – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Computing and Communications Services\n\t\t\t    \n                            CCSV Menu\n                        Show search box.Computing and Communications ServicesProjectsNetwork ProjectsDatacenter Firewall UpgradeDatacenter Network UpgradeEnterprise Systems ProjectsRogue Tenant MigrationTelephony ProjectsPhone System UpgradeInfrastructure ProjectsHomeCompleted ProjectsHomeOur ServicesBilling ServicesBilling Services and RatesAdmin BillingNetwork ServicesServer Hosting ServicesTelephone ServicesUnified CommunicationsAbout UsStaffPolicies and DocumentsAcceptable Use PolicyInfrastructure DocumentationFrequently Asked QuestionsComputing and Communications ServicesProjectsNetwork ProjectsDatacenter Firewall UpgradeDatacenter Network UpgradeEnterprise Systems ProjectsRogue Tenant MigrationTelephony ProjectsPhone System UpgradeInfrastructure ProjectsHomeCompleted ProjectsHomeOur ServicesBilling ServicesBilling Services and RatesAdmin BillingNetwork ServicesServer Hosting ServicesTelephone ServicesUnified CommunicationsAbout UsStaffPolicies and DocumentsAcceptable Use PolicyInfrastructure DocumentationFrequently Asked Questions\n        Our Office\n        Location IconComputing and Communications Services\n                                                                            Butte Hall, Room 417\n                                                                530-898-4616Regular Hours\n                                                                            8 a.m. - 5 p.m.\n                                                                \n                                                                                Monday-Friday\n                                                                    Current page:  CCSV\n                                        \n    \t\tComputing and Communications Services\n    \t\n                        Network Refresh Project\n                    This spring, the Division of IT will be performing major upgrades to the campus network hardware, including replacing network switches in all State-supported buildings. Click here to visit our project page to learn more.\n                        Phone System Upgrade\n                    In June 2020, CCSV began an upgrade of the existing campus phone system. For more details and information, click here to visit our Phone System Upgrade page. Be sure to check back frequently to get the newest information as it becomes available.Welcome to Computing and Communications Services (CCSV).  We are the organization within Information Technology(opens in new window) responsible for the campus data centers, wired and wireless networks, servers and telephone services.  CCSV is also leading efforts within the CSU system to collaborate, migrate or deploy new services into cloud-based service providers such as Amazon AWS, Microsoft Azure and other software as a service (SaaS) providers.Our Organization IncludesCommunications Account Services (CASV) creates and manages telecom billing accounts and administers the Admin Telecom Billing website. This online tool provides campus departments the ability to review their monthly voice and network charges. CASV also processes orders pertaining to phone line and network installations, repairs and maintenance, as well as provides assistance with phone set features and settings.Enterprise Systems Group (ESYS) designs and maintains the computing and data storage environment for campus-wide systems. This environment includes physical and virtual servers that support campus resources such as centralized directory, network, portal, web, voicemail, and data warehouse. The ESYS team also provides Oracle and SQL database services in support of the campus resources and applications such as Canvas and data warehouse. ESYS also manages the connection to Microsoft Exchange cloud-based email for faculty and staff.In addition to supporting the campus enterprise computing environment, ESYS also provides server hosting and co-location services to campus departments and affiliates for department-specific applications and manages secure campus data center facilities that support the on-premise internet and computing infrastructure.Network Operations (NOP) provides network operations, design, and development for all networks, both on-campus and major satellite locations. This scope of operations includes access networks (wireless, desktop wired connectivity), datacenter support, and network security infrastructure.Telecommunications Services (TSRV) provides design, implementation, and management of voice and data communications on campus. TSRV services include telephone and networking cabling infrastructure for the campus telecommunications system, supported devices, and associated peripheral equipment, as well as management of the telephone and voicemail systems.Information TechnologyKendall Hall, 109www.csuchico.edu/itSupport Our CollegeMore in our divisionComputing & Communication ServicesCreative Media & TechnologyEnterprise ApplicationsInformation SecurityInstitutional Research and Strategic Analytics (IRSA)IT Administrative ServiceIT Support ServicesTechnology Equity and Inclusion\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "projects/network-projects/datacenter-firewall-upgrade.shtml",
        "projects/network-projects/datacenter-network-upgrade.shtml",
        "projects/enterprise-systems-projects/rogue-tenant-migration-project.shtml",
        "projects/telephony-projects/phone-system-upgrade.shtml",
        "projects/infrastructure-projects/infrastructure-projects.shtml",
        "projects/completed-projects/completed-projects.shtml",
        "services/billing/index.shtml",
        "services/billing/admin.shtml",
        "services/network.shtml",
        "services/server-hosting.shtml",
        "services/telephone/index.shtml",
        "services/unified-communications/index.shtml",
        "about/staff.shtml",
        "policies-documents/acceptable-policy.shtml",
        "policies-documents/documentation.shtml",
        "frequently-asked-questions.shtml",
        "index.shtml",
        "projects/network-projects/datacenter-firewall-upgrade.shtml",
        "projects/network-projects/datacenter-network-upgrade.shtml",
        "projects/enterprise-systems-projects/rogue-tenant-migration-project.shtml",
        "projects/telephony-projects/phone-system-upgrade.shtml",
        "projects/infrastructure-projects/infrastructure-projects.shtml",
        "projects/completed-projects/completed-projects.shtml",
        "services/billing/index.shtml",
        "services/billing/admin.shtml",
        "services/network.shtml",
        "services/server-hosting.shtml",
        "services/telephone/index.shtml",
        "services/unified-communications/index.shtml",
        "about/staff.shtml",
        "policies-documents/acceptable-policy.shtml",
        "policies-documents/documentation.shtml",
        "frequently-asked-questions.shtml",
        "tel:530-898-4616",
        "projects/network-projects/network-refresh-project.shtml",
        "projects/telephony-projects/phone-system-upgrade.shtml",
        "https://www.csuchico.edu/it/index.shtml",
        "https://www.csuchico.edu/esys/index.shtml",
        "https://www.csuchico.edu/it/index.shtml",
        "https://www.csuchico.edu/giving/index.shtml",
        "index.shtml",
        "https://www.csuchico.edu/cmt/index.shtml",
        "https://www.csuchico.edu/eapp/index.shtml",
        "https://www.csuchico.edu/isec/index.shtml",
        "https://www.csuchico.edu/ir/index.shtml",
        "https://www.csuchico.edu/iasc/index.shtml",
        "https://www.csuchico.edu/itss/index.shtml",
        "https://www.csuchico.edu/tein/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}