{
    "title": "Kirki Plugin Up for Sale, Development Discontinued – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nApril 26, 2023\nSarah Gooding\nKirki Plugin Up for Sale, Development Discontinued\n\nDavid Vongries, developer of the Kirki Customizer Framework plugin, announced he is sunsetting the product and will discontinue development and support. Vongries bought the plugin in 2020 from its original creator, Ari Stathopoulos, and grew its user base from 400K to 600K active installs. He launched Kirki PRO with additional extensions in March 2022.\n“When I first acquired Kirki in early 2020, I had big plans for it,” Vongries said. “Although we were able to execute on step one of the 2-step plan we had for the plugin, as time went on, I lost passion for the project mainly due to the direction WordPress core has taken with Gutenberg.\n“It’s clear to me now that I was too ambitious in taking on the project.”\nKirki’s customizer framework enabled theme authors to add custom controls and advanced features to the customizer, including the ability to style it, and add a custom header. Although block theme adoption has been a slow process, the death knell for the Customizer rang years ago. \nIn 2020, Vongries said that exploring how Kirki could potentially extend Gutenberg was one of his goals. Stathopoulos had also discussed the possibility of moving away from the customizer to work with full-site editing and global styles, helping themes that use Kirki transition to global styles. These goals did not materialize but the potential for them is still there.\nVongries is now looking for someone to acquire the plugin but is committed to providing limited support to users in the meantime, including fixing critical bugs and compatibility issues that happen as the result of WordPress core updates.\n“The current active install count in the WordPress repository is 600,000, which presents a great opportunity to revamp the plugin and get it in front of actual users,” he said. “I believe that there’s still great potential in Kirki, and I’m looking for someone who shares that vision to take it forward.”\nVongries has put a price tag of $30K on the plugin, which includes all the assets – the website, GitHub, and PRO extensions. No further active development or updates are planned unless Kirki gets acquired by someone who wants to carry it forward.\nCategory: NewsTags: kirkiShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n1\n\n\n\n\t\tOne response to “Kirki Plugin Up for Sale, Development Discontinued”\t\n\n\n\n\n\n\n\n\n\n julius rosen says: \n\nApril 27, 2023 at 1:42 PM \n\n\nWhat market is there for dead plugins?\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Notify me of follow-up comments by email. Notify me of new posts by email. \n\n Join the discussion via emailGet only replies to your comment, the best of the rest, as well as a daily recap of all comments on this post. No more than a few emails daily, which you can reply to/unsubscribe from directly from your inbox.Δ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nYou may also like\nDavid Vongries Takes Over as New Owner of the Kirki Customizer FrameworkApril 28, 2020Kirki: A Free Plugin to Style the WordPress Customizer and Add Advanced ControlsJune 3, 2014Build Customizer Settings Faster by Using the Kirki Framework in Your ProjectAugust 9, 2019\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://wordpress.org/plugins/kirki/",
        "https://kirki.org/blog/goodbye/",
        "https://kirki.org/blog/kirki-pro-is-now-live/",
        "https://wptavern.com/category/news",
        "https://wptavern.com/tag/kirki",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?share=twitter",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?share=mastodon",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?share=facebook",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?share=telegram",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?share=jetpack-whatsapp",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?share=pocket",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20Kirki%20Plugin%20Up%20for%20Sale%2C%20Development%20Discontinued&body=https%3A%2F%2Fwptavern.com%2Fkirki-plugin-up-for-sale-development-discontinued&share=email",
        "https://oneminutequickSEO%20tips.com",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued#comment-438719",
        "https://wptavern.com/kirki-plugin-up-for-sale-development-discontinued?replytocom=438719#respond",
        "/kirki-plugin-up-for-sale-development-discontinued#respond",
        "https://akismet.com/privacy/",
        "https://wptavern.com/david-vongries-takes-over-as-new-owner-of-the-kirki-customizer-framework",
        "https://wptavern.com/david-vongries-takes-over-as-new-owner-of-the-kirki-customizer-framework",
        "https://wptavern.com/kirki-a-free-plugin-to-style-the-wordpress-customizer-and-add-advanced-controls",
        "https://wptavern.com/kirki-a-free-plugin-to-style-the-wordpress-customizer-and-add-advanced-controls",
        "https://wptavern.com/build-customizer-settings-faster-by-using-the-kirki-framework-in-your-project",
        "https://wptavern.com/build-customizer-settings-faster-by-using-the-kirki-framework-in-your-project",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge"
    ]
}