{
    "title": "They Rank in the World's Top Six: CSUF Finance Students Prepare for Global Competition in Washington, D.C. | CSUF News",
    "body": "\n\n\nSkip to Content (Press Enter)\n\n\n\n\n\n\nCSUF News\n\n\n\nlock Portal Login\nGive\nSearch search\n\n\n\n\n\n\n\n\nMenu\n\n\nTopics\n\nCampus and Community\nArts\nBusiness and Economics\nCommunications\nEducation\nEngineering and Computer Science\nHealth and Human Development\nHumanities and Social Sciences\nNatural Sciences and Mathematics\nAthletics\nTopics A-Z\n\n\nCSUF In the News\nTitan Spotlight\nPeople & Voices\n\nFaculty and Staff\nStudents\nAlumni\nTitans of Academia\nTitans of Promise\nTitan Voices\nTitans of Tassel\n\n\nEvents\nResources\n\nE-Newsletter Subscription\nRSS Feeds\nPhotos\n\n\nFor Journalists\nPublications\n\n\n \n\n\n\n\nThey Rank in the World’s Top Six: CSUF Finance Students Prepare for Global Competition in Washington, D.C.\n April 27, 2023\n\nShare This:\n \n\n\n\n\n\n\nThe Titan Capital Management Team is heading to Washington, D.C., for a world championship. Left to right: students Sam Fedrow, Brandon Leon, Jacquelyn George, Jericho Cezar and faculty adviser Kelly Ko. \nIt all started with having to win a local CFA (chartered financial analyst) Society stock competition. Out of 1,300 teams competing from the Americas, Asia, Europe, the Middle East and Africa, 134 teams won their local competitions. Of those 134 teams, 17 teams advanced to the regional finals…and from there, six advanced to the global final. \nAmong the top six? Cal State Fullerton’s Titan Capital Management team.\nOn May 3, CSUF’s four-person Titan Capital Management team will compete in Washington, D.C. The stakes couldn’t be higher. The winning team — graduating seniors Sam Fedrow ’23, Jericho Cezar ’23, Jacquelyn George ’23 and MBA student Brandon Leon ’23 — is now in the running to become the world’s champion.\nPitted against other high-ranking finance student teams, this competition challenges students to research, analyze and value a publicly traded company, and then present their findings to a panel of judges, who are industry professionals. Students are evaluated on their report writing, presentation skills and the quality of their research.\nFor four consecutive years, CSUF teams have won the CFA Society of Los Angeles Investment Research Challenge, but none have placed as high as the 2023 team. \nThe four finance students put in more than 600 hours of research, practice and meetings. They debated and double-checked each other’s work. They sought advice from their faculty adviser, Kelly Ko, CFA, finance lecturer at Cal State Fullerton and equity director of the Titan Capital Management program, and industry mentor Derek Derman, partner and co-portfolio manager of Poplar Forest Capital. \nThe team analyzed their stock choices, then analyzed them again. They practiced their presentations, checked their report and critiqued the pitch they would make before the judges. \n“I am incredibly proud of this accomplishment,” said CSUF President Fram Virjee. “Our TCM program is the manifestation of everything we hope to be and achieve when we think of high impact practices. This program represents what CSUF is all about–providing students with a rigorous, transformational educational experience, with equitable opportunities for all students, achieving greatness even with limited resources. This success speaks to the Titan culture, where students are given permission to experiment, and fully immerse themselves in their fields of study. I could not be more proud.”\nIn Washington, D.C., the CSUF team will be competing against Cal Poly San Luis Obispo, Universitas Indonesia, University of Sydney, Polytechnic University of Milan and University of Neuchatel. \n“The CFA Institute Research Challenge is the most prestigious, well-recognized global investment competition,” said Ko. “Students in this program develop the superior skills needed to be successful in the investment management industry. To be able to mentor and coach students in the competition is a privilege and helps our program get recognized nationally and globally as among the best in preparing them for careers in industry. \n“I love to see our students compete, achieve and develop confidence as they are ranked among the best universities nationally and globally,” he continued.\n‘It’s great to win and winning is what everyone sees and recognizes now. But we see this every day with the students in our program and I’m so honored to have the privilege to be their adviser. It’s been a wonderful journey and they’ve made me a better professor and mentor in the process, for which I will be forever grateful.”\nAnd will he be accompanying his “dream team” of students to Washington, D.C.? “Absolutely!”\n“We have a diverse student body at the college where a third are first-generation students, the first in their families to attend college and many of them come from humble beginnings,” said Sridhar Sundaram, dean of the College of Business and Economics. “Our goal is to change their lives through the holistic framework of education we provide at the college. The TCM program is a great example, where we provide the students with relevant knowledge, help them apply it in practice, and grow them personally and professionally through the program. Seeing the success of our Titan Capital Management team is truly gratifying and not surprising. This team exemplifies the hard work, commitment and success that we want to build in all our students.”\nTitan Capital Management is one of the College of Business and Economics’ signature programs, providing students with the opportunity to manage a real-world investment portfolio used to fund student services such as tutoring and career readiness. Graduates from Titan Capital Management acquire positions at major financial firms such as Goldman Sachs and PIMCO.\nFounded about 10 years ago, TCM, as it is commonly known, owes much of its success to Jeffrey S. Van Harte ’80 (B.A. business administration-finance), chair and chief investment officer of Jackson Square Partners. His $1.5 million gift helped make the center a reality.\n“I am just so proud and happy for this team,” he said. “They are now in the ‘Top 6 in the World’…the world!! While I am breathless over what our TCM students and professors have achieved, this accomplishment is bigger than just TCM. \n“CSUF is home to a number of national champions and groundbreaking research: Gravitational waves and black holes; national championships for baseball, basketball and softball; world-class art programs and more. And this achievement is right up there, too. What do you think the statistical probabilities are of moving up through 1,300 teams? I would argue it’s one of the great accomplishments and most unlikely successes in the university’s history. \n“You want to challenge me?” he laughed. “Then let’s go to the statistics department and put pencil to paper.”\nTitan Capital Management Student Voices\nTeam member George said the competition has been invaluable to her career preparation: “The CFA LA competition is going to benefit me in my career future because it has shown me how important and amazing the CFA designation is. I have connected with people who currently hold the designation and I have started to become a little more excited about the amazing opportunities that can come from that network. I also have learned through the process how to really analyze a company, and I have learned terms and ideas that go into finding a good investment that I would not know now if I did not have that exposure.”\nTeam member Leon said presenting the report and the overall experience in the competition has been a major milestone in his career preparation. “It showed me how an accurate industry-level report is constructed. The biggest question you must ask yourself is, ‘What are other people not seeing, either good or bad?’” he said. “It took months of diligence with the financial data and analysis and the management and investors. We started with a sell report initially, but in the 11th hour on Christmas Eve, just a few weeks before the final report was due, we decided to flip the whole report to a buy and change everything.”\nLeon continued: “The benefit was that the time spent researching the company made it easy to convert the report to a buy because we had more supporting data heading in that direction. Constant communication was vital as it was also different from traditional school projects. We sometimes met daily, for hours at a time, either in person or on Zoom. It felt like we were co-workers working toward writing a report for the company. And, we did eventually purchase a small stake in Chipotle in one of our student-managed funds.”\nTeam member Cezar said: “The hardest part of competition, and the part where I learned the most, was determining our recommendation for Chipotle. The stock is expensive, as seen in the high P/E compared to other restaurant stocks, and that led us to immediately try to recommend a sell on it. However, we struggled to find evidence for our thesis. With the help of Professor Ko as our faculty adviser and our industry mentor, Derek Derman, we overcame our bias and saw the stock as a buy. Once that happened, we were able to find a plethora of evidence that supported the stock being a buy. As a result, I learned that no matter what decision you are trying to make, you must ignore your biases as much as possible and follow the evidence.”\n“We all put in countless hours of work to know our company inside and out, and it felt great to submit our final written report,” said team member Fedrow. “The most difficult part in preparing for the presentation was identifying the strongest parts of our argument to include. It was surprisingly hard to translate a 20-page report and hundreds of hours of research into a 10-minute pitch — it felt like we did not have nearly enough time to make our case. But because of that, we learned how to identify and explain the key drivers behind our recommendation concisely.”\n\n\n\n\nRelated Stories\n\nTitan Capital Management Embraces Highs, Lows Amid Wild Stock MarketTitan Capital Management Gives Finance Students an EdgeTitan Capital Management Students Experience Volatility of Stock Market \n\n\n\nTags\nBusiness and EconomicsEmpowermentStudents \n\n\n\n\n\n\n\nContact:\n\t\t\t\t\t\t\tValerie Orleans\n\t\t\t\t\t\t\tvorleans@fullerton.edu\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nBrowse\n\nAll News\nTopics A-Z\nAthletics\n\n\n\nFollow Us\n\nFacebook\n\n\nTwitter\n\n\nLinkedIn\n\n\nInstagram\n\n\nYouTube\n\n\n\nAbout\n\nCSUF Facts\nContact Media Relations\nFind an Expert\nPrivacy Policy\n\n\n\nSubscribe / Download\n\nSubscribe to our eNewsletters\n\nSubmit a Story\nDo you have news you’d like to share with the campus?\nSubmit Your Story\n\n\n\n\n\n\n\n\n\n\nThis site is maintained by Strategic Communications.\n\t\t\t\t\t\t\tTo report problems or comments, please contact strategiccomm@fullerton.edu.\n\t\t\t\t\t\t\t© California State University, Fullerton. All Rights Reserved. \n\n\n\nWeb Accessibility\nLearn about web accessibility\nReport a web accessbility problem\nDownload Adobe Acrobat Reader\nMicrosoft Viewers\n\n\n\n\n\n\n\n\n\nSome page features may require javascript to run.\n\n",
    "links": [
        "#main-content",
        "http://fullerton.edu/",
        "https://news.fullerton.edu",
        "https://my.fullerton.edu/",
        "https://giving.fullerton.edu/",
        "javascript:void(0);",
        "https://news.fullerton.edu/campus-and-community/",
        "https://news.fullerton.edu/arts/",
        "https://news.fullerton.edu/business-and-economics/",
        "https://news.fullerton.edu/communications/",
        "https://news.fullerton.edu/education/",
        "https://news.fullerton.edu/engineering-and-computer-science/",
        "https://news.fullerton.edu/health-and-human-development/",
        "https://news.fullerton.edu/humanities-and-social-sciences/",
        "https://news.fullerton.edu/natural-sciences-and-mathematics/",
        "https://news.fullerton.edu/athletics/",
        "https://news.fullerton.edu/topics/",
        "http://news.fullerton.edu/csuf-in-the-news/",
        "https://news.fullerton.edu/spotlight",
        "javascript:void(0);",
        "https://news.fullerton.edu/faculty-and-staff/",
        "https://news.fullerton.edu/students/",
        "https://news.fullerton.edu/alumni/",
        "https://news.fullerton.edu/titans-of-academia/",
        "https://news.fullerton.edu/titans-of-promise/",
        "http://blog.fullerton.edu/",
        "https://news.fullerton.edu/titans-of-tassel/",
        "http://calendar.fullerton.edu/",
        "javascript:void(0);",
        "https://news.fullerton.edu/e-newsletter-subscription/",
        "https://news.fullerton.edu/rss-feeds/",
        "https://www.flickr.com/photos/csufnewsphotos",
        "https://news.fullerton.edu/press/",
        "https://news.fullerton.edu/publications/",
        "https://news.fullerton.edu/2019/09/titan-capital-management-advantage/",
        "https://business.fullerton.edu/academics/finance/tcm",
        "https://news.fullerton.edu/2020/04/titan-capital-management-stock-market-highs-lows/",
        "https://news.fullerton.edu/2019/09/titan-capital-management-advantage/",
        "https://news.fullerton.edu/2018/02/titancapitalmanagement/",
        "https://news.fullerton.edu/business-and-economics/",
        "https://news.fullerton.edu/empowerment/",
        "https://news.fullerton.edu/students/",
        "https://news.fullerton.edu/all-news/",
        "https://news.fullerton.edu/topics/",
        "https://news.fullerton.edu/athletics/",
        "http://www.facebook.com/csufofficial",
        "http://twitter.com/csuf",
        "http://www.linkedin.com/edu/california-state-university-fullerton-17827",
        "http://instagram.com/csufofficial",
        "http://www.youtube.com/user/CSUFullerton",
        "http://www.fullerton.edu/about/default.aspx#facts",
        "https://news.fullerton.edu/press/",
        "http://experts.fullerton.edu/",
        "http://www.fullerton.edu/it/iso/policy/OnlinePrivacy.php",
        "https://news.fullerton.edu/e-newsletter-subscription/",
        "https://ua.fullerton.edu/titans-spotlight/",
        "http://fullerton.edu",
        "mailto:strategiccomm@fullerton.edu",
        "http://fullerton.edu/ati",
        "http://www.fullerton.edu/reportati/",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/office.aspx"
    ]
}