{
    "title": "UC Davis Mobile",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\nAll of UC Davis, One app. Throw away clunky catalogs and clear a few of the 26 tabs you have open in your laptop's browser. The new UC Davis Mobile allows you to do everything from checking real-time Unitrans schedules to accessing your UC Davis email.\n\n\n\n\n\n\n\n\n\n\n\nEverything an Aggie would need.\n\n\n\n\n\nStay up date with what's happening around campus, wherever you might be.\n\n\n\n\n\n\n\nEver wonder where your classes are? Where to find parking? Us too.\n\n\n\n\n\n\n\nTo those who aren't fans of broadsheet print, access all of The Aggie's award-winning journalism from the comfort of your phone.\n\n\n\n\nEnjoy student-run, community, independent, freeform radio live on the go.\n\n\n\n\n\nWhy waste time at a bus stop? Check real-time Unitrans schedules, and make your bus in perfect time.\n\n\n\n\nOh no, your Mail app doesn't work with your UC Davis\n                    email. We've got you covered.\n\n\n\n\n\nKeep up with the latest videos from some of the most creative minds UC Davis has to\n                    offer.\n\n\n\n\n \nGet the latest news about your favorite UC Davis Athletics teams' wins and losses.\n\n\n\n\n \nYour new schedule isn't working? Check course offerings easily, and avoid missing even one lecture of your new classes. \n\n\n\n\n\nDon't waste swipes. Browse the Dining Commons' menus before you commit.\n\n\n\n\n\nCheck course grades, annoucements, and assignments without leaving the app.\n\n\n\n\n\n\n*Current Android version is not inclusive of all features.\n\n\n\n\n\n\nQuestions?\n\n\nEmail us.\n\n\n\n \n\n\n\n\n\n",
    "links": [
        "https://itunes.apple.com/us/app/uc-davis-mobile/id455098573",
        "https://play.google.com/store/apps/details?id=edu.ucdavis.mobile.aggie",
        "https://itunes.apple.com/us/app/uc-davis-mobile/id455098573",
        "https://play.google.com/store/apps/details?id=edu.ucdavis.mobile.aggie",
        "mailto:ithelp@ucdavis.edu"
    ]
}