{
    "title": "AI Writer - WordPress Extensions",
    "body": "\n\n\n\n\nLaunch Sale – 50% OFF on all Product 🌟🎁\n\n\n\n\n← Back to HomeFeaturesHow it WorksFAQ’s\n\n\n\n\n\n\nShare\nShare on Facebook\nShare on Twitter\nEmail this Page\n\n\nAI Writer\n\nTake your content creation to new heights on your WordPress website with our Gutenberg AI Writer Plugin. Seamlessly integrated into the Gutenberg editor, this powerful plugin utilizes the ChatGPT API to streamline your content creation process. Forget about clunky admin AI screens and embrace a user-friendly AI Writer workflow, efficient rewriting tools, and customizable content settings that adapt to your specific requirements. Experience the difference the Gutenberg AI Writer Plugin can make for your WordPress content creation today.\n\nKey Features\nHere are some of the key features of our AI Writer:\nLike Notion AI, But For WordPress\n\nThis WordPress AI Writer comes with super fast shortcuts that allows you to quickly generate AI written content without having to leave your Gutenberg editor. You can simply press “space” on an empty paragraph to open the AI writer menu. Similarly, You just have to highlight and “right-click” to open the rewriting support menu.\nExperience Hassle-Free Content Rewriting with AI\n\nThe Gutenberg AI Writer Plugin goes beyond content generation, providing you with an impressive set of rewriting features to polish and perfect your content. Whether you need to rephrase a sentence or fine-tune an entire article, This AI Writer plugin comes with advanced AI tools empower you to create content that resonates with your audience:\nContent Rewriting Ai Tools\n\nRewrite: Rewrites the selected piece of content\nImproves: Improves the selected piece of content\nFix Grammar: Fixes the grammar mistake with the help of AI\nMake Shorter: Shorten a selected piece of content\nMake Longer: Elaborate the selected content with the help of AI\nTranslate: Helps you to quickly translate the selected languages to any language\nTone: Helps you to quickly change the tone of the selected content to excited, sad, happy etc.\n\nEasily Create Engaging Content in Gutenberg Blocks\n\nThe Gutenberg AI Writer Plugin is designed to work effortlessly within your Gutenberg editor, ensuring a smooth and efficient content creation experience. AI-generated content, including tables and other formatted elements, will automatically be outputted into the appropriate Gutenberg blocks, maintaining the structure and aesthetics of your pages and posts.\nEffortlessly Translate Your Content with AI\n\nEffortlessly cater to a global audience with the Gutenberg AI Writer Plugin’s quick and accurate translation feature. Generate content in your preferred language or instantly translate existing text into multiple languages, ensuring your message reaches readers around the world. Embrace the power of AI to streamline your multilingual content creation process and connect with a diverse audience like never before.\n\nStandard Features\n\n\n\n\nClean Code\nOur plugin is developed with clean and efficient code.\n\n\n\n\nSEO-friendly\nOur plugin is developed with SEO optimization in mind. \n\n\n\n\n\n\nResponsive\nOur plugin is compatible with all devices.\n\n\n\n\nPerformant\nOur plugin is developed with performance in mind.\n\n\n\n\n\nHow it work\n\n\n\n\nAfter purchasing, download the plugin zip file.\nInstall and activate the plugin like any other plugin from the plugins area in WordPress admin.\nNavigate to the page or post editor where you want to write some content.\nConfigure the Open AI Api Key if you haven’t already from the plugin sidebar\nPress “space” after inserting a new paragraph block.\nAdd your prompt and press “enter“.\nReview your generated content\n(Optional) rewrite your content if you don’t like a certain part, You can open the rewriting menu by simply highlighting the content you want to rewrite and “right click“.\n\nIn conclusion, this Gutenberg AI Writer Plugin is the ultimate solution to streamline your content creation and editing process within WordPress. By harnessing the power of ChatGPT API, our plugin offers an impressive range of features, from effortless content generation to seamless rewriting and translation capabilities. Don’t miss the opportunity to elevate your content strategy and captivate your audience with high-quality, engaging content tailored to your needs. Experience the difference the Gutenberg AI Writer Plugin can make for your WordPress website today!\nSo what are you waiting for? Download AI Writer today and start enhancing your content!\nNote: The Ai Writer plugin employs OpenAI’s GPT generative text and requires payment for access to its API based on your usage. For further details on the associated costs, please refer to this link.\n\n\nFrequently Asked Questions\n\nCan I use this plugin on multiple websites?\nYes, you can use this plugin on multiple websites.\n\n\nHow do I renew my license, and what happens if it expires?\nAll our plugins come with a Lifetime usage; you won’t need to renew them yearly.\n\n\nIs there a trial period or a money-back guarantee for the premium version?\nWe offer a 7-day money-back guarantee for our plugins. If you are not satisfied with the plugin’s features or performance, you can request a full refund within the specified period, no questions asked. However, we suggest you try it live before purchasing it.\n\n\nIs this plugin compatible with the latest version of WordPress?\nYes, this plugin is compatible with the latest version of WordPress. It is regularly updated to ensure compatibility with new releases. However, please check the “Minimum Requirements” section for the minimum requirements in the sidebar.\n\n\nAre there any prerequisites or required plugins for this plugin to work?\nMost of our plugins are independent blocks or extensions to other core blocks or 3rd party plugins. Kindly refers to the “Minimum Requirements” section for details in the sidebar.\n\n\nDoes the plugin work with any WordPress theme?\nYes, this plugin is designed to work with most WordPress themes. However, some themes may have specific styling or customization that could affect the plugin’s appearance or functionality. If you encounter issues, please consult the theme’s documentation or contact the theme developer for assistance.\n\n\nIs the plugin compatible with popular page builders or Gutenberg?\nOur plugins are built specifically for the WordPress Gutenberg editor unless mentioned in the plugin description otherwise.\n\n\nHow do I get support for the plugin?\nWith every product purchase, enjoy 6 months of complimentary support, extendable as needed. For support, kindly use the support form here.\n\n\nAre there any known conflicts with other plugins?\nThere are no known conflicts with other major plugins. However, if you experience any issues, please contact the support team for assistance and provide details about the conflicting plugins.\n\n\n\n\nShare\nTweet\nEmail\n\n\n\n\n\nPay once and enjoy lifetime use on unlimited sites!\n\nBuy Now – $69 139\n\n\n100% money-back guarantee within 7 days, no questions asked!\n\n\n\nMinimum Requirements\n\n\n\nWordPress\n\n\n6.1\n\n\n\n\nPHP\n\n\n7.4\n\n\n\n\n\n\n\n\nRelated Products\n\n\n\n\nDall-E AI Image Generator\nA WordPress plugin that utilizes Dall-E’s API to generate AI images through text-to-image or image-to-image conversion. \n\nView Details ➞: Dall-E AI Image Generator\n$139\n–\n$69\n\n\n\n\n\n\nQuery Sort Block\nQuery sort block allows you to effortlessly add post-sorting functionality in just a few clicks \n\nView Details ➞: Query Sort Block\n$19\n–\n$9\n\n\n\n\n\n\nQuery Search Block\nQuery search block adds a new block to your query loop that searches only within the filters you choose, making it easy for users to find content without leaving the page. \n\nView Details ➞: Query Search Block\n$39\n–\n$19\n\n\n\n\n\n\n\n\n\n\n© 2018-2023 GutenbergHubAll Rights Reserved\n\n\nExplore\nBlogShopAbout\n\nSupport & Connect\nAccountContactGet Support\nJoin Facebook Group\nFollow on Twitter\n\n\nLegal\nPrivacy PolicyRefund PolicyTerms & ConditionsCookie Policy\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://shop.gutenberghub.com/",
        "https://shop.gutenberghub.com/",
        "#keyfeatures",
        "#howitworks",
        "#faqs",
        "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fshop.gutenberghub.com%2Fai-writer%2F&title=AI%20Writer",
        "https://twitter.com/share?text=AI%20Writer&url=https%3A%2F%2Fshop.gutenberghub.com%2Fai-writer%2F",
        "/cdn-cgi/l/email-protection#96a9e5e3f4fcf3f5e2abd7dfb3a4a6c1e4ffe2f3e4b0b5a6a5aeadf4f9f2efabd7dfb3a4a6c1e4ffe2f3e4b3a4a6b0fbf2f7e5feadb3a4a6fee2e2e6e5b3a5d7b3a4d0b3a4d0e5fef9e6b8f1e3e2f3f8f4f3e4f1fee3f4b8f5f9fbb3a4d0f7ffbbe1e4ffe2f3e4b3a4d0",
        "https://platform.openai.com/account/api-keys",
        "https://openai.com/pricing",
        "https://shop.gutenberghub.com/account/#!/support",
        "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fshop.gutenberghub.com%2Fai-writer%2F&title=AI%20Writer",
        "https://twitter.com/share?text=AI%20Writer&url=https%3A%2F%2Fshop.gutenberghub.com%2Fai-writer%2F",
        "/cdn-cgi/l/email-protection#9ca3efe9fef6f9ffe8a1ddd5b9aeaccbeef5e8f9eebabfacafa4a7fef3f8e5a1ddd5b9aeaccbeef5e8f9eeb9aeacbaf1f8fdeff4a7b9aeacf4e8e8ecefb9afddb9aedab9aedaeff4f3ecb2fbe9e8f9f2fef9eefbf4e9feb2fff3f1b9aedafdf5b1ebeef5e8f9eeb9aeda",
        "https://shop.gutenberghub.com/dall-e-ai-image-generator/",
        "https://shop.gutenberghub.com/query-sort-block/",
        "https://shop.gutenberghub.com/query-search-block/",
        "https://gutenberghub.com/",
        "https://shop.gutenberghub.com/",
        "https://gutenberghub.com/about",
        "https://shop.gutenberghub.com/account/",
        "https://gutenberghub.com/contact/",
        "https://shop.gutenberghub.com/account/#!/support",
        "https://www.facebook.com/GutenbergHub/",
        "https://twitter.com/gutenberghub",
        "https://gutenberghub.com/privacy-policy/",
        "https://gutenberghub.com/refund-policy/",
        "https://gutenberghub.com/terms-of-service/",
        "https://gutenberghub.com/cookie-policy/"
    ]
}