{
    "title": "Tips for Families | Families",
    "body": "\n \n \n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nFamilies\n\n\nStanford University\n\n\n\n\n\n\n\n\n\n\n\n    Menu\n\n\n\n\n\nSearch form\nSearch term\n\n\n\n\n\nHome\nFAQ\nGet Involved\nHow Do I Pay?\nStay Informed\nTips\nVital Info\nLatest News\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nTips for Families\n\n\nGraduating students often decorate their mortar boards during graduation with messages of thanks to family members.\n\nStaff and faculty involved with Stanford parents or guardians and their students offer the following tips for new Stanford parents or guardians to help them help students succeed at Stanford.\n\nLet go.\nLet them make their own decisions, solve their own problems, pick their own courses and, eventually, choose their own major. When they do choose a major, let the choice be based on intellectual passion, not perceptions of which major is safest or most pragmatic.\nListen and reassure.\nAt some point in their first year, many students feel overwhelmed. They may call or text home, fearing their admission was a mistake. We hear this often. Listen, encourage and reassure. Suggest they talk to their academic advisor, the academic advisor in their residence or their resident fellow. Remind them of the support resources at Stanford, such as tutoring, help with study skills and counseling.\nHave conversations about lifestyle choices, especially alcohol use, before they come to campus and encourage them to be cognizant of their well being.\nNationwide problems like binge drinking are challenges at Stanford, too. Talk to your children in advance about the choices they are likely to confront and help them determine what they value in their own behavior and that of others.\nEncourage them to get to know faculty members.\nThe academic program at Stanford is designed to encourage close interaction between students and faculty. From small freshman seminars to faculty nights in the dining halls, Stanford offers opportunities for students to get to know faculty. Surveys show that students who develop close relationships with faculty get more out of their Stanford education than students who do not.\nEncourage them to learn for the sake of learning.\nStanford’s general education requirements are designed to encourage intellectual exploration. Suggest they study a subject they have never studied before. Many students are accustomed to collecting credentials needed for college admission. Encourage them, instead, to learn for the sake of learning.\nStay in touch, but perhaps not too much.\nBetween their busy schedules and changes in their sleeping patterns, it may be hard to reach them. Help foster their growing independence by, perhaps, being in touch less frequently than you are used to.\nDon’t focus on grades.\nWhen you do talk to your students, try not to focus on grades. Ask which faculty members they have met, which classes they enjoy, what they are learning and what they are doing for fun. Stanford students put plenty of pressure on themselves. What they need to know from you is that you believe in them.\nHelp them learn the difference between disappointment and failure.\nMany Stanford students are used to being the smartest kid in their class. At some point, they will experience something they will choose to label as failure-perhaps a “C” in a course–even if it is not. Not everyone can be first in his or her class. Assure them that their best effort is all you expect.\nSend them a cake on their birthday.\nThe Parents’ Club has been helping to make Stanford a home-away-from-home for more than 80 years. Birthday cakes are delivered right to dorm rooms by members of the club.\nCall us if you are concerned or need reassurance.\nColleges and universities are limited by federal law about what information about students they can share with parents and guardians. Nevertheless, if you are concerned about a student or need some reassurance, contact the Parent Help Line at (650) 725-0649.\n\n \n\n\n\nStanford + Parents/Guardians\n The student is at the center — and is the focus — of this important partnership.\n\nOur Policy\nProspective Parents\n\n\n  \n\nParents' Helpline\n\nmykidis@stanford.edu\n650-725-0649\n \n\n\n  \n\nIn an Emergency\n\nemergency.stanford.edu\n650-725-5555\n 844-ALERTSU (844-253-7878)  \n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University,  Stanford, California 94305.\n\n \n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/faq/",
        "https://parents.stanford.edu/get-involved/",
        "https://parents.stanford.edu/how-do-i-pay/",
        "https://parents.stanford.edu/stay-informed/",
        "https://parents.stanford.edu/tips/",
        "https://parents.stanford.edu/vital-information/",
        "https://parents.stanford.edu/newsletter/",
        "https://www.stanfordparentsclub.org/",
        "tel:16507250649",
        "/stanford-parents/",
        "http://www.stanford.edu/dept/uga/parents/",
        "mailto:mykidis@stanford.edu",
        "tel:16507250649",
        "http://emergency.stanford.edu/",
        "tel:16507255555",
        "tel:18442537878",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}