{
    "title": " Gravatar Blog",
    "body": "\n\n\nGravatar Blog\n← Back to Gravatar.com\n\n\n\n\n Something funny happened\nJuly 23, 2014 | Posted by Toni\n\n\nOn the way to building a Gravatar app, we noticed that taking pictures of ourselves to update our Gravatars was something we only wanted to do every month or so, but then we started taking selfies and sharing them with each other and that became a daily and very fun habit. So our Gravatar app morphed into a Selfies app, and it’s now ready for the world to play with! You can read more about the app here. We hope you become one of the first brave souls to try it out, and let us know what you think.\n\n\nComments (5)\n\n\n\n Mobile Friendly\nMarch 13, 2014 | Posted by Joen A.\n\n\nWe just made the Gravatar.com website, blog, and all profile pages friendlier towards mobile devices. Additionally, you can now edit your profile on the go.\nEnjoy!\n\n\nComments (4)\n\n\n\n A question for Gravatar users\nMarch 05, 2014 | Posted by Toni\n\n\nWe are working on a Gravatar mobile app and would like to ask our users:\nTake Our Poll\n\n\nComments (8)\n\n\n\n Manage Multiple Identities with One Gravatar Account\nFebruary 06, 2014 | Posted by Michelle Weber\n\n\nDid you know that you can have multiple email addresses associated with your Gravatar account? And that each email address can use a different image? Managing multiple email addresses with Gravatar is a snap.\nMany of us have multiple email accounts — for work, school, our personal lives, our blogs, online groups we belong to, and more. Many of us also use different images of ourselves on different websites. You might not want your professional image to be the same as what you’d use on Twitter or Facebook.\nGravatar can help you manage these identities by allowing you to use associate a different image with each email address you’ve connected to Gravatar. To get started, sign in to Gravatar. You’ll see all the email addresses associated with your account, and all the images you’ve uploaded:\n\nPick the email address you’d like to edit, and select an image (or add a new one using the blue link at the top). We’ll double-check with you to make sure you want to make this change:\n\nAnd there you go!\n\nMake sure you use this email address when participating online, and the appropriate Gravatar will appear alongside. Now, your online identities are neatly separated, and you’re presenting yourself exactly as you prefer.\n\n40.714353\n-74.005973\n \n\nComments Off on Manage Multiple Identities with One Gravatar Account\n\n\n\n Add your WordPress sites to your Gravatar Profile\nOctober 02, 2013 | Posted by Josh\n\n\nNow we’ve made it easy for you to promote your WordPress sites on your Gravatar Profile.\nYou’ve always been able to add your WordPress sites manually, just as you can with any other existing web page. In addition, now we also also display a handy list of your WordPress.com and Jetpack-connected sites from which you can select. Simply log into your Gravatar account and follow the instructions on the “How to Add websites to Your Gravatar Profile” support page. Once you’ve done so, you will see thumbnails of your chosen WordPress.com sites on your Gravatar profile.\n\n\n\nComments Off on Add your WordPress sites to your Gravatar Profile\n\n\n\n Have a self-hosted WordPress site? Supercharge your Gravatars with Jetpack\nAugust 01, 2013 | Posted by Michelle Weber\n\n\nWe’ve written about Gravatar Hovercards before — the nifty pop-up that adds a name, bio, and link to more info when you hover over a Gravatar on WordPress.com. Hovercards are a great way to learn more about the people commenting on your site, and to share your own contact info.\nBut what about all the self-hosted WordPress sites? Are you stuck with simplified Gravatars if you’re not using WordPress.com?\nNot if you have Jetpack installed!\nJetpack is a powerful, multipurpose plugin brought to you by Automattic, the same great folks behind WordPress.com and Gravatar. It’s a single plugin that hooks into the power of the WordPress.com cloud to bring you dozens of features for which you’d normally need dozens of individual plugins: social sharing, robust stats, proofreading tools, extra sidebar widgets, photo galleries and carousels, contact forms, image optimization, and more — like Gravatar Hovercards.\nNow, when you hover over a commenter’s Gravatar, you’ll learn more about them and how to find them in other online spaces:\n\nJust install Jetpack and make sure the Gravatar Hovercards module is enabled to give your site visitors the tools to create deeper connections.\n(If you’d like to do even more with Gravatars, the WordPress Plugin Directory has several other well-rated plugins to enhance Gravatars — we like HiDPI Gravatar, which uses Javascript to replace standard Gravatar images with retina-ready images.)\n\n\nComments Off on Have a self-hosted WordPress site? Supercharge your Gravatars with Jetpack\n\n\n\n Gravatar and WordPress.com, Together Forever\nApril 03, 2013 | Posted by Beau Lebens\n\n\nDid you know that your Gravatar.com account has always been a WordPress.com account? It’s true.\nBack in 2007 we (Automattic) acquired Gravatar. Heading into 2008 we rewrote it in PHP, and ever since then, it’s been using the same integrated user system as WordPress.com for accounts. Previously we handled that “behind the scenes,” but we found that it made things pretty confusing for everyone. We’ve now switched over to using WordPress.com Connect exclusively, which allows you to explicitly connect Gravatar and WordPress.com, and to use your WordPress.com credentials to log into Gravatar. That’s one less set of login credentials to worry about!\nThis is not a real button 🙂\n\nIf you had a Gravatar account before, it’s actually always been a WordPress.com account!\nWhen you try to log in at Gravatar.com now, you will be asked to do so using WordPress.com Connect.\nOnce you’re logged into WordPress.com, you then grant Gravatar access to use your WordPress.com account.\nAfter that, you’ll use your WordPress.com username and password to log in to Gravatar, for evermore.\n\nYou might be wondering about existing accounts and creating new accounts, and what your options are:\n\nIf you have a Gravatar account, it’s actually also a WordPress.com account. You can use those details to log into WordPress.com, then grant access to Gravatar.\nIf you already have a WordPress.com account, then you can use that to log into Gravatar.com now.\nIf you don’t have a WordPress.com (or Gravatar) account, you can create one for free (no need for a blog, although you can do that also if you like!) and then you can grant access to Gravatar to get started.\n\nThe beauty of switching to WordPress.com Connect is that it means your account information is all managed in one, super-secure place (WordPress.com), and it avoids all sorts of complexity and potential for problems with password resets, account activations, and more. We’re in the process of switching all of our services to using WordPress.com Connect, so you can use the same account to log into our other nifty products, including VaultPress, Akismet and Polldaddy.\nThere’s a bunch more info on the WordPress.com Connect FAQ, which will hopefully help clear up any other questions you have.\n\n40.668167\n-73.980065\n \n\nComments (31)\n\n\n\n Gravatar: Creating a Truly Global System\nJanuary 14, 2013 | Posted by Michelle Weber\n\n\nWe can’t really call Gravatars “globally recognized avatars” unless they’re realistically available to people the world over, and that means making sure everyone who wants to use one has language access. That’s why Gravatar, like every Automattic joint, relies on a fantastic group of international volunteers to translate almost everything we create, ensuring that what we do is globally accessible.\nIn the past few weeks, we’ve completed the French and Korean translations of en.gravatar.com, bringing the total number of available languages to 43, from Georgian to Norwegian to Bengali.\n(If you’ve never heard of Georgian, take a minute to click over — it’s a beautiful script!)\nIf you visit any of the non-English Gravatar pages, you might still see some content in English — that’s because almost all these pages are works-in-progress. If you’d like to contribute to one of them, or start a translation for a language that’s not currently on the list, we’d love to have you! Just click on “help translate” next to any of the currently available languages, or visit the Gravatar GlotPress page to see exactly what still needs to be done, learn how to become a translator, and add your language to the list.\n\n\nComments (4)\n\n\n\n Default Image Changes\nOctober 09, 2012 | Posted by Barry\n\n\nLast week we made some changes to how default images, sometimes called “fallback images”, are handled in Gravatar URLs. The purpose of these changes was to enhance the security of the Gravatar API and protect the many of millions of users who view billions of Gravatars every day. The majority of you will not notice any change – which is good!  If you’re a developer though, you should keep these recent updates in mind.\nYou can read all about how default images work on the implementation page, but the short version is:\nDefault images must be publicly accessible via a simple HTTP or HTTPS request on the standard ports of 80 and 443, respectively.  They must have a valid image file extension of jpg, jpeg, png, or gif.\nIf your default image is not publicly accessible, doesn’t have a file extension, is not actually an image, requires HTTP Authentication, or is otherwise unavailable to a normal web request, it cannot be used as the fallback/default image for a Gravatar. On the backend, we are now processing default images through a new service we have been working on called Photon, which we will talk more about soon.\nWe’ve also introduced a new default image which you can use, called ‘blank’. Just use ?d=blank and you’ll get a transparent PNG image in whatever size you asked for if the requested Gravatar doesn’t exist. More details on this are on the image implementation page as well.\n\n40.668167\n-73.980065\n \n\nComments Off on Default Image Changes\n\n\n\n Is Your Gravatar Retina-Ready?\nJuly 30, 2012 | Posted by Erica\n\n\nNow that all of Gravatar.com is optimized for retina display, you’ll be looking extra sharp to anyone who views your Gravatar profile or Hovercard from a device like the iPhone 4.\n\nBut are you looking your best? If you’re using a low-resolution image of yourself that you cropped from a friend’s Facebook photo two years ago, then it’s time for an update 🙂 Log in to Gravatar.com and upload a new image now, so that you can get a full-resolution version at all sizes, on all sites.\n\nIf you’re one of the many sites that uses Gravatars, you’ll also be happy to know that we’ve increased the maximum size image you can request, all the way up to 2048px! That means you can go ahead and implement higher resolution user images for all devices, high-dpi or otherwise.\nWe’d love to hear about any Retina-compatible implementations of Gravatar in the comments.\n\n40.767498\n-73.974037\n \n\nComments (16)\n\n\nOlder Posts »\n\nan    joint\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nFollowing\n\n\n\n\n\n\n\n\t\t\t\tGravatar Blog\t\t\t\n\n\nJoin 15,078 other followers\n\n\n\n\n\n\n\n \n\n\t\t\t\t\t\t\t\t\t\t\t\tSign me up\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tAlready have a WordPress.com account? Log in now. \n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tGravatar Blog\t\t\t\n\n\n\n Customize\n\n\n\n\nFollow\n\n\nFollowing\n\n\nSign up\nLog in\n\n\n\t\t\t\t\t\t\t\t\t\t\tReport this content\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tView site in Reader\t\t\t\t\t\t\t\t\t\t\n\n\nManage subscriptions\n\nCollapse this bar\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n",
    "links": [
        "https://blog.gravatar.com/",
        "http://gravatar.com/",
        "https://blog.gravatar.com/2014/07/23/something-funny-happened/",
        "https://blog.gravatar.com/2014/03/05/a-question-for-gravatar-users/",
        "http://getselfies.com/",
        "http://getselfies.com/about/",
        "http://feedback.getselfies.com/",
        "https://blog.gravatar.com/2014/07/23/something-funny-happened/#comments",
        "https://blog.gravatar.com/2014/03/13/mobile-friendly/",
        "https://blog.gravatar.com/2014/03/13/mobile-friendly/#comments",
        "https://blog.gravatar.com/2014/03/05/a-question-for-gravatar-users/",
        "https://polldaddy.com/p/7853939",
        "https://blog.gravatar.com/2014/03/05/a-question-for-gravatar-users/#comments",
        "https://blog.gravatar.com/2014/02/06/multiple-identities/",
        "https://gravatar.files.wordpress.com/2014/02/gravatar.png",
        "https://gravatar.files.wordpress.com/2014/02/gravatar-confirm-copy.png",
        "https://gravatar.files.wordpress.com/2014/02/gravatar-climax.png",
        "https://blog.gravatar.com/2013/10/02/add-your-wordpress-sites-to-your-gravatar-profile/",
        "http://en.gravatar.com/support/profile-links/",
        "https://gravatar.files.wordpress.com/2013/10/grav-sites-full.jpg",
        "https://blog.gravatar.com/2013/08/01/gravatar-and-jetpack/",
        "https://blog.gravatar.com/2010/10/06/gravatar-hovercards-on-wordpress-com/",
        "http://wordpress.com",
        "http://jetpack.me",
        "http://wordpress.org/plugins/",
        "http://wordpress.org/plugins/hidpi-gravatars/",
        "https://blog.gravatar.com/2013/04/03/gravatar-and-wordpress-com-together-forever/",
        "http://automattic.com",
        "https://blog.gravatar.com/2008/03/14/big-changes-afoot/",
        "http://en.support.wordpress.com/wpcc-faq/",
        "http://vaultpress.com",
        "http://akismet.com",
        "http://polldaddy.com",
        "http://en.support.wordpress.com/wpcc-faq/",
        "https://blog.gravatar.com/2013/04/03/gravatar-and-wordpress-com-together-forever/#comments",
        "https://blog.gravatar.com/2013/01/14/gravatar-translations/",
        "http://fr.gravatar.com/",
        "http://ko.gravatar.com/",
        "http://ka.gravatar.com/",
        "http://nb.gravatar.com/",
        "http://bn.gravatar.com/",
        "http://ka.gravatar.com/",
        "http://en.gravatar.com/site/translations/",
        "https://blog.gravatar.com/2013/01/14/gravatar-translations/#comments",
        "https://blog.gravatar.com/2012/10/09/default-image-changes/",
        "http://gravatar.com/site/implement/images/",
        "http://gravatar.com/site/implement/images/",
        "https://blog.gravatar.com/2012/07/30/retina/",
        "https://blog.gravatar.com/2010/06/02/public-profiles-for-everyone/",
        "https://blog.gravatar.com/2010/10/06/gravatar-hovercards-on-wordpress-com/",
        "http://gravatar.com/gravatars/new/",
        "https://blog.gravatar.com/2012/01/26/growth-and-performance/",
        "http://www.kylejlarson.com/blog/2012/creating-retina-images-for-your-website/",
        "https://blog.gravatar.com/2012/07/30/retina/#comments",
        "https://blog.gravatar.com/page/2/",
        "",
        "",
        "https://blog.gravatar.com",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fr-login.wordpress.com%2Fremote-login.php%3Faction%3Dlink%26back%3Dhttps%253A%252F%252Fblog.gravatar.com%252F2014%252F07%252F23%252Fsomething-funny-happened%252F",
        "https://blog.gravatar.com",
        "https://gravatar.wordpress.com/wp-admin/customize.php?url=https%3A%2F%2Fgravatar.wordpress.com%2F",
        "",
        "",
        "https://wordpress.com/start/",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fr-login.wordpress.com%2Fremote-login.php%3Faction%3Dlink%26back%3Dhttps%253A%252F%252Fblog.gravatar.com%252F2014%252F07%252F23%252Fsomething-funny-happened%252F",
        "http://en.wordpress.com/abuse/?report_url=https://blog.gravatar.com",
        "https://wordpress.com/read/feeds/25819",
        "https://subscribe.wordpress.com/",
        "",
        "#",
        "#"
    ]
}