{
    "title": "Watch Abstract: The Art of Design | Netflix Official Site",
    "body": "Netflix HomeUNLIMITED TV SHOWS & MOVIESJOIN NOWSIGN INAbstract: The Art of Design2017 | Maturity Rating:TV-14  | 2 Seasons | DocumentariesStep inside the minds of the most innovative designers in a variety of disciplines and learn how design impacts every aspect of life.Starring:Olafur Eliasson, Neri Oxman, Ruth E. CarterWatch all you want.JOIN NOWThis visually rich documentary series earned an Emmy nomination for Outstanding Graphic Design and Art Direction.VideosAbstract: The Art of DesignAbstract: The Art of Design: Season 2 (Trailer)Abstract: The Art of Design (Trailer)EpisodesAbstract: The Art of DesignSelect a seasonSeason 2Season 1Release year: 2019Meet six of the world's most influential designers in a stylish new season spanning bio-architecture, costume design, typeface design and more.Olafur Eliasson: The Design of Art45mOlafur Eliasson creates sensory-rich immersive installations, including a lamp-lit sun at the Tate Modern and chunks of Arctic ice on city streets.Neri Oxman: Bio-Architecture45mCan we design our way out of an ecological crisis? At the MIT Media Lab, professor Neri Oxman cultivates new materials that emulate nature.Ruth Carter: Costume Design47mA visual storyteller and frequent Spike Lee collaborator, Ruth E. Carter won an Oscar for her Afrofuturistic costume design for \"Black Panther.\"Cas Holman: Design for Play46mAs founder of toy company Heroes Will Rise, Cas Holman crafts tools and objects designed to inspire kids (and adults) to play creatively.Ian Spalter: Digital Product Design46mOn the heels of leading influential projects for Nike and Instagram, Ian Spalter explains the process of experimenting with new product designs.Jonathan Hoefler: Typeface Design44mWhile researching vintage watches as inspiration for a new font, Jonathan Hoefler delves into his work for Apple, Obama's \"Change\" campaign and more.Release year: 2017Step inside the minds of the most innovative designers in a variety of disciplines and learn how design impacts every aspect of life.Christoph Niemann: Illustration47mFrom New Yorker covers to Instagram sketches, illustrator Christoph Niemann plays with abstraction and interactivity -- and questions authenticity.Tinker Hatfield: Footwear Design42mTinker Hatfield's background in architecture and athletics sparked his game-changing shoe designs for Nike, including the iconic Air Jordan series.Es Devlin: Stage Design43mStage designer Es Devlin crafts evocative sets for concerts, operas, plays and runway shows using light, film, sculpture -- and even rain.Bjarke Ingels: Architecture45mArchitect Bjarke Ingels unites function, fantasy and sustainability in “pragmatic utopian” designs like a clean power plant topped with a ski slope.Ralph Gilles: Automotive Design48mAs Fiat Chrysler’s global head of design, Ralph Gilles steers the brand into the future with sleek new sports cars and a self-driving electric van.Paula Scher: Graphic Design41mGraphic designer Paula Scher paints with words, developing the visual language of iconic brands and institutions around the world.Platon: Photography44mPlaton’s fearless portraits capture the souls of world leaders and ordinary people. A shoot with Gen. Colin Powell provides a window into his process.Ilse Crawford: Interior Design42mInterior designer Ilse Crawford creates spaces and objects that engage the senses and promote well-being, from high-end hotels to Ikea furniture.More DetailsWatch offlineDownloads only available on ad-free plans.GenresDocuseries, Social & Cultural Docs, LifestyleThis show is...Cerebral, InspiringCastOlafur EliassonNeri OxmanRuth E. CarterCas HolmanIan SpalterJonathan HoeflerChristoph NiemannTinker HatfieldEs DevlinBjarke IngelsPaula ScherPlatonIlse CrawfordRalph GillesMore Like ThisComing SoonThe MotherA military-trained assassin comes out of hiding to protect the daughter she's never met from ruthless criminals gunning for revenge.Queen CleopatraAs Egypt's last pharaoh, Cleopatra fights to protect her throne, family and legacy in this docudrama featuring reenactments and expert interviews.Black KnightIn a dystopian future devastated by air pollution, the survival of humanity depends on the Black Knights — and they’re far from your average deliverymen.Queen Charlotte: A Bridgerton StoryYoung Queen Charlotte's marriage to King George of England sparks an epic love story and transforms high society in this \"Bridgerton\" universe prequel.Great British Baking Show: JuniorsBritain's most talented young bakers wow judges with cakes, biscuits, breads and more in this kid-focused spinoff of \"The Great British Baking Show.\"Why didn’t I tell you a million times?Reunited as adults, two childhood friends fall madly in love and won't let anything — not even death — tear them apart, in this supernatural love story.Royalteen: Princess MargretheIn the wake of her prom scandal, Princess Margrethe longs for normalcy as she struggles to maintain her perfect facade while dealing with family drama.UglyDollsMoxy and her colorful friends leave Uglyville on a quest to find a kid to love. But on the way, they must confront what it means to be different.Go behind the scenes of Netflix TV shows and movies, see what's coming soon and watch bonus videos on Tudum.com.Questions? Call 1-844-505-2993FAQHelp CenterAccountMedia CenterInvestor RelationsJobsNetflix ShopRedeem Gift CardsBuy Gift CardsWays to WatchTerms of UsePrivacyCookie PreferencesCorporate InformationContact UsSpeed TestLegal NoticesOnly on NetflixDo Not Sell or Share My Personal InformationSelect LanguageEnglishEspañol",
    "links": [
        "/",
        "/login?nextpage=https%3A%2F%2Fwww.netflix.com%2Ftitle%2F80057883",
        "https://www.netflix.com/browse/genre/637976",
        "/title/81074662",
        "/title/81098586",
        "/title/81026142",
        "/title/81123425",
        "/title/81155081",
        "/title/81116168",
        "/title/81406333",
        "/title/81387962",
        "/title/80216752",
        "/title/81328829",
        "/title/80229847",
        "/title/81410436",
        "/title/80210920",
        "/title/81230204",
        "/title/81195027",
        "/title/81476183",
        "/title/81613670",
        "/title/81665637",
        "/title/81516659",
        "/title/81037694",
        "https://netflix.com/tudum",
        "tel:1-844-505-2993",
        "https://help.netflix.com/support/412",
        "https://help.netflix.com",
        "/youraccount",
        "https://media.netflix.com/",
        "http://ir.netflix.com/",
        "https://jobs.netflix.com/jobs",
        "https://netflix.shop/",
        "/redeem",
        "/gift-cards",
        "/watch",
        "https://help.netflix.com/legal/termsofuse",
        "https://help.netflix.com/legal/privacy",
        "#",
        "https://help.netflix.com/legal/corpinfo",
        "https://help.netflix.com/contactus",
        "https://fast.com",
        "https://help.netflix.com/legal/notices",
        "https://www.netflix.com/browse/genre/839338",
        "https://www.netflix.com/dnsspi"
    ]
}