{
    "title": "Almendra Lawrence - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\n\n\nAlmendra Lawrence\n\n \n\n\t\t\t\t\t\tAlmendra (Journalism, '11) is a bilingual content producer that helps empower and inspire audiences through storytelling. She also assists with editing and communications project management. She is a proud alumna and former editor-in-chief of The Orion.\t\t\t\t\t\n\n\t\t\t\t\t\tContact Almendra Lawrence at \n\t\t\t\t\t\t\tacarpizo@csuchico.edu\t\t\t\t\t\t\n\n\n\n\n\n \nExpanded CalFresh Eligibility Brings Food Access to More Chico State Students \n\n\t\tMore Chico State students can now qualify for CalFresh benefits to access food, thanks to expanded eligibility requirements.\t\n\n\n\n\n \nFive Siblings Fulfill Father’s Dream \n\n\t\tSalvador Hernandez left a remarkable legacy as his five children earned college degrees from Chico State, fulfilling his dream.\t\n\n\n\n\n \nMother, Son Turned Classmates Learn From Each Other \n\n\t\tKevin LaCombe and Evone LaCombe were overlapping kinesiology students for two semesters—an experience the mother and son called unique and inspiring. \t\n\n\n\n\n \nJournalism Major Finds Career Path to Write Her Own Future \n\n\t\tA love of writing led Skylar Trostinsky to journalism and Tehama Group Communications, where she’s honing her skills and paving the way for a successful career in PR.\t\n\n\n\n\n \nConstruction Management Student Gets Solid Start to Future \n\n\t\tSenior construction management major Mateus Avalos went from novice to leader in the program—securing three internships and helping lead community service projects in his hometown of Chico.\t\n\n\n\n\n \nKinesiology Major Finds Groove in Adapted Physical Education \n\n\t\tFrom hating PE to aspiring to change how it is taught, Drew Jones’ passion for adapted physical education has taken her on a journey of service-learning opportunities and to pursue her teaching credential.\t\n\n\n\n\n \nAlumna Takes Pride in Identity, Launches ‘Queer Gear’ Business \n\n\t\tSarah Weiss started an e-commerce store that's not just fashionable, but impactful. Queer Gear sells clothing to promote visibility and representation, while giving back to nonprofit organizations focused on LGBTQ+ causes.\t\n\n\n\n\n \nOffice Hours with Concrete Industry Management Professor Mohammed Albahttiti \n\n\t\tCIM Professor Mohammed Albahttiti empowers students through hands-on service-learning projects that connect theory with real-world application. \t\n\n\n\n\n \nOffice Hours with Journalism and PR Department Chair and Professor Janell Bauer \n\n\t\tFueled by her passion for feminism and gender equity research, Janell Bauer aims to inspire her students to be thoughtful communicators.\t\n\n\n\n\n \nFive Questions with Kinesiology Alumna and Adapted Physical Education Teacher Taylor Guy \n\n\t\tAs an adapted physical education teacher, kinesiology alumna Taylor Guy is passionate about making sports accessible to her students and helping them find an activity they enjoy promoting lifelong physical activity.\t\n\n\n\n\n \nIntroducing Theodore Greenfield: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tTheodore Greenfield, a father of two and elementary school band instructor, hopes to become a high school math teacher to share his love for the subject.\t\n\n\n\n\n \nIntroducing Yanetli Navarro-Hernandez: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tConstruction Industry Management student Yanetli Navarro-Hernandez wants to be a role model and encourage more women to pursue careers in construction management.\t\n\n\n\n\n \n‘Living my dream’: Chico State Alumna Forges Path in Hollywood \n\n\t\tHannah Hull (Media Arts, '20) shares about her \"wild ride\" from Chico State to Hollywood, where she's been working on sets of films and television shows.\t\n\n\n\n\n \nChico State Program Encourages Students to Give Back Home \n\n\t\tChico State's Giving Back Home program offers support and resources to students looking to make a difference in their hometowns. \t\n\n\n\n\n \nDistinguished Alum and Owner of Advantage Therapy Services Haley Willis \n\n\t\tHaley Willis, CEO and founder of Advantage Therapy Services in Chico, is helping advance the field of speech-language pathology. She is being honored as the 2023 Distinguished Alumni of the College of Communications and Education. \t\n\n\n\n\n \nChico State Helps Pave Way for Alumna Now Living in Israel \n\n\t\tIn November, alumna Ashira Solomon was invited to be the presenter and moderator for the Reykjavík Global Forum – Women Political Leaders in Iceland.\t\n\n\n\n\n \nBFA Graduate Drawn to Chico State’s Art Program \n\n\t\tInspired by his culture, BFA graduate Joel Solis dedicated his culminating exhibition to Latino street vendors around Butte County. \t\n\n\n\n\n \n5 Questions with Alumna and Vice President of Center Road Solutions Allison Ivie \n\n\t\tInspired by her mother, alumna Allison Ivie has made a career of advocating and empowering organizations that help women and families.\t\n\n\n\n\n \nChico State Professor Helps Reshape How CSUs Teach About Climate Change \n\n\t\tChico State Professor Mark Stemen's Faculty Learning Community earns coveted sustainability award for helping CSUs integrate climate change topics in classrooms.\t\n\n\n\n\n \n5 Questions with US Attorney for Oregon Natalie Wight \n\n\t\tAlumna Natalie Wight was confirmed as the state of Oregon's new top law enforcement official after being nominated by President Joe Biden. \t\n\n\n\n\n \nFond Farewell: Retired Theatre Professor James “Marty” Gilbert \n\n\t\tRetired professor James “Marty” Gilbert is remembered as a gifted set designer who was also a kind, patient, and supportive colleague and teacher.\t\n\n\n\n\n \nFond Farewell: Retired Instructional Media Center Technician Dennis Yarnell \n\n\t\tKnown for his sense of humor and work ethic, Dennis Yarnell was impactful in his 35 years with the Instructional Media Center.\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "mailto:acarpizo@csuchico.edu",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/five-siblings-fulfill-fathers-dream/",
        "https://today.csuchico.edu/mother-son-turned-classmates-learn-from-each-other/",
        "https://today.csuchico.edu/skylar-trostinsky/",
        "https://today.csuchico.edu/mateus-avalos/",
        "https://today.csuchico.edu/drew-jones/",
        "https://today.csuchico.edu/sarah-weiss/",
        "https://today.csuchico.edu/office-hours-with-concrete-industry-management-professor-mohammed-albahttiti/",
        "https://today.csuchico.edu/office-hours-with-janell-bauer/",
        "https://today.csuchico.edu/five-questions-with-taylor-guy/",
        "https://today.csuchico.edu/rawlins-theodore-greenfield/",
        "https://today.csuchico.edu/rawlins-yanetli-navarro-hernandez/",
        "https://today.csuchico.edu/media-arts-hannah-hull/",
        "https://today.csuchico.edu/giving-back-home/",
        "https://today.csuchico.edu/distinguished-alum-haley-willis/",
        "https://today.csuchico.edu/university-paves-way-for-alumna-in-israel/",
        "https://today.csuchico.edu/bfa-joel-solis/",
        "https://today.csuchico.edu/5-questions-with-allison-ivie/",
        "https://today.csuchico.edu/mark-stemen-flc/",
        "https://today.csuchico.edu/5-questions-natalie-wight/",
        "https://today.csuchico.edu/fond-farewell-james-marty-gilbert/",
        "https://today.csuchico.edu/fond-farewell-dennis-yarnell/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}