{
    "title": "Explore More than 50 Graduate Programs | Graduate Division",
    "body": "\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\nUniversity of California, Riverside\n\n\n\n\n\nUCR Home\n\n\n\n\n\n\n\nFaculty and Staff\n\n\nGraduate Advisor Resources\n\n\nRegulations and Procedures\n\n\n\n\nPost Docs\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUC Riverside\n\n\n\n\n Graduate Division \n\n\n\nPromoting Graduate Education\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nHome\n\n\nDean's Welcome\n\n\nContact Us\n\n\nCOGD 2022\n\n\nSupporting Graduate Students\n\n\n\n\nGraduate Programs\n\n\nGraduate Programs\n\n\n\n\nAdmissions\n\n\nOverview\n\n\nWhy UC Riverside?\n\n\nUniversity Policies\n\n\n\n\nDeadlines\n\n\nRequirements\n\n\nAdmission Requirements\n\n\nInternational Academic Records\n\n\nReturning & Continuing Students\n\n\n\n\nApply\n\n\nOnline Application\n\n\nHow to Apply\n\n\nFee Waivers\n\n\nOther Ways To Attend\n\n\n\n\nAccepting Your Offer\n\n\nAccepting Your Offer\n\n\nGradEdge/JumpStart\n\n\nTranscripts for Admitted Students\n\n\n\n\nFAQ\n\n\n\n\nCurrent Students\n\n\nGraduation Procedures\n\n\nPetitions and Forms\n\n\nDissertation and Thesis Submission\n\n\nRegulations and Procedures\n\n\nCommencement\n\n\nNeed Help?\n\n\n\n\nFunding\n\n\nFellowships, Awards, and Grants\n\n\nResources for Finding External Funding\n\n\n\n\nEmployment\n\n\nGraduate Student Employment \n\n\nAcademic Student Employees (ASE)\n\n\nGraduate Student Researcher (GSR)\n\n\nResources and Policies\n\n\n\n\n\n\nGradSuccess\n\n\nAcademic Preparation\n\n\nResearch Ethics\n\n\n\n\n\n\n\nUCR Home\n\n\n\n\n\n\n\nFaculty and Staff\n\n\nGraduate Advisor Resources\n\n\nRegulations and Procedures\n\n\n\n\nPost Docs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExplore More than 50 Graduate Programs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRequest More Info \n\n\n\n\nGraduate Program Info\n\n\n\n\nApply \n\n\n\n\n\n\n\n\nUCR offers over 50 academic and professional graduate programs that will challenge and prepare you for whatever path you will take after graduate school. A complete list of graduate programs offered provides more information about each program as well as access to the program and college websites. We encourage you to review these pages then contact the program and faculty to make sure that the graduate program would be the right fit for you.\n\n\n\n\n\n\n\n\n\n\n                \n            42     \n            \n\n                \n            Doctor of Philosophy Programs    \n            \n\n\n\n\n\n                \n            55     \n            \n\n                \n            Master's Degree Programs    \n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n            Accounting, Auditing and Assurance - M.P.Ac.    \n\nOffering Master of Professional Accountancy (M.P.Ac.) program will fill this growing demand for qualified certified public accountants (CPA's), especially with a California law effective for years after 2013 that will require 150 semester hours (or 225 quarter hours) of applicable college credit. Offered by the A. Gary Anderson Graduate School of Management in the School of Business.\n\n\n\n\n            Anthropology - M.A., M.S., Ph.D.    \n\nOffering M.A., M.S. and Ph.D. programs, research focuses on how people live in a variety of settings and adapt to the processes of change and transformation, both historically and today. Upon completion, students will be able to engage in research, teaching, policy-related and/or administrative activities. Offered by the Department of Anthropology in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Applied Statistics - Ph.D.    \n\nOffered through the Department of Statistics in the College of Natural and Agricultural Sciences, the program emphasizes both the theory of statistics and its application to special fields of interest. In addition to courses in statistics, Ph.D. students take courses in a substantive field from which a thesis problem requiring a statistical approach should arise. The substantive field may be fields such as:\n\nBiology\nEconomics\nPolitical Science\nPsychology\nAdministration\n\n\n\n\n\n            Art History - M.A., Ph.D.    \n\nStudents pursue an M.A. or Ph.D. in the history of Western and non-Western art from ancient to contemporary times, including the history of photography, emphasizing the interpretation of art in its historical and cultural contexts. Students take courses in both Western and non-Western areas. Offered by the Department of the History of Art in the  College of Humanities, Arts and Social Sciences.​​​​​\n\n\n\n\n            Art, Visual - M.F.A.    \n\nThe program's core lies in independent creative work done in consultation with faculty. Students can work in any medium. UCR has facilities for photography, painting, video, digital media and sculpture. Individual graduate studios are provided. Offered by the Department of Art in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Biochemistry and Molecular Biology - M.S., Ph.D.    \n\nOffering both M.S. and Ph.D. degrees, the program prepares students for careers in science by expanding their knowledge of biochemistry and molecular biology, and by developing students' critical thinking skills and creativity. There is considerable flexibility to develop the curriculum to fit specific needs and interests. Offered by the Department of Biochemistry in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Bioengineering - M.S., Ph.D.    \n\nThe M.S. program is designed for professionals seeking greater depth in the area of bioengineering or individuals with biological science degrees who wish to enhance their education. The Ph.D. is heavily integrated with research activities and is intended for people seeking careers in academic or industrial research. The Bioengineering Program is an interdisciplinary program offered by the Bourns College of Engineering.\n\nBiomaterials and Regenerative Medicine\nBiomedical Imaging\nComputational Bioengineering\nNeuroengineering\nMolecular and Cellular Engineering\n\n\n\n\n\n            Biomedical Sciences - M.S. and Ph.D.    \n\nStudents acquire a broad understanding of human disease, therapeutics and design of predictive experimental model systems through an innovative and rigorous program that integrates medical curriculum with mentored research and critical analysis of research-based modeling of human pathophysiology. Faculty come to the program from the School of Medicine and the Departments of Biochemistry and Molecular Biology, Environmental Toxicology, Nematology, Cell Biology and Neuroscience, and Psychology, providing a wide range of perspectives and approaches to problems. Offered by the School of Medicine.\nM.S\nPh.D.\n\n\n\n\n            Biophysics - M.S., Ph.D.    \n\n Biophysics is an interdepartmental program with faculty participating from a wide variety of department such as Biochemistry, Botany and Plant Sciences, Chemistry, and Physics.  Areas of existing expertise on campus include biological electron transfer, biological imaging, computational and mathematical modeling of biological systems, macromolecular structure determination, neurobiophysics, protein engineering and spectroscopic methods of various sorts.  Offered by the Department of Biophysics in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Business Administration - Ph.D.    \n\nThe Ph.D.program at the A. Gary Anderson Graduate School of Management will fill a growing demand for doctoral students in management in the UC system. It is an academic program that will provide candidates with the chance to do intensive research in the field of business and is built upon an interdisciplinary theme with collaborations from other departments at UC Riverside, including economics, sociology, psychology, and statistics.\n\n\n\n\n            Business Analytics – MSBA    \n\nThe MSBA program at the A. Gary Anderson Graduate School of Management prepares students for a career in the growing and important field of business analytics. As firms have access to increasingly large amounts of data about their customers, costs, and suppliers, highly trained analysts who examine this information have become essential. UCR’s graduate degree in business analytics will bring your business acumen and statistical computing skills to a level that allows you to make the most of vast business data.\n\n\n\n\n            Cell, Molecular & Developmental Biology - M.S., Ph.D    \n\nStudents have the opportunity to participate in research in a variety of areas of basic, applied, agricultural, and biomedical sciences. Students enrolled in the interdepartmental CMDB program have access to modern professorial laboratories as well as state-of-the-art equipment, such as:\n\nBioinformatics\nProteomics, including protein sequencing via mass spectrometry\nDNA sequencing\nCell sorting\n\n\n\n\n\n            Chemical & Environmental Engineering - M.S., Ph.D.    \n\nOffered by the Department of Chemical and Environmental Engineering in the Bourns College of Engineering. The program features both M.S. and Ph.D. degrees. Fields of specialization include:\n\nAdvanced Materials and Nanotechnology\nAir Quality Systems Engineering\nBiotechnology and Biomolecular Engineering\nComputation and Molecular Engineering\nEnergy Conversion and Storage\nWater Quality System Engineering\n\n\n\n\n\n            Chemistry - M.S., Ph.D.    \n\nOffered by the Department of Chemistry in the College of Natural and Agricultural Sciences. Students have the opportunity to perform cutting-edge research in an environment that combines the state-of-the-art facilities, quality, and breadth of research with close student-faculty interaction. The Ph.D. is a research degree in which students can pursue many sub-disciplines, including:\n\nAnalytical Chemistry\nInorganic Chemistry\nOrganic Chemistry\nPhysical Chemistry\nInterdisciplinary research opportunities in Bioanalytical, Environmental and Materials Chemistry\nChemical Genomics\n\n\n\n\n\n            Classics - Tri-Campus Program - Ph.D.    \n\nThe Ph.D. program is offered jointly with UC Irvine, UC Riverside and UC San Diego. Instruction takes place on the UC Irvine campus. It features an innovative curriculum and program of study that addresses the practical and theoretical questions confronting the humanities and classics in particular, as both enter the twenty-first century. Offered at UC Riverside by the Department of Comparative Literature and Foreign Languages in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Comparative Literature - M.A., Ph.D.    \n\nThe program is based on the comparative studies of world literatures and cultures. Students are admitted into the Ph.D. program only and students who do not already hold a master's degree in literature, comparative literature, or a comparable field must complete M.A. requirements while pursuing the Ph.D. The degree has three tracks: interliterary studies, interdisciplinary studies, and science fiction science, and literature. Offered by the Department of Comparative Literature and Foreign Languages in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Computer Engineering - M.S.    \n\nThe M.S. program is concerned with the design, programming and use of computing structures, large and small. Computer engineers receive training in electronic engineering, software design and hardware-software integration. This field of engineering at UCR not only focuses on how computer systems themselves work, but also how they integrate into the larger picture of the specific application. The Computer Engineering Program is an interdepartmental program between the Computer Science and Engineering and Electrical and Computer Engineering departments in the Bourns College of Engineering.\n\nComputer Architecture\nCompilers and Software Systems\nDigital Design and Design Automation\nEmbedded and Real-Time Systems\nHigh-Performance Computing\nVLSI Circuits and Systems\n\n\n\n\n\n            Computer Science - M.S., Ph.D.    \n\nThe program offers a M.S., which is ideal for professionals seeking greater depth in several areas, and a Ph.D. intended for well-qualified individuals who wish to pursue careers in academic or industrial research. Research programs include algorithm design, software engineering, embedded system design and theory of computation. Offered by the Computer Science and Engineering Department in the Bourns College of Engineering.\n\n\n\n\n            Creative Writing & Writing for the Performing Arts - M.F.A.    \n\nStudents pursuing the M.F.A. program complete a core of course work in one writing discipline selected from fiction, creative non-fiction, poetry, playwriting, screenwriting, or writing for interactive media. Students participate in seminars and workshops where they explore cross-genre writing and the theoretical underpinnings of creative writing. This interdisciplinary program is offered in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Creative Writing & Writing for the Performing Arts - Palm Desert - M.F.A.    \n\nUCR Palm Desert's M.F.A. program in Creative Writing and Writing for the Performing Arts is designed for professionally oriented writers who are interested in a variety of literary forms. Students concentrate their work in one genre — fiction, screenwriting, creative non-fiction, poetry, or playwriting — but are required to take workshops in at least one other area. Classes are all held through the M.F.A. program at the UCR Palm Desert Campus.\n\n\n\n\n            Critical Dance Studies - Ph.D    \n\nThe program provides a base for research in the field of cultural and historical studies of dance. Consideration of all dimensions of dance, including digital culture, body politics, media studies, mobilization and class, ethnicity, sexuality and gender, and corporeal knowledge and choreography are considered. Offered by the Department of Dance in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Earth and Planetary Sciences - M.S., Ph.D.    \n\nEmphasizing general geology combined with specialization in one of 16 fields, including paleobiology, neotectonics, organic geochemistry, stratigraphy and sedimentology. A rich and diverse array of study options is available to students. Offered by the Department of Earth and Planetary Sciencesin the College of Natural and Agricultural Sciences.\n\n\n\n\n            Economics - M.A., Ph.D.    \n\nOffered by the Department of Economics in the College of Humanities, Arts and Social Sciences. Students have the opportunity to pursue either a M.A. or Ph.D. in economics, with emphases in a wide range of fields, including:  \n\nMicroeconomics\nMacroeconomics\nEconometrics\nEconomic Development\nEconomic History\nInternational Trade\n\n\n\n\n\n            Education - M.A., M.Ed., Ph.D.    \n\nSince its founding in 1969, the School of Education at UCR, has consistently delivered cutting edge master’s (M.A. or M.Ed.), doctoral and teacher credentialing programs that prepare students to become outstanding classroom educators, researchers, and educational leaders. The doctoral (Ph.D.) programs offered by the University of California School of Education are designed to hone the research and analytical skills of those who would become tomorrow's thought leaders in education. UCR's  School of Education's accredited Master of Arts (M.A.) degree programs seek innovative solutions to some of modern education's most critical challenges. Addressing California’s and the nation’s urgent educational needs is the focus of the Master of Education (M.Ed.) degrees offered at the University of California, Riverside. The Teacher Credential programs at University of California, Riverside, offer exceptional opportunities to work with diverse populations while studying rigorous curricula that thoroughly prepare you for the public or private school classroom. For those interested in a teaching credential only, please visit the SOE website for additional information. \n\nPh.D. programs: Education Policy Analysis and Leadership; Education, Society, and Culture; Educational Psychology; Higher Education Administration and Policy; School Psychology; and Special Education.\nM.A. programs: Education, Society, and Culture; Educational Psychology; Neuroscience and Education; Research, Evaluation, Measurement, and Statistics (REMS); and Special Education and Autism.\nM.Ed. specialized programs: Applied Behavior Analysis (not accepting applications Fall 2023); Diversity and Equity; Education Policy Analysis and Leadership; and Higher Education Administration and Policy.\n\n\n\n\n\n            Education (General Education with Teaching Emphasis) - M.Ed    \n\nOffered by the School of Education, the Teacher Education and Credential Programs prepares you to be an outstanding classroom teacher and a leader in a school district. You can pursue either a multiple subject or single subject teaching credential and combine your studies with the in-depth understanding of educational theory and research you would expect from a strong M.Ed. program.  \n\nSingle Subject Teaching Credential: English, Mathematics and Foundational Mathematics, Biology, Chemistry, Geoscience, Physics, and Foundational General Science, Social Science, World Languages (Spanish)\nMultiple Subject Teaching Credential (Bilingual Authorization (Spanish) is available)\n\n\n\n\n\n            Electrical Engineering - M.S., Ph.D.    \n\nOffered by the Department of Electrical and Computer Engineering in the Bourns College of Engineering. The program offers an MS, PhD, and a combined BS and MS degree in Electrical Engineering. MS and PhD students choose a field of study from a broad list of distinct specializations. \nMS: Themes\n\nAdvanced Materials and Devices\nCommunications and Signal Processing\nEmbedded Real-Time Systems\nInternet of Things\nNanoscience and Nanotechnology\nRobotics and Computer Vision\nSmart Grids and Power Systems\n\nPhD: Areas of Research\n\nCommunications and Signal Processing, and Networking\nComputer Engineering\nControls and Robotics\n Intelligent Systems\nNanotechnology, Advanced Materials, and Devices\nPower Systems and Smart Grid\n\n\n\n\n\n            Engineering - M.S. (Online Program)    \n\n   The Online Master of Science in Engineering Program is the newest program at the Bourns College of Engineering and is designed to enable fully employed engineers to advance their professional education and enhance their value to their employers. This unique program, which is delivered over the Internet, gives engineers the opportunity to learn a specialization in depth and to renew and update their knowledge of technological advances. The areas of specialization offered are:\n\nBioengineering\nChemical Engineering\nData Science\nElectrical Engineering\nEnvironmental Engineering\nMaterials at the Nanoscale\nMechanical Engineering\n\n\n\n\n\n            English - Ph.D.    \n\nOffered by the Department of English in the College of Humanities, Arts and Social SciencesThe Ph.D. program encourages graduate students to become teachers and scholar-critics capable of significant original literary scholarship. Students work in close consultation with the graduate adviser to map a course of study including seminar work, fulfillment of the foreign language requirement, the successful completion of two qualifying exams, and the dissertation.\n\n\n\n\n            Entomology - M.S., Ph.D.    \n\nWith programs leading towards M.S. or Ph.D. degrees, students have the opportunity for research specialization in more than a dozen areas, including behavior, biochemistry, nematology and pathology. Offered by the Department of Entomology in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Environmental Science - M.S., Ph.D    \n\nThis interdepartmental program provides students with broad training and exposure to the many facets of environmental science, as well as the specialized study of a specific research topic. Administered by nearly 50 UCR faculty from different environmentally related disciplines, research and course offerings are diverse, ranging from fundamental soil, aquatic, and atmospheric chemistry through resource and environmental management, economics and policy, to a host of other areas within both the natural and social sciences. Offered by the Department of Environmental Sciences in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Environmental Toxicology - M.S., Ph.D.    \n\nAn integrated interdisciplinary program in the College of Natural and Agricultural Sciences that leads to an M.S. or Ph.D. The program teaches the scientific principles of toxicology, focusing on biology, chemistry and the ways that xenobiotics and toxins interact with the biosphere.\n\n\n\n\n            Ethnic Studies - Ph.D.    \n\nThe Ph.D. program has a special focus on public policy and community studies, the connection of people of color in the United States with those in the diaspora (international affairs), and culture. Offered by the Department of Ethnic Studies in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Evolutionary Biology Joint Doctoral Program (SDSU/UCR) - Ph.D.    \n\nSan Diego State University (SDSU) offers a Doctoral degree program in Evolutionary Biology in collaboration with the University of California, Riverside (UCR) graduate program in Evolution, Ecology and Organismal Biology. This joint program involves research training under the supervision of participating SDSU Faculty in areas within the Department of Biology, one academic year of residence at UCR under the supervision of UCR Faculty in the Evolution, Ecology and Organismal Biology graduate program. Prospective graduate students are encouraged to visit the SDSU Graduate Access Page to apply; once accepted through SDSU portal then an application to the Evolutionary Biology Joint Doctoral SDSU/UCR (JDEB) program at UCR may be submitted.\n\n\n\n\n            Evolution, Ecology and Organismal Biology - M.S., Ph.D.    \n\nOffering both M.S. and Ph.D. degrees, the program features specialization tracks in evolutionary biology, ecology and physiology. The M.S. program is a research based program, while the Ph.D. program requires the demonstration of broad knowledge of cell and molecular biology, evolutionary biology, or physiology, and the ability to conduct original research. Offered by the Department of Biology in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Experimental Choreography - M.F.A.    \n\nHighly motivated choreographers pursuing the M.F.A. conduct both research in dance and an assessment of contemporary issues in dance aesthetics, history and culture. The focus is the development of experimental choreography that challenges cultural assumptions and is informed by a critical and reflective perspective.\nThe program is especially designed for the practicing artist who desires to return to an institutional context for advanced study and to examine their own work as they produce new work. Offered by the Department of Dance in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Finance - M.Fin    \n\nThe new Master's of Finance (MFin) program offered by the A. Gary Anderson Graduate School of Management addresses the unmet demand for trained finance professionals. The MFin program will enable finance executives to gain the specialized expertise required for professional advancement, and prepare students who seek to pursue professional certifications in finance.\n\n\n\n\n            Genetics, Genomics and Bioinformatics - Ph.D.    \n\nA unique Ph.D. program that offers three tracks:\n\nMolecular Genetics\nPopulation and Evolutionary Genetics\nGenomics and Bioinformatics.\n\nThe program features diverse research opportunities ranging from current topics in cellular and organismal biology, through mechanisms of molecular evolution, to quantitative genetics, population structure and dynamics, to conservation biology. The program serves both computationally- oriented informaticians and \"wet-bench\"-oriented genomicists. Offered by the Department of Genetics, Genomics, and Bioinformatics in the College of Natural and Agricultural Sciences.\n\n\n\n\n            History - M.A., Ph.D.    \n\nGraduate study in history at the UCR culminates in the Ph.D. degree in history or in the professional M.A. degree in public history, which prepares graduates for careers in museums, archives and historical preservation. Students can also earn the M.A. degree in history, which provides a strong background for careers in professions such as teaching, government and journalism. Offered by the Department of History in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Management - M.B.A.    \n\nThe M.B.A. program at the A. Gary Anderson Graduate School of Management balances the art and science of management, emphasizing managing through information, while recognizing the global environment of management. Students are prepared to excel in a competitive international environment. Teamwork, relationships and communication are underscored.\n\n\n\n\n            Management - Professional M.B.A.    \n\nThe Professional M.B.A. program at the A. Gary Anderson Graduate School of Management offers the same quality of teaching as the M.B.A. program. But the two programs differ in key ways: The Professional M.B.A. can be completed on a fast track (in as little as 20 months) or courses can be taken over several years, depending on the individual student's schedule. The\nProfessional M.B.A offers evening courses so students can still work or meet other day-time obligations while enrolled in the program.\n\n\n\n\n            Materials Science and Engineering - M.S., Ph.D.    \n\nStudents in MSE acquire a solid background in the basic sciences and in the engineering of materials, with hands-on laboratory experience in nano-scale materials characterization and processing. This program prepares graduates for a variety of careers in fields such as nanotechnology, electronics, computing, the biomedical, automotive and aerospace industries, as well as government agencies and research laboratories. Offered by Materials Science and Engineering in the Bourns College of Engineering.\n\n\n\n\n            Mathematics - M.A., M.S., Ph.D.    \n\nOffering a M.A., M.S., and Ph.D., the program offers easy access to two dozen faculty members whose research covers a range of specialties, including Algebra/Algebraic Geometry, Analysis and PDEs, Applied Mathematics, Geometry and Topology, and Mathematical Physics.  Offered by the Department of Mathematics in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Mechanical Engineering - M.S., Ph.D.    \n\nAn M.S. and Ph.D. are offered for students interested in specialized areas of mechanical engineering. The M.S. offers broad-based study, while the Ph.D. allows students to pursue a specialized program of research. Faculty engage in research activities that span the areas of biomedical and health science, fluid and thermal science, design and information computation, mechanics and materials, and nano-structured materials and nanotechnology. Offered by the Department of Mechanical Engineering in the Bourns College of Engineering.\n\nAir Quality and Fire Engineering\nBioapplications\nControls, Robotics and Automation\nMechanics, Advanced Materials and Manufacturing\nNanoscale Design and Micro-Device Engineering\nThermal Systems and Multiphase Flows\n\n\n\n\n\n            Microbiology - M.S., Ph.D.    \n\nOffering M.S. and Ph.D. programs, opportunities are available for study in a wide range of disciplines, including molecular microbiology, plant microbiology, and environmental microbiology. The training that students receive in Microbiology will prepare them for teaching and research careers in colleges and universities, as well as basic and applied research in private, industrial, and government laboratories. Offered by the Graduate Program in Microbiology in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Music - M.A., Ph.D.    \n\nOffered by the Department of Music in the College of Humanities, Arts and Social Sciences, students may pursue either an M.A. or Ph.D. in the subjects of: \n\nComposition — Students receive a thorough grounding in historical and contemporary compositional practice along with a strong emphasis in digital technologies for creation, documentation, and production.\nEthnomusicology — Bringing the insights of cutting-edge cultural theory to original research based on solidly grounded, finely detailed ethnographic fieldwork.\nMusicology — Featuring one of the leading programs in the world on the musical heritage of Iberia and Latin America, students in musicology may pursue a wide variety of subjects, including British music.\n\n\n\n\n\n            Neuroscience - Ph.D.    \n\nThe Ph.D. program is designed to prepare students for careers in research and teaching, as well as in scientific administration. It focuses on a multidisciplinary approach to understanding nervous systems ranging from the molecular and cellular to the behavioral and cognitive. Offered by the Interdepartmental Graduate Program in Neuroscience in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Philosophy - M.A., Ph.D.    \n\nThis program specializes in analytic philosophy, contemporary European philosophy, and the history of philosophy. Students become acquainted with the state of discussion in central areas of contemporary philosophy and are given the skills needed to conduct their own research. Students who have successfully completed a master's degree in philosophy may be invited to pursue the Ph.D. degree. Offered by the Department of Philosophy in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Physics - M.S., Ph.D.    \n\nOffered by the Department of Physics and Astronomy in the College of Natural and Agricultural Sciences, the graduate program features theoretical and experimental research programs in:\n\nAstrophysics and Space Physics\nBiophysics\nCondensed Matter Physics\nFundamental Precision Measurements\nHigh Energy Physics\nRelativistic Heavy Ion and Spin Physics\nSurface Physics\n\n\n\n\n\n            Plant Biology - M.S., Ph.D.    \n\nOffered by the Department of Botany and Plant Sciences in the College of Natural and Agricultural Sciences, the M.S. and  Ph.D. degrees offer the following areas of study:\n\nAgricultural Plant Biology\nBiochemistry and Physiology\nCellular, Molecular and Developmental Biology\nEcology\nEvolution, Systematics and Ethnobotany\nGenetics\nGenomics and Bioinformatics\nChemical Genomics applied to questions of Plant Biology\n\n\n\n\n\n            Plant Pathology - M.S., Ph.D.    \n\nThis highly competitive program offers both M.S. and Ph.D. degrees. The department features a wide ranging set of research topics, all geared towards improving disease management of California's crops. Offered by the Department of Plant Pathology and Microbiology in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Political Science - M.A., Ph.D.    \n\nThe M.A. and Ph.D. programs prepare students for research and teaching in academic institutions. The small, research-oriented program is well-suited to train people interested in:\n\nAmerican Political Institutions\nMethodology\nMass Political Behavior (both U.S. and non-U.S.)\nPolitical Violence and Civil-Military Relations\n\nTotal graduate enrollment is limited to fewer than 40 students. Offered by the Department of Political Science in the College of Humanities, Arts and Social Sciences. \n\n\n\n\n            Psychology - Ph.D.    \n\nThe Ph.D. program offers areas of specialization in cognitive psychology, developmental psychology, social/personality psychology and systems neuroscience. There is also cross-cutting and interdisciplinary study in quantitative psychology, in family studies, positive psychology and health psychology. Individual programs can also be created. There is no concentration in clinical psychology, but many graduate students study applied topics such as the promotion of the mental and physical health of children, adolescents, and the aging. Offered by the Department of Psychology in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Public Policy - M.P.P    \n\nOffered by the the School of Public Policy, the Master of Public Policy (MPP) degree will provide a new and different focus from other public policy programs. Three distinguishing characteristics of the program will position it to be a national leader in public policy thought, education, and scholarship:\n\nThe UCR MPP program will be unique in its emphasis on the intersection and synergies between environmental and social policies.\n It will train students in \"regional\" policy-making, or policy-making that transcends traditional jurisdictional and administrative boundaries (such as the city, county, state and country).\n Finally, it will highlight similarities between the policy challenges facing local communities in the United States (such as communities in Inland Southern California) and policy problems confronting emerging countries (such as Mexico, Brazil, China, and India). It will train students in the skills of applying policy lessons learned globally to the policy challenges facing local communities in the United States.\n\n\n\n\n\n            Religious Studies - M.A., Ph.D.    \n\nFeaturing a M.A. degree that allows a broad study of religious traditions and a more specialized Ph.D. degree that prepares students to enter into academia as researches and instructors, the small program engages religion as a political and social dynamic on the international stage, critically appraising the force of religions in contemporary global cultures, contacts, and conflicts. Offered by the Department of Religious Studies in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Robotics - M.S.    \n\n Students in the M.S. program in Robotics participate in interdisciplinary training involving robot design, embedded systems, control and navigation, and perception and artificial intelligence. The Robotics Program is an interdepartmental program offered by the Computer Science and Engineering, Electrical and Computer Engineering, and Mechanical Engineering departments in the Bourns College of Engineering.\nThe program is designed to provide an education covering both breadth and depth, exposing students to a core set of courses and then focusing on a single aspect of robotics to gain in-depth knowledge, including mechanical design and fabrication, embedded platforms and systems, control and navigation, and artificial intelligence and perception.\nFocus Areas:\n\nArtificial intelligence and perception\nControl and navigation\nMechanical design and fabrication\nEmbedded Systems\n\n\n\n\n\n            Sociology - Ph.D. - Closed for 2022-23 & 2023-24 Academic Years    \n\nOffered by the Department of Sociology in the College of Humanities, Arts and Social Sciences. The program is designed to prepare students for teaching and research careers in sociology, earning an M.A. as part of their progress to the Ph.D. Areas of specialization are:  \n\nCriminology and Sociolegal Studies\nGender Studies\nOrganizations and Institutions\nPolitical Economy and Global Social Change\nRace and Class Inequality\nSocial Psychology\nSociological Theory and Evolutionary Sociology\n\n\n\n\n\n            Southeast Asian Studies - M.A    \n\nCentered on the study of the arts and cultural life in Southeast Asia and the diasporas. The program is geared towards understanding the region and making sense of and engaging with various forms of culture. The region will be studied with an emphasis on historical, religious and ethnographical perspectives. Offered by the interdepartmental SEATRiP Program in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Spanish - M.A., Ph.D.    \n\nDesigned to prepare scholars for teaching and research in Spanish and Latin American literature and cultural studies. The program is organized primarily for students seeking the Ph.D. degree, with the M.A. degree awarded in the course of a student's progress. A small number of students only complete the M.A. as advanced study for teaching in high schools or community colleges. Offered by the Department of Hispanic Studies in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n            Statistics - M.S. (for Ph.D. see Applied Statistics)    \n\nThe M.S. program emphasizes applications and theory, providing an operational knowledge of the subject. It is often completed by students pursuing the Ph.D. program in Applied Statistics. Offered through the Department of Statistics in the College of Natural and Agricultural Sciences.\n\n\n\n\n            Visual Art - M.F.A.    \n\nThe program's core lies in independent creative work done in consultation with faculty. Students can work in any medium. UCR has facilities for photography, painting, video, digital media and sculpture. Individual graduate studios are provided. Offered by the Department of Art in the College of Humanities, Arts and Social Sciences.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nUniversity of California, Riverside\n\n900 University Ave.\n            Riverside, CA 92521\nTel: (951) 827-1012\n\n\nUCR Library\nCampus Status\nCampus Store\nCareer Opportunities\nDiversity\nMaps and Directions\nVisit UCR\n\n\n\n\n\nGraduate Division\n\n             University Office Building\n            Riverside, CA 92521                         \n tel: (951) 827-4302                 fax: (951) 827-2238         email: graddiv@ucr.edu \n\n\n Find Us\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy and Accessibility\nTerms and Conditions\n© 2023 Regents of the University of California\n\n\n\n\n\n\n\n\n\n\n×\n\n\n\n\n\n\nLet us help you with your search\n\n\nEnter your Search Criteria.\n\n\n\nSearch All UCR\n\n\nSearch This Site\n\n\nCancel\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://ucr.edu",
        "https://www.ucr.edu",
        "/faculty-and-staff",
        "/graduate-advisor",
        "/regulations-and-procedures",
        "/postdoctoral-studies",
        "/",
        "/",
        "/",
        "/about-us",
        "/directory",
        "/cogd-2022",
        "https://supportinggraduatestudents.ucr.edu",
        "",
        "/programs",
        "",
        "",
        "/admissions",
        "/university-policies",
        "/deadlines",
        "",
        "/admission-requirements",
        "/international-academic-records",
        "/returning-continuing-students",
        "",
        "https://grad.ucr.edu/apply/",
        "/apply",
        "/fee-waivers",
        "/other-ways-attend",
        "/accepting-your-offer",
        "/accepting-your-offer",
        "/gejs",
        "/transcripts-admitted-students",
        "/frequently-asked-questions",
        "",
        "/graduation-procedures",
        "/petitions-and-forms",
        "/dissertation-and-thesis-submission",
        "/regulations-and-procedures",
        "/commencement-2023",
        "/need-help",
        "/funding",
        "/funding",
        "/resources-finding-external-funding",
        "/graduate-student-employment",
        "/graduate-student-employment",
        "/academic-student-employee-ase",
        "/graduate-student-researcher-gsr",
        "/resources-and-policies",
        "/gradsuccess",
        "https://apro.ucr.edu/",
        "/research-ethics",
        "https://www.ucr.edu",
        "/faculty-and-staff",
        "/graduate-advisor",
        "/regulations-and-procedures",
        "/postdoctoral-studies",
        "https://grad.ucr.edu/register/GradDivision",
        "/programs",
        "https://grad.ucr.edu/apply/",
        "#accounting_auditing_and_assurance_mpac",
        "http://agsm.ucr.edu/",
        "http://soba.ucr.edu/",
        "#anthropology_ma_ms_phd",
        "https://anthropology.ucr.edu/graduate/prospective_students.html",
        "http://chass.ucr.edu/",
        "#applied_statistics_phd",
        "http://statistics.ucr.edu/",
        "http://cnas.ucr.edu/",
        "#art_history_ma_phd",
        "http://arthistory.ucr.edu/",
        "http://chass.ucr.edu/",
        "#art_visual_mfa",
        "http://art.ucr.edu/",
        "http://chass.ucr.edu/",
        "#biochemistry_and_molecular_biology_ms_phd",
        "http://biochemistry.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#bioengineering_ms_phd",
        "http://www.bioeng.ucr.edu/",
        "https://www.engr.ucr.edu/",
        "#biomedical_sciences_ms_and_phd",
        "https://medschool.ucr.edu/graduate/",
        "https://urldefense.proofpoint.com/v2/url?u=https-3A__biomed.ucr.edu_masters-2Dprogram&d=DwMGaQ&c=LsLxleeqPm1pgCNn-PN_bQ&r=WbYfYnQz2yy5anEYWFB9TJXP-UEqDJbNc2uWAA83axM&m=7xolpQ8zjVc2dVFd-FONsXJaYtn_1mo9lDneqh10nWQ&s=cP3w-TsGk8j8L8HX23oLpiImWmJQcRJm31TaDnQyyGY&e=",
        "https://urldefense.proofpoint.com/v2/url?u=https-3A__biomed.ucr.edu_phd-2Dprogram&d=DwMGaQ&c=LsLxleeqPm1pgCNn-PN_bQ&r=WbYfYnQz2yy5anEYWFB9TJXP-UEqDJbNc2uWAA83axM&m=7xolpQ8zjVc2dVFd-FONsXJaYtn_1mo9lDneqh10nWQ&s=wJ6KA5KlMXXfwitkQHAl4fnnzTXvMPFiazDRrIhXNDg&e=",
        "#biophysics_ms_phd",
        "http://biophysics.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#business_administration_phd",
        "http://agsm.ucr.edu/phd_program/",
        "http://agsm.ucr.edu/",
        "#business_analytics_msba",
        "https://business.ucr.edu/msba",
        "https://business.ucr.edu/graduate",
        "#cell_molecular_developmental_biology_ms_phd",
        "http://cell.ucr.edu/",
        "#chemical_environmental_engineering_ms_phd",
        "http://www.cee.ucr.edu/",
        "http://www.engr.ucr.edu/",
        "#chemistry_ms_phd",
        "http://chem.ucr.edu/",
        "http://cnas.ucr.edu/",
        "#classics_tricampus_program_phd",
        "https://complitlang.ucr.edu/",
        "http://chass.ucr.edu/",
        "#comparative_literature_ma_phd",
        "https://complitlang.ucr.edu/",
        "http://chass.ucr.edu/",
        "#computer_engineering_ms",
        "http://cen.ucr.edu/",
        "https://www1.cs.ucr.edu/",
        "https://www.ee.ucr.edu/",
        "https://www.engr.ucr.edu/",
        "#computer_science_ms_phd",
        "https://www1.cs.ucr.edu/",
        "https://www.engr.ucr.edu/",
        "#creative_writing_writing_for_the_performing_arts_mfa",
        "https://creativewriting.ucr.edu/",
        "http://chass.ucr.edu/",
        "#creative_writing_writing_for_the_performing_arts_palm_desert_mfa",
        "http://palmdesertmfa.ucr.edu/",
        "https://palmdesert.ucr.edu/",
        "#critical_dance_studies_phd",
        "http://dance.ucr.edu/",
        "http://dance.ucr.edu/",
        "#earth_and_planetary_sciences_ms_phd",
        "https://epsci.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#economics_ma_phd",
        "http://economics.ucr.edu/",
        "http://chass.ucr.edu/",
        "#education_ma_med_phd",
        "http://education.ucr.edu/",
        "https://education.ucr.edu/master-arts",
        "https://education.ucr.edu/master-education",
        "https://education.ucr.edu/doctoral",
        "https://education.ucr.edu/teacher-education",
        "https://education.ucr.edu/",
        "#education_general_education_with_teaching_emphasis_med",
        "https://education.ucr.edu/",
        "https://education.ucr.edu/teacher-education",
        "#electrical_engineering_ms_phd",
        "https://www.ece.ucr.edu/",
        "https://www.engr.ucr.edu/",
        "#engineering_ms_online_program",
        "http://engineeringonline.ucr.edu/?Access_Code=UCR-MSE-SEO2&utm_campaign=UCR-MSE_SEO2",
        "https://www.engr.ucr.edu/",
        "https://engineeringonline.ucr.edu/bioengineering/?Access_Code=UCR-MSEBE-SEO2&utm_campaign=UCR-MSEBE-SEO2",
        "https://engineeringonline.ucr.edu/chemical-engineering/?Access_Code=UCR-MSE-SEO2&utm_campaign=UCR-MSE-SEO2",
        "https://engineeringonline.ucr.edu/data-science/?Access_Code=UCR-MSEDS-SEO2&utm_campaign=UCR-MSEDS-SEO2",
        "https://engineeringonline.ucr.edu/bioengineering/?Access_Code=UCR-MSEBE-SEO2&utm_campaign=UCR-MSEBE-SEO2",
        "https://engineeringonline.ucr.edu/environmental-engineering/?Access_Code=UCR-MSEEES-SEO2&utm_campaign=UCR-MSEEES-SEO2",
        "https://engineeringonline.ucr.edu/nanotechnology-engineering/?Access_Code=UCR-MSEMN-SEO2&utm_campaign=UCR-MSEMN-SEO2",
        "https://engineeringonline.ucr.edu/mechanical-engineering/?Access_Code=UCR-MSEME-SEO2&utm_campaign=UCR-MSEME-SEO2",
        "#english_phd",
        "http://english.ucr.edu/",
        "http://chass.ucr.edu/",
        "#entomology_ms_phd",
        "http://entomology.ucr.edu/",
        "http://cnas.ucr.edu/",
        "#environmental_science_ms_phd",
        "https://envisci.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#environmental_toxicology_ms_phd",
        "http://etox.ucr.edu/",
        "http://cnas.ucr.edu/",
        "#ethnic_studies_phd",
        "https://ethnicstudies.ucr.edu/",
        "http://chass.ucr.edu/",
        "#evolutionary_biology_joint_doctoral_program_sdsuucr_phd",
        "https://www.sdsu.edu/",
        "https://eeob.ucr.edu/",
        "http://www.bio.sdsu.edu/eb/jdsdsu.html",
        "http://www.bio.sdsu.edu/",
        "http://www.bio.sdsu.edu/eb/jducr.html",
        "https://www2.calstate.edu/apply/graduate",
        "https://grad.ucr.edu/apply/",
        "#evolution_ecology_and_organismal_biology_ms_phd",
        "https://eeob.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#experimental_choreography_mfa",
        "http://dance.ucr.edu/",
        "http://chass.ucr.edu/",
        "#finance_mfin",
        "http://agsm.ucr.edu/mfin/",
        "http://agsm.ucr.edu/",
        "#genetics_genomics_and_bioinformatics_phd",
        "http://ggb.ucr.edu/",
        "https://ggb.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#history_ma_phd",
        "https://history.ucr.edu/",
        "http://chass.ucr.edu/",
        "#management_mba",
        "http://agsm.ucr.edu/mba_program/",
        "http://agsm.ucr.edu/",
        "#management_professional_mba",
        "http://agsm.ucr.edu/flexmba/",
        "http://agsm.ucr.edu/",
        "#materials_science_and_engineering_ms_phd",
        "https://www.mse.ucr.edu/",
        "http://www.engr.ucr.edu",
        "#mathematics_ma_ms_phd",
        "http://mathdept.ucr.edu/",
        "http://cnas.ucr.edu/",
        "#mechanical_engineering_ms_phd",
        "https://www.me.ucr.edu/",
        "https://www.engr.ucr.edu/",
        "#microbiology_ms_phd",
        "https://microbiology.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#music_ma_phd",
        "http://music.ucr.edu/",
        "http://chass.ucr.edu/",
        "#neuroscience_phd",
        "https://neuro.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#philosophy_ma_phd",
        "http://philosophy.ucr.edu/",
        "http://chass.ucr.edu/",
        "#physics_ms_phd",
        "http://physics.ucr.edu/",
        "http://cnas.ucr.edu/",
        "#plant_biology_ms_phd",
        "http://plantbiology.ucr.edu/",
        "http://cnas.ucr.edu/",
        "#plant_pathology_ms_phd",
        "http://plantpath.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#political_science_ma_phd",
        "http://politicalscience.ucr.edu/",
        "http://chass.ucr.edu/",
        "#psychology_phd",
        "http://psych.ucr.edu/",
        "http://chass.ucr.edu/",
        "#public_policy_mpp",
        "http://spp.ucr.edu/mpp/",
        "#religious_studies_ma_phd",
        "http://religiousstudies.ucr.edu/",
        "http://chass.ucr.edu/",
        "#robotics_ms",
        "https://robotics.engr.ucr.edu/",
        "https://www1.cs.ucr.edu/",
        "https://www.ee.ucr.edu/",
        "https://www.me.ucr.edu/",
        "https://www.engr.ucr.edu/",
        "#sociology_phd_closed_for_202223_202324_academic_years",
        "http://sociology.ucr.edu/",
        "http://chass.ucr.edu/",
        "#southeast_asian_studies_ma",
        "http://seatrip.ucr.edu/",
        "http://chass.ucr.edu/",
        "#spanish_ma_phd",
        "http://hispanicstudies.ucr.edu/",
        "http://chass.ucr.edu/",
        "#statistics_ms_for_phd_see_applied_statistics",
        "http://statistics.ucr.edu/",
        "https://cnas.ucr.edu/",
        "#visual_art_mfa",
        "http://art.ucr.edu/",
        "http://chass.ucr.edu/",
        "https://library.ucr.edu/",
        "https://campusstatus.ucr.edu/",
        "https://ucr.bncollege.com/shop/ucr/home",
        "https://jobs.ucr.edu",
        "https://diversity.ucr.edu/",
        "https://campusmap.ucr.edu/",
        "https://www.ucr.edu/about/visitors",
        "https://campusmap.ucr.edu/?loc=UOB",
        "mailto:graddiv@ucr.edu",
        "https://campusmap.ucr.edu/?loc=UOB",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}