{
    "title": "Faculty Senate approves changes to Honor Code, Judicial Charter - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 27, 2023 Faculty Senate approves changes to Honor Code, Judicial Charter Following lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Chelcey Adami\n\nThe Faculty Senate voted to approve changes to the Student Judicial Charter and Honor Code – core university guidance on academic honesty and integrity – during Thursday’s meeting.\n\nThe Committee of 12 presented proposed changes to the Honor Code and Judicial Charter to the Faculty Senate on April 13. (Image credit: Andrew Brodhead)\n\nThe change to the Honor Code allows for proctoring, which is currently prohibited, starting this fall unless the Associated Students of Stanford University Undergraduate Senate reverses its recent decision and approves a proposal by the Committee of 12 (C-12) that facilitates a multi-year study on proctoring.\nThe Honor Code vote came after lengthy discussion among senators and student representatives that centered on issues of good faith, trust, cheating, procedural fairness, and more.\nIn remarks to the senate, Provost Persis Drell briefly reported on the graduate student unionization effort underway, which university leadership also commented on earlier this week. “We continue to encourage graduate students to educate themselves about this issue and ultimately to exercise their right to vote in an election,” Drell said.\nAdditionally, Vice Provost for Undergraduate Education Sarah Church informed senators about an opportunity to participate in the Curriculum Transformation Institute and its seed funding opportunity. Projects focused on making introductory courses more equitable and accessible for students are strongly welcomed.\nA presentation on the undergraduate residential neighborhood program ResX was postponed.\nTrust, cheating, and good faith\nThe C-12 spent several years reviewing and discussing potential ways to revise the Honor Code, Judicial Charter, and interpretations of the Fundamental Standard, the latter of which has been resolved. This included extensive outreach to students, faculty, and 23 other universities.\nTo be enacted, C-12 recommendations must be voted on by the Board of Judicial Affairs (BJA), Undergraduate Senate (UGS), the Graduate Student Council (GSC), the Faculty Senate, and the university president.\nOn April 13, the C-12 presented proposed changes to the Honor Code and Judicial Charter to the Faculty Senate. Senators, as with other voting entities, were asked to provide their comments before a vote, and changes were made to the proposals based on the feedback, explained Marcia L. Stefanick, C-12 faculty co-chair and professor (research) of medicine and of obstetrics and gynecology.\nThe Judicial Charter proposal includes replacing the Student Judicial Charter of 1997 with the Stanford Student Conduct Charter of 2023 to allow for a more nuanced consideration of alleged violations, an emphasis on education instead of punishment, a more streamlined process, and increased accessibility. The Faculty Senate unanimously approved the Judicial Charter proposal, and it now goes to the president for final approval.\nFor the Honor Code, the C-12 proposed including new text and definitions to improve clarity, and the launch of the Academic Integrity Working Group (AIWG) to conduct a multi-year study of equitable practices for proctoring in-person examinations.\nIn the last week, the BJA and GSC approved the Honor Code and Judicial Charter proposals. However, on Tuesday, the UGS approved the proposed changes to the Judicial Charter but voted against the Honor Code proposal.\nWhen senators asked UGS Representative Gurmenjit Bahia why the UGS voted overwhelmingly against the proposal, she said it was due to proctoring. “We believe that faculty should have trust in us and faith in the students, and also we felt like the study didn’t have specific details we wanted,” Bahia said.\nThe Faculty Senate was asked to vote on the C-12 Honor Code proposal to allow it to potentially move forward in the future if the UGS revisits and approves it. Senators voted to approve the C-12 Honor Code proposal on a divided vote.\nWith support from other senators, Richard Taylor, the Barbara Kimball Browning Professor in the School of Humanities and Sciences, brought forth a separate motion to change the Honor Code to allow for proctoring, citing insufficient current mechanisms to ensure academic integrity and faculty’s ultimate responsibility to do so. The motion amends the Honor Code by replacing a clause with this:\n“To foster a climate of academic honesty, effective learning, and fair assessment, instructors have the right to engage in reasonable proctoring of in-person exams. In doing so, instructors will also avoid taking unusual and unreasonable precautions to prevent forms of dishonesty. Instructors will also avoid, as far as practicable, academic procedures that create temptations to violate the Honor Code. Instructors will provide clear guidance, both in their course syllabi and in response to student questions, on what constitutes permitted and unpermitted aid.”\nUnder the current system, students rarely report cheating by classmates, Taylor said, citing data that only two of 720 violation reports came from students between 2018 and 2020. “It is a serious failure on the part of this faculty that we’ve allowed an environment of this sort to develop here,” Taylor said. He added that while he would have preferred consensus, the UGS vote left the senate with the “choice of doing nothing of substance or acting in a limited way on our own authority, at least for an interim period.”\nBahia said the motion completely dismissed students’ shared role in governing the policies at issue and would obliterate trust between faculty and students.\nSome senators and university administrators said that while they thought the C-12 Honor Code proposal was necessary to address the issue of proctoring, the motion Taylor proposed could negatively impact student-faculty relations; Church and others called it the “nuclear option.” David Palumbo-Liu, the Louise Hewlett Nixon Professor and professor, by courtesy, of English, also opposed it, adding that he felt it was improper procedurally and that he would like more data. “If you want to bring this before us, you have to go through the proper channels,” he said.\nOther senators expressed shock that the UGS turned down what they felt was a mild option to create the group to study proctoring.\nGSC Student Representative Lawrence Berg said graduate students, as teaching assistants, have long observed issues with academic dishonesty and cheating. As a representative of grad students, he asked the senate, in this specific instance, to reclaim authority over the Honor Code and pass the motion.\nDarryl Thompson, president of the Associated Students of Stanford University, which includes the GSC and UGS, noted that with the divided vote from the student body on the issue of proctoring, he was conflicted as well. However, he said that one thing he was not conflicted about was what he described as a lack of good faith portrayed by the motion.\nAmalia Kessler, the Lewis Talbot and Nadine Hearn Shelton Professor of International Legal Studies, and professor, by courtesy, of history, said she was also “concerned about the precedent that would be set in terms of the relationship with the undergrads, but I can’t help but wonder what we could possibly offer that would lead to some kind of productive change if a study was unacceptable.” Kessler is associate dean for advanced degree programs.\nDebra Satz, dean of the School of Humanities and Sciences, said she believes there is a broken system and “the undergrads have themselves also pulled out of the contract by the lack of taking responsibility. I don’t blame them … asking students to tell on other students is not a successful plan. … I think we’re seeing an unraveling of a culture where students who don’t want to cheat are in an environment where they feel like everybody else is cheating.”\nJuan Santiago, the Charles Lee Powell Foundation Professor and professor of mechanical engineering in the School of Engineering, was one of the senators who brought the motion presented by Taylor. Addressing concerns that the motion would “break the contract” of requiring all entities, including UGS, to approve the proposals, he countered that UGS also “have not met their end of this.” Santiago said he thinks the differing opinions about proctoring expressed by undergraduate and graduate students stem from a “sense of entitlement” from undergraduates.\nChurch stressed that UGS can’t just veto the option but also “needs to present solutions because the majority of students may be honest but there’s a large proportion who are not … It’s naive to think that the status quo will continue.”\nThe revision was approved on a divided vote and takes effect in the 2023-24 academic year. However, if the remaining stakeholders – UGS and the president – approve a new C-12 Honor Code proposal before then, that new Honor Code will supersede the amendment.\nIn memory\nSenators also heard three memorial resolutions. Barbara Babcock, the first woman member of Stanford law faculty and the Judge John Crown Professor of Law, Emerita, died April 18, 2020, at age 81. John Gosling, professor emeritus of anatomy, died July 17, 2020. He was 81. Paul Seaver, the Allen D. Christensen Professor of History Emeritus, died at age 88 on Aug. 2, 2020.\n\n\n\n\n\n\n\n\n\n\n\n\nStanford News\nUniversity Affairs\nFaculty Senate\nInstitutional News\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n \nSTANFORD Magazine\nGrad students give undergrads a leg up\nThe WCC STEM Program connects aspiring grad students with actual grad students in science, technology, engineering, and math.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D12279",
        "https://communitystandards.stanford.edu/policies-guidance/student-judicial-charter-1997",
        "https://communitystandards.stanford.edu/policies-guidance/honor-code",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/20230427FS_N6A3262.jpg",
        "https://assu.stanford.edu/branches/undergraduate-senate/",
        "https://studentaffairs.stanford.edu/about-vice-provost/student-affairs-initiatives/committee-12#:~:text=The%20Committee%20of%2012%20(C,interpretations%20of%20the%20Fundamental%20Standard%20.",
        "https://gradstudentunionization.stanford.edu/?mkt_tok=NjYwLVRKQy05ODQAAAGLXg8r4NrXaYVqd9Y0fN6nASN0I8FEoUywsjE8tUVaIaIAo2DFdc1hetl8GG3trphw2PzSQO4S8k0ygcaTbqucy3ZDV4Yuo4Mmjof30w",
        "https://news.stanford.edu/report/2023/04/26/upcoming-graduate-student-union-election/",
        "https://ctl.stanford.edu/teaching-support/programs-workshops-resources/curriculum-transformation-institute-seed-grants",
        "https://communitystandards.stanford.edu/policies-guidance/honor-code",
        "https://communitystandards.stanford.edu/policies-guidance/student-judicial-charter-1997",
        "https://communitystandards.stanford.edu/resources/about-board-judicial-affairs",
        "https://assu.stanford.edu/branches/undergraduate-senate/",
        "https://assu.stanford.edu/branches/graduate-student-council/",
        "https://news.stanford.edu/report/2023/04/13/faculty-senate-hears-proposed-changes-honor-code-judicial-charter/",
        "https://profiles.stanford.edu/marcia-stefanick",
        "https://drive.google.com/file/d/1jvO6Jeq6chN5SInqFEGjx5tFeGFRoTP-/view",
        "https://profiles.stanford.edu/200500",
        "https://profiles.stanford.edu/david-palumbo-liu",
        "https://assu.stanford.edu/",
        "https://profiles.stanford.edu/amalia-kessler?releaseVersion=10.5.1",
        "https://profiles.stanford.edu/juan-santiago",
        "https://news.stanford.edu/2020/04/23/legal-scholar-barbara-allen-babcock-first-woman-member-stanford-law-faculty-died-81/",
        "https://med.stanford.edu/news/all-news/2020/11/john-gosling-anatomy-researcher-and-teacher-dies-at-81.html",
        "https://news.stanford.edu/2020/08/10/paul-seaver-leading-historian-early-modern-england-dies-88/",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/topic/faculty-senate/",
        "https://news.stanford.edu/report/topic/institutional-news/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D12279",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://stanfordmag.org/contents/stem-support",
        "https://news.stanford.edu/report/content-partner/stanford-magazine/",
        "https://stanfordmag.org/contents/stem-support",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}