{
    "title": "Seven Stanford affiliates named Paul & Daisy Soros Fellows - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 27, 2023 Seven Stanford affiliates named Paul & Daisy Soros Fellows The award supports immigrants and children of immigrants pursuing graduate degrees in the United States. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Alex Kekauoha\n\nSix Stanford graduate students and one Stanford alum are among the recipients of the 2023 Paul & Daisy Soros Fellowships for New Americans, which supports immigrants and children of immigrants pursuing graduate degrees in the United States.\nThe Stanford-affiliated fellows are among 30 new Americans selected this year from a pool of more than 2,000 applicants. They come from across the United States and are pursuing careers in science, medicine, engineering, and business. PD Soros Fellows receive $90,000 towards their graduate studies.\nThe merit-based fellowship program was established in 1997 by Hungarian immigrants and philanthropists Paul and Daisy Soros. Since then, it has supported 776 fellows from 103 countries, including more than 105 Stanford graduate students.\nFollowing are the 2023 PD Soros Fellows affiliated with Stanford:\n\n\nDesmond Edwards (Image credit: Courtesy PD Soros Fellowship)\n\nDesmond Edwards is a PhD student in microbiology and immunology at Stanford School of Medicine. He was born and raised in Jamaica before moving to the United States for college. He graduated from the Massachusetts Institute of Technology where he double majored in biology and biological engineering and minored in French. At Stanford, Edwards is a Knight-Hennessy Scholar and the first from Jamaica.\n\n\nFreja Ekman (Image credit: Courtesy PD Soros Fellowship)\n\nFreja Ekman is an MD and PhD student in genetics at Stanford School of Medicine. She was born in Erlangen, Germany, to parents from Sweden and Norway, and immigrated to San Diego, California, at age 5 with her family. She holds a bachelor’s degree in chemical biology from the University of California, Berkeley, and a master’s degree in translational biomedical research from the University of Cambridge. At Stanford, she is a Knight-Hennessy Scholar.\n\n\nRicardo Guajardo (Image credit: Courtesy PD Soros Fellowship)\n\nRicardo Guajardo is a Stanford alumnus currently pursuing an MD and PhD in neuroscience at the University of California, San Francisco. Guajardo was born in Monterrey, Mexico, and immigrated to Laredo at age 8 with his family. His eighth-grade biology class and his mother’s nursing career sparked his interest in medicine. At Stanford, he studied biology with a concentration in neurobiology and was awarded the Firestone Medal for Excellence in Research.\n\n\nOmair Khan (Image credit: Courtesy PD Soros Fellowship)\n\nOmair Khan is an MD-PhD dual degree student in stem cell biology and regenerative medicine at Stanford School of Medicine. He was born and raised in New Orleans, Louisiana, to parents from India. After being displaced by Hurricane Katrina in 2005, Khan’s family relocated to Chicago. His father’s brain tumor diagnosis inspired him to pursue a career in medicine. He earned a bachelor’s degree in molecular, cellular, developmental biology, and global health studies at Yale University.\n\n\nNathan Mallipeddi (Image credit: Courtesy PD Soros Fellowship)\n\nNathan Mallipeddi is an MBA student at Stanford Graduate School of Business and an MD student at Harvard University. He was born in Cincinnati, Ohio, to parents from India, and later relocated to the San Francisco Bay Area. As a Fulbright Scholar, he traveled to India where he worked in healthcare and with patients with disabilities. He holds a bachelor’s degree in biology and political science from the University of California, Los Angeles.\n\n\nJuliet Nwagwu Ume-Ezeoke (Image credit: Courtesy PD Soros Fellowship)\n\nJuliet Nwagwu Ume-Ezeoke is a PhD student in civil and environmental engineering at Stanford’s Doerr School of Sustainability and the School of Engineering. She was born and raised in Nigeria, and later Senegal, and moved to the United States at age 11. She is interested in human-centered designs of urban systems and aspires to be an urban planner. She holds bachelor’s degrees in mechanical engineering and computer science from Harvard College.\n\n\nSteven Truong (Image credit: Courtesy PD Soros Fellowship)\n\nSteven Truong is an MD and PhD student in biosciences at Stanford School of Medicine. He was born in St. Paul, Minnesota, to Vietnamese refugees. He graduated from the Massachusetts Institute of Technology where he double majored in biological engineering and writing. As a Marshall Scholar, Truong also completed an MPhil in computational biology at Cambridge University. He also holds an MA in creative writing from Royal Holloway, University of London.\n\n\n\n\n\n\n\n\n\n\n\n\nAwards & Honors\nStanford News\nAwards\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D12238",
        "https://www.pdsoros.org/",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/Desmond_938x1407.jpg",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/Freja_938x1407.jpg",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/Ricardo_938x1407.jpg",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/Omair_938x1407.jpg",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/Nathan_1000x1500.jpg",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/Juliet_1000x1500.jpg",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/Steven_938x1407.jpg",
        "https://news.stanford.edu/report/content-partner/university-communications/awards-honors/",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/topic/awards/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D12238",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}