{
    "title": "Episode 2: WordPress is Free(dom) – WordPress News",
    "body": "\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\n\nNews\n\n\n\n\n\nCategories\n\n\n\n\nAll Posts\nAwards\n\nCommunity\n\nDesign\n\nDevelopment\n\nDocumentation\n\nEvents\n\nFeatures\n\nGeneral\n\nInterviews\n\nMeta\n\nMonth in WordPress\n\nPodcast\nReleases\n\nSecurity\n\nStore\n\nTesting\n\nUpdates\n\nWordCamp\n\n\n\n\n\n\n\n\nFebruary 15, 2021\n\t\tBy Josepha\n\t\tin Podcast\n\n\nEpisode 2: WordPress is Free(dom)\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWordPress Briefing – A WordPress Podcast\t\t\t\t\t\nEpisode 2: WordPress is Free(dom)\n\n\n\n\nPlay Episode\n\n\nPause Episode\n\n\n\n\n\n\n\n\n\n\n\n\n\nMute/Unmute Episode\n\n\nRewind 10 Seconds\n\n1x\n\nFast Forward 30 seconds\n\n\n\n00:00\n/\n\n10:17\n\n\n\n\n\nSubscribe\nShare\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tApple Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tGoogle Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPocketCasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRSS\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tSpotify\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStitcher\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\tRSS Feed\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tShare\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tLink\t\t\t\t\n\n\n\n\n\n\n\n\t\t\t\t\tEmbed\t\t\t\t\n\n\n\n\n\n\n\n\nDownload file | Play in new window | Duration: 10:17\n\n\n\n\n\n\n\nLearn about where WordPress is going, how we’ll get there, and how you can get involved.\n\n\nApple Podcasts\nGoogle Podcasts\nPocket Casts\nRSS\nSpotify\nStitcher\n\n\n\n\n\nIn this episode, Josepha Haden Chomphosy gives quick explanations of the Four Freedoms of open source, the phrase “Free as in free speech, not free as in beer,” and why open source matters in the grand scheme of things. \nHave a question you’d like answered? You can submit them to wpbriefing@wordpress.org, either written or as a voice recording.\nCredits\nEditor: Dustin HartzlerLogo: Beatriz FialhoProduction: Chloé BringmannSong: Fearless First by Kevin MacLeod\nReferences\nFree software, definedThe analogy of cake according to Hugh LashbrookeBonus content to Matt’s excellent viewpoint on The Four FreedomsContributor HighlightWordCamp India videosWordPress 5.7 Committers, Maintainers, and EmeritiKeeping Up with Full Site Editinghttps://make.wordpress.org/test/tag/fse-outreach-program/\n\nWays to keep up with Gutenberg & Full Site Editing (FSE)\n\nTranscript\n\nHello, everyone, and welcome to the WordPress briefing, the podcast where you can catch quick explanations of some of the ideas behind the WordPress open source project and the community around it, as well as get a small list of big things coming up in the next two weeks. I’m your host, Josepha Haden Chomphosy. Here we go!\nI’d like to start today with a look at the phrase “free as in free speech.” If you’re familiar with the WordPress community, you might have heard it from another community member. And if you’re not familiar with us, then this may be your first time hearing it. Either way, I think it’s important for us to learn a bit more about it. The full phrase is “free as in speech, not free as in beer,” and specifically it relates to open source software. But WordPress happens to be a little bit of both of those things. \nWordPress is literally free, you can go right now to the download section of the WordPress website and own your own copy with the click of a button. There are some costs associated with getting your first site online. But for the software, zero, absolutely nothing. So it’s free. But also WordPress is open source. And that’s where the free as in free speech part comes in. \nThe four freedoms of open source as laid out in the early 90s are basically:\nthe freedom to run the program for any purposethe freedom to study how the program works, and change it so that it does your computing as you wishthe freedom to redistribute copies so that you can help your neighborthe freedom to distribute copies of your modified versions giving the community a chance to benefit from your changes.\nSometime last year, or a couple of years ago, Hugh Lashbrooke, who works in the WordPress community, did an excellent post about the Four Freedoms using cakes as an example. You will find a link in the show notes to that post because it’s an excellent illustration. It was going to take too long for this. But I really think that if you’re having a little bit of trouble hanging on to this concept of the four freedoms, then that’s a great illustration.\nIt’s hard to know how these open source four freedoms matter on a daily basis. So from a practical standpoint, what this all means is that you can own a copy of the software that is easy to use, easy to study and learn from, easy to change, and easy to share. It also means that once you’ve shared your changes with others, those changes can also be brought back to the broader community so that they can also benefit from that change, which I am sure made the software a little bit better, just a little bit more functional. But from a philosophical standpoint, this means so much more. \nThe freedoms of open source, when applied at the scale of humanity, or even at the scale of 39% of the web, can enable the removal of barriers to opportunity in the world. You don’t have to be rich to have an online presence. You don’t have to find loopholes in proprietary platforms and hope that they never change their terms of service. You own all of the content that you create on a WordPress site and have the liberty to move it to a new host if you need to, or switch your theme if it fits your mood.\nThere are compounding benefits to that. When it doesn’t matter where you connect to the internet, or what Hard Knocks life has dealt you—when your location or language, or mobility can’t prevent you from opening up a shop to sell your jam or your honey\nor a site to promote your specific services—that opens up the opportunity for generational wealth that is really hard to tap into otherwise. And if you’re not quite ready to come with me on that, then I think you might at least agree that having reliable passive income or an excellently trained lead generation funnel can offer stability in a time when the world is really unstable. \nAs always, if something in here doesn’t make sense to you, or if you have a question you’d like to have answered, I want to hear from you. You can email me at wpbriefing@wordpress.org. \nSo there you have it. A really quick explanation of why open source matters to me on a day to day basis and why it might need to matter to you to a little bit; free as in free speech, but also a little bit free as in beer.\nNow it’s time for our community highlight. I crowdsourced a few contributor success stories on \nTwitter. And I’m going to highlight them as this podcast progresses over the year. But before I do, I wanted to call out something that I thought was really remarkable. \nI enjoyed seeing about a third of the people who came up as “this person was my buddy, my mentor as I was figuring out how to how to contribute to WordPress, and how WordPress as an ecosystem worked.” About a third of those people were women. And not only are they women, but they are women who were in WordPress leadership. And some of them are women who are currently in leadership in the project. And based on the list that, I’m seeing also women who probably will be in leadership in the future, both in WordPress and wherever else they happen to be doing that kind of support work. I think that’s pretty amazing, because in technology, of course, there is a pretty understood lack of diversity in the voices that we see. I haven’t checked recently, but for a long time, the number of women that we saw in the technology field was right about 10%. At some point, someone told me it was up to 14%. \nThe women that are showing up and being subject matter experts and being represented in WordPress are above and beyond that every single time. And we’re not perfect. We have a lot of things that we have to do. And I for what I can make small, little changes in the systems that we have, about how we work in WordPress, how we work in the community, and how we work with each other. I asked my team reps to do the same thing. And so I think that, in the long run, what happens is we will have a more and more welcoming and open community and hopefully keep moving past that 30% of women that we’re seeing and right on out into an excellent 50/50 split. But you know, that’s probably a topic for some other podcasts. \nI promised a community highlight from the crowdsourcing I did on Twitter. And the one that I want to highlight today is from Topher DeRosia. He is one of the folks behind the HeroPress site, and he had this lovely story to tell. \n“When I was standing on the edge of the contributor pool. I asked Siobhan McKeown for help, and she quite kindly pushed me headfirst into #docs. Changed everything.”\nI love this story, not only because of the people involved but also it is so evocative. I know that when I started contributing to WordPress, I felt exactly the same way. A pool is exactly right.\nAnd that brings us to our small list of big things. Our third segment of this show.\nI have four things on my list for you this week. The first is WordCamp India; they just wrapped up their first-ever online event, which ran over three subsequent weekends. So don’t forget to check out wordpress.tv or our YouTube channel for some of those excellent sessions.\nItem number two for you is that WordPress 5.7 is coming up on March 9. And I want to quickly clarify something there’s been a bit of a misunderstanding and I think it’s my fault. WordPress 5.7 will not include a Full Site Editing prototype in Core, that will still be in the Gutenberg plugin. But Item number three, Full Site Editing is coming to WordPress in 2021. And so you’ll start seeing some updates and statuses and demos showing up. To help people get ready. Keep an eye on wordpress.org slash news, or follow your favorite committers on Twitter.\nThis leads me now to my fourth item on my small list of big things. I’m in the process of cleaning up our committer lists so that our new and learning contributors can easily tell who is active and can help them find their way into the project. So that my friends, is your small list of big things. \nThank you for tuning in today for the WordPress briefing. I’m your host Josepha Haden Chomphosy. I’ll see you again in a couple of weeks!\n\n\n\n\n\n\n\nPrevious Episode 1: Welcome to your WP Briefing\nNext Episode 3: My Typical Day as WordPress’s Executive Director\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fwordpress.org%2Fnews%2F2021%2F02%2Fwordpress-is-freedom%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/news",
        "https://wordpress.org/news/all-posts/",
        "https://wordpress.org/news/category/awards/",
        "https://wordpress.org/news/category/community/",
        "https://wordpress.org/news/category/design/",
        "https://wordpress.org/news/category/development/",
        "https://wordpress.org/news/category/documentation/",
        "https://wordpress.org/news/category/events/",
        "https://wordpress.org/news/category/features/",
        "https://wordpress.org/news/category/general/",
        "https://wordpress.org/news/category/interviews/",
        "https://wordpress.org/news/category/meta/",
        "https://wordpress.org/news/category/month-in-wordpress/",
        "https://wordpress.org/news/podcast/",
        "https://wordpress.org/news/category/releases/",
        "https://wordpress.org/news/category/security/",
        "https://wordpress.org/news/category/store/",
        "https://wordpress.org/news/category/testing/",
        "https://wordpress.org/news/category/updates/",
        "https://wordpress.org/news/category/wordcamp/",
        "https://profiles.wordpress.org/chanthaboune/",
        "https://wordpress.org/news/podcast/",
        "https://podcasts.apple.com/us/podcast/wp-briefing/id1551691710",
        "https://podcasts.google.com/feed/aHR0cHM6Ly93b3JkcHJlc3Mub3JnL25ld3MvZmVlZC9wb2RjYXN0",
        "https://pca.st/uqvvmt8t",
        "https://wordpress.org/news/feed/podcast",
        "https://open.spotify.com/show/6BxgmE9Qg2TZA8EKZLJ4zS",
        "https://www.stitcher.com/show/wp-briefing",
        "https://www.facebook.com/sharer/sharer.php?u=https://wordpress.org/news/podcast-player/9722/wordpress-is-freedom.mp3&t=Episode 2: WordPress is Free(dom)",
        "https://twitter.com/intent/tweet?text=https://wordpress.org/news/podcast-player/9722/wordpress-is-freedom.mp3&url=Episode 2: WordPress is Free(dom)",
        "https://wordpress.org/news/podcast-player/9722/wordpress-is-freedom.mp3",
        "https://wordpress.org/news/podcast-download/9722/wordpress-is-freedom.mp3",
        "https://wordpress.org/news/podcast-download/9722/wordpress-is-freedom.mp3?ref=new_window",
        "https://podcasts.apple.com/us/podcast/wp-briefing/id1551691710",
        "https://podcasts.google.com/feed/aHR0cHM6Ly93b3JkcHJlc3Mub3JnL25ld3MvZmVlZC9wb2RjYXN0",
        "https://pca.st/uqvvmt8t",
        "https://wordpress.org/news/feed/podcast",
        "https://open.spotify.com/show/6BxgmE9Qg2TZA8EKZLJ4zS",
        "https://www.stitcher.com/show/wp-briefing",
        "mailto:wpbriefing@wordpress.org",
        "https://profiles.wordpress.org/dustinhartzler/",
        "https://profiles.wordpress.org/beafialho/",
        "https://profiles.wordpress.org/mkaz/",
        "https://profiles.wordpress.org/cbringmann/",
        "https://www.gnu.org/philosophy/free-sw.en.html",
        "https://hugh.blog/2019/03/15/becoming-a-good-open-source-citizen/",
        "https://ma.tt/2014/01/four-freedoms/",
        "https://twitter.com/topher1kenobe/status/1356698714996432897",
        "https://wordpress.tv/event/wordcamp-india-2021/",
        "https://make.wordpress.org/core/5-7/",
        "https://make.wordpress.org/core/2021/02/03/committers-maintainers-and-emeriti/",
        "https://make.wordpress.org/test/tag/fse-outreach-program/",
        "https://make.wordpress.org/core/2020/05/20/ways-to-keep-up-with-full-site-editing-fse/",
        "https://profiles.wordpress.org/hlashbrooke/",
        "https://profiles.wordpress.org/topher1kenobe/",
        "https://heropress.com/",
        "https://profiles.wordpress.org/siobhan/",
        "https://wordpress.org/news/2021/02/welcome-to-your-wp-briefing/",
        "https://wordpress.org/news/2021/03/my-typical-day-as-wordpresss-executive-director/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}