{
    "title": "Women university presidents, engineering deans issue open letter supporting CHIPS and Science Act | Brown University",
    "body": "\n\n\n\n\n\n\nSkip to Main Content\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \nNews from Brown\n\n\n\n\n\n\nSite Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTopics\n\nScience and Technology\n\n\n\nDate\n\n                  April 20, 2023\n                  2023-04-20\n\n\n\nMedia Contact\n\n                    \nNews Staff\n [email protected]\n\n  401-863-2476\n\n\n\n\n\n\n\n\n\nAll News\n\n\n\nShare\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\nLinkedin\n\n\n\n\n\n\nEmail\n\n\n\n\n\n\n\n\n\n\n\n\n\nWomen university presidents, engineering deans issue open letter supporting CHIPS and Science Act\nThe 13 signatories, including Brown’s Christina H. Paxson and Tejal Desai, call on universities to help meet the U.S. Commerce Secretary’s semiconductor workforce goals by preparing more women, people of color to enter the field.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPROVIDENCE, R.I. [Brown University] — Brown University President Christina H. Paxson and School of Engineering Dean Tejal Desai are among 13 women university presidents and deans of engineering from six leading research universities who have issued an open letter in support of the CHIPS and Science Act.\nThe April 20 open letter details steps the authors say that higher education institutions must take to support the ambitious goals of the legislation — which was passed into law by Congress in August 2022, to grow the semiconductor industry workforce — while also preparing more women and people of color to enter the field. Upon publication, it was signed by leaders from Brown University, Dartmouth College, Indiana University, Olin College, the University of California, Berkeley, the University of Rochester and the University of Washington.\nThe full text of the letter is published below.\nOpen letter in support of CHIPS and Science Act\nApril 20, 2023\nTo our partners in government and industry:\nWe applaud the passage of the CHIPS and Science Act, which will strengthen the nation’s economic competitiveness and security. We are writing as women university presidents and engineering deans to  express our commitment to help significantly grow the engineering workforce, which is essential to achieve the goals of CHIPS.  \nA simple truth is that expanding this workforce will be impossible without bringing in more women and people of color. \nAccording to Commerce Secretary Gina Raimondo, the nation must triple the number of graduates who are semiconductor industry-ready. Currently, women represent between 10 and 25% of the semiconductor industry, and historically underrepresented groups make up only 20%. The success of CHIPS hinges on tapping the full strength of the nation’s talent, by attracting more women and historically marginalized groups to the industry.\nWe are forming a coalition of higher-education institutions that are committed to expanding and diversifying the semiconductor workforce. It is fitting that this coalition is beginning as six universities in the AAU (America’s leading research universities) that have both women presidents and deans of engineering (as of July 2023), as well as the female Chair of the Board of the American Association for the Advancement of Science (AAAS). We plan to expand this coalition to include many more institutions that share our commitment.\nFar too many employers report a mismatch between what engineering students learn in school, and what graduates need on day one of the job. Building a more heterogeneous, job-ready labor force demands that  higher education, private industry and the federal government coalesce and act at an unprecedented level and pace.\nWe know what works when it comes to growing groups of diverse industry-ready graduates, and we’re ready to act.\nHere is what it will take:\n1. Connecting the semiconductor industry to societal impact: Research shows that women and members of historically marginalized groups are drawn to fields and careers that enable them to help other people. We have to bring to light the often-overlooked ways that the semiconductor industry benefits society, as well as how investment in the field will dramatically benefit other sectors including health care, energy and the environment.\n2. Creating more varied educational on-ramps: The traditional engineering curriculum too frequently has math and science classes that are divorced from reality and require background knowledge too many students have never gotten. We need to make programming accessible to more students by refreshing curricula across higher education.\n3. Supporting cross-university cohorts of students: Research clearly finds that when individuals are around people of similar backgrounds, they are more likely to feel like they belong and persist in a field. Cohort based models, and the support services they bring with them, must be part of the solution. We will create cross-university cohorts of women and individuals from historically underrepresented groups pursuing relevant degrees to build a greater sense of community.\n4. Creating more permeability between higher education and industry: The challenges that employers face, from closing gaps in skills to equipping students with more industry-embedded experiences aren’t solved by one-off internships. Instead, we need to enable faculty and industry collaborations, create opportunities for students to be embedded in workplaces to get hands-on experience while making progress toward their degrees, and host employers on university campuses to collaborate on developing curricula and inspiring students.\n5. Investing in engineering education hard infrastructure: To support the development of workers with knowledge and skills needed for the U.S. to lead in semiconductor manufacturing and innovation, existing educational laboratory facilities and equipment at universities and colleges across the nation must be modernized and made more accessible to a greater number and diversity of students.\nThe value of higher education in this equation goes beyond the immediate term. Having an adaptable workforce that can seamlessly transition as industry and technology rapidly shift is critical to the nation’s long-run global competitiveness. Engineering education that endows students with a wide array of knowledge and skills can help them more fluidly pivot into new roles as high-level employees.\nWe need funding and support from federal and state governments and employers to implement these strategies. To educate and graduate a single PhD in engineering today costs up to half a million dollars.\nThis is personal for us. We have often been the “first” women to occupy leadership roles, and frequently are still one of the few or only women in gatherings of industry leaders.  We did not arrive at our positions on our own — it took mentorship, community, and, thankfully, amazing educations to help us get here.  And we are proud of the strides our institutions have taken to diversify the student populations focused on STEM. Now, we want to work together to help expand (and change) the makeup of the entire semiconductor and engineering workforce — and with CHIPS, we have the potential infrastructure to get it done.\nTo quote Secretary Raimondo, “the stakes couldn’t be higher,” and we couldn’t agree more. If the CHIPS Act is the equivalent of landing on the moon, then this time, it cannot be walked by men alone.\nSincerely,\nBrown University President Christina Paxson, and Dean of Engineering Tejal Desai\nDartmouth President-elect Sian Beilock and Dean of Engineering Alexis Abramson\nIndiana University President Pam Whitten and Dean of Engineering Joanna Millunchick,\nUniversity of Rochester President Sarah Mangelsdorf and Dean of Engineering Wendy Heinzelman\nUniversity of Washington President Ana Marie Cauce and Dean of Engineering Nancy Allbritton\nUniversity of California, Berkeley Chancellor Carol Christ and Dean of Engineering Tsu-Jae King Liu\nOlin College President and Chair of the Board of Directors of the American Association for the Advancement of Science (AAAS) Gilda Barabino\n\n\n\n\n\n\n\n\nTags\n\nDiversity and Inclusion\nPresident\nResearch\nSchool of Engineering\n\n\n\n\nRelated news:\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Science and Technology\n\n\nFour years later, AI language dataset created by Brown graduate students goes viral\n\n\n\n\n\n April 25, 2023\n\n  Thanks to the popularity of new AI-powered chatbots and technology, Brown alumni Aaron Gokaslan and Vanya Cohen are seeing newfound interest in their dataset replicating OpenAI’s language processing model GPT-2.\n\n\nRead Article\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen details for Four years later, AI language dataset created by Brown graduate students goes viral\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Science and Technology\n\n\nOn the eve of Earth Day, Brown climate scientist outlines solutions for a warming world\n\n\n\n\n\n April 20, 2023\n\n  Kim Cobb, a Brown University professor and director of the Institute at Brown for Environment and Society, spoke about the need to act on climate change, urging that action must be taken collaboratively and equitably.\n\n\nRead Article\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen details for On the eve of Earth Day, Brown climate scientist outlines solutions for a warming world\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Science and Technology\n\n\nBrown geologist elected to American Academy of Arts and Sciences\n\n\n\n\n\n April 19, 2023\n\n  Alberto Saal, a geology professor at Brown, is honored for his work in helping scientists understand the formation and early history of Earth and the Moon.\n\n\nRead Article\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen details for Brown geologist elected to American Academy of Arts and Sciences\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n\n\nProvidence\nRI\n02912\n\n\n\n\n\n\n\n\n401-863-1000\n\n\n\n\n\n\nQuick Navigation\n\n\n\n\nVisit Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Map\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA to Z\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter Navigation\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEvents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Safety\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccessibility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers at Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe campaign for building on distinction\n\nGive To Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSocial Navigation\n\n\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\n\n\nInstagram\n\n\n\n\n\n\n\n\nLinkedIn\n\n\n\n\n\n\n\n\nSnapchat\n\n\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\n\n\nYouTube\n\n\n\n\n\n\n\n\nSocial Media Directory\n\n\n\n\n© Brown University \n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \n\n\nFor You\n\n\n\n\n\n\n\nCurrent Students\n\n\nFaculty\n\n\nStaff\n\n\nParents & Families\n\n\nAlumni\n\n\nFriends & Neighbors\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\nMobile Site Navigation\n\n\n\n\nMobile Site Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\nTopics\n\n\n\n\n\nArts and Humanities\n\n\n\n\nEnvironment\n\n\n\n\nHealth and Medicine\n\n\n\n\nNews and Events\n\n\n\n\nScience and Technology\n\n\n\n\nSocial Sciences\n\n\n\n\nStudent Life\n\n\n\n\nUniversity Initiatives\n\n\n\n\n\n\n\n\nMobile Secondary Navigation Navigation\n\n\n\n\nCOVID-19 Info\n\n\n\n\nAbout\n\n\n\n\nEvents\n\n\n\n\nFor You\n\n\n\n\nGive to Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAll of Brown.edu\n\n\n\n\n\n\nPeople\n\n\n\n\n\n\nNews\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\nSearch people\n\n\n\n\n\n\n\nAdvanced Search\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Search\n\n\n\n\n\n\n\n\n\n\n\nWomen university presidents, engineering deans issue open letter supporting CHIPS and Science Act\n\n\n\n\n\nOpen details for Women university presidents, engineering deans issue open letter supporting CHIPS and Science Act\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark this Page\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page_main_content",
        "/",
        "/news",
        "/news/featured-events",
        "/news/for-journalists",
        "#flyout_search",
        "#menu",
        "/news/science-technology",
        "/cdn-cgi/l/email-protection#a6cbc3c2cfc7f9d4c3cac7d2cfc9c8d5e6c4d4c9d1c888c3c2d3",
        "tel:4018632476",
        "/news/all",
        "#",
        "#",
        "#",
        "#",
        "https://www.commerce.gov/news/speeches/2023/02/remarks-us-secretary-commerce-gina-raimondo-chips-act-and-long-term-vision",
        "https://www.aau.edu/",
        "https://www.aaas.org/",
        "/news/tag/diversity-inclusion",
        "/news/tag/president",
        "/news/tag/research",
        "/news/tag/engineering",
        "/news/2023-04-25/open-web-text",
        "/news/2023-04-25/open-web-text",
        "/news/2023-04-25/open-web-text",
        "/news/2023-04-20/earth-week-lecture",
        "/news/2023-04-20/earth-week-lecture",
        "/news/2023-04-20/earth-week-lecture",
        "/news/2023-04-19/academy-saal",
        "/news/2023-04-19/academy-saal",
        "/news/2023-04-19/academy-saal",
        "https://www.google.com/maps/dir/?api=1&destination=Brown%20University%2075%20Waterman%20St.%20Providence%20RI%2002912",
        "tel:4018631000",
        "https://www.brown.edu/about/visit",
        "https://www.brown.edu/Facilities/Facilities_Management/maps/#building/",
        "https://www.brown.edu/a-z",
        "https://www.brown.edu/about/contact-us",
        "https://www.brown.edu/news",
        "https://events.brown.edu/",
        "https://dps.brown.edu/",
        "https://www.brown.edu/website-accessibility",
        "https://www.brown.edu/careers",
        "http://alumni-friends.brown.edu/giving/",
        "https://www.facebook.com/BrownUniversity",
        "https://instagram.com/brownu",
        "https://www.linkedin.com/edu/school?id=19348",
        "https://www.snapchat.com/add/brown-u",
        "https://twitter.com/BrownUniversity",
        "https://www.youtube.com/brownuniversity",
        "https://www.brown.edu/social/",
        "/",
        "/current-students",
        "/faculty",
        "/staff",
        "/families",
        "https://alumni-friends.brown.edu/",
        "/friends-neighbors",
        "#flyout_search",
        "#menu",
        "/news/featured-events",
        "/news/for-journalists",
        "/taxonomy/term/146",
        "/taxonomy/term/311",
        "/taxonomy/term/161",
        "/taxonomy/term/301",
        "/taxonomy/term/306",
        "/taxonomy/term/316",
        "/taxonomy/term/521",
        "/taxonomy/term/526",
        "https://healthy.brown.edu/",
        "/about",
        "https://events.brown.edu",
        "",
        "https://alumni-friends.brown.edu/giving",
        "https://directory.brown.edu/",
        "#header",
        "https://www.brown.edu/news/2023-04-20/chips-act"
    ]
}