{
    "title": "FAQ - International Programs | Extension and International Programs | CSUF",
    "body": "\n\n\n\n CSUF Campus is Closed for the holidays December 26, 2022 through January 2, 2023.\n         We will resume responding to requests upon our return on January 3, 2023 at 8 a.m.Website and online services unavailable on May 29. See IT Disaster Recovery website\n         ► For International Students FAQs, click here ›COVID-19 Vaccine Requirement for Students and Instructors ► \n\nSite Menu\n\nsearchSearch this site\n\nCSUF\n\nInternational Programs\n+Study at CSUF\n\n\n\nInternational Admissions\nUniversity Semester Abroad\n\n\n\n\n\n+Services\n\n\n\nInternational Students & Scholars\nNew International Students\nMaintaining Status\nEmployment\nTravel & Visa\nHealth Insurance\nHousing\n\n\n\n\n\n+CSUF Students\n\n\n\nStudy Abroad\n\n\n\n\n\n+Faculty & Staff\n\n\n\nFulbright Program\nInternational Partnerships\nVisiting Scholars/Exchange Visitors\n\n\n\n\n\n+About\n\n\n\nInternational Programs\nCalifornia State University, Fullerton\n\n\n\n\n\nContact International Programs\n\n \n\n\n\n\n\nExtension and International Programs\nExtension and International Programs\n+Professional Development\n\n\n Certificate Programs \n Educator Courses and Programs \nCommunity & Corporate Engagement\n Leadership for Public Agencies\n\n\n\n\n+Degrees\n\n\n Online Degree Completion Programs \n Master’s Programs \n Pre-Health Program \n Test Preparation Courses \n\n\n\n\n+University Courses\n\n\n Open University \n Summer Session \n Winter Session \n\n\n\n\n+Lifelong Learning\n\n\n Fullerton Arboretum \n Osher Lifelong Learning Institute \n\n\n\n\n+Online\n\n\n Online Certificate Programs \n Online Degree Completion Programs \n Online Programs for Educators\nOnline Training & Courses\n\n\n\n\n+International\n\n\n International Programs \n International Admissions \n University Semester Abroad \nInternational Students & Scholars\nStudy Abroad & Global Engagement\n\n\n\n\n\n There was a problem with the left navigation. \n\n\n MENU \n\n\n\n\n\n\n\n\nSearch this site or CSUF general sitesSiteCSUF\n\n\n\nExtension and International Programs\n\n\n\nExtension and International Programs\nOnline degrees, certificate programs, and accelerated courses at California State\n                                 University, Fullerton. Your growth is our goal.\n\n\n\n\n\n\nProfessional Development\n\n\n\nProfessional Development\nCertificate programs provide working professionals with evening and weekend courses,\n                                 as well as networking opportunities to advance their careers or enter new fields.\n\n\n Certificate Programs  Educator Courses and Programs Community & Corporate Engagement Leadership for Public Agencies\n\n\n\nDegrees\n\n\n\nDegrees\nEIP partners with CSUF colleges and departments to offer bachelor’s and master’s degrees,\n                                 as well as preparation programs for those looking to apply to professional health-care,\n                                 law and business schools.\n\n\n Online Degree Completion Programs  Master’s Programs  Pre-Health Program  Test Preparation Courses \n\n\n\nUniversity Courses\n\n\n\nUniversity Courses\nEIP expands access to University classes through Open University, Summer Session and\n                                    Winter Session. Open University registration is open to the general public; Summer\n                                    and Winter Sessions help Cal State Fullerton students graduate on-time or early.\n\n\n Open University  Summer Session  Winter Session \n\n\n\nLifelong Learning\n\n\n\nLifelong Learning\nOur lifelong learning opportunities range from programs for children to retirees,\n                                 and include an on-campus arboretum  with classes and events for those of all ages.\n\n\n Fullerton Arboretum  Osher Lifelong Learning Institute \n\n\n\nOnline\n\n\n\nOnline Programs\nOnline programs are structured with lectures and assignments, and allow you to interact\n                                 and communicate with students and instructors/professors online.\n\n\n Online Certificate Programs  Online Degree Completion Programs  Online Programs for EducatorsOnline Training & Courses\n\n\n\nInternational\n\n\n\nInternational Programs\nInternational students may study for one semester or complete an entire bachelor's\n                                 or master's degree at CSUF. \n\n\n International Programs  International Admissions  University Semester Abroad International Students & ScholarsStudy Abroad & Global Engagement\n\n\n\n\n\n\n\n\n\nExtension and International ProgramsInternational Programs\n\nStudy at CSUF\n\n\n\n\nInternational Admissions\nUniversity Semester Abroad\n\n\n\n\n\n\nServices\n\n\n\n\nInternational Students & Scholars\nNew International Students\nMaintaining Status\nEmployment\nTravel & Visa\nHealth Insurance\nHousing\n\n\n\n\n\n\nCSUF Students\n\n\n\n\nStudy Abroad\n\n\n\n\n\n\nFaculty & Staff\n\n\n\n\nFulbright Program\nInternational Partnerships\nVisiting Scholars/Exchange Visitors\n\n\n\n\n\n\nAbout\n\n\n\n\nInternational Programs\nCalifornia State University, Fullerton\n\n\n\n\n\n\nContact International Programs\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nCOVID-19 Updates & Frequently Asked Questions (FAQ)\n\nInternational Students and Scholars is committed to supporting you during this COVID-19\n                              pandemic.  We are closely monitoring the developments of this pandemic situation and\n                              its impact on international students and scholars. This page has been created to help\n                              answer some frequently asked questions and provide additional resources. Please frequently\n                              check this ISS COVID-19 FAQ webpage for updates as this global health crisis is rapidly\n                              evolving.\n\nISS Services While Operating Remotely\nISS Advising: International Student Advisors are available by virtual appointments: https://extension.fullerton.edu/international/students/advising\nAppointment times are made available on a daily basis (when CSUF is open).\n\nIncreased Processing Timeframe \n\n\nWe are currently accepting all requests, but are prioritizing requests that are time-sensitive\n                                    (i.e., OPT, STEM OPT Extensions, extensions of I-20s, or other requests requiring\n                                    immediate action). Due to high volume and limited resources, processing times have\n                                    increased. ISS is unable to respond to inquiries about the status of the below listed\n                                    services/requested received. Please plan ahead by submitting requests well in advance\n                                    as we are unable to accommodate rush requests. Please do not send multiple emails or submissions for the same request, or sign up\n                                       for virtual appointments to check on status of requests. This only adds to our volume\n                                       and further delays processing of email/request.\nProcessing times listed below are subject to change without notice, especially during\n                                    peak request periods.Requests/emails that are either incomplete or requiring additional follow-up will\n                                    further extend processing times.\n\n\n\n\nTYPE OF SERVICE/REQUEST\nPROCESSING TIME FRAMES(does not include time frame for shipping of I-20 or other documents from ISS^)\n\n\nRelease of ISS Holds related to health insurance\n5 business days* after ISS confirms payment\n\n\nLetter RequestsTravel Signature RequestConcurrent Enrollment RequestsReduced Course Load RequestsLeave of Absence RequestsProgram Extension Requests\n10 business days*\n\n\nCurricular Practical Training (CPT)Optional Practical Training (OPT)OPT Employer UpdatesSTEM OPT Extension RequestsSTEM OPT Employer UpdatesSTEM OPT Validation Reporting\n15 business days*\n\n\n\n\n*Business days are Mondays through Fridays, except CSUF holidays. Processing of requests\n                                          and emails received after business hours begin on next business day. In other words,\n                                          if you submit your request/email after 5:00 PM (California Time) on a Friday, then\n                                          processing will count and begin on the following Monday.\n\n\n\n\nForm I-20 Issuance (updated January 12, 2022) \n\n\nSEVP (Student & Exchange Visitor Program), Department of State and CBP (Customs and\n                                       Border Protection) accept digitally signed, electronic copies of the Form I-20. However,\n                                       the DMV (Department of Motor Vehicles) may require a wet signed Form I-20. If you\n                                       need to submit an application to the DMV, you can request a wet signed I-20 by setting\n                                       up Express Mail here: extension.fullerton.edu/international/students/express-mail. ISS will then print and ship your I-20 for use with DMV. Outgoing shipments will occur\n                                       on Thursdays and Fridays (subject to change without notice).\nIf you are requesting an I-20 in which an electronic signature is permitted (all but\n                                       DMV), ISS will issue it and send it to your CSUF email. Upon receiving the electronic\n                                       I-20 via email, you need to print it and sign it with black ink in the Student Attestation\n                                       Section. \n\n\n\nFrequently Asked Questions  (updated August 15, 2022)\nHere are some frequently asked questions pertaining to maintenance of F1/J1 immigration\n                           status during the COVID-19 pandemic, based on available guidance from the Student\n                           & Exchange Visitor Program (SEVP), U.S. Department of State, and U.S. Citizenship\n                           and Immigration Services (USCIS). As situations related to the COVID-19 crisis change\n                           and more guidance becomes available, this webpage will be updated. Please continue\n                           to check your CSUF email for campus and ISS updates.\n\nNew Students for Fall 2022\n\nWhat is CSUF's mode of instruction for Fall 2022? \n\n\nCSUF plans for primarily in-person instruction, with some courses delivered virtually\n                                    and some delivered as hybrid (mixture of in-person and virtual). Please frequently\n                                    check your CSUF email and the Titans Return website for more updates. \n\n\n\n\nI am admitted for Fall 2022. Will I be issued a Form I-20? \n\n\nConsistent with current SEVP's COVID-19 guidance for 2022-2023 academic year, ISS will issue a Form I-20 to admitted students who have accepted their admission\n                                    offer and whose supporting documents for the I-20 have been approved by ISS. Please\n                                    note that you do not need the Form I-20 if beginning your CSUF academic program by\n                                    studying remotely from outside the U.S. However, students who come from a U.S. sanctioned\n                                    country (Iran, Cuba, North Korea, Ukraine - Crimea Region, Sudan, Syria) are not permitted\n                                    to enroll and study remotely from abroad.\n\n\n\n\nI have returned to my home country. I have already transferred my SEVIS record to\n                                 CSUF. Can I attend CSUF remotely from my home country? \n\n\nYes, in most cases you can enroll full time in fully online/web courses for Fall 2022\n                                    and study remotely from your home country. Please be sure to inform ISS of your Fall\n                                    2022 plans to remain outside the U.S.\nNote that students who come from a U.S. sanctioned country (Iran, Cuba, North Korea,\n                                    Ukraine - Crimea Region, Sudan, Syria) are not permitted to enroll remotely from abroad.\n\n\n\n\nI have returned to my home country due to the COVID19 situation. I have already transferred\n                                 my SEVIS record to CSUF. Can I return to the U.S. to begin my first semester at CSUF\n                                 this Fall 2022? \n\n\nConsistent with SEVP's COVID-19 guidance, ISS will issue your CSUF Form I-20 for Fall 2022. Please note that the Form I-20\n                                    is a certificate of eligibility for the F-1 status. Entry to the U.S. remains at the\n                                    discretion of U.S. Customs and Border Protection (CBP).\n\n\n\n\nI cannot get my visa to come to the U.S. for the Fall 2022 semester. What can I do? \n\n\nYou can still begin your CSUF academic program by enrolling in fully online/web courses\n                                    for the Fall 2022 semester and study remotely from outside the U.S. This will allow\n                                    you more time to obtain the F-1 visa. If you choose to study from outside the U.S.,\n                                    please notify ISS immediately so that adjustments can be made to your Fall 2022 I-20.\n                                    Please note that your CSUF admission offer is specific to the Spring 2022 semester.\n                                    If you do not enroll in at least one Fall 2022 course, then you must reapply for admission\n                                    for a future term and wait for an admission decision before a new I-20 can be issued\n                                    to you. Please check the Fall 2022 Registration Guide for enrollment deadlines. If any further questions related to your CSUF admission,\n                                    please contact the Admissions Office: admissions@fullerton.edu.\n\n\n\n\nDue to COVID-19, can I postpone my admission to Fall 2022 to Spring 2023 or a future\n                                 term? \n\n\nYour CSUF admission offer is specific to beginning your academic program in the Fall\n                                    2022 semester. If you do not enroll in the Fall 2022 term, then you must reapply for\n                                    admission for a future term. If any further questions about  your CSUF admission offer,\n                                    please contact the Admissions Office: admissions@fullerton.edu.\n\n\n\nContinuing Students\nContinuing students are international students who entered the U.S. in a previous\n                           semester and have remained enrolled and in active F-1 or J-1 status at CSUF or on\n                           approved OPT/STEM OPT since March 9, 2020 (based on SEVP Broadcast messages, March 9, 2020 and April 26, 2021).\nMaintaining Immigration Status\n\nI was admitted (in Fall 2020 or Spring 2021 or Fall 2021 or Spring 2022 semester),\n                                 have been studying from outside of the U.S., and plan to begin in-person coursework\n                                 in Fall 2022 semester. What do I need to do? \n\n\nPlease contact ISS to request a Form I-20 for Fall 2022.\n\n\n\n\nI am not able to secure an F1 visa. What should I do? \n\n\nIn most cases, you can enroll in fully online (100% web) courses for the semester\n                                    and study remotely from outside the U.S. To maintain your F1 status, you must enroll\n                                    in a full course load. If you are not enrolling in any CSUF courses, you may request\n                                    a Leave of Absence if eligible. Please meet virtually with an ISS Advisor to discuss your situation,\n                                       eligibility for Leave Request and explore other options.\n\n\n\n\nCan I remain in the U.S. while doing online instruction for Fall 2022 semester? \n\n\nYes, you can remain in the U.S. as long as you maintain a full course of study (or\n                                    have ISS approved reduced course load) for Fall 2022 semester. If you are unable to\n                                    maintain a full course of study, please schedule a virtual appointment with an ISS\n                                    Advisor before submitting withdrawal requests.\n\n\n\n\nWill my SEVIS record or F1/J1 status be terminated if I drop my classes or do not\n                                 virtually attend online classes? \n\n\nYes, in most cases. Please refer to https://extension.fullerton.edu/international/students/status/\n\n\n\n\nI returned to my home country and am facing difficulties with virtual coursework due\n                                 to the time difference. What should I do? \n\n\nPlease be sure to clearly communicate your situation with your professor(s) and ask\n                                    if any accommodations can be made available. Please discuss your situation with an\n                                    ISS Advisor before any repeated or extended absences from course participation and\n                                    before submitting withdrawal request from course. \n\n\n\nHealth Insurance\n\nDo I have to purchase health insurance for Fall 2022 semester if I am studying from\n                                 my home country? Can I get a health insurance refund? \n\n\nIf you will remain outside the U.S. for the entire duration of the Fall 2022 semester\n                                    while studying virtually, you are not required to purchase the CSUF International\n                                    Student Health Insurance Plan for the Fall 2022 semester. Please be reminded that\n                                    if you decide to remain in the U.S., the CSUF International Student Health Insurance\n                                    is a condition of your enrollment and F-1 status.\nTo request an exception to the health insurance requirement based on being outside\n                                    the U.S., please email ISS proof that you have departed the U.S. (examples of acceptable\n                                    proof include I-94 Travel History, copy of airline ticket, copy of arrival date stamp\n                                    in passport). If you have been admitted for Fall 2022 semester and you are not transferring\n                                    from a SEVIS approved school, you are not required to provide proof of departure.  \n\n\n\n\nIn the event that I actually have Coronavirus, does my CSUF International Student\n                                 Health insurance cover the hospital and testing fees? \n\n\nPlease view your COVID-19 Coverage information on Anthem's Individual and Family webpage:\n                                    https://www.anthem.com/ca/coronavirus/individual-and-family/\n\n\n\nHealth & Wellness Resources\nEmployment\n\nI am planning to graduate in Fall 2022. After I complete my classes virtually, can\n                                 I apply for Post-Completion OPT while I am overseas? \n\n\nIf you are currently outside the U.S. and have not yet applied for Post-Completion\n                                    OPT, you must re-enter the U.S prior to your program completion date in order to qualify\n                                    for OPT. You cannot submit your OPT application to USCIS while you are outside the\n                                    U.S. Please discuss your situation with an ISS Advisor well in advance. \n\n\n\n\nI am on approved OPT or STEM OPT Extension and my employer has reduced my hours. Does\n                                 working less than 20 hours per week affect my F1 status? \n\n\nDuring the COVID19 emergency, SEVP considers employment that is less than 20 hours\n                                    per week to be valid for OPT employment.\n\n\n\n\nI am on approved OPT or STEM Extension OPT and my employer has instructed me to work\n                                 from home. What steps do I need to take to report this? \n\n\nAccording to the SEVP FAQ released on April 14, 2020, your SEVIS record does not need\n                                    to be updated if you are working from home due to COVID19. Additionally, students\n                                    on STEM OPT are not required to update their I-983 if working from home due to COVID19.\n\n\n\n\nI am on approved OPT or STEM Extension OPT and my employer has placed me on a paid/unpaid\n                                 leave. Does this count as unemployment or affect my status? \n\n\nTime off work consistent with the employer’s leave-related policies does not count\n                                    as unemployment. As long as you are expected to resume work after the leave, you do\n                                    not need to take any action to update your SEVIS record or Form I-20. Please be sure\n                                    to save any documentation and/or communication from your employer pertaining to the\n                                    leave. If you are on approved OPT or STEM OPT and your employment has been permanently\n                                    terminated, you must report the end of your employment to ISS within 10 days.\n\n\n\n\nI am on approved OPT or STEM Extension OPT and I am unable to find a job. Will USCIS\n                                 allow for additional unemployment days? \n\n\nAt this time, there have not been any changes or flexibility in regards to the limit\n                                    on unemployment days. If you are on OPT and want to avoid exceeding the unemployment\n                                    limit, you may want to consider a qualifying volunteer position. Unlike OPT, STEM Extension OPT cannot be maintained with volunteer and/or unpaid\n                                    positions. Otherwise, you must depart the U.S. or transfer to a new school before\n                                    exceeding the unemployment limit.\n\n\n\n\nI am on approved STEM Extension OPT or plan to apply for STEM Extension OPT. Can I\n                                 submit the form I-983 with electronic signatures? \n\n\nAt this time, there has not been an official announcement indicating that an electronic\n                                    signature on the I-983 is permitted. We therefore must defer to the instructions on\n                                    the I-983 form itself which indicates “sign in ink”.\n\n\n\nTravel Alerts & FAQs\n\nProof of COVID-19 Vaccination Status Required before Boarding Flight to U.S. \n\n\nEffective November 8, 2021, all non-immigrant air travelers to the U.S. are required\n                                    to be fully vaccinated and present proof of COVID-19 vaccination before boarding an\n                                    airplane bound for the U.S. For more details, please see CDC's website.\n\n\n\n\nAfter International Travel Guidance from CDC \n\n\nFor your health and safety, please see CDC's After International Travel Guidance.\n\n\n\n\nCan I travel internationally? \n\n\nISS does not recommend travel due to the current COVID-19 pandemic, travel restrictions\n                                    for certain foreign nationals, and temporary suspension of visa services in most US\n                                    Embassies. If you choose to depart the U.S., please be prepared for delays and possible\n                                    inability to re-enter the U.S.\n\n\n\n\nCan I travel within the U.S.? \n\n\nISS does not recommend non-essential travel within the U.S. due to the current COVID-19\n                                    pandemic. Various parts of the U.S. have travel restrictions. Please refer to CDC: COVID-19 Cases in the U.S.  If you choose to travel within the U.S., please seriously consider your health and\n                                    safety. Be sure to follow the recommendations provided by Centers of Disease Control and Prevention.\n\n\n\n\nDo I have to return to my home country? \n\n\nNo. While Cal State Fullerton is taking precautionary measures and providing virtual\n                                    instruction mode for all students, F1 and J1 students can remain in the US if they\n                                    choose to do so. Students should check the expiration date on their Form I-20 (for\n                                    F1 students) or Form DS-2019 (for J1 students).\n\n\n\n\nDo I need to submit my Form I-20 or Form DS-2019 before departing the US? \n\n\nNo. Please submit the online Travel Signature Request prior to departure. F1 students will receive their signed Form I-20 via CSUF email.\n                                    J1 students will have their reprinted Form DS-2019 mailed to mailing address provided\n                                    (or shipped overseas at students' expense). \n\n\n\n\nDo I need to apply for a new visa if I am outside the U.S.? \n\n\nA visa is valid until its expiration date. You are not required to apply for a new\n                                    visa if it has not yet expired or been revoked.\n\n\n\n\nWhat should I do if I am unable to depart the United States before the end of my Grace\n                                 Period? \n\n\nF-1 Visa Holders: If you are unable to depart the U.S. before the end of your Grace\n                                    Period, your options to extend your F-1 status include receiving admission to another\n                                    SEVP certified School and transferring your SEVIS record or applying for OPT. Please\n                                    consult with an ISS Advisor regarding procedures and eligibility. Additionally, we\n                                    encourage you to also contact your home country’s local consulate or embassy in the\n                                    U.S. for support and information regarding travel home.\nJ-1 Visa Holders: Please contact ISS to request an appointment with ISS Associate\n                                    Director to discuss your situation.\n\n\n\n\nIf I apply for unemployment benefits, will it affect my F-1 status? \n\n\nUnemployment benefits do not impact your F1 status or eligibility for future benefits.\nIt is important to note that unemployment insurance eligibility requirements vary\n                                    from state to state. Check with the unemployment insurance agency in the state where\n                                    you worked regarding eligibility guidelines. Click here to search for your state’s program.\n\n\n\nArchives\n\nCSUF President Virjee's July 8, 2020 message: Supporting our International Students\nFAQ for Spring & Summer 2020\nFAQ for Fall 2020\nFAQ for Spring 2021\nFAQ for Fall 2021\nFAQ for Spring 2022\n\nUpdated August 19, 2022\n\n\n\n\n\n\n\n\n\n\n\n\nThis site is maintained by Extension and International Programs.\nMailing Address:  800 N. State College Blvd., #THall 1403, Fullerton, CA 92831\nTo report problems or comments with this site, please contact eipcommunications@fullerton.edu.© California State University, Fullerton. All Rights Reserved.\n            \t\t\t\t\t\n\n\nWeb Accessibility\nCSUF is committed to ensuring equal accessibility to our users. Let us know about\n            any accessibility problems you encounter using this website.We'll do our best to improve things and get you the information you need.\n\nResources:\nDownload Adobe Acrobat Reader\nAdobe Reader\nDownload Word viewer, or download Excel viewer, or download PowerPoint viewer\nMicrosoft Viewers\nReport An ATI Issue\nAccessible @ CSUF\n\n\n\n\n\nThis page uses javascript to help render elements, if you have problems please enable javascript.\n\n\n\n\n\n\n\n\n\n\n©",
    "links": [
        "https://www.fullerton.edu/it/events_projects/disaster-recovery/",
        "https://extension.fullerton.edu/international/covid19-faq.aspx",
        "http://coronavirus.fullerton.edu/",
        "https://www.fullerton.edu/",
        "http://admissions.fullerton.edu/intl/",
        "/international/usa/default.aspx",
        "/international/students/default.aspx",
        "/international/new-students/default.aspx",
        "/international/students/status/",
        "/international/students/employment/default.aspx",
        "https://ueetest2.fullerton.edu/international/students/travel-visa/default.aspx",
        "/international/students/health.aspx",
        "/international/students/housing/default.aspx",
        "/studyabroad/default.aspx",
        "/international/fulbright.aspx",
        "/international/international-partnerships.aspx",
        "/international/visiting-scholars.aspx",
        "/international/about-ip.aspx",
        "/international/about-csuf.aspx",
        "/international/contact.aspx",
        "https://extension.fullerton.edu/",
        "#",
        "https://extension.fullerton.edu/professionaldevelopment/",
        "https://extension.fullerton.edu/professionaldevelopment/educator",
        "https://extension.fullerton.edu/community-corporate-engagement",
        "https://extension.fullerton.edu/leadershipdevelopment",
        "#",
        "https://extension.fullerton.edu/onlinedegrees",
        "https://extension.fullerton.edu/masters",
        "https://extension.fullerton.edu/prehealth",
        "https://extension.fullerton.edu/professionaldevelopment/test-preparation",
        "#",
        "https://extension.fullerton.edu/ou",
        "https://extension.fullerton.edu/summer",
        "https://extension.fullerton.edu/winter",
        "#",
        "https://fullertonarboretum.org/",
        "https://olli.fullerton.edu/",
        "#",
        "https://extension.fullerton.edu/professionaldevelopment/online#header-section",
        "https://extension.fullerton.edu/professionaldevelopment/online#degree-completion",
        "https://extension.fullerton.edu/professionaldevelopment/educator",
        "https://extension.fullerton.edu/online-training.aspx",
        "https://international.fullerton.edu/",
        "https://extension.fullerton.edu/international/",
        "http://admissions.fullerton.edu/intl/",
        "https://extension.fullerton.edu/international/usa/",
        "https://extension.fullerton.edu/international/students/",
        "https://extension.fullerton.edu/studyabroad",
        "http://www.fullerton.edu",
        "https://extension.fullerton.edu/",
        "#",
        "https://extension.fullerton.edu/professionaldevelopment/",
        "https://extension.fullerton.edu/professionaldevelopment/educator",
        "https://extension.fullerton.edu/community-corporate-engagement",
        "https://extension.fullerton.edu/leadershipdevelopment",
        "#",
        "https://extension.fullerton.edu/onlinedegrees",
        "https://extension.fullerton.edu/masters",
        "https://extension.fullerton.edu/prehealth",
        "https://extension.fullerton.edu/professionaldevelopment/test-preparation",
        "#",
        "https://extension.fullerton.edu/ou",
        "https://extension.fullerton.edu/summer",
        "https://extension.fullerton.edu/winter",
        "#",
        "https://fullertonarboretum.org/",
        "https://olli.fullerton.edu/",
        "#",
        "https://extension.fullerton.edu/professionaldevelopment/online#header-section",
        "https://extension.fullerton.edu/professionaldevelopment/online#degree-completion",
        "https://extension.fullerton.edu/professionaldevelopment/educator",
        "https://extension.fullerton.edu/online-training.aspx",
        "https://international.fullerton.edu/",
        "https://extension.fullerton.edu/international/",
        "http://admissions.fullerton.edu/intl/",
        "https://extension.fullerton.edu/international/usa/",
        "https://extension.fullerton.edu/international/students/",
        "https://extension.fullerton.edu/studyabroad",
        "https://extension.fullerton.edu/",
        "/",
        "/international",
        "http://admissions.fullerton.edu/intl/",
        "/international/usa/default.aspx",
        "/international/students/default.aspx",
        "/international/new-students/default.aspx",
        "/international/students/status/",
        "/international/students/employment/default.aspx",
        "https://ueetest2.fullerton.edu/international/students/travel-visa/default.aspx",
        "/international/students/health.aspx",
        "/international/students/housing/default.aspx",
        "/studyabroad/default.aspx",
        "/international/fulbright.aspx",
        "/international/international-partnerships.aspx",
        "/international/visiting-scholars.aspx",
        "/international/about-ip.aspx",
        "/international/about-csuf.aspx",
        "/international/contact.aspx",
        "/international/students/advising.aspx",
        "/international/students/express-mail.aspx",
        "http://coronavirus.fullerton.edu/",
        "https://www.ice.gov/doclib/sevis/pdf/bcm2205-03.pdf",
        "https://www.ice.gov/doclib/sevis/pdf/bcm2205-03.pdf",
        "http://records.fullerton.edu/registration/registrationguides.php",
        "mailto:admissions@fullerton.edu",
        "mailto:admissions@fullerton.edu",
        "https://www.ice.gov/doclib/sevis/pdf/bcm2003-01.pdf",
        "https://www.ice.gov/doclib/sevis/pdf/bcm2104-05.pdf",
        "https://extension.fullerton.edu/international/students/status/leaving-csuf.aspx",
        "https://extension.fullerton.edu/international/students/status/leaving-csuf.aspx",
        "/international/students/status/default.aspx",
        "https://www.anthem.com/ca/coronavirus/individual-and-family/",
        "http://www.fullerton.edu/studentwellness/",
        "https://studyinthestates.dhs.gov/2018/07/reporting-volunteer-positions-during-opt-employment",
        "https://www.cdc.gov/coronavirus/2019-ncov/travelers/noncitizens-US-air-travel.html",
        "https://www.cdc.gov/coronavirus/2019-ncov/travelers/after-travel-precautions.html",
        "https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/cases-in-us.html?CDC_AA_refVal=https%3A%2F%2",
        "https://www.cdc.gov/coronavirus/2019-ncov/index.html",
        "/international/students/travel-signature-request.aspx",
        "https://www.careeronestop.org/LocalHelp/UnemploymentBenefits/find-unemployment-benefits.aspx?location=CA&keyword=&persist=true&ajax=0",
        "https://president.fullerton.edu/communications/messages/supporting-our-international-students.aspx",
        "https://ueestatic.fullerton.edu/static/ip//pdf/iss-covid19-faq-spring-summer-2020.pdf",
        "https://ueestatic.fullerton.edu/static/ip/pdf/iss-covid19-faq-fall-2020.pdf",
        "https://ueestatic.fullerton.edu/static/ip/pdf/iss-covid19-faq-spring-2021.pdf",
        "https://ueestatic.fullerton.edu/static/ip/pdf/iss-covid19-faq-fall-2021.pdf",
        "https://ueestatic.fullerton.edu/static/ip/pdf/iss-covid19-faq-spring-2022.pdf",
        "#top",
        "/",
        "/",
        "mailto:eipcommunications@fullerton.edu",
        "https://www.facebook.com/CSUFeip1/",
        "https://twitter.com/csufeip",
        "https://www.linkedin.com/company/csufeip",
        "https://www.instagram.com/csufeip/",
        "https://www.youtube.com/channel/UCXfVE_OaAYI6RWV4m_Cn0iQ",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/details.aspx",
        "https://www.fullerton.edu/reportati/",
        "https://www.fullerton.edu/ATI",
        "https://a.cms.omniupdate.com/11/?skin=csufullerton&account=EIP&site=eip&action=de&path=/international/covid19-faq.pcf"
    ]
}