{
    "title": "Big Dreams Bold Vision | Chapman Newsroom",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nFind information for\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\n\nDegrees\n\n                & Programs\nMaps &\n\n                Directions\nAll Directories\nNews\nEvents\n\nSocial\n\n\n\n\n\n\n\nfacebook\n\n\n\n\n\n\n\ntwitter\n\n\n\n\n\n\n\npinterest\n\n\n\n\n\n\n\ninstagram\n\n\n\n\n\n\n\n\n\nyoutube\n\n\n\n\n\n\n\nlinkedin\n\n\n\n\n\n\n\n\n\nsnapchat\n\n\n\n\n\n\n\ntumblr\n\n\n\n\n\n\n\nitunes\n\n\n\n\n\n\nSocial hub\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\nNewsroom\n\n\n\n\n\n\n\n\nTopics\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind\n\n\n\n\n\n\n\n\n\n\nLog in\n\n\n\n\n\n\n\n\n\n\n                    Login\n\n                  \n\n\n\n\ncanva icon\n\n\nCanvas\n\n\n\n\n\n\n\n\n\n\n\n\n\nHandshake\n\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty & staff) \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n              Chapman University\n\n            \n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nChapman Newsroom\nMain Menu >\n\n\nTopics\n\n\nToggle\n\n\n\n\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\n\nToggle\n\n\n\n\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\nMain Menu\n< Chapman Newsroom \n\n\n\nAbout\n\n\n\nToggle About\n\n\n\n\n\nMaps & Directions\nVisit Chapman\nDiscover Chapman\nFacts & Rankings\nLeadership\nCampus Services\nConnect\n\n\n\nAcademics\n\n\n\nToggle Academics\n\n\n\n\n\nDegrees & Programs\n\nSchools & Colleges\nAcademic Calendar\nFaculty Directory\nLibraries\nCourse Catalogs\nInternational Study\n\n\n\nAdmission\n\n\n\nToggle Admission\n\n\n\n\n\nUndergraduate Admission\n\nUndergraduate Application\nGraduate Admission\nGraduate Application\nAffordability\nFinancial\n\n                    Aid\n\n                    Calculator\nCampus Tours\n\n\n\nAlumni\n\n\n\nToggle Alumni\n\n\n\n\n\nEvents\nGet Involved\nCareer\n\n                    Support\n\n\nArts\n\nCampus Life\n\n\n\nToggle Campus Life\n\n\n\n\n\nAthletics\nDiversity & Inclusion\nEvents\nFish Interfaith\n\n                    Center\nHealth & Safety\nResidence\n\n                    Life\nStudent Life\n\n\n\nResearch\n\n\n\nToggle Research\n\n\n\n\n\nPre-Award\n\n                    Administration\nPost-Award\n\n                    Administration\nResearch Integrity\nInstitutes &\n\n                    Centers\nCenter for\n\n                    Undergraduate\n\n                    Excellence\nGraduate Research\n\n                    Support\n\n\n\nSupport\n\n\n\nToggle Support\n\n\n\n\n\nContact Development\nGet Involved\nAreas to\n\n                    Support\nAlumni Involvement\n\n\n\n\n\n\nFind information for...\n\n\n\nToggle Find Information By Audience\n\n\n\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\nDegrees & Programs\nMaps & Directions\nAll Directories\nNews\nEvents\nSocial\n\n\n\n\n\n\n\n\n\n\n\n\n\nWant to see more like this? \nChapman Magazine seeks to convey the overall excellence of Chapman University by presenting news and features that illuminate the distinctive people, programs, history and culture of the university. \n\n\nRead more Chapman Magazine stories\n\n\n\n\n\n\n\nShare via Facebook Share via Twitter Share via Reddit Share via Pinterest Share via Email Share via LinkedIn \n Print Friendly\n\n\n\n\n\n\n\n\nBusiness & Economy \nBig Dreams Bold Vision\n Dawn BonkerMay 10, 201912 min read\n\n\n\n\n\nThe Argyros School celebrates 20 years of building upon the legacy of its extraordinary namesake by continuing to extend its reach and multiply its impact.\n\n\n\n\n\n\nBig\nDreams\nBold\nVision\n\nBy Dawn Bonker\n\n\n\n\n\n\n\n\n\n\n\n\n“Nonuple” isn’t an everyday word for most people. But it’s an illuminating one at Chapman University’s Argyros School of Business and Economics.\n\n\n\n\n\nThe term describes when something is nine times greater than it once was. At the Argyros School, it comes in handy to quantify the growth of academic publishing by faculty in the past two decades. It’s just one sign of the school’s progress in the 20 years since it took on the name and embraced the vision of The Honorable George L. Argyros ’59. Among the remarkable indicators are increased student selectivity, a climb in the rankings and growing numbers of alumni rising up in every industry, from technology to international investment.\nStill, the dean of the school can’t resist some fun with the word that says so much about the unique brand of energy fueling the upward trajectory there.\n“I had to learn this term,” Argyros Dean Tom Turk, Ph.D., says with a laugh. “Because we’ve nonupled our research publishing in the past 20 years. That’s pretty significant.”\nSuch a culture of achievement was precisely what alumnus Argyros envisioned for the school named in his honor. In his remarks during the naming dedication, Argyros called for greatness.\n“Dare to dream. Take advantage of the ability to think big and reach high. Be willing to take risks. Fight courageously for the principles you believe in,” Argyros said.\nAs the school marks two decades since its naming, it’s clear that the leadership, faculty, students and alumni have more than delivered on that challenge. Today the Argyros School ranks among the world’s top 100 business schools in U.S. News & World Report rankings, offering eight areas of specialization for undergraduates and five graduate programs. The school graduates some 600 students every year, compared with about 180 two decades ago, and boasts a faculty of nearly 80, including Vernon Smith, Ph.D., Nobel laureate in economics.\nUnderscoring it all is an unmatched student experience. With help from the school’s own career services office, students find meaningful internships. Undergraduates and graduates alike collaborate in small classes taught by faculty who are industry leaders as well as gifted teachers. Also in the classroom are business experts, thanks to a robust schedule of speakers who visit classes throughout the year. Many, including partners with the Big Four accounting firms, even return for mock interviews. None just talk and run.\n\n\n\n\n\n\n\n\n\n\n\n5\nArgyros School graduate programs\n\n\n\n\n\n\n\n\n\n\n\n\n\n75\nPercentage of employment offers to Argyros School students that are accepted within 90 days of graduation (Class of 2016)\n\n\n\n\n\n\n\n\n\n\n\n\n\n34\nRanking in\nBloomberg\nBusinessweek Best\nUndergraduate\nBusiness Schools,\n2016 (most recent rankings)\n\n\n\n\n\n\n\n\n\n\n\n\n\n73\nRanking in\nBloomberg\nBusinessweek Best\nU.S. Full-Time MBA\nPrograms, 2018\n\n\n\n\n\n\n\n\n\n\n\n\n\n100+\nOn-campus recruiting\nvisits by employers\neach year\n\n\n\n\n\n\n\n“\nDare to dream. Take advantage of the ability to think big and reach high. Be willing to take risks. Fight courageously for the principles you believe in.”\n– George L. Argyros ‘59\n\n\n\n\n\n“We have influential business leaders who interact with our students in a personal setting. At a bigger university, you’re never going to meet them. It’s not like you’re going to go for coffee with them and ask them questions,” Turk says. “Here, that’s fairly typical.”\nLife beyond the traditional curriculum and classrooms whirrs with vigor, too. In the Janes Financial Center, students have access to 12 Bloomberg terminals, which they use to oversee the Student Managed Investment Fund. In addition, the students thrive in Research Challenge competitions sponsored by the Chartered Financial Institute (CFA). In fact, they hold a three-year winning streak.\nAnother hallmark is the school’s Economic Science Institute, founded in 2008 and led by Professor Vernon Smith, who received the Nobel Prize in 2002. He is regarded as “the father of experimental economics,” having formulated and formalized the principles and much of the methodology of that now-thriving discipline.\nThe institute’s widely recognized level of expertise has served to attract additional numbers of prestigious faculty. Moreover, it has made Chapman a hub of experimental economics, and supports its newest minor, humanomics, which explores economics through the lens of the humanities, and humanities through the lens of economics.\n\n\n\n\n\n“\nOur alumni provide great connections and intellectual expertise.”\n\n\n\n\n\nReflecting the entrepreneurial spirit and real estate career that was foundational to its namesake, the Argyros School will introduce an M.S. in real estate beginning in fall 2020.\n“We have a lot of faculty who do world-class research on real estate topics. A lot of our trustees are people who built Orange County. Our alumni provide great connections and intellectual expertise. We are pulling all that together to become the place that builds the next set of leaders in real estate,” Turk says.\nWith the growth of the school has come leadership in industries. Data is paramount now, which is why the Argyros School continues to grow its computational programs.\nThrough it all, the important principles that George Argyros himself established 20 years ago still endure.\n“Generally, a business degree isn’t to prepare you for a particular industry,” Turk says. “It prepares you to think strategically, to support your ideas, analyze them with all the data available and to build consensus, so you can get something done.”\nWhich is exactly what the Argyros School itself has done in abundance over the past two decades. Maybe even nine times over.\n\n\n\n\n\n\n20th\n\nAnniversary Celebration\n\n\n\n\n\n\nThe Chapman University School of Business was founded in 1974, but in 1999 it officially became the George L. Argyros School of Business and Economics, thanks to a transformational gift made by Julianne and The Honorable George Argyros ’59. His generosity set in motion a new era of growth and achievement in business education.\n\n\n\n\n\n\n\n\n\n\n\n This fall, Chapman celebrates this milestone anniversary with a special visit by President George W. Bush, who will be guest of honor at the celebration. In addition to his visionary contributions to higher education, George Argyros was appointed by President Bush and served as U.S. ambassador to Spain and Andorra from 2001-2004.\n\n\n\n\n\nOver the past year, the Argyros School has welcomed a slate of other distinguished guest speakers whose areas of expertise highlight the interests, impact and contributions of George Argyros.\n\n\n\n\n\nA Conversation About International Economics with Nigel Farage\nIn partnership with the Center for the Study of War and Society in Wilkinson College of Arts, Humanities, and Social Sciences, the Argyros School welcomed British politician Nigel Farage to campus in October. The visit was made possible by Shannon and George Argyros Jr. ’89 (JD ’01). Farage spent time throughout his visit to campus discussing international economics with faculty, students, alumni and special guests.\n\n\n\n\n\nA Conversation About Sports Leadership with Jeanie Buss \nWhen you’re the chief executive officer of one of the most successful NBA teams of all time, you’re bound to have insights into an industry that can turn on player injuries, management changes and fan loyalty. In the spring semester, a joint effort with the Fowler school of Law brought to campus Lakers controlling owner Jeanie Buss, who participated in a wide ranging conversation. Buss offered advice to others aiming for sports management careers.\n“It’s a very competitive world out there,” said Buss. “Every skill set you can acquire is going to help you excel in the career you choose. When you’re young and have the energy, take all the opportunities that you can. Even if it’s something you don’t think you want to do, expose yourself to it so you understand how important it is.”\n\n\n\n\n\n\nA Conversation About Leadership with Andrew Card\nAndrew Card, the man who was at President Bush’s side on Sept. 11, 2001, understands what it takes to be a leader in challenging times. In his talk at the Argyros School this spring, the former chief of staff for President Bush told students that leadership begins when other viewpoints are heard.\n“Make the ‘we’ as inclusive as it can be for our great country. In today’s world ‘we’ includes more individuals than when the Constitution was written, and it can still be improved and expanded,” said Card, who also served as deputy chief of staff for President George H. W. Bush.\n\n\n\n\n\n\n\nARGYROS FAMILY\nA Tradition of Leadership\n\nTake a stroll through the heart of Chapman University and you’ll see a campus that is transformed because a young couple met 60 years ago at the old Snack Shop on the corner of Chapman Avenue and Shaffer Street.\n\n\n\n\n\nGeorge L. Argyros ’59 was already a determined young man, putting himself through college by working long hours at a supermarket while earning a degree in business and economics. But he still had to eat, and it was when he stopped into a restaurant a few blocks from campus that he saw a dark-haired beauty on a date with someone else. They married three years later, in 1962, and today Julianne is president of both Arnel, the company founded by George after graduating college, and the Argyros Family Foundation. Today, Arnel is one of the largest privately owned, diversified real estate and investment companies in the world.\nThe family’s generosity at Chapman is visible. Walk west from the Argyros Forum Student Union and you’ll pass the Julianne Argyros Fitness Center, the Ambassador George L. Argyros ’59 Global Citizens Plaza and Julianne Argyros Fountain, the Julianne Argyros Orchestra Hall in Musco Center for the Arts, and, of course, the Argyros School of Business and Economics.\nIn the two decades since the business school was named for one of the most successful real estate entrepreneurs in Southern California history, the Argyros School’s reputation has continued to grow. Now Chapman is launching a “50 for 50” campaign. The goal is to propel the Argyros School into the top 50 in the U.S. News & World Report business school rankings by raising $50 million, thus increasing the school’s total endowment to $100 million. (Go to: chapman.edu/asbe20)\n“The meaning of success for me is giving back,” George Argyros has said. “Every individual can make a difference. Once you see these young people that we’re helping, and you see the difference you’re making in their lives, it energizes you to want to do more.”\n\n\n\n\n\nArgyros – whose business ventures included owning the airline AirCal and Major League Baseball’s Seattle Mariners – was instrumental in transforming the tiny Chapman College he attended into a bustling university. After becoming a member of Chapman’s Board of Trustees in 1973, he left an indelible impact as the longest-serving chairman of Chapman’s board, leading it from 1976-2001. He resigned to serve President George W. Bush as U.S. ambassador to Spain and Andorra from 2001-04 and remains an emeritus chair of the Chapman board.\nCarrying on the vision of Julianne and George, daughter Lisa Argyros ’07 is a current Chapman trustee. Son George Argyros Jr. ’89 (JD ’01) supports the Board of Counselors for the Argyros School and is a Chapman President’s Cabinet member. Another daughter, Stephanie Argyros, is a University of Southern California trustee.\nThe family has supported education, the arts and other philanthropic efforts not only throughout Southern California but across the nation with an extraordinary array of major gifts. For example, the Argyros Family is participating in the University of Southern California’s restoration of the Los Angeles Memorial Coliseum and its iconic peristyle end, where the flame was lit for the 1932 and 1984 Olympic Games. The many Orange County institutions that have benefited from the Argyros family’s philanthropy include the Segerstrom Center for the Arts, CHOC Children’s Hospital, the Richard Nixon Foundation, Discovery Science Center, South Coast Repertory, the Orangewood Foundation, Boy Scouts, Girl Scouts and the Orange County School of the Arts.\nNational efforts have included support of the George W. Bush Presidential Center and the Horatio Alger Association, of which George Argyros is chairman emeritus. A $15 million gift to the organization from the Argyros family helped launch a national college scholarship program for veterans who served in Iraq and Afghanistan.\nOther beneficiaries of the couple’s generosity are far too many to list.\nAs former President George H.W. Bush once said of Ambassador Argyros in a video tribute: “George, how proud you must be. Your example is the kind of volunteer spirit that truly epitomizes the concept of being one of a thousand points of light.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMore than One Path to a Doctorate at Chapman\n\n\n\n\n\nVaccination Is Best Protection Against Measles, Say Chapman Health Experts\n\n\n\n\n\n\n\nYou may also like\n\n\n\n\n\n\n\n\n\n\nNew Asia-Pacific Initiative Offers Unique Take on Hotbed Region Growing up in Los Angeles, Robert Koepp became fascinated with Asia. He had Asian American friends, and absorbed happenings in that part of the world when his father watched the news. “As I got older, there were more...\n\n\nMay 1, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n\n\n\nChapman Family Donors Make a Collective Impact On Giving Day  Thanks to the enthusiasm of the Chapman Family, Chapman University’s fifth annual Giving Day was an unrivaled success. The 24-hour online fundraising event surpassed its goal of 1,000 donations on April 25, raising more...\n\n\nApril 28, 2023 Staci Dumoski\n\n \n\n\n\n\n\n\n\n\n\nDaniel Canogar’s “Pareidolia” Multimedia Artwork Unveiled at Chapman University On April 13, the Phyllis and Ross Escalette Permanent Collection of Art in Wilkinson College of Arts, Humanities, and Social Sciences unveiled its newest artwork installation, “Pareidolia,” by internationally renowned...\n\n\nApril 27, 2023 Staci Dumoski\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nEmergency \n\nMedia ContactsCerise Valenzuela Metzger\n\nDirector of Public Relations\n(714) 289-3143 (office)\n(657) 390-6760  (cell)\ncmetzger@chapman.edu\n\nOffice of Public Relations\n\nPR@chapman.edu \n\nNewsroom SiteChapman Magazine\n\nChapman Forward\nCOVID-19 Resources\n\nChapman Site\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment \n\nServices & PoliciesAccessibility Feedback \nWebsite Feedback \nDisability Services \nDirectory Emergency \nConsumer Disclosures \nPrivacy Policy Title IX \n\n\n\n\n\n© 2023 Chapman University           \n\n\n\n\n\n\nTopics\n\nAlumni\nArts & Film\nBusiness & Economy\nCampus & Students\nCollege Knowledge\nCommunity\nCOVID-19\nHealth & Behavior\nHumanities & Society\nScience & Engineering\nUniversity News\n\n\nOur Voices\nCOVID-19 Resources\nMagazines\n\nChapman Magazine\nChapman Forward\n\n\nPress Room\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#",
        "#",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "#",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://www.pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu/",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/edu/school?id=17838",
        "https://www.snapchat.com/add/chapmanu",
        "http://chapmanadmission.tumblr.com/",
        "http://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://social.chapman.edu/",
        "#",
        "https://www.chapman.edu/",
        "/",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "https://news.chapman.edu/wp-admin/ ",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "https://www.chapman.edu/campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu",
        "https://news.chapman.edu/work/",
        "/",
        "https://www.chapman.edu/",
        "#",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "#",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/discover/index.html",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "/about/connect",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/academics/course-catalogs/index.aspx",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "/admission/undergraduate/applynow",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/afford.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/net-cost-calculator/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/events/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/students/health-and-safety/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "/research/",
        "https://www.chapman.edu/research/sponsored-projects-services/pre-award/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/post-award/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index.aspx",
        "https://www.chapman.edu/research/graduate-research/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/contact-us.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/ways-to-give/areas-to-support.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/audiences/index.aspx",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "https://social.chapman.edu/",
        "https://news.chapman.edu/magazine-fall-2019/",
        "#",
        "#",
        "#",
        "#",
        "mailto:?subject=Big%20Dreams%20Bold%20Vision&body=https%3A%2F%2Fnews.chapman.edu%2F2019%2F05%2F10%2Fbig-dreams-bold-vision%2F",
        "#",
        "#",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/author/bonker/",
        "https://www.chapman.edu/business/index.aspx",
        "https://www.chapman.edu/business/about/20th-anniversary.aspx",
        "https://www.wsj.com/articles/SB122351051370717359",
        "https://www.chapman.edu/business/faculty-research/janes-financial-center/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/economic-science-institute/index.aspx",
        "https://news.chapman.edu/2017/11/29/doer-without-equal/",
        "https://www.chapman.edu/asbe20",
        "https://www.nixonfoundation.org/",
        "https://www.bushcenter.org/",
        "https://news.chapman.edu/2019/05/13/more-than-one-path-to-a-doctorate-at-chapman/",
        "https://news.chapman.edu/2019/05/09/vaccination-is-best-protection-against-measles-say-chapman-health-experts/",
        "https://news.chapman.edu/2023/05/01/new-asia-pacific-institute-offers-unique-take-on-hotbed-region/",
        "https://news.chapman.edu/2023/05/01/new-asia-pacific-institute-offers-unique-take-on-hotbed-region/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/04/27/daniel-canogars-pareidolia-multimedia-artwork-unveiled-at-chapman-university/",
        "https://news.chapman.edu/2023/04/27/daniel-canogars-pareidolia-multimedia-artwork-unveiled-at-chapman-university/",
        "https://news.chapman.edu/author/dumoski/",
        "https://www.chapman.edu/emergency/index.aspx",
        "tel:+1714-289-3143",
        "tel:+1657-390-6760",
        "mailto:cmetzger@chapman.edu",
        "mailto:PR@chapman.edu",
        "/magazine",
        "/forward",
        "/coronavirus/",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/jobs/index.aspx",
        "https://www.chapman.edu/accessibility/feedback-form.aspx",
        "https://www.chapman.edu/website-feedback-form.aspx",
        "https://www.chapman.edu/students/health-and-safety/disability-services/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "emergency/index.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/index.aspx",
        "https://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "https://www.chapman.edu/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/"
    ]
}