{
    "title": "Introducing Kristen Chatham: 2023 Lt. Rawlins Merit Scholarship Recipient - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nIntroducing Kristen Chatham: 2023 Lt. Rawlins Merit Scholarship Recipient\n\nClayton Truscott\nFebruary 9, 2023\n\n\n\n\nJason Halley / University Photographer \n\n\n\t\t\t(Jason Halley/ University Photographer)\t\t\n\n\n\n\nIn the coming weeks, we will be celebrating the accomplishments and stories behind this year’s Lt. Rawlins Merit Scholarship Recipients. The award—one of the largest and most prestigious at Chico State—celebrates scholarship, extracurricular activities, and outstanding academic, and professional accomplishments.\nKristen Chatham is not rattled by hard work.\nNow a junior, Chatham is double majoring in the business administration’s marketing and management program, in addition to being in the honors program. And when she is not in class, organizing a sales event for the Seufferlein Sales Program (SSP), or serving as communications director for the American Marketing Association’s (AMA) Chico branch, Chatham is driving back to Palo Cedro to support her family. Alongside being driven and already highly accomplished, she is grounded by an unwavering sense of duty to loved ones.  \nHer reputation as both a strategic problem solver and a gifted leader has been earned through a slew of regional and national accomplishments. This includes being recognized as sixth in the nation for the perfect pitch at AMA’s International Collegiate Conference, where Chatham also led a team in the Sabre-sponsored Marketing Simulation Competition that won their segment. Over the last two years on campus, she has played a key role in organizing and running the sales events hosted by SSP—a job her professors and mentors note that she does with poise and confidence well beyond her years.\n“She has greatly impressed me with her maturity, organization, and leadership skills,” said Katie Mercurio, assistant professor of marketing. “Together with a very positive attitude, these skills suggest Kristen will be one of our top business graduates after she leaves Chico State.”\nWith graduation in her future, Chatham’s capacity to seize and create opportunities is sure to serve her across all the trails she blazes.  \nWhat does receiving the Rawlins Award mean to you?\nIt is so important to me. I come from a small town, Palo Cedro, about an hour and a half north and have always been really close to my family—I have a little brother who is a sophomore in high school right now. Because we’re so close, it’s always been like: do what you can for the family, help make your brother succeed, help your parents succeed. So, it’s been really nice to alleviate a little bit of pressure off of them by having a little bit of that monetary reward. I’m really proud of that—being able to contribute a little bit back to my family, because they helped me pay for my education.\nIs there a faculty member that stands out for you during your time at Chico State?\nI would say that there are two staff members who have been just absolute influences in my life. One of them is Tom Villa (Business Administration, ’82). He is the executive director of the SSP and a marketing professor. I met him about two years ago through SSP, and he has just changed my life and been such an incredible influence. He had 32 years at Verizon and comes from a very successful background, which he uses to help us students. He’s just been a mentor in my life and has taken me under his wing, teaching me about corporate culture and how to be successful in the workplace. I have big and lofty goals for the future and want to be an officer at a corporation, and he is helping me work toward this in so many ways.  \nThe other professor is Katie Mercurio, also a marketing professor. I met her through a sales competition—because I’m on staff at the sales program. We run two to three sales competitions per year and about a year ago, she was helping by facilitating scoring and we worked extremely close together. She was just such an inspiration—a truly powerful person and I appreciate her so much.\nAnd why did you choose Chico State?\nI’m actually a legacy student. My dad [Gordon Chatham (Business Administration, ’91; MBA, ’07)] went to Chico State quite a few years ago. He was a business major as well, studying accounting and finance. I made my decision in my junior year of high school that I want to do business. I’m really interested in marketing and I think that’s what I’m going to be good at. So, I talked to him and asked, “tell me about your experience about Chico State—did you enjoy it?”\nHe’s a director at a company now and I’ve seen him be very successful too, with his background from Chico State. And so, he told me about his experience and how much he loved Chico and that it was just such a great opportunity. That’s what piqued my interest about Chico State. But like I said, I’m really close with my family, too. I wanted to, for the first few years at least, have an opportunity where I could go home and see them and help them out. I have just grown to love Chico State. I’ve been involved in so many different things here. I think to be successful, you have to spread your wings and do things that make you a little uncomfortable. And so I’m very happy that I’ve gotten involved in the way that I have.\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tClayton Truscott\t\t\n\n\n\t\tCommunications Manager Clayton Truscott leads storytelling and content development efforts for University Communications.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/ctruscott/",
        "https://today.csuchico.edu/rawlins-kristen-chatham/?share=facebook",
        "https://today.csuchico.edu/rawlins-kristen-chatham/?share=twitter",
        "https://today.csuchico.edu/rawlins-kristen-chatham/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Introducing%20Kristen%20Chatham%3A%202023%20Lt.%20Rawlins%20Merit%20Scholarship%20Recipient&body=https%3A%2F%2Ftoday.csuchico.edu%2Frawlins-kristen-chatham%2F&share=email",
        "https://today.csuchico.edu/rawlins-kristen-chatham/#print",
        "#",
        "https://today.csuchico.edu/author/ctruscott/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}