{
    "title": "WP Cloud – The first cloud platform built for WordPress",
    "body": "\n\n\n\nWP Cloud\n\n\n\n\n\n\n\n\n\n\n\n\n\nBring world-class WordPress hosting to your customers.\n\nWP Cloud gives you the tools you need to add scalable, highly available, extremely fast WordPress hosting to your product offering. It’s the only cloud platform built from the ground up just for WordPress.\n\n\n\nLET’S CONNECT\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMinimize Risk\n\nWP Cloud is incredibly secure and comes with the option to include or sell additional client-facing security features, including real-time backups, anti-spam, and malware scanning.\n\n\nWeb Application FirewallDDoS ProtectionHourly database and daily file backupsSSL certificates and TLS traffic encryption\n\n\n\n\n\n\n\n\n\n\n\n\nCreate Trust\n\nWith more than 15 years of experience running hundreds of millions of sites on WordPress.com, the highest-trafficked sites in the world on WPVIP, and the managed WordPress hosting company Pressable, we've built a platform we're proud to put up against any cloud services.\n\n\n99.999% UptimeHigh availability with automated scalingFull data center redundanciesAutomated failure detection with zero-downtime migration\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIncrease Speed\n\nWe’re the only cloud platform team fully dedicated to optimizing WordPress. Your customers will feel the difference with WP Cloud, and you’ll be able to expand to new markets even faster.\n\n\nIncredibly low page speed indexAutomated WordPress edge cachingBuilt-in CDN4 origin and 24 edge global data centers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n              5.7\n            \n\n\n\n\n\n\n              5.6\n            \n\n\n\n\n\n\n              5.5\n            \n\n\n\n\n\n\n              5.4\n            \n\n\n\n\n\n\n              5.3\n            \n\n\n\nManage Less\n\nWP Cloud saves you significant time and resources by managing and automating updates, caching, and scaling for traffic spikes. \n\n\nAutomated WordPress core and plugin updatesMulti-region real-time failoverIntegrated migration toolsExpert premium support\n\n\n\n\n\n\nRequest\n\n\n\n\n              Response\n            \n\n\n\n\n\n\n\n                  {\n                  \"id\": \"ch_1Id32p2eZvKYlo2C2UafkuSM\",\n                  “url”: “my-new-environment.wp.cloud”,\n                  “name”: “my-new-environment”,\n                  ...\n                  }\n                \n\n\n\n\nBuild More\n\nWP Cloud is completely API-driven and ready to integrate directly under your platform. Your customers get the fantastic experience they’ve come to expect from you and the speed and security of a WordPress-first cloud. \n\n\nEliminate costly server platform softwareBring your own interface and revenue modelsDeploy new WordPress environments in secondsProvide fully integrated staging environments\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOne Focus.\n\nWhile AWS, Google Cloud, and Azure are focused on one-size-fits-all solutions for customers across industries, WP Cloud is the best solution for WordPress-centric hosting companies like yours.\n\n\n\n\n\n\n\n\n\n\nWe built WP Cloud so every hosting company can provide the safest and fastest WordPress experience available.\n \n\n\n\n\n\n\t              Matt Mullenweg, co-founder of WordPress\t            \n\n\n\n\n\n\n\n\n\n\n425  Million\n\nPageviews per day delivered via WordPress.com and Pressable.com and growing.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLet’s Chat\nIf you’re interested in learning more about how WP Cloud can help you provide scalable, highly available, very fast websites, send Jesse a message below or call him at +1-408-MY-CLOUD (692-5683).\n\n\n\n\n\n\n\n\n\n\n\n\nSEND JESSE FRIEDMAN A MESSAGE\n\n\n\nΔ\n \n\n\n\n\n\n\n\nCopyright\t© 2023 WP Cloud. All rights reserved.\n\n\nPrivacy Policy\n \n\n\n\n\n\n        An   \n        \n\t        venture\nWork With Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://wp.cloud/",
        "https://wp.cloud/",
        "#lets-chat",
        "https://wordpress.com",
        "https://pressable.com/",
        "tel:+1-408-692-5683",
        "https://wp.cloud/",
        "https://automattic.com/privacy/",
        "https://automattic.com/work-with-us/"
    ]
}