{
    "title": "Search Results | CSUSB",
    "body": "\n\n\n\n\n\nSkip banner navigation Skip to main content\n\n\nSite Header Region\n\n\n \n\n     \n\n  \n\n\n\nQuick Links\n\nmyCoyote\nDirectory\nLibrary\nMaps\nPalm Desert Campus\nMake a Gift\n\n\n\n\n\n\n\n\n\nPage Header\n\n\n\n\n\nJob Opportunities\n\n\n\n\n\n\n\n\nPage Menu\nPage Menu\n\n\nCurrent Opportunities\n\n\n\n\n\n\n\n\nMain Content Region\n\n\n\n\nJob Opportunities\n\n \n\nSend me jobs like these\n\n\nWe will email you new jobs that match this search.\n\n\n\nOk, we will send you jobs like this.\nThe email address was invalid, please check for errors.\nYou must agree to the privacy statement\nSubscribe\n\nRecaptcha\n\n\nPrivacy agreement\n\n\n\n\nSearch results\n\n\n\nPosition\nLocation\nCloses\n\n\n\n\n\nAthletics, Men's Head Soccer Coach\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nHEAD MEN’S SOCCER COACH\nCal State San Bernardino is a NCAA Division II member, competing in the California Collegiate Athletic Association (CCAA). The university seeks an individual who has demonstrated success in attracting campus and community support. The CCAA has been one of the nation's most successful intercollegiate athletic conferences since its establishment in 1938. CCAA members have won 151 NCAA Championships (102 men, 49 women) which is far and away the most of any Division II conference.\nRANK AND QUALIFICATIONS: This is a 12-month position. Bachelor’s degree is required, master’s degree preferred. A minimum of three years of successful soccer coaching experience, preferably at the collegiate level.\nDUTIES AND RESPONSIBILITIES: Under the general supervision of the Director of Athletics, direct all aspects of an NCAA Division II soccer program including but not limited to: coaching, recruiting, program development, and maintenance of a strong academic environment.\nSALARY: Dependent on qualifications and experience.\nDEADLINE AND APPLICATION PROCESS:\nThe position will remain open until filled. Applicants must successfully complete a background investigation to include criminal records check, DMV check, fingerprint check and prior work history.\n\n\n\nAthletics, Women's Head Soccer Coach\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nHEAD WOMEN'S Soccer Coach \nCal State San Bernardino is a NCAA Division II member, competing in the California Collegiate Athletic Association (CCAA). The university seeks an individual who has demonstrated success in attracting campus and community support. The CCAA has been one of the nation's most successful intercollegiate athletic conferences since its establishment in 1938. CCAA members have won 151 NCAA Championships (102 men, 49 women) which is far and away the most of any Division II conference.\nRANK AND QUALIFICATIONS: This is a 12-month position. Bachelor’s degree is required, master’s degree preferred. A minimum of three years of successful soccer coaching experience, preferably at the collegiate level.\nDUTIES AND RESPONSIBILITIES: Under the general supervision of the Director of Athletics, direct all aspects of an NCAA Division II soccer program including but not limited to: coaching, recruiting, program development, and maintenance of a strong academic environment.\nSALARY: Dependent on qualifications and experience.\nDEADLINE AND APPLICATION PROCESS:\nThe position will remain open until filled. Applicants must successfully complete a background investigation to include criminal records check, DMV check, fingerprint check and prior work history.\n\n\n\nAthletics, Head Coach Men’s Basketball\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nHead Coach Men’s Basketball\nUnder the general supervision of the Director of Athletics, direct all aspects of an NCAA Division II Men’s Basketball program including but not limited to: coaching, recruiting, maintenance of a strong academic environment, compliance with NCAA, conference and institutional regulations, retention of students, management of scholarship and operations budget, fundraising, organizing practices and developing season schedule.\nMINIMUM QUALIFICATIONS\nBachelor's degree is required, master's preferred.  Coaching experience at the collegiate level or higher.\n\n\n\nMarketing Department Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Marketing at CSUSB is searching for a new Department Chair. This invitation is for candidates internal to the Department of Marketing at CSUSB only. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research and evidence of commitment to student success. The Chair is expected to provide leadership in shaping and facilitating the future of the department including faculty and staff development, faculty mentoring, and strategic planning. The Department Chair will serve in a leadership capacity in support of the Jack H. Brown College of Business and Public Administration strategic mission. He/she will provide academic and administrative leadership and facilitate the orderly conduct of the affairs of the Department and the College.\n\n\n\nInformation & Decision Sciences Department Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Department of Information & Decision Sciences at CSUSB is searching for a new Department Chair. This invitation is for candidates internal to the Department of Information & Decision Sciences at CSUSB only. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research and evidence of commitment to student success. The Chair is expected to provide leadership in shaping and facilitating the future of the department including faculty and staff development, faculty mentoring, and strategic planning. The Department Chair will serve in a leadership capacity in support of the Jack Brown College strategic mission. He/she will provide academic and administrative leadership and facilitate the orderly conduct of the affairs of the Department and the College.\n\n\n\nSchool of Social Work Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe School of Social Work is an integral part of the College of Social and Behavioral Sciences at CSUSB. The school serves the region’s social work education needs with accredited (CSWE) Master of Social Work (MSW) and Bachelor of Arts in Social Work (BASW) degrees. Through coursework, field placement experiences, and extra-curricular activities, the diverse student body gains the knowledge, skills, and ethical foundation they need to become effective agents of positive change. The Director will be responsible for providing leadership and overseeing all aspects of the School, including program development, administration, budget, faculty and staff development, and student success. This invitation is for candidates internal to the School of Social Work at CSUSB only, with a time base of 1.00 for the chair position.\n\n\n\nDepartment of Theatre Arts Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nDepartment of Theatre Arts offers liberal arts degrees in four concentrations and is accredited through the National Association of Schools of Theatre (NAST). For more information regarding the position, please contact the Recruitment Chair, Dr. Terry Donovan Smith, tdsmith@csusb.edu.\n\nTo find out more about the Department of Theatre Arts: https://www.csusb.edu/theatre-arts.\nSee https://www.csusb.edu/sites/default/files/upload/file/%28Admin%29Chair_Responsibilities.pdf for a full list of Department Chair Responsibilities.\n\n\n\nPsychology Department Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Psychology at California State University, San Bernardino invites applications from tenured faculty for the position of Department Chair at the Associate or Full Professor rank beginning August 17, 2023. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research and evidence of excellence in teaching. The Chair is expected to provide leadership in facilitating long-term planning for professional involvement and development of the faculty and the Department, and mentor faculty effectively in meeting their responsibilities in scholarship, teaching, and service. The Department of Psychology is in the College of Social and Behavioral Sciences and offers a B.A. in General Psychology with two concentrations - Biological Psychology and Industrial and Organizational Psychology. Additionally, the department offers an M.A. program in Psychological Science, as well as M.S. programs in Clinical/Counseling and Industrial/Organizational Psychology. The Department has 22 full-time tenure track faculty members, four full-time lecturers and approximately 1800 undergraduate majors and 100 graduate majors.\n\n\n\nDepartment of Ethnic Studies Chair (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Ethnic Studies is seeking a Department Chair to serve in all capacities as required by the position. The start date of the position is at the beginning of Fall 2023 semester.\n\n\n\nDepartment of Music Chair (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Music at CSUSB is searching for a new Department Chair. This invitation is for candidates internal to the Department of Music at CSUSB only, with a time base of 0.75 for the chair position. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research or creative activity, and evidence of commitment to student success. The Department Chair will serve in a leadership capacity in support of the College of Arts & Letters’ mission and institutional values. They will provide academic and administrative leadership and facilitate the orderly conduct of the affairs of the Department and the College. \n\n\n\nDepartment of Teacher Education and Foundations (TEF) - Early Childhood Reading/Literacy Position (Open Rank)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCandidates must have knowledge, skills and interest in early childhood reading/literacy education, teaching, research, and professional development. Candidates are expected to teach early childhood reading/literacy education courses for teacher candidates, early childhood certificate courses, and graduate students. Candidates are expected to meet the requirements for excellence in teaching, active scholarly and professional work, and service to the University and community. \n\nThe successful candidate is expected to:\n•\tDesign and teach early childhood literacy/reading education courses at the credential, certificate, and graduate levels that emphasize high impact instructional strategies and current teaching and learning theories in early childhood reading/literacy education.\n•\tImplement fun, engaging, and research-based reading/literacy activities that support and enhance children’s cognitive development, creativity, language skills, and problem-solving skills. \n•\tWork with credential, credential, undergraduate, and graduate students \n•\tParticipate in committee assignments at the department, college, and university levels.\n•\tSupervise student teachers.\n•\tEngage in research/publication and/or creative activities.\n•\tAdvise and mentor credential and graduate students.\n•\tParticipate in student recruitment to the credential and graduate programs.\n\nQualified candidates must demonstrate active involvement and excellence in teaching and mentoring/supervising a diverse population of students, working collaboratively and productively with faculty, staff, and administrators within and across programs, departments, and colleges at the university. Candidates are also expected to be actively engaged with the community (e.g., schools and school districts, county office of education, professional organizations, etc.). \n\n\n\n\nDepartment of Kinesiology - Lecturer AY\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Kinesiology Department at California State University, San Bernardino is seeking part-time lecturer applications from a diverse group of qualified individuals for both our San Bernardino Campus (SBC) as well as our Palm Desert Campus (PDC). The department is seeking experienced, well-organized, and student-centered individuals to teach in any of our three concentrations: Allied Health Professions, Exercise Science, and Physical Education and Adapted Physical Education. Subject areas may include the following: Biomechanics, motor development, motor learning, physical education, adapted physical education, sport and exercise physiology, sport and exercise psychology, sociology of sport, statistics in kinesiology, and other kinesiology related classes such as, but not limited to, activities classes. Candidates must have at least a Master’s degree, or specialized certification for activity classes, in a field of Kinesiology or related discipline. Preference will be given to candidates who have prior teaching experience at the college or university level and who can furnish evidence of strong teaching. Candidates should demonstrate their ability to interact and work effectively with a wide and culturally diverse range of students, including first-generation college students. Preference will be given to those with experience in working with diverse populations and fostering a collaborative, supportive and inclusive environment. Preference will also be given to those with relevant work experience and those who bring professional capabilities.\nThis is a pool of part-time lecturers for the department to draw on as necessary and all appointments are temporary. Staffing decisions are made on a rolling basis typically beginning a few months prior to the start of an academic term right up to the beginning of the academic term. We recommend submitting your application at least 4 months before the beginning of an academic term to be considered for available positions.\n\n\n\n\nDepartment of Theatre Arts - Assistant Professor\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCalifornia State University, San Bernardino Department of Theatre Arts seeks an accomplished theatre artist/director with a primary focus in Educational Theatre for a full time, tenure track position beginning August 2023. We seek a Theatre Generalist with strong Performance based skills in addition to an extensive background in Drama education, TYA, and applied drama. We particularly seek a candidate to further develop Youth theatre and collaborate with CSUSB’s Education Department on California’s newly reinstated Single Subject Credential in Theatre.\n\n\n\nDepartment of Teacher Education and Foundations (TEF) - Educational Psychology and Adolescent Development - Open Rank\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCandidates must have knowledge, skill and interest in teaching Educational Psychology and Adolescent Development. Preferred candidates will be expected to meet the traditional requirements of excellence in teaching, active scholarly and professional work, and service to the University and community. We are seeking candidates who have a passion for teaching and learning. This position is an open rank position whereby the successful candidate can be appointed at the Assistant, Associate, or Full Professor rank.\n\nThe successful candidate is expected to:\n• Design and teach courses in Educational Psychology and Adolescent Development particularly in the Secondary credential program and at graduate levels.\n• Implement high impact instructional strategies in their teaching.\n• Implement high impact advising practices.\n• Work with credential and graduate students within PK-12 school settings.\n• Participate in committee assignments at the department, college, and university-wide levels.\n• Supervise student teachers through a large service region (San Bernardino and Riverside Counties).\n• Engage in research /publication and/or creative activities.\n• Advise, coach, and mentor credential and graduate students.\n• The skills and dispositions to work with diverse students, colleagues and community members.\n\n\n\nAssistant Professor - Public Administration\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Public Administration at CSU-San Bernardino is seeking to fill a full time, tenure track position at the Assistant Professor level. We seek candidates with a commitment to high impact teaching, an active research agenda, and a commitment to university and community service. Sub field expertise is open; however, we prefer candidates who are able to teach across our MPA leadership and non-profit management core curriculums.\n\n\n\nAssistant Professor of Japanese Language and Asian Studies\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of World Languages and Literatures at California State University, San Bernardino (CSUSB) invites applications for the position of Assistant Professor of Japanese Language and Asian Studies, which will begin in August of 2023. This is a full-time, tenure-track position.  In addition to expertise in Japanese language, literature, and culture; an additional specialization in linguistics and the ability to teach Korean or Chinese language, literature, and culture are also desirable. The faculty member will be responsible for teaching two general education courses in English (JAPN 2900 “Japanese Literature in English” and JAPN 3900 “Voices and Visions from the World of Japanese Anime and Manga”) and a variety of courses in Japanese.  In addition, the faculty member may teach Japanese linguistics. They will participate in curriculum development, work collaboratively with faculty in other departments, organize cultural activities, maintain an active research agenda, and provide service to the department, college, and university.\nREQUIRED QUALIFICATIONS\n•\tABD or Ph.D. in Japanese, Asian Studies, or related discipline by time of appointment\n•\tRelevant teaching experience and pedagogical training \n•\tActive research agenda\n•\tThe ability to teach in Japanese and English\nPREFERRED QUALIFICATIONS\n•\tPh.D. in Japanese, Asian Studies, or related discipline by time of appointment\n•\tTwo years of university/college teaching experience  \n•\tA record of scholarship commensurate with an Assistant Professor\n\nFor more information regarding the position, please contact the Recruitment Chair, Dr. George Thomas (George.Thomas@csusb.edu). Please submit application materials through CSU Careers. Formal review of applications will begin December 16, 2022 and will continue until the position is filled.\n\n\n\n\nW. Benson Harer Egyptology Scholar in Residence, History Department Visiting Faculty\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of History at California State University, San Bernardino (CSUSB) invites applications for the W. Benson Harer Egyptology Scholar in Residence.  This successful candidate will be a member of the CSUSB community for the one semester in either fall 2023 or spring 2024.\n\nThe applicant should specialize in Ancient Egyptian History, Society, Archaeology, or Art anytime between the Predynastic to the Roman Periods.  The successful candidate will receive housing, a partial meal plan, $2,500 towards relocation expenses, and a $26,000 stipend.\n\nCSUSB hosts the Robert and Frances Fullerton Museum of Art (RAFFMA), which includes one of the largest collections of Ancient Egyptian artifacts in Southern California.  The collection includes over 2000 artifacts dating from the Predynastic Period to the Coptic Period.\n\n\n\nDepartment of Health Science & Human Ecology Tenure Track Assistant Professor\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCandidates should have general expertise in Public Health and specific expertise in Health Services Administration and/or Health Care Management to teach undergraduate and graduate courses in Health Services Administration as well as Public Health. The Health Services Administration Program is designed to prepare our diverse student body for management roles in health care settings to enhance the quality and innovation in the delivery of health care services for all individuals.\n\nThe Department serves approximately 800 students majoring in 4 undergraduate programs (environmental health science, health services administration, nutritional science and dietetics, and public health) and 3 graduate programs (Master of Public Health, Master of Science in Health Service Administration, and Master of Science in Nutritional Science). The newly hired faculty member would join a well-established department of 14 tenure-track and over 20 adjunct faculty members.\n\n\n\nDepartment of Mathematics, Assistant Professor in Statistics\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Mathematics at California State University, San Bernardino (CSUSB) invites applications for a tenure-track faculty position in the area of Statistics at the rank of Assistant Professor to begin August 2023.\n\n\n\nAssistant Professor - Department of Physics\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Physics at California State University, San Bernardino invites applications from a diverse group of qualified applicants for an Assistant Professor tenure-track position to begin August 2023. The Department offers B.A. and B.S. degrees in Physics, with minors in astronomy and applied physics, and is currently in the planning stages for an interdisciplinary M.S. degree in Materials Science, which is associated with the Center for Advanced Functional Materials (https://www.csusb.edu/center-advanced-functional-materials). We welcome applications in all areas of research in physics. Preference will be given to candidates who are able to teach courses within the full range of undergraduate department courses. The successful candidate will join an intellectually stimulating and innovative academic environment that embraces diversity. We are particularly interested in receiving applications from all groups historically underrepresented in Physics and STEM fields, including intersections across multiple groups.\n\n\n\nMore Jobs 14\n\nCurrent opportunities\n\n\n\nPosition\nLocation\nCloses\n\n\n\n\n\nAthletics, Men's Head Soccer Coach\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nHEAD MEN’S SOCCER COACH\nCal State San Bernardino is a NCAA Division II member, competing in the California Collegiate Athletic Association (CCAA). The university seeks an individual who has demonstrated success in attracting campus and community support. The CCAA has been one of the nation's most successful intercollegiate athletic conferences since its establishment in 1938. CCAA members have won 151 NCAA Championships (102 men, 49 women) which is far and away the most of any Division II conference.\nRANK AND QUALIFICATIONS: This is a 12-month position. Bachelor’s degree is required, master’s degree preferred. A minimum of three years of successful soccer coaching experience, preferably at the collegiate level.\nDUTIES AND RESPONSIBILITIES: Under the general supervision of the Director of Athletics, direct all aspects of an NCAA Division II soccer program including but not limited to: coaching, recruiting, program development, and maintenance of a strong academic environment.\nSALARY: Dependent on qualifications and experience.\nDEADLINE AND APPLICATION PROCESS:\nThe position will remain open until filled. Applicants must successfully complete a background investigation to include criminal records check, DMV check, fingerprint check and prior work history.\n\n\n\nAthletics, Women's Head Soccer Coach\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nHEAD WOMEN'S Soccer Coach \nCal State San Bernardino is a NCAA Division II member, competing in the California Collegiate Athletic Association (CCAA). The university seeks an individual who has demonstrated success in attracting campus and community support. The CCAA has been one of the nation's most successful intercollegiate athletic conferences since its establishment in 1938. CCAA members have won 151 NCAA Championships (102 men, 49 women) which is far and away the most of any Division II conference.\nRANK AND QUALIFICATIONS: This is a 12-month position. Bachelor’s degree is required, master’s degree preferred. A minimum of three years of successful soccer coaching experience, preferably at the collegiate level.\nDUTIES AND RESPONSIBILITIES: Under the general supervision of the Director of Athletics, direct all aspects of an NCAA Division II soccer program including but not limited to: coaching, recruiting, program development, and maintenance of a strong academic environment.\nSALARY: Dependent on qualifications and experience.\nDEADLINE AND APPLICATION PROCESS:\nThe position will remain open until filled. Applicants must successfully complete a background investigation to include criminal records check, DMV check, fingerprint check and prior work history.\n\n\n\nAthletics, Head Coach Men’s Basketball\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nHead Coach Men’s Basketball\nUnder the general supervision of the Director of Athletics, direct all aspects of an NCAA Division II Men’s Basketball program including but not limited to: coaching, recruiting, maintenance of a strong academic environment, compliance with NCAA, conference and institutional regulations, retention of students, management of scholarship and operations budget, fundraising, organizing practices and developing season schedule.\nMINIMUM QUALIFICATIONS\nBachelor's degree is required, master's preferred.  Coaching experience at the collegiate level or higher.\n\n\n\nMarketing Department Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Marketing at CSUSB is searching for a new Department Chair. This invitation is for candidates internal to the Department of Marketing at CSUSB only. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research and evidence of commitment to student success. The Chair is expected to provide leadership in shaping and facilitating the future of the department including faculty and staff development, faculty mentoring, and strategic planning. The Department Chair will serve in a leadership capacity in support of the Jack H. Brown College of Business and Public Administration strategic mission. He/she will provide academic and administrative leadership and facilitate the orderly conduct of the affairs of the Department and the College.\n\n\n\nInformation & Decision Sciences Department Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Department of Information & Decision Sciences at CSUSB is searching for a new Department Chair. This invitation is for candidates internal to the Department of Information & Decision Sciences at CSUSB only. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research and evidence of commitment to student success. The Chair is expected to provide leadership in shaping and facilitating the future of the department including faculty and staff development, faculty mentoring, and strategic planning. The Department Chair will serve in a leadership capacity in support of the Jack Brown College strategic mission. He/she will provide academic and administrative leadership and facilitate the orderly conduct of the affairs of the Department and the College.\n\n\n\nSchool of Social Work Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe School of Social Work is an integral part of the College of Social and Behavioral Sciences at CSUSB. The school serves the region’s social work education needs with accredited (CSWE) Master of Social Work (MSW) and Bachelor of Arts in Social Work (BASW) degrees. Through coursework, field placement experiences, and extra-curricular activities, the diverse student body gains the knowledge, skills, and ethical foundation they need to become effective agents of positive change. The Director will be responsible for providing leadership and overseeing all aspects of the School, including program development, administration, budget, faculty and staff development, and student success. This invitation is for candidates internal to the School of Social Work at CSUSB only, with a time base of 1.00 for the chair position.\n\n\n\nDepartment of Theatre Arts Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nDepartment of Theatre Arts offers liberal arts degrees in four concentrations and is accredited through the National Association of Schools of Theatre (NAST). For more information regarding the position, please contact the Recruitment Chair, Dr. Terry Donovan Smith, tdsmith@csusb.edu.\n\nTo find out more about the Department of Theatre Arts: https://www.csusb.edu/theatre-arts.\nSee https://www.csusb.edu/sites/default/files/upload/file/%28Admin%29Chair_Responsibilities.pdf for a full list of Department Chair Responsibilities.\n\n\n\nPsychology Department Chair 12 Mo (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Psychology at California State University, San Bernardino invites applications from tenured faculty for the position of Department Chair at the Associate or Full Professor rank beginning August 17, 2023. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research and evidence of excellence in teaching. The Chair is expected to provide leadership in facilitating long-term planning for professional involvement and development of the faculty and the Department, and mentor faculty effectively in meeting their responsibilities in scholarship, teaching, and service. The Department of Psychology is in the College of Social and Behavioral Sciences and offers a B.A. in General Psychology with two concentrations - Biological Psychology and Industrial and Organizational Psychology. Additionally, the department offers an M.A. program in Psychological Science, as well as M.S. programs in Clinical/Counseling and Industrial/Organizational Psychology. The Department has 22 full-time tenure track faculty members, four full-time lecturers and approximately 1800 undergraduate majors and 100 graduate majors.\n\n\n\nDepartment of Ethnic Studies Chair (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Ethnic Studies is seeking a Department Chair to serve in all capacities as required by the position. The start date of the position is at the beginning of Fall 2023 semester.\n\n\n\nDepartment of Music Chair (Internal Applicants Only)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Music at CSUSB is searching for a new Department Chair. This invitation is for candidates internal to the Department of Music at CSUSB only, with a time base of 0.75 for the chair position. The ideal candidate will be an experienced faculty member with demonstrated leadership and administrative skills, an established record of scholarly research or creative activity, and evidence of commitment to student success. The Department Chair will serve in a leadership capacity in support of the College of Arts & Letters’ mission and institutional values. They will provide academic and administrative leadership and facilitate the orderly conduct of the affairs of the Department and the College. \n\n\n\nDepartment of Teacher Education and Foundations (TEF) - Early Childhood Reading/Literacy Position (Open Rank)\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCandidates must have knowledge, skills and interest in early childhood reading/literacy education, teaching, research, and professional development. Candidates are expected to teach early childhood reading/literacy education courses for teacher candidates, early childhood certificate courses, and graduate students. Candidates are expected to meet the requirements for excellence in teaching, active scholarly and professional work, and service to the University and community. \n\nThe successful candidate is expected to:\n•\tDesign and teach early childhood literacy/reading education courses at the credential, certificate, and graduate levels that emphasize high impact instructional strategies and current teaching and learning theories in early childhood reading/literacy education.\n•\tImplement fun, engaging, and research-based reading/literacy activities that support and enhance children’s cognitive development, creativity, language skills, and problem-solving skills. \n•\tWork with credential, credential, undergraduate, and graduate students \n•\tParticipate in committee assignments at the department, college, and university levels.\n•\tSupervise student teachers.\n•\tEngage in research/publication and/or creative activities.\n•\tAdvise and mentor credential and graduate students.\n•\tParticipate in student recruitment to the credential and graduate programs.\n\nQualified candidates must demonstrate active involvement and excellence in teaching and mentoring/supervising a diverse population of students, working collaboratively and productively with faculty, staff, and administrators within and across programs, departments, and colleges at the university. Candidates are also expected to be actively engaged with the community (e.g., schools and school districts, county office of education, professional organizations, etc.). \n\n\n\n\nDepartment of Kinesiology - Lecturer AY\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Kinesiology Department at California State University, San Bernardino is seeking part-time lecturer applications from a diverse group of qualified individuals for both our San Bernardino Campus (SBC) as well as our Palm Desert Campus (PDC). The department is seeking experienced, well-organized, and student-centered individuals to teach in any of our three concentrations: Allied Health Professions, Exercise Science, and Physical Education and Adapted Physical Education. Subject areas may include the following: Biomechanics, motor development, motor learning, physical education, adapted physical education, sport and exercise physiology, sport and exercise psychology, sociology of sport, statistics in kinesiology, and other kinesiology related classes such as, but not limited to, activities classes. Candidates must have at least a Master’s degree, or specialized certification for activity classes, in a field of Kinesiology or related discipline. Preference will be given to candidates who have prior teaching experience at the college or university level and who can furnish evidence of strong teaching. Candidates should demonstrate their ability to interact and work effectively with a wide and culturally diverse range of students, including first-generation college students. Preference will be given to those with experience in working with diverse populations and fostering a collaborative, supportive and inclusive environment. Preference will also be given to those with relevant work experience and those who bring professional capabilities.\nThis is a pool of part-time lecturers for the department to draw on as necessary and all appointments are temporary. Staffing decisions are made on a rolling basis typically beginning a few months prior to the start of an academic term right up to the beginning of the academic term. We recommend submitting your application at least 4 months before the beginning of an academic term to be considered for available positions.\n\n\n\n\nDepartment of Theatre Arts - Assistant Professor\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCalifornia State University, San Bernardino Department of Theatre Arts seeks an accomplished theatre artist/director with a primary focus in Educational Theatre for a full time, tenure track position beginning August 2023. We seek a Theatre Generalist with strong Performance based skills in addition to an extensive background in Drama education, TYA, and applied drama. We particularly seek a candidate to further develop Youth theatre and collaborate with CSUSB’s Education Department on California’s newly reinstated Single Subject Credential in Theatre.\n\n\n\nDepartment of Teacher Education and Foundations (TEF) - Educational Psychology and Adolescent Development - Open Rank\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCandidates must have knowledge, skill and interest in teaching Educational Psychology and Adolescent Development. Preferred candidates will be expected to meet the traditional requirements of excellence in teaching, active scholarly and professional work, and service to the University and community. We are seeking candidates who have a passion for teaching and learning. This position is an open rank position whereby the successful candidate can be appointed at the Assistant, Associate, or Full Professor rank.\n\nThe successful candidate is expected to:\n• Design and teach courses in Educational Psychology and Adolescent Development particularly in the Secondary credential program and at graduate levels.\n• Implement high impact instructional strategies in their teaching.\n• Implement high impact advising practices.\n• Work with credential and graduate students within PK-12 school settings.\n• Participate in committee assignments at the department, college, and university-wide levels.\n• Supervise student teachers through a large service region (San Bernardino and Riverside Counties).\n• Engage in research /publication and/or creative activities.\n• Advise, coach, and mentor credential and graduate students.\n• The skills and dispositions to work with diverse students, colleagues and community members.\n\n\n\nAssistant Professor - Public Administration\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Public Administration at CSU-San Bernardino is seeking to fill a full time, tenure track position at the Assistant Professor level. We seek candidates with a commitment to high impact teaching, an active research agenda, and a commitment to university and community service. Sub field expertise is open; however, we prefer candidates who are able to teach across our MPA leadership and non-profit management core curriculums.\n\n\n\nAssistant Professor of Japanese Language and Asian Studies\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of World Languages and Literatures at California State University, San Bernardino (CSUSB) invites applications for the position of Assistant Professor of Japanese Language and Asian Studies, which will begin in August of 2023. This is a full-time, tenure-track position.  In addition to expertise in Japanese language, literature, and culture; an additional specialization in linguistics and the ability to teach Korean or Chinese language, literature, and culture are also desirable. The faculty member will be responsible for teaching two general education courses in English (JAPN 2900 “Japanese Literature in English” and JAPN 3900 “Voices and Visions from the World of Japanese Anime and Manga”) and a variety of courses in Japanese.  In addition, the faculty member may teach Japanese linguistics. They will participate in curriculum development, work collaboratively with faculty in other departments, organize cultural activities, maintain an active research agenda, and provide service to the department, college, and university.\nREQUIRED QUALIFICATIONS\n•\tABD or Ph.D. in Japanese, Asian Studies, or related discipline by time of appointment\n•\tRelevant teaching experience and pedagogical training \n•\tActive research agenda\n•\tThe ability to teach in Japanese and English\nPREFERRED QUALIFICATIONS\n•\tPh.D. in Japanese, Asian Studies, or related discipline by time of appointment\n•\tTwo years of university/college teaching experience  \n•\tA record of scholarship commensurate with an Assistant Professor\n\nFor more information regarding the position, please contact the Recruitment Chair, Dr. George Thomas (George.Thomas@csusb.edu). Please submit application materials through CSU Careers. Formal review of applications will begin December 16, 2022 and will continue until the position is filled.\n\n\n\n\nW. Benson Harer Egyptology Scholar in Residence, History Department Visiting Faculty\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of History at California State University, San Bernardino (CSUSB) invites applications for the W. Benson Harer Egyptology Scholar in Residence.  This successful candidate will be a member of the CSUSB community for the one semester in either fall 2023 or spring 2024.\n\nThe applicant should specialize in Ancient Egyptian History, Society, Archaeology, or Art anytime between the Predynastic to the Roman Periods.  The successful candidate will receive housing, a partial meal plan, $2,500 towards relocation expenses, and a $26,000 stipend.\n\nCSUSB hosts the Robert and Frances Fullerton Museum of Art (RAFFMA), which includes one of the largest collections of Ancient Egyptian artifacts in Southern California.  The collection includes over 2000 artifacts dating from the Predynastic Period to the Coptic Period.\n\n\n\nDepartment of Health Science & Human Ecology Tenure Track Assistant Professor\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nCandidates should have general expertise in Public Health and specific expertise in Health Services Administration and/or Health Care Management to teach undergraduate and graduate courses in Health Services Administration as well as Public Health. The Health Services Administration Program is designed to prepare our diverse student body for management roles in health care settings to enhance the quality and innovation in the delivery of health care services for all individuals.\n\nThe Department serves approximately 800 students majoring in 4 undergraduate programs (environmental health science, health services administration, nutritional science and dietetics, and public health) and 3 graduate programs (Master of Public Health, Master of Science in Health Service Administration, and Master of Science in Nutritional Science). The newly hired faculty member would join a well-established department of 14 tenure-track and over 20 adjunct faculty members.\n\n\n\nDepartment of Mathematics, Assistant Professor in Statistics\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Mathematics at California State University, San Bernardino (CSUSB) invites applications for a tenure-track faculty position in the area of Statistics at the rank of Assistant Professor to begin August 2023.\n\n\n\nAssistant Professor - Department of Physics\n\n\nSan Bernardino - San Bernardino Campus\n\n\n\n\n\nThe Department of Physics at California State University, San Bernardino invites applications from a diverse group of qualified applicants for an Assistant Professor tenure-track position to begin August 2023. The Department offers B.A. and B.S. degrees in Physics, with minors in astronomy and applied physics, and is currently in the planning stages for an interdisciplinary M.S. degree in Materials Science, which is associated with the Center for Advanced Functional Materials (https://www.csusb.edu/center-advanced-functional-materials). We welcome applications in all areas of research in physics. Preference will be given to candidates who are able to teach courses within the full range of undergraduate department courses. The successful candidate will join an intellectually stimulating and innovative academic environment that embraces diversity. We are particularly interested in receiving applications from all groups historically underrepresented in Physics and STEM fields, including intersections across multiple groups.\n\n\n\nMore Jobs 14\nPowered by PageUp\n\n\nRight Content\n\nApplicant Sign-In\n\nJob Search\n\nFilter Results\nWork type\n\nAuxiliary 0\nInstructional Faculty - Temporary/Lecturer 8\nInstructional Faculty – Tenured/Tenure-Track 17\nManagement (MPP) 0\nNon-Instructional Faculty (Coach/Counselor/Librarian) 8\nStaff 0\nVisiting Faculty 1\nLocations\nSouthern California\nSan Bernardino - Palm Desert Campus 1\nSan Bernardino - San Bernardino Campus 33\nCategories\nAppointment Type\nAt-Will 0\nProbationary 0\nTemporary 17\nTenured/Tenure-Track 17Bargaining Unit\nConfidential 0\nExcluded 0\nMPP 0\nUnit 1 - UAPD - Union of American Physicians/Dentists 0\nUnit 3 - CFA - California Faculty Association 34\nUnit 4 - APC - Academic Professionals of California 0\nUnit 5 - CSUEU - Operations and Support Services 0\nUnit 7 - CSUEU - Clerical and Administrative Support Services 0\nUnit 8 - SUPA - State University Police Association 0\nUnit 9 - CSUEU - Technical Support Services 0Job Search Category/Discipline\nAdministrative 0\nAthletics 5\nChild/Youth Education and Development 0\nCoach (Non-instructional Faculty) 3\nCounselor (Non-instructional Faculty) 0\nCustodial/Facilities 0\nFaculty - Behavioral Sciences 7\nFaculty - Business/Management 4\nFaculty - Computer Science 1\nFaculty - Education/Library Science 3\nFaculty - Fine/Performing Arts 1\nFaculty - Health Sciences 3\nFaculty - Letters/Humanities 4\nFaculty - Mathematics/Statistics 1\nFaculty - Natural Sciences 2\nFinance/Accounting 0\nFundraising & Alumni Relations 0\nHealth Professionals 0\nHuman Resources 0\nInformation Systems & Technology 0\nResearch 0\nSafety 0\nStudent Services 0Time Basis\nFull Time 22\nPart Time 12Workplace Type (Exclude Inst Fac)\nOn-site (work in-person at business location) 0\nTelecommute eligible (work onsite as scheduled and/or as requested and telecommute as scheduled) 0\n\n\n\n\n\n\nFooter Region\n\n\n\n\n\n   \n\nCalifornia State University, San Bernardino\n5500 University Parkway,\nSan Bernardino CA 92407\n+1 (909) 537-5000\n\n\nFooter Social Media\n\nFollow Us\n\nFacebook\nTwitter\nYouTube\nInstagram\nLinkedIn\nSocial Media\n\n\n\n\n\n\n\n\nFooter Menu\n\n\n\nLogin\n\nmyCoyote\nBlackboard\nStudent Email\nFaculty & Staff Email\n\n\nOf Interest to...\n\nFuture Students \nCurrent Students\nFaculty & Staff\nFull-Time Faculty\nPart-Time Faculty\nCommunity & Visitors\nAlumni & Friends\nUniversity Partners\nMilitary/Veterans\n\n\n\n\n\n\nEmployment\n\nJob Listings\nFaculty Jobs\nCareer Center\nHuman Resources\nStudent Employment\n\n\nResources\n\nContact\nAnnual Safety Reports\nTitle IX Notice\nDisclosure of Consumer Information\nAcrobat Reader\nMS Office Viewers\n\n\n\n\n\n\nCampus Services\n\nAcademic Advising\nHousing & Residential Life\nOmbuds Services\nParking\nPolice\nPsychological Counseling\nServices to Students with Disabilities\nStudent Health Center\nTranscripts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter Bar Menu\n\nAccessibility\nPrivacy and Security\nWebsite Copyright/DMCA Policy\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page-header",
        "#main-content",
        "https://www.csusb.edu/",
        "https://my.csusb.edu",
        "https://www.csusb.edu/campus-directory",
        "https://www.csusb.edu/library",
        "https://www.csusb.edu/maps-directions",
        "https://www.csusb.edu/pdc",
        "https://www.csusb.edu/advancement/development/how-give/make-a-gift",
        "https://careers.csusb.edu/en-us/listing/",
        "/en-us/Search/?search-keyword=&category=unit+3+-+cfa+-+california+faculty+association&subscribe=true",
        "/en-us/job/527358/athletics-mens-head-soccer-coach",
        "/en-us/job/527349/athletics-womens-head-soccer-coach",
        "/en-us/job/527175/athletics-head-coach-mens-basketball",
        "/en-us/job/527004/marketing-department-chair-12-mo-internal-applicants-only",
        "/en-us/job/527041/information-decision-sciences-department-chair-12-mo-internal-applicants-only",
        "/en-us/job/526725/school-of-social-work-chair-12-mo-internal-applicants-only",
        "/en-us/job/526856/department-of-theatre-arts-chair-12-mo-internal-applicants-only",
        "/en-us/job/526493/psychology-department-chair-12-mo-internal-applicants-only",
        "/en-us/job/526611/department-of-ethnic-studies-chair-internal-applicants-only",
        "/en-us/job/524038/department-of-music-chair-internal-applicants-only",
        "/en-us/job/524033/department-of-teacher-education-and-foundations-tef-early-childhood-readingliteracy-position-open-rank",
        "/en-us/job/520595/department-of-kinesiology-lecturer-ay",
        "/en-us/job/520214/department-of-theatre-arts-assistant-professor",
        "/en-us/job/520046/department-of-teacher-education-and-foundations-tef-educational-psychology-and-adolescent-development-open-rank",
        "/en-us/job/519562/assistant-professor-public-administration",
        "/en-us/job/519768/assistant-professor-of-japanese-language-and-asian-studies",
        "/en-us/job/518881/w-benson-harer-egyptology-scholar-in-residence-history-department-visiting-faculty",
        "/en-us/job/518173/department-of-health-science-human-ecology-tenure-track-assistant-professor",
        "/en-us/job/517598/department-of-mathematics-assistant-professor-in-statistics",
        "/en-us/job/517478/assistant-professor-department-of-physics",
        "/en-us/search/?job-mail-subscribe-privacy=agree&search-keyword=&category=unit+3+-+cfa+-+california+faculty+association&page=2&page-items=20",
        "/en-us/job/527358/athletics-mens-head-soccer-coach",
        "/en-us/job/527349/athletics-womens-head-soccer-coach",
        "/en-us/job/527175/athletics-head-coach-mens-basketball",
        "/en-us/job/527004/marketing-department-chair-12-mo-internal-applicants-only",
        "/en-us/job/527041/information-decision-sciences-department-chair-12-mo-internal-applicants-only",
        "/en-us/job/526725/school-of-social-work-chair-12-mo-internal-applicants-only",
        "/en-us/job/526856/department-of-theatre-arts-chair-12-mo-internal-applicants-only",
        "/en-us/job/526493/psychology-department-chair-12-mo-internal-applicants-only",
        "/en-us/job/526611/department-of-ethnic-studies-chair-internal-applicants-only",
        "/en-us/job/524038/department-of-music-chair-internal-applicants-only",
        "/en-us/job/524033/department-of-teacher-education-and-foundations-tef-early-childhood-readingliteracy-position-open-rank",
        "/en-us/job/520595/department-of-kinesiology-lecturer-ay",
        "/en-us/job/520214/department-of-theatre-arts-assistant-professor",
        "/en-us/job/520046/department-of-teacher-education-and-foundations-tef-educational-psychology-and-adolescent-development-open-rank",
        "/en-us/job/519562/assistant-professor-public-administration",
        "/en-us/job/519768/assistant-professor-of-japanese-language-and-asian-studies",
        "/en-us/job/518881/w-benson-harer-egyptology-scholar-in-residence-history-department-visiting-faculty",
        "/en-us/job/518173/department-of-health-science-human-ecology-tenure-track-assistant-professor",
        "/en-us/job/517598/department-of-mathematics-assistant-professor-in-statistics",
        "/en-us/job/517478/assistant-professor-department-of-physics",
        "/en-us/search/?job-mail-subscribe-privacy=agree&search-keyword=&category=unit+3+-+cfa+-+california+faculty+association&page=2&page-items=20",
        "https://www.pageuppeople.com/powered-by-pageup/",
        "https://secure.dc4.pageuppeople.com/apply/873/sb/applicationForm/default.asp",
        "https://www.facebook.com/CSUSB",
        "https://www.twitter.com/csusbnews",
        "https://www.youtube.com/csusb",
        "https://instagram.com/csusb",
        "https://www.linkedin.com/school/california-state-university-san-bernardino/",
        "https://www.csusb.edu/advancement/strategic-communication/social-media-csusb",
        "https://my.csusb.edu/",
        "http://csusb.blackboard.com/",
        "http://mail.coyote.csusb.edu/",
        "http://mail.csusb.edu",
        "https://www.csusb.edu/future-students",
        "https://www.csusb.edu/current-students",
        "https://www.csusb.edu/faculty-staff",
        "https://www.csusb.edu/faculty-resource-directory-ft",
        "https://www.csusb.edu/faculty-resource-directory-pt",
        "https://www.csusb.edu/community-visitors",
        "https://www.csusb.edu/alumni-friends",
        "https://www.csusb.edu/advancement/philanthropy/corporate-foundation-philanthropy",
        "https://www.csusb.edu/veterans",
        "https://www.csusb.edu/human-resources/employment/job-opportunities",
        "https://careers.csusb.edu/en-us/filter/?ie=utf-8&q=&search-keyword=&work-type=instructional%20faculty%20-%20temporary%2flecturer&work-type=instructional%20faculty%20%e2%80%93%20tenured%2ftenure-track&work-type=non-instructional%20faculty%20(coach%2fcounselor%2flibrarian)&work-type=visiting%20faculty&category=unit%203%20-%20cfa%20-%20california%20faculty%20association&category=faculty&job-mail-subscribe-privacy=agree",
        "https://www.csusb.edu/career-center",
        "https://www.csusb.edu/human-resources",
        "https://www.csusb.edu/human-resources/student-employment",
        "https://www.csusb.edu/about-csusb/contact-csusb",
        "https://www.csusb.edu/police/annual-security-reports",
        "https://www.csusb.edu/title-ix/resources/title-ix-notice-non-discrimination-basis-gender-or-sex",
        "https://www.csusb.edu/registrar/disclosure-consumer-information",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/office.aspx",
        "https://www.csusb.edu/advising",
        "https://www.csusb.edu/housing",
        "https://www.csusb.edu/ombuds",
        "https://www.csusb.edu/parking",
        "https://www.csusb.edu/police",
        "https://www.csusb.edu/caps",
        "https://www.csusb.edu/ssd",
        "https://www.csusb.edu/student-health-center",
        "https://www.csusb.edu/registrar/records/request-csusb-transcript",
        "https://www.csusb.edu/ats/campus-resources/job-opportunities-accessibility-statement",
        "https://www.csusb.edu/about-csusb/privacy-and-security-notice",
        "https://www.csusb.edu/its/security/reporting/copyrightdmca-notice-and-procedure"
    ]
}