{
    "title": "Open University/Door | School of Extended and International Education at Sonoma State University",
    "body": "\n\nJump to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\nToggle Menu\n\n\n\n\n\n\n\n\n\nClose Nav\nsearch query *\n\n\n\n\n\nCommon Searches\n\nWhat majors and minors are offered?\nWhere can I find information about graduate programs?\nHow much is tuition?\nWhat financial aid packages are available?\nWhere can I log in to SSU Online?\n\n\nClose Nav\n\n\nClose Nav\nsearch query *\n\n\n\n\n\n\nApply\nVisit\nGive\nLogin\nA-Z\nLibrary\nDirectory\nStudents\nMaps\nFaculty & Staff\nAthletics\nAlumni\nAbout UsToggle Submenu Mission\nHistory\nFacts\nDiversity\nPresident\nAdministration\nDivisions & Departments\nStrategic Plan\nSustainability\n\nAcademicsToggle Submenu Degree Programs\nSchools & Departments\nAcademic Calendar\nAcademic Support\nAdvising Central\nSchedule of Classes\nCatalog\n\nAdmissions & AidToggle Submenu Experience SSU\nHow to Apply\nI Have Applied\nForms\nFinancial Aid\nStudent Fees & Charges \nRegistrar\n\nCampus LifeToggle Submenu Seawolf Living\nClubs & Organizations\nCampus Recreation\nAssociated Students\nFraternities & Sororities\nHousing\nCulinary Services\nThings to Do at SSU\nAbout the Area\n\nNews & EventsToggle Submenu Seawolf Calendar\nSocial Media Feeds\nInsights Magazine\nCampus Updates\nFor News Media\nGreen Music Center\nBox Office Tickets\n\n\n\nClose Nav\n\n\n\n\n\n\n\n\n\n\n\nYou are hereSEIE Home ›  \nOpen University/Door\n\n\n\n\n\n\n\nWinter Intersession 2023\nSession Dates\nClasses run\nJanuary 4 - 18\nView the Schedule of Classes\nTake a Class Without Enrolling at the CSU\nWant to take a class without enrolling at the CSU? Open University and Open Door offer the opportunity for anyone to enroll in a course without being admitted to the CSU. You can take courses for personal enrichment or start your college career. Open University and Open Door give you the flexibility to take courses on a space-available basis and earn college credit.\nAre you...\nPreparing for university admission to a degree program?\nUpdating your professional training and job skills?\nExploring personal interests?\nLooking for next steps if you have been academically or\nadministratively disqualified at SSU or another CSU?\nIf so, taking a university course through SSU Open University/Open Door could be an option for you.\nWho Can Take Open University/Open Door Courses?\nMembers of the general public\nFormer SSU students and alumni\nNon-resident students not enrolled in a University program\nDisqualified students from SSU or other institutions\nEnrollment Eligibility\nOpen University/Door may be right for you if you:\nmissed the deadline for admission to SSU degree programs\nwant to update your professional training and job skills\nwant to explore personal interests\nwant to test your interest in a field before entry\nhave been academically or administratively disqualified at SSU or another CSU\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Door (Winter Intersession/Summer)\n\n\n\n\n\nOpen University (Fall/Spring)\n\n\n\n\n\nNo Formal Admission Required\nOpen Door is a registration policy whereby students who have not been formally admitted to Sonoma State may participate in Summer Session and Winter Intersession academic credit courses.\nPrerequisites\nWhile the prerequisites for many courses are waived during Winter Intersession and Summer Session, Open Door registration for some courses is subject to the approval of the associated academic department. If a course has pre-requisites listed in the course description, please check with the academic department to see if you meet the requirements.\nPlease note: all prospective Open Door students wishing to enroll in Business Department classes will need department approval.\nForeign/International Students\nOpen Door registration is open to permanent residents and those maintaining valid non-immigrant visa status, including, but not limited to F-1/F-2 student visa and J-1/Au Pair visa holders. Sonoma State University will not issue immigration documents for attendance through Open Door registration.\nStudents must demonstrate proof of English proficiency by one of the following options:\nComplete and pass the SSALI UPP course prior to beginning the Semester at Sonoma (SAS) program.\nSubmit a minimum qualifying score from the following English Proficiency test listed on the Admission Requirements Page for International Students.\nTOEFL/IELTS is not required of those who have studied full-time for three or more years at the secondary level or above at an institution where English is the principal language of instruction. Official transcripts are required.\nInternational students must also obtain written approval from the International Student Advisor, located in the Center for International Education in International Hall, prior to enrolling through Open Door.\nDisqualified Students\nMatriculated students (admitted to SSU) or students who have previously attended SSU who have been academically disqualified may enroll in Summer Session and Winter Intersession courses through Open Door registration.\nFees\nOpen Door enrollment fees are due at the time of registration.\nDrops, Withdrawal, and Refunds\nNon-attendance does not constitute withdrawal. Intersession and Summer Session classes may be dropped for a full refund up until the last business day before the 1st day of instruction. Students may drop on the 1st or 2nd day of instruction for a 65% refund. The last day to withdraw is the 3rd day of instruction; a grade of W (Withdrawn) will appear on your SSU record and there will be no refund.\nOpen Door students must contact SEIE Customer Service to drop a class.\nGrade Mode Change\nSome courses have an option for students to receive a letter grade or Cr/NC; otherwise, the course description in the catalog will specify. Students may change their grade mode up to the end of the 2nd day of instruction, using the form at the SEIE office.\nCredit Information\nOpen Door students receive Special Sessions academic credit for courses numbered 100–599; please note that Special Sessions credit does not meet degree residence requirements. In the CSU, up to 24 units of Special Sessions academic credit may be applied toward a Baccalaureate degree. Nine units may be applied toward a Master's degree (subject to departmental approval). Please consult with your home institution about how SSU Intersession/Summer Session academic units will apply to your degree.\nGrades & Transcripts\nAll University rules and regulations pertaining to grades and transcripts apply to Open Door students; see University grading policies.\nOpen Door enrollment grades are available by requesting either an unofficial or an official transcript from the Sonoma State University Registrar’s Office. Unofficial transcripts may be requested in person only at the Registrar’s Office. Official transcripts may be requested by submitting a transcript request form to the Registrar’s Office.\nPlease note that Open Door students will not have access to online student services except for their Canvas online classroom space (if your class is using one).\n\n\n\n\n\nNo Formal Admission Required\nOpen University is a registration policy whereby students who have not been formally admitted to Sonoma State may enroll in academic credit courses offered by the university during the Fall and Spring semesters. \nMatriculated (Admitted) SSU Students\nThe Open University registration process is available only to non-matriculated students. If a student who has applied and been admitted to Sonoma State as a resident student enrolls through Open University in the semester of his or her admission, they will lose their status as admitted students and must reapply for admission.\nDisqualified Students\nCurrent or former SSU students who have been academically disqualified for academic or administrative reasons may be allowed to take classes at SSU through Open University if approved by an Advisor. The focus should be on raising the GPA by retaking courses for which a C- or below was received.\nFirst, set up an appointment with your Advisor to create a reinstatement plan. To that meeting, bring an Open University Disqualified Student Approval Form (available from the SEIE office). Fill in which classes you have been approved to take, have the Advisor sign, and submit this form along with your Open University registration form(s) and method of payment. Please see below for additional information about the Open University registration process.\nPrerequisites\nPlease note that some courses are closed to non-majors, and that students enrolling through Open University must have fulfilled test score and/or other prerequisites. If pre-requisites have not been fulfilled, the University reserves the right to withdraw you from the course(s) with no refund. An instructor's signature on your registration form does not guarantee that any pre-requisites have been waived.\nForeign/International Students\nInternational students may apply to take a full course of study through Open University via the Semester at Sonoma program. Otherwise, Open University registration is open to permanent residents and those maintaining valid non-immigrant visa status, including, but not limited to F-1/F-2 student visa and J-1/Au Pair visa holders. Sonoma State University will not issue immigration documents for attendance through Open University registration.\nStudents must demonstrate proof of English proficiency by one of the following options:\nTOEFL (Test of English as a Foreign Language): A minimum score of 61 for undergraduate courses or 80 for graduate courses is required. Sonoma State's ETS code is 4723.\nIELTS (International English Languvage Test System): A band score of 6.0 will be accepted in lieu of TOEFL for undergraduate students.\nTOEFL/IELTS is not required of those who have studied full-time for three or more years at the secondary level or above at an institution where English is the principal language of instruction. Official transcripts are required.\nInternational students must also obtain written approval from the International Student Advisor, located in the Center for International Education in International Hall, prior to enrolling through Open University.\nWithdrawal\nTo drop a class, students must submit a Class Drop and Refund Request form to the SEIE office.\nNon-attendance does not constitute withdrawal. Students must withdraw from a class by date specified in the Academic Calendar for dropping with a grade of \"W\", generally four weeks into the semester.\nAfter this time, students may withdraw for reasons clearly beyond their control by securing the approval and signature of the instructor on a Class Drop and Refund Request form. No refund will be given.\nRefunds\nRefunds are calculated on the following scale:\nA total refund of fees is granted through the end of Add/Drop.\nAfter that time, no refunds are given.\nThe effective date of a refund application is the day it is received by the office.\nGrade Mode Change\nMany courses have an option for students to receive a letter grade or Cr/NC; otherwise, the course description in the SSU Catalog will specify. Students may change their grade mode up to the end of the 4th week of instruction. Please stop by the SEIE office for the appropriate form. Please note that courses graded Cr/NC may not count for major purposes should you pursue a degree in the future. See an Advisor in that department if you are unsure.\nCredit Information\nOpen University participants receive Special Sessions academic credit for courses numbered 100--599. Up to 24 units of academic credit may be applied toward a Baccalaureate degree. Up to 9 units may be applied toward a Master's degree (subject to departmental approval). Units earned in Open University courses do not meet degree residence requirements.\nGrades & Transcripts\nAll regular University rules and regulations pertaining to grades and transcripts apply to Open University students; see University grading policies.\nStudents may request official transcripts using the transcript request form supplied by the Office of the Registrar.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSchool of Extended and International Education\n\nSEIE Home\nBrowse All Programs & Courses\nAcademic Calendars\nInformation Sessions\nInternational Programs\nOpen University/DoorOpen University (Fall/Spring)\nOpen Door (Winter Intersession/Summer)\n\nFrequently Asked Questions\nResources for Students\nResources for Faculty\nSEIE Curriculum Committee\nCampus Services\nAbout SEIE\n\n\n\n\n\n\n \n\n\nFacebook for SEIE \n\n\n Twitter for SEIE\n\n\nInstagram for SEIE\n\n\nYouTube for SEIE\n\n\nLinkedIn for SEIE\n\n\n\n  \n\n\n\n\n\n\n\n\nSupport Lifelong Learning   \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSSU Facebook\nSSU Twitter\nSSU Instagram\nSSU Youtube\nSSU News RSS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1801 East Cotati Ave\nRohnert Park, CA 94928\n707.664.2880\n\n\n\n\n\n\n\nContact SSU\nPrivacy Notice\nCalifornia State University\n\n\n\nAccessibility\nSafeSSU\nWebsite Feedback\n\n\n\nEmergency Information\nJobs\nTitle IX\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "http://www.sonoma.edu/",
        "http://www.sonoma.edu",
        "#",
        "#",
        "#",
        "http://www.sonoma.edu//academics/degree-programs",
        "http://www.sonoma.edu/aa/gs/",
        "http://www.sonoma.edu/registration/fees.html",
        "http://www.sonoma.edu/finaid",
        "https://login.sonoma.edu/",
        "#",
        "#",
        "http://admissions.sonoma.edu/apply",
        "https://www.sonoma.edu/visit",
        "http://www.sonoma.edu/give",
        "https://login.sonoma.edu/",
        "http://www.sonoma.edu/a-z",
        "http://library.sonoma.edu",
        "https://ldaps.sonoma.edu/fasd/",
        "http://www.sonoma.edu/students",
        "http://www.sonoma.edu/maps",
        "http://www.sonoma.edu/faculty-staff",
        "http://sonomaseawolves.com/",
        "http://www.sonoma.edu/alumni",
        "http://www.sonoma.edu/about",
        "#",
        "http://www.sonoma.edu/about-us/mission",
        "http://www.sonoma.edu/about-us/history",
        "http://www.sonoma.edu/about-us/facts",
        "http://diversity.sonoma.edu",
        "http://www.sonoma.edu/about-us/president",
        "http://www.sonoma.edu/about-us/administration",
        "http://www.sonoma.edu/divisions-departments",
        "http://strategicplan.sonoma.edu/",
        "http://sustainablessu.sonoma.edu/",
        "http://www.sonoma.edu/academics",
        "#",
        "http://www.sonoma.edu/academics/degree-programs",
        "http://www.sonoma.edu/academics/schools-departments",
        "http://www.sonoma.edu/academics/calendar",
        "http://www.sonoma.edu/academics/support",
        "https://advising.sonoma.edu/",
        "http://www.sonoma.edu/academics/schedule-classes",
        "http://www.sonoma.edu/academics/catalog",
        "http://admissions.sonoma.edu/",
        "#",
        "http://admissions.sonoma.edu/experience",
        "http://admissions.sonoma.edu/how-apply",
        "http://admissions.sonoma.edu/i-have-applied",
        "http://admissions.sonoma.edu/forms",
        "http://www.sonoma.edu/finaid",
        "http://seawolfservices.sonoma.edu/fees",
        "http://registrar.sonoma.edu",
        "http://getinvolved.sonoma.edu/",
        "#",
        "http://www.seawolfliving.com/",
        "http://getinvolved.sonoma.edu/recognized-student-organizations",
        "http://campusrec.sonoma.edu/",
        "http://as.sonoma.edu/",
        "http://getinvolved.sonoma.edu/fraternity-and-sorority-life",
        "http://housing.sonoma.edu",
        "http://culinary.sonoma.edu/",
        "http://www.sonoma.edu/campus-life/things-to-do",
        "http://www.sonoma.edu/campus-life/about-area",
        "http://news.sonoma.edu/",
        "#",
        "http://www.sonoma.edu/calendar",
        "http://news.sonoma.edu/social-media-feeds",
        "http://news.sonoma.edu/insights",
        "http://www.sonoma.edu/updates",
        "http://news.sonoma.edu/media",
        "http://gmc.sonoma.edu/",
        "https://tickets.sonoma.edu",
        "#",
        "/",
        "https://csusonoma.augusoft.net/index.cfm?fuseaction=1010&amp;catalogid=5",
        "#field-paragraph-tab-tab-0",
        "#field-paragraph-tab-tab-1",
        "https://seie.sonoma.edu/programs/ssali",
        "http://admissions.sonoma.edu/how-apply/requirements/international",
        "http://www.sonoma.edu/registration/grading_abrev",
        "http://www.sonoma.edu/registration/records/forms",
        "http://www.sonoma.edu/catalog",
        "http://www.sonoma.edu/registration/grading_abrev",
        "http://www.sonoma.edu/registration/records/forms",
        "/",
        "/programs",
        "https://seie.sonoma.edu/programs/seie-calendars/academic-calendar-view",
        "/information-sessions",
        "/international-programs",
        "/open_university-open_door",
        "/open-university/fall-spring",
        "/open-door/winter_intersession-summer_session",
        "/faqs",
        "/resources-students",
        "/resources-faculty",
        "/seie-curriculum-committee",
        "/campus-services",
        "/about-seie",
        "https://www.facebook.com/ExtendedEdatSSU",
        "https://twitter.com/SEIEatSSU",
        "https://www.instagram.com/ssu_seie/",
        "https://www.youtube.com/channel/UCjyixV2UTwSK7NqilDym1hg/featured",
        "https://www.linkedin.com/school/15134809/",
        "https://commerce.cashnet.com/ssugivetodev?itemcode=SSUDEV-EXTED",
        "https://www.facebook.com/sonomastateuniversity",
        "https://twitter.com/ssu_1961",
        "https://instagram.com/sonomastateuniversity",
        "https://www.youtube.com/csusonoma/",
        "http://news.sonoma.edu/rss.xml",
        "http://www.sonoma.edu",
        "http://www.sonoma.edu/contact-ssu",
        "http://www.sonoma.edu/privacy",
        "https://www.calstate.edu/",
        "http://accessibility.sonoma.edu",
        "https://safessu.sonoma.edu",
        "https://www.sonoma.edu/website-feedback",
        "http://www.sonoma.edu/ps/emergency/",
        "http://www.sonoma.edu/employment",
        "http://ophd.sonoma.edu/"
    ]
}