{
    "title": "Location – WordCamp Jinja 2023",
    "body": "\n\n\n\t\t\tSkip to content\t\t\n\n\n\n\t\t\t\t\t\tMain\t\t\t\t\t\nHome\nNotices\n\nCall for Sponsors\nCall for Speakers\nSocial Media Stream\n\n\nLocation\nTickets\nSponsors\nCode of Conduct\nContact\n \n\n\n\n\n\n\n\n\t\t\t\tWordCamp Jinja 2023\t\t\t\n\n\n\t\t\tThere's always more to learn!\t\t\n\n\n\n\n\t\t\t\t\tMain\t\t\t\t\nHome\nNotices\n\nCall for Sponsors\nCall for Speakers\nSocial Media Stream\n\n\nLocation\nTickets\nSponsors\nCode of Conduct\nContact\n \n\n\n\n\n\n\n\n \nLocation \n\nWordCamp Jinja 2023 will take place in two different venues: Iganga Secondary School and The Innovation Village Jinja.\nIganga Secondary School\nIganga Secondary School is a girls-only school located in Iganga, a town in the Eastern Region of Uganda. The school has a rich history of academic excellence and social responsibility, and has a special unit for special needs students. The school offers both O-level and A-level courses, as well as vocational training and co-curricular activities. The school’s official website is www.igangass.ac.ug.\nAs you enter the school, you are met by an inspirational monument with the words, “SOARING TO GLOBAL CITIZENSHIP”.\n\n\"SOARING TO GLOBAL CITIZENSHIP:\" Glad to visit @IgangaSS (girls) Secondary School today as part of ongoing preparations for this year's #WordCampJinja slated for Mon Sept 4th to Tue Sept 5th 2023. The theme for this year's conference is \"There is always more to learn!\" and among… pic.twitter.com/ewpVC2xV4Z— Mukalele Rogers (@mrogers4christ) April 5, 2023\n\nThe school is situated on a spacious and green campus, with modern facilities and equipment. The school has a computer lab, a library, a science lab, a sick bay (medical services), a sports field, and good dormitories.\n\n\n\n\n\n\n\n The school also has a very active ICT club, and one of the projects they’ve worked on is a WordPress powered online store and mobile app entitled Lyta Store, enables online shopping and mitigates the challenge of heavy travel to school through enabling students to shop variety of school requirements ranging from personal utilities like Vaseline to scholastic materials like books and pens online from various suppliers to be found at school hence solving not only one problem, but also other related problems that come with reporting back to school. The website is available at lytastore.com.\n\n\nWatch presentation by Iganga Secondary School Students presenting during the 7th National Conference on Communications in Jun 2022\nThe school is about 35 km away from Jinja, the second-largest city in Uganda and the source of the Nile River. Jinja is known for its natural beauty and cultural diversity, as well as its adventure tourism and industrial development. You can easily reach Jinja from Iganga by public transport or private car, in about 40 minutes.\n\n\n\nWe are honored to host WordCamp Jinja 2023 at Iganga Secondary School and we look forward to welcoming you to this amazing place!\nThe Innovation Village Jinja\nThe Innovation Village Jinja is a co-working space and innovation hub located in Jinja. The Innovation Village Jinja is part of The Innovation Village network, which aims to create an ecosystem that supports entrepreneurs, innovators, and creatives in Uganda.\n\n#Kudos to the partners, speakers and participants who made the inaugural #WordCampJinja a success. The engagements, trainings and hackathon were great and insightful. We strive to stay committed to providing platform where young people can meet, connect, and share ideas. pic.twitter.com/o75W402ID4— The Innovation Village (@TheVillageUG) September 5, 2022\n\nThe Innovation Village Jinja offers a variety of services and programs for its members and partners, such as:\n– Workspaces: A comfortable and conducive environment for working, meeting, and collaborating.– Events: A platform for networking, learning, and showcasing ideas and solutions.– Labs: A space for experimenting, prototyping, and testing new products and services.– Accelerators: A program for mentoring, coaching, and funding startups and social enterprises.– Communities: A network of like-minded people who share common interests and goals.\nThe Innovation Village Jinja is the perfect venue for our Contributor Day on Wednesday 6th September 2023. We are excited to partner with them and to connect with the local WordPress community in Jinja!\n\n\n\nWebsite Camp Hackathon at The Innovation Village, Jinja in Dec 2021\n\n\n\nLocated on Plot 5, Main Street, Jinja City. See Map\n\n\n\n\n\n\n\n\nRecent PostsCall for Sponsors\nCall for Speakers\nWordCamp Jinja 2023 is now on official Schedule!\n \n\n \n\n\n\n\t\t\t\t\tProudly powered by WordPress\t\t\t\t\n\nGo to WordCamp Central\n\nPrivacy Policy \n\n \n\n\n\n\n\n\n\tPrivacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. \n\nTo find out more, including how to control cookies, please see here: \n\t\t\n\t\tCookie Policy\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://jinja.wordcamp.org/2023/",
        "https://jinja.wordcamp.org/2023/notices/",
        "https://jinja.wordcamp.org/2023/call-for-sponsors/",
        "https://jinja.wordcamp.org/2023/call-for-speakers/",
        "https://jinja.wordcamp.org/2023/social-media-stream/",
        "https://jinja.wordcamp.org/2023/location/",
        "https://jinja.wordcamp.org/2023/tickets/",
        "https://jinja.wordcamp.org/2023/sponsors/",
        "https://jinja.wordcamp.org/2023/code-of-conduct/",
        "https://jinja.wordcamp.org/2023/contact/",
        "https://jinja.wordcamp.org/2023/",
        "https://jinja.wordcamp.org/2023/",
        "https://jinja.wordcamp.org/2023/",
        "https://jinja.wordcamp.org/2023/notices/",
        "https://jinja.wordcamp.org/2023/call-for-sponsors/",
        "https://jinja.wordcamp.org/2023/call-for-speakers/",
        "https://jinja.wordcamp.org/2023/social-media-stream/",
        "https://jinja.wordcamp.org/2023/location/",
        "https://jinja.wordcamp.org/2023/tickets/",
        "https://jinja.wordcamp.org/2023/sponsors/",
        "https://jinja.wordcamp.org/2023/code-of-conduct/",
        "https://jinja.wordcamp.org/2023/contact/",
        "https://igangass.ac.ug/",
        "https://www.igangass.ac.ug/",
        "https://twitter.com/IgangaSS?ref_src=twsrc%5Etfw",
        "https://twitter.com/hashtag/WordCampJinja?src=hash&ref_src=twsrc%5Etfw",
        "https://t.co/ewpVC2xV4Z",
        "https://twitter.com/mrogers4christ/status/1643538083315367938?ref_src=twsrc%5Etfw",
        "https://lytastore.com/about/",
        "https://twitter.com/hashtag/Kudos?src=hash&ref_src=twsrc%5Etfw",
        "https://twitter.com/hashtag/WordCampJinja?src=hash&ref_src=twsrc%5Etfw",
        "https://t.co/o75W402ID4",
        "https://twitter.com/TheVillageUG/status/1566795035672207360?ref_src=twsrc%5Etfw",
        "https://goo.gl/maps/xytPqAvbE7y2rNyo9",
        "https://jinja.wordcamp.org/2023/call-for-sponsors/",
        "https://jinja.wordcamp.org/2023/call-for-speakers/",
        "https://jinja.wordcamp.org/2023/welcome-to-wordcamp-jinja-2023/",
        "https://wordpress.org/",
        "https://central.wordcamp.org/",
        "https://wordpress.org/about/privacy/",
        "https://wordpress.org/about/privacy/cookies/"
    ]
}