{
    "title": "Training Courses | DoResearch",
    "body": "  Skip to main content Stanford UniversityTopicsView and Search All TopicsAll Topics by CategoryPolicies & ResourcesPolicies & Resources OverviewPolicy ManualsResearch Policy HandbookFaculty HandbookGraduate Academic Policies & ProceduresAdministrative GuidePolicy Manuals (col 2) Property Management ManualService Center ManualSpace InventoryUniversity Wide Policy DocumentsResourcesHow ToTools & DocumentsGlossaryOffices & PeopleResearch UnitsView All Independent Laboratories, Centers, and InstitutesView All Research Support OfficesPeopleSearch All PeopleFundingTrainingCompliance TrainingTraining CoursesAnnouncementsSearch   search  Click to open the mobile menuTopicsView and Search All TopicsAll Topics by CategoryPolicies & ResourcesPolicies & Resources OverviewPolicy ManualsResearch Policy HandbookFaculty HandbookGraduate Academic Policies & ProceduresAdministrative GuidePolicy Manuals (col 2) Property Management ManualService Center ManualSpace InventoryUniversity Wide Policy DocumentsResourcesHow ToTools & DocumentsGlossaryOffices & PeopleResearch UnitsView All Independent Laboratories, Centers, and InstitutesView All Research Support OfficesPeopleSearch All PeopleFundingTrainingCompliance TrainingTraining CoursesAnnouncementsMy DorClick to open the Omnibar MenuResearch at StanfordDoResearchCentral OfficesOffice of the Vice Provost & Dean of ResearchEnvironmental Health & SafetyIndustrial Contracts OfficeOffice of Research AdministrationOffice of Technology Licensing Research Compliance OfficeResearch Policy and IntegrityScience OutreachStanford Research Computing CenterStanford Research Development Office Business AffairsOffice of the Chief Risk OfficerGlobal Business ServicesPostdoctoral AffairsSexual Harassment Policy OfficeUniversity Corporate and Foundation RelationsUniversity ITVice Provost for Graduate EducationSchool Research OfficesEngineering Research AdministrationResearch Management GroupIndependent Laboratories, Centers & InstitutesCenter for Advanced Study in the Behavioral SciencesChemistry, Medicine and Engineering for Human HealthE.L. Ginzton LaboratoryFreeman Spogli Institute for International StudiesGeballe Laboratory for Advanced MaterialsKavli Institute for Particle Astrophysics and CosmologyPrecourt Institute for EnergyPULSE Institute for Ultrafast Energy ScienceStanford Bio-XStanford Center On LongevityStanford Human-Centered Artificial IntelligenceStanford Humanities CenterStanford Institute for Economic Policy ResearchStanford Institute for Materials and Energy SciencesStanford Woods Institute for the EnvironmentW.W. Hansen Experimental Physics LaboratoryWu Tsai Neurosciences InstituteResearch Partners Stanford and SLACKey:You are here Training Courses  Select filters below to narrow your results. Subjects, Programs, & Audiences  SubjectAllAnimal Care and UseConflicts of InterestEnvironmental Health & SafetyExport ControlsFinanceHuman Subjects & Good Clinical PracticeIndustry Sponsored Clinical Trial Financial AdministrationInternational ActivitiesNational Institutes of Health (NIH)NIH K AwardsNIH NRSAPlshipPrivacy & SecurityProperty ManagementResearch AdministrationResponsible Conduct of ResearchSexual Harassment PreventionShared Scientific Facilities/Cores & Service CentersSpace Inventory Certificate ProgramAllCardinal Curriculum Level ICardinal Curriculum Level IIDPA Property Certification AudienceAllAdministratorsFacultyPI and Research TeamResearcher Keyword  Order By:A - ZZ - A37 Courses All Finance CoursesGain the knowledge and confidence to navigate Stanford's Financial Systems. Keep your skills sharp and your financial acumen strong and focused. Choose from a wide variety of training courses to Animal Care and Use Training ProgramFaculty, staff, and students who will be involved in the use of laboratory animals are expected to complete the web-based Animal Care and Use Training Program (VSC-PROG-0001), which provides anVSC-PROG-0001 Budget Preparation Companion WorkshopThis course is part of Cardinal Curriculum Level II Certification. Take this course after completing ORA-1120 Proposal and Budget Preparation and the Proposal Preparation Companion Workshop ORA-1501. In this 90-minuteORA-1502 CRISP TrainingThe Clinical Research Invoicing System for Participants (CRISP) supports tracking patient events and is the invoicing process used for industry sponsored clinical trials. CRISP resources include a User Guide; this Department Property Administrator TrainingComprehensive course required for all DPAs, recommended for anyone assisting with capital equipment and other property issues.PMO-1000 DPA Property Certification ProgramDPA's are required to enroll and complete the DPA Property Certification course - PMO-1000 offered by the Office of Research Administration's Property Management Office (PMO).PMO-1000 EH&S Training OpportunitiesAs a part of EH&S’ commitment to sustaining a culture of safety on campus, they have developed and teach specialty and trainings to educate personnel and staffers of the hazards Expenditure Statement Reconciliation and ReviewThis course is part of Cardinal Curriculum Level II Certification. If you are working toward a Cardinal Curriculum Level II certificate, this class is an elective. We recommend you takeFIN-0160 Export Controls: An OverviewThis class is a guide for all faculty and staff who administer international research and foreign students at Stanford, export materials and equipment, work with disclosure-restricted technical information, travel internationallyDOR-1130 FUNDamentals of Funds: Introduction to Funds ManagementTake this course after completing ORA-1101 Understanding Cost Policy. This course covers the fundamentals of funds. Fund accounting allows us to track University activity in a meaningful way. This isFIN-0170 Gift Administration At StanfordThis course is part of Cardinal Curriculum Level II Certification. If you are working toward a Cardinal Curriculum Level II certificate, this class is an elective. We recommend you takeORA-1128 Global Activity PlanningGlobal Business Services (GBS) provides faculty and staff with training and resources to plan your research actvities abroad. iLab for Stanford AdministratorsStanford Shared Scientific Facilities provide specialized scientific services, instruments, equipment, supplies, technologies, and technical expertise to support research. iLab is a web application some Stanford Shared Scientific Facilities have adoptedORA-6001 Introduction to iJournalsTake this course after completing ORA-1101 Understanding Cost Policy. This course is part of Cardinal Curriculum Level II Certification. If you are working toward a Cardinal Curriculum Level II certificateFIN-0210 Managing Sponsored ProjectsThis course is part of Cardinal Curriculum Level II Certification. Take this course after completing the Cardinal Curriculum Level I Certification program and ORA-1120 Proposal and Budget Preparation, ORA-1501 ProposalORA-1126 NIH K Award Application WorkshopThis lab 3-hour computer lab session workshop is offered before each standard NIH deadline via Zoom meeting. It is available for Stanford researchers and is required for School of MedicineDOR-1219 NIH NRSA Fellowship WorkshopNRSA F Series Individual Postdoctoral and Pre-doctoral Fellowships Required computer lab sessions - Zoom Workshops (DOR-1218) Highlights: Required NIH NRSA F Series Computer Lab Sessions-especially for those submitting (or resubmitting)DOR-1218 Overview of Research and the Regulatory EnvironmentThis course is part of Cardinal Curriculum Level I Certification. Take this course after completing ORA-1101 Understanding Cost Policy. This course is an introduction to research administration at Stanford UniversityORA-1102 Overview of Research and the Regulatory Environment Companion WorkshopThis course is part of Cardinal Curriculum Level I Certification. Take this course after completing ORA-1101 Understanding Cost Policy and ORA-1102 Overview of Research and the Regulatory Environment After youORA-1103 Overview of Stanford University Service Center Policies and PracticesThis course is part of Cardinal Curriculum Level II Certification. If you are working toward a Cardinal Curriculum Level II certificate, this class is an elective. We recommend you takeORA-1125 PI Training: Stewardship and Compliance for Principal InvestigatorsStanford requires individuals new to the position of Principal Investigator (PI) to understand the regulatory environment in which sponsored research is conducted. This course outlines the regulatory environment for sponsoredDOR-0680 Privacy and Security TrainingTraining on data security and protection such as GDPR and HIPAA. Proposal and Budget PreparationThis course is part of Cardinal Curriculum Level II Certification. Take this course after completing the Cardinal Curriculum Level I Certification program. This course is for administrators at all levelsORA-1120 Proposal Preparation Companion WorkshopThis course is part of Cardinal Curriculum Level II Certification. Take this course after completing the online ORA-1120 Proposal and Budget Preparation course. In this 1 hour zoom webinar workshopORA-1501 RECR TrainingResponsible and Ethical Conduct of Research (RECR) applies to all researchers and research staff engaged in scholarly research. While written with all researchers in mind, special consideration has been given Required Tutorial on Human Subject Research ProtectionThis tutorial fulfills the requirement set for in RPH 5.7 Training in the Protection of Human Subjects in Research Sexual Harrasssment Prevention TrainingThe Sexual Harassment Policy Office offers three different customized training programs for faculty and staff at Stanford, including those in non-faculty teaching positions.SUHT Pagination   Current page 1   Page 2  Next page Next   Last page Last »    Stanford University   Stanford Home Search Stanford Maps & Directions Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility  © Stanford University. Stanford, California 94305.FeedbackFeedback Please login to provide feedback, report a bug, or contact site administrators.",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "/",
        "/topics",
        "/topics/all-topics-category",
        "/policies-resources",
        "/policies/research-policy-handbook",
        "/policies/faculty-handbook",
        "/policies/graduate-academic-policies-procedures",
        "/policies/administrative-guide",
        "https://ora.stanford.edu/ora-units/property-management-office/property-management-manual",
        "/policies/service-center-manual",
        "/policies/space-inventory",
        "/policies/university-wide-policy-documents",
        "/how-to",
        "/tools-documents",
        "/glossary",
        "/office/independent-laboratories-centers-and-institutes",
        "/offices",
        "https://stanfordwho.stanford.edu/",
        "/funding",
        "/training/compliance-training",
        "/training",
        "/announcements",
        "/topics",
        "/topics/all-topics-category",
        "/policies-resources",
        "/policies/research-policy-handbook",
        "/policies/faculty-handbook",
        "/policies/graduate-academic-policies-procedures",
        "/policies/administrative-guide",
        "https://ora.stanford.edu/ora-units/property-management-office/property-management-manual",
        "/policies/service-center-manual",
        "/policies/space-inventory",
        "/policies/university-wide-policy-documents",
        "/how-to",
        "/tools-documents",
        "/glossary",
        "/office/independent-laboratories-centers-and-institutes",
        "/offices",
        "https://stanfordwho.stanford.edu/",
        "/funding",
        "/training/compliance-training",
        "/training",
        "/announcements",
        "/user",
        "https://www.stanford.edu/research/",
        "/homepage",
        "/office/office-vice-provost-and-dean-research",
        "https://ehs.stanford.edu/",
        "https://ico.sites.stanford.edu/",
        "/office/office-research-administration",
        "https://otl.stanford.edu/",
        "https://researchcompliance.stanford.edu/",
        "/office/research-policy-and-integrity",
        "https://oso.stanford.edu/",
        "https://srcc.stanford.edu/",
        "/office/stanford-research-development-office",
        "https://businessaffairs.stanford.edu/",
        "https://ocro.stanford.edu/",
        "https://globalops.stanford.edu/",
        "https://postdocs.stanford.edu/",
        "https://harass.stanford.edu/",
        "https://cfr.stanford.edu/",
        "https://uit.stanford.edu/",
        "https://vpge.stanford.edu/",
        "https://era.stanford.edu/",
        "http://med.stanford.edu/rmg.html",
        "https://casbs.stanford.edu/",
        "https://chemh.stanford.edu/",
        "https://ginzton.stanford.edu/",
        "https://fsi.stanford.edu/",
        "https://glam.stanford.edu/",
        "https://kipac.stanford.edu/",
        "https://pie.stanford.edu/",
        "https://ultrafast.stanford.edu/",
        "https://biox.stanford.edu/",
        "https://longevity.stanford.edu",
        "https://hai.stanford.edu/",
        "https://shc.stanford.edu/",
        "http://siepr.stanford.edu/",
        "http://simes.stanford.edu/",
        "https://woods.stanford.edu/",
        "https://web.stanford.edu/group/hepl/",
        "https://neuroscience.stanford.edu/",
        "/office/stanford-and-slac-0",
        "/training/compliance-training",
        "/training/finance",
        "/training/animal-care-and-use",
        "/training/research-administration-7",
        "/training/industry-sponsored-clinical-trial-financial-administration",
        "/training/property-management-0",
        "/training/property-management",
        "/training/environmental-health-safety",
        "/training/research-administration-10",
        "/training/export-controls",
        "/training/finance-0",
        "/training/research-administration-5",
        "/training/international-activities",
        "/training/shared-scientific-facilitiescores-service-centers-0",
        "/training/finance-1",
        "/training/research-administration-4",
        "/training/national-institutes-health-nih-0",
        "/training/national-institutes-health-nih",
        "/training/research-administration-0",
        "/training/research-administration-11",
        "/training/shared-scientific-facilitiescores-service-centers",
        "/training/plship",
        "/training/privacy-security",
        "/training/research-administration-1",
        "/training/research-administration-6",
        "/training/responsible-conduct-research",
        "/training/human-subjects-good-clinical-practice-1",
        "/training/sexual-harassment-prevention",
        "?page=0",
        "?page=1",
        "?page=1",
        "?page=1",
        "https://stanford.edu",
        "https://www.stanford.edu/",
        "https://www.stanford.edu/search/",
        "https://visit.stanford.edu/plan/",
        "https://emergency.stanford.edu/",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility",
        "#",
        "/saml_login?destination=/training%3Fcallback%3Dq507y%26categoryid%3Dvc6ql%26code%3Dwcq8l%26csrf_token%3Dxx7wm%26emailto%3Dmzigm%26item%3Dyurd4%26lang%3Dy5m1k%26list_type%3Dwzdlm%26mod%3Dgdtry%26name%3Dwx70y%26password%3Dh5uu4%26q%3Dncs4f%26region%3Dg1pta%26s%3Dxipm8%26terms%3Di22qi%26text%3Ddxofp%26tid%3Djvf3v%26token%3Dnu0zt%26uid%3Dtboyd%26url%3Doxtk2"
    ]
}