{
    "title": "Antibiotics after breast cancer linked to poorer survival, Stanford Medicine-led study finds | News Center | Stanford Medicine",
    "body": "\n\n\n\n\n\n\n\nSkip to Content\nSkip to Local Navigation\nSkip to Global Navigation\n\n\nStanford Medicine\n\n\nNews Center\n\n\n\n\nSite Nav\n\n\nMenu\n\n\n\n\n\n\n\n\nSee us on facebook\n\n\n\n\n\nSee us on twitter\n\n\n\n\n\nSee us on youtube\n\n\n\n\n\nSee us on linkedin\n\n\n\n\n\nSee us on instagram\n\n\n\n\n\n\n\n\n\n\n\nStanford Medicine\nExplore Stanford Medicine\n\n\nHealth Care \n\n\n\nFind a doctor\nAdult-care doctor\nPediatrician or pediatric specialist\nObstetrician\nClinics & Services\nAdult care\nPediatric care\nObstetrics\nClinical trials\n\n\n\nLocations\nStanford Health Care\nStanford Children's Health\nEmergency Department\nDial 911 in the event of a medical emergency\n\n\n\n\nExplore Health Care\nLearn how we are healing patients through science & compassion \n\n\n Back\n\n\n\n\nResearch \n\n\n\nBasic science departments\nClinical science departments\nInstitutes\nResearch centers\nSee full directory\nResearch Resources\nResearch administration\nAcademic profiles\nClinical trials\nFunding opportunities\nSee all\nProfessional Training\nPostdoctoral scholars\nClinical research fellows\n\n\n\nResearch News\n\nStanford team stimulates neurons to induce particular perceptions in mice's minds  \n\n\n\n\nExplore Research\nLearn how we are fueling innovation \n\n\n Back\n\n\n\n\nEducation \n\n\n\nMD program\nPA Programs\nPhD programs\nMasters programs\nContinuing Medical Education\nPostdoctoral scholars\nResidencies & fellowships\nHigh School & Undergraduate Programs\nSee all\nEducation Resources\nAcademic profiles\nSchool Administration\nBasic science departments\nClinical science departments\nAlumni services\nFaculty resources\nDiversity programs\nLane Library\nStudent resources\n\n\n\nEducation News\n\nStudents from far and near begin medical studies at Stanford \n\n\n\n\nExplore Education \nLearn how we empower tomorrow's leaders \n\n\n Back\n\n\n\n\nGive \n\n\n\n\nSupport Stanford Medicine\n\n\n\nSupport teaching, research, and patient care.  \nWays to give\nWhy giving matters\nMake a gift online\n\n\n\nSupport Children's Health\n\n\n\n\nSupport Lucile Packard Children's Hospital Stanford and child and maternal health \nWays to give\nHow your gift helps\nMake an online gift\n\n\n Back\n\n\n\n\nAbout \n\n\n\nAbout us\nNews\nContacts\nMaps & directions\nLeadership\nVision\nDiversity\nGlobal health\nCommunity engagement\nEvents\nHow you can help\n\n\nStanford School of Medicine\nStanford Health Care\nStanford Children's Health\n\n Back\n\n\n\n\nSite Search\n\n\nSubmit Search Query\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Dropdown MenuMenu\n\n\n\n                Scope Blog\n            \n\n\n\n\n\n\n\n\n\n\n                Stanford Medicine Magazine\n            \n\n\n\n\n\n\n\n\n\n\n                Of Note\n            \n\n\n\n\n\n\n\n\n\n\n                COVID-19 Updates\n            \n\n\n\n\n\n\n\n\n\n\n                Topics\n            \n\n\n\n\n\nTopics\n\n\n\n\nAdministration\nAging\nBig Data\nBiochemistry\nBioengineering\nCancer\nCardiovascular Health\nChemical Biology\nChronic Disease\nCOVID-19\nDevelopmental Biology\nEducation\nGenetics\nGlobal Health\nHealth Policy\nHearing\nImaging\nImmunology\n\n\n\n\nInfectious Disease\nMental Health\nNeuroscience\nNutrition\nObituaries\nPain\nPatient Care\nPediatrics\nPrecision Health\nPreventive Medicine\nSleep\nStem Cells\nSurgery\nTechnology\nTransplantation\nUrology\nWomen's Health\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Medicine\n\n\nNews\n\n\n2023\n\n\n                    Antibiotics linked to poorer cancer survival\n                \nStory\n\n\n\n\n\n\n            Antibiotics after breast cancer linked to poorer survival, Stanford Medicine-led study finds\n          \n\n\n\n\n\nshare\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTriple-negative breast cancer patients who used antibiotics within three years of diagnosis have an increased risk of death, according to a study. The gut microbiome is a likely link.\nApril 18, 2023 \n       - By Krista Conger\n\n\n\n\n\n\n\n\n\nResearchers found that women with triple-negative breast cancer who took more than one course of antibiotics were more likely to experience recurrence or to die of their cancer. \nsolarseven/Shutterstock.com\n\n\n\n\n\n\n\nWomen with triple-negative breast cancer who received multiple antibiotic prescriptions within three years after their cancer diagnosis were more likely to experience disease recurrence and to die from their cancer than those who took fewer courses of the drugs, according to a study by researchers at Stanford Medicine. The effect on survival was not due to differences in cancer severity, the study showed.\nThe risk increased substantially with the total number and types of antibiotics prescribed for each patient.\n“Each additional antibiotic increased the risk of death between 5% and 18% relative to patients who weren’t prescribed antibiotics,” said Julia Ransohoff, MD, a fellow in hematology and medical oncology at the Stanford School of Medicine. “It is important to interpret these findings with caution, however. We can’t let life-threatening infections go untreated. But this study suggests that we consider how best to treat them without raising the risk of cancer recurrence.”\nRansohoff is the lead author of the study, which was published online April 12 in Nature Communications. Allison Kurian, MD, professor of medicine and of epidemiology and population health, and Ami Bhatt, MD, PhD, associate professor of medicine and of genetics, are the senior authors of the study.\n“These findings offer insight into the role of the immune system, and factors that may perturb its function, in fighting the most aggressive type of breast cancer,” Kurian said. “Gaining a better understanding of this process will be important to guide patient care.”\nEffect on a type of immune cell\nThe researchers studied 772 women who were diagnosed between January 2000 and May 2014 and treated at Stanford Health Care or Palo Alto Medical Foundation. They found that treatment with antimicrobials (a class of drugs that includes antibiotics to treat bacterial infections and antifungals to treat fungal infections) was associated with a decrease in the numbers of an immune cell called lymphocytes circulating in a patient’s blood. Lymphocyte numbers have been shown to correlate with response to treatment and overall survival in people with breast cancer. (Although the researchers studied total antimicrobial prescriptions, 99% of the women in the study who were prescribed antimicrobials received antibiotics.)\n\n\n\n\n\n\n\n\n\n\n\nJulia Ransohoff\n\n\n\n\n\n\n\nThe researchers believe the link between antimicrobials and lymphocyte numbers lies in the gut. It’s well established that antibiotic treatment, as well as chemotherapy, can be especially harsh on the bacteria that carpet our intestines — a population of tiny helpers known as the gut microbiome. These bacteria not only help us digest food, but also affect many aspects of our health, including how our immune systems respond to emerging threats like infection or cancers.\n“We’ve long known that the gut microbiome plays a role in shaping the immune system and that the immune system is pivotal in how people respond to cancers and chemotherapy,” Ransohoff said. “We found a surprisingly strong and sustained increased risk of death in patients who had received multiple antimicrobials any time during the three years after their initial diagnosis.”\nThe study has caveats. The women were diagnosed and treated before 2021, when the use of an immune-boosting therapy called immune checkpoint inhibitors for early-stage triple-negative breast cancer became routine. Also, triple-negative breast cancer is unique among breast cancer types. It is both more rare and more difficult to treat successfully than other breast cancers. But it is also more sensitive to attacks by the immune system, so it is unclear whether the association between antibiotics and poorer survival will translate to other types of breast cancer.\nAntibiotic use and cancer\nThis study is not the first to show that antibiotic use may affect cancer survival. A previous large study by researchers in Australia of more than 7,000 people with cancer found an association between antibiotic use in the six months prior to the patients’ diagnosis and poorer survival. And antibiotic treatment correlates with increased tumor growth in several mouse models of breast cancer. Other studies have also hinted at an association between gut microbiome health and responses to cancer treatments.\nBut this study is the first to correlate antimicrobial use with both the number of circulating lymphocytes and overall cancer survival — and to do it at several time points after treatment.\n\n\n\n\n\n\n\n\n\n\n\nAllison Kurian\n\n\n\n\n\n\n\n“While other studies have suggested that the gut microbiome is different in cancer patients who do poorly versus those who do well, few have evaluated the upstream choices that patients and doctors can make to affect the microbiome,” Bhatt said. “This study helps connect some of the dots — finding that antibiotic use is linked to lower numbers of a type of circulating immune cell important to fight cancer. We still don’t know if the microbiome is the critical connecting factor between antibiotic use and cancer outcomes, but we suspect that it may be a key player.”\nRansohoff and her colleagues used a database called Oncoshare, which integrates electronic health records and data from the California Cancer Registry. The women in the study were diagnosed with non-metastatic (stages 1 through 3) triple-negative breast cancer and were treated with chemotherapy and, if necessary, surgery. Eighty-four percent of the women were prescribed antimicrobials at some point after their cancer diagnosis; 99% of these prescriptions were for antibiotics. The median follow-up time for the study was 104 months.\nThe researchers found that, over the course of the multiyear study period, 20% of the women who were not prescribed antimicrobials during the study died. In contrast, 23% of the women who had ever received antimicrobials died. There was no statistically significant difference in the risk of death from breast cancer between the average woman who did versus did not receive antimicrobials since diagnosis, suggesting that the risk associated with each prescription was small. However, Ransohoff and her colleagues found that the risk of death from breast cancer increased not just with the total number of prescriptions a woman had received since diagnosis, but also with the number of unique drugs to which she was exposed (amoxicillin versus tetracycline, for example).\nThe association between antimicrobial use and an increased risk of death lasted about three years after the women’s cancer diagnoses; the risk gradually decreased in years four and five. Further analysis showed the association was not due to how sick the patients were when they received the drugs.\n\n\n\n\n\n\n\n\n\n\n\nAmi Bhatt\n\n\n\n\n\n\n\nThe data from Oncoshare didn’t include information about the patients’ gut microbiomes, which is usually obtained through fecal samples. But Ransohoff and her colleagues hope to design a new study that directly correlates gut microbiome composition with lymphocyte numbers and long-term cancer survival.\n“We would love to look directly at the gut microbiome and see how antibiotic exposure shapes gut taxonomy,” Ransohoff said. “But this study certainly raises the question of how our findings should impact clinical care of cancer patients.”The researchers caution against applying the findings of the study of several hundred women to any one person.\n“Patients should not panic if they were treated with antibiotics after a breast cancer diagnosis,” Kurian said. “In any individual case, the risk increase is not large. But overall, these findings suggest a link between antibiotic use, the immune system and breast cancer survival, which warrants further study.”  \nResearchers from the Palo Alto Medical Foundation Research Institute and UC San Francisco contributed to the work.\nThe study was funded by the National Institutes of Health (grants 5T32HG000044 and R01AI14375702), the Breast Cancer Research Foundation, the Susan and Richard Levy Gift Fund, the Suzanne Pride Bryan Fund for Breast Cancer Research, the Jan Weimer Junior Faculty Chair in Breast Oncology, the Regents of the University of California’s California Breast Cancer Research Program, the BRCA Foundation, the G. Willard Miller Foundation, the Biostatistics Shared Resource of the Stanford Cancer Institute, Stand Up 2 Cancer, the V Foundation, and the Damon Runyon Cancer Research Foundation.\n\n\n\n\n\n\n\n\n\n\n\n                \n                    \n                    Krista Conger\n                \n            \n\n                Krista Conger is a senior science writer in the Office of Communications. Email her at kristac@stanford.edu.\n\n            \n\n\n\n\nMedia Contacts\n\n\n\n\n                \n                    \n                    Krista Conger\n                \n            \nTel\n                    650-725-5371\n\nkristac@stanford.edu\n\n\n\nAbout Stanford Medicine\nStanford Medicine is an integrated academic health system comprising the Stanford School of Medicine and adult and pediatric health care delivery systems. Together, they harness the full potential of biomedicine through collaborative research, education and clinical care for patients. For more information, please visit med.stanford.edu.\n\n\n\n\n\n\n\n\n\n\n        Related News\n    \n\n\n\n\n\n\n\n\n\n\nApril 12, 2023\n\nResearchers use skin-colonizing bacteria to create a topical cancer therapy in mice\nIn a study led by Stanford Medicine, researchers harnessed the skin’s immune response to bacteria to create an immunotherapy — delivered by swab — that treats aggressive tumors in mice.\n\n\n\n\n\nApril 12, 2023\n\nTiny DNA circles are key drivers of cancer, Stanford Medicine-led international study finds\n\n\n\n\n\n\n        Topics\n    \n\n\n\n\n\nCancer\n\nAll Topics\n\n\n\n\n\n\n\n\n\n                        Stanford Medicine Magazine\n                    \n\n\n\n\n            2023 ISSUE 1\n        \n\n\nReal-world health\n\n\n\nHow social factors make or break us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNews Center\n\n\nNews Center\nOffice of Communications\nFor Journalists\nFor Faculty & Staff\nSchool Policies\nContacts\n\n\nNews Sources\nScope Blog\nStanford Medicine Magazine \nStanford Health Care Newsroom\nStanford Children's Health Newsroom\n\n\n\nStanford School of Medicine\n\nAbout\nContact\nMaps & Directions\nCareers\n\n\nBasic Science Departments\nClinical Science Departments\nAcademic Programs\nVision\n\n\n\n\n\n\n\n Find People\n\n\n Visit Stanford\n\n\n Search Clinical Trials\n\n\n Give a Gift\n\n\n\n\n\n\n©2023 Stanford Medicine\n\n\n\nPrivacy Policy\n\n\nTerms of Use\n\n\n\nSee us on Facebook\n\n\n\n\nSee us on Twitter\n\n\n\n\n\n\n\n\n\n\n\nStanford University\n\n\nStanford School of Medicine\n\n\nStanford Health Care\n\n\nStanford Children's Health\n\n\nStanford Health Care Tri-Valley\n\n\nStanford Medicine Partners\n\n\n\n\n\n\n\n\n",
    "links": [
        "#mainContent",
        "#navigationLocal",
        "#navigationGlobal",
        "https://med.stanford.edu/",
        "https://med.stanford.edu/news.html",
        "https://www.facebook.com/stanfordmedicine",
        "https://twitter.com/StanfordMed",
        "http://www.youtube.com/user/stanfordmedicine",
        "https://www.linkedin.com/school/stanford-university-school-of-medicine/posts/",
        "https://instagram.com/stanford.med/",
        "http://med.stanford.edu",
        "#",
        "#",
        "https://stanfordhealthcare.org/directory/guided-search.html#x1=sp_spec_care_phy&q1=true&page=1",
        "http://www.stanfordchildrens.org/en/search/default?tab=doctors",
        "http://www.stanfordchildrens.org/en/search/default?tab=doctors&search-term=Obstetrics",
        "#",
        "https://stanfordhealthcare.org/directory/guided-search.html#x1=sp_spec_care_clinic&q1=true&page=1",
        "http://www.stanfordchildrens.org/en/service/index?",
        "http://www.stanfordchildrens.org/en/service/index?",
        "//med.stanford.edu/clinicaltrials/",
        "#",
        "https://stanfordhealthcare.org/directory/guided-search.html#x1=sp_spec_care_clinic&q1=true&page=1",
        "http://www.stanfordchildrens.org/en/locations-directions",
        "http://stanfordhealthcare.org/medical-clinics/emergency-department.html",
        "//med.stanford.edu/health-care.html",
        "#",
        "#",
        "//med.stanford.edu/school/directory/basic-science-departments.html",
        "//med.stanford.edu/school/directory/clinical-science-departments.html",
        "//med.stanford.edu/school/directory/stanford-medicine-institutes.html",
        "//med.stanford.edu/school/directory/research-centers-and-programs.html",
        "//med.stanford.edu/school/directory.html",
        "#",
        "//med.stanford.edu/school/directory/research-administration.html",
        "//med.stanford.edu/profiles/",
        "//med.stanford.edu/clinicaltrials/",
        "//med.stanford.edu/rmg/funding/",
        "//med.stanford.edu/school/directory/researcher-resources.html",
        "#",
        "//postdocs.stanford.edu",
        "//gme.stanford.edu",
        "//med.stanford.edu/content/sm/news/all-news/2019/07/stanford-team-stimulates-neurons-to-induce-particular-perception.html",
        "//med.stanford.edu/research.html",
        "#",
        "#",
        "//med.stanford.edu/md.html",
        "//med.stanford.edu/pa.html",
        "//med.stanford.edu/education/phd-programs.html",
        "//med.stanford.edu/education/masters-programs.html",
        "//med.stanford.edu/cme/",
        "//postdocs.stanford.edu",
        "//gme.stanford.edu",
        "//med.stanford.edu/education/summer-outreach.html",
        "//med.stanford.edu/education.html",
        "#",
        "//med.stanford.edu/profiles/",
        "//med.stanford.edu/school/deans-office.html",
        "//med.stanford.edu/school/directory/basic-science-departments.html",
        "//med.stanford.edu/school/directory/clinical-science-departments.html",
        "//med.stanford.edu/alumni/",
        "//med.stanford.edu/school/directory/academic-resources.html",
        "//med.stanford.edu/about/diversity.html",
        "http://lane.stanford.edu/index.html",
        "//med.stanford.edu/school/directory/academic-resources.html",
        "//med.stanford.edu/content/sm/news/all-news/2019/08/students-from-far-and-near-begin-medical-studies-at-stanford.html",
        "//med.stanford.edu/education",
        "#",
        "#",
        "//medicalgiving.stanford.edu",
        "//medicalgiving.stanford.edu",
        "//medicalgiving.stanford.edu/ways-to-give.html",
        "//medicalgiving.stanford.edu/why-giving-matters.html",
        "http://pgnet.stanford.edu/goto/medgift",
        "//www.supportlpch.org/",
        "//www.supportlpch.org",
        "http://www.supportlpch.org/Waystogive",
        "http://www.supportlpch.org/page.aspx?pid=358",
        "http://www.supportlpch.org/donate",
        "#",
        "#",
        "//med.stanford.edu/about.html",
        "//med.stanford.edu/news.html",
        "//med.stanford.edu/about/contacts.html",
        "//med.stanford.edu/about/contacts/maps-directions.html",
        "//med.stanford.edu/school/leadership.html",
        "//med.stanford.edu/about/vision.html",
        "//med.stanford.edu/about/diversity.html",
        "//globalhealth.stanford.edu",
        "//med.stanford.edu/about/community-engagement.html",
        "//med.stanford.edu/about/events.html",
        "//med.stanford.edu/about/how-to-help.html",
        "//med.stanford.edu/school.html",
        "http://stanfordhealthcare.org",
        "http://www.stanfordchildrens.org",
        "#",
        "#",
        "#",
        "https://scopeblog.stanford.edu/",
        " https://stanmed.stanford.edu/",
        " https://med.stanford.edu/news/all-news/brands/notable.html",
        "https://stanfordhealthcare.org/discover/covid-19-resource-center.html",
        " https://med.stanford.edu/news/topics.html",
        "https://med.stanford.edu/news/topics.html",
        "https://med.stanford.edu/news/topics/stanford-medicine.html",
        "https://med.stanford.edu/news/topics/aging-geriatrics.html",
        "https://med.stanford.edu/news/topics/ai-technology-innovation.html",
        "https://med.stanford.edu/news/topics/biochemistry.html",
        "https://med.stanford.edu/news/topics/bioengineering.html",
        "https://med.stanford.edu/news/topics/cancer.html",
        "https://med.stanford.edu/news/topics/cardiology.html",
        "https://med.stanford.edu/news/topics/cellular-molecular-biology.html",
        "https://med.stanford.edu/news/topics/autoimmune-conditions.html",
        "https://med.stanford.edu/news/topics/covid-19.html",
        "https://med.stanford.edu/news/topics/dev-bio.html",
        "https://med.stanford.edu/news/topics/medicial-education.html",
        "https://med.stanford.edu/news/topics/genetics.html",
        "https://med.stanford.edu/news/topics/global.html",
        "https://med.stanford.edu/news/topics/health-policy.html",
        "https://med.stanford.edu/news/topics/ear-nose-throat.html",
        "https://med.stanford.edu/news/topics/radiology.html",
        "https://med.stanford.edu/news/topics/immunology.html",
        "https://med.stanford.edu/news/topics/infectious-diseases.html",
        "https://med.stanford.edu/news/topics/psychiatry-mental-health.html",
        "https://med.stanford.edu/news/topics/neurology-neurosurgery.html",
        "https://med.stanford.edu/news/topics/nutrition.html",
        "https://med.stanford.edu/news/topics/obituaries.html",
        "https://med.stanford.edu/news/topics/anesthesiology-pain-management.html",
        "https://med.stanford.edu/news/topics/patient-care.html",
        "https://med.stanford.edu/news/topics/pediatrics.html",
        "https://med.stanford.edu/news/topics/precision-health.html",
        "https://med.stanford.edu/news/topics/preventive-medicine.html",
        "https://med.stanford.edu/news/topics/sleep.html",
        "https://med.stanford.edu/news/topics/stem-cell.html",
        "https://med.stanford.edu/news/topics/surgery.html",
        "https://med.stanford.edu/news/topics/technology.html",
        "https://med.stanford.edu/news/topics/transplantation.html",
        "https://med.stanford.edu/news/topics/urology.html",
        "https://med.stanford.edu/news/topics/womens-health.html",
        "https://med.stanford.edu/",
        "https://med.stanford.edu/news.html",
        "https://med.stanford.edu/news/all-news/2023.html",
        "mailto:?Subject=Antibiotics after breast cancer linked to poorer survival, Stanford Medicine-led study finds&Body=http://med.stanford.edu/news/all-news/2023/04/antibiotics-cancer.html",
        "http://www.facebook.com/sharer.php?s=100&p%5Burl%5D=http%3A%2F%2Fmed.stanford.edu%2Fnews%2Fall-news%2F2023%2F04%2Fantibiotics-cancer.html",
        "https://twitter.com/share?url=http%3A%2F%2Fmed.stanford.edu%2Fnews%2Fall-news%2F2023%2F04%2Fantibiotics-cancer.html",
        "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Fmed.stanford.edu%2Fnews%2Fall-news%2F2023%2F04%2Fantibiotics-cancer.html&title=Antibiotics+after+breast+cancer+linked+to+poorer+survival%2C+Stanford+Medicine-led+study+finds",
        "https://www.cancer.org/cancer/breast-cancer/about/types-of-breast-cancer/triple-negative.html",
        "https://profiles.stanford.edu/julia-ransohoff",
        "https://www.nature.com/articles/s41467-023-37636-0",
        "https://profiles.stanford.edu/allison-kurian",
        "https://profiles.stanford.edu/ami-bhatt",
        "mailto:kristac@stanford.edu",
        "mailto:kristac@stanford.edu",
        "https://med.stanford.edu/",
        "http://med.stanford.edu/school.html",
        "http://med.stanford.edu/",
        "https://med.stanford.edu/news/all-news/2023/04/cancer-bacteria.html",
        "https://med.stanford.edu/news/all-news/2023/04/ecDNA-cancer.html",
        "/news/topics/cancer.html",
        "/news/topics.html",
        "https://stanmed.stanford.edu/issue/2023issue1/",
        "https://stanmed.stanford.edu/issue/2023issue1/",
        "https://med.stanford.edu/news.html",
        "http://mednews.stanford.edu/",
        "http://mednews.stanford.edu/whatWeDo/",
        "http://mednews.stanford.edu/media/",
        "http://mednews.stanford.edu/staff/",
        "http://mednews.stanford.edu/media/index.html#policy",
        "http://mednews.stanford.edu/connect/",
        "https://scopeblog.stanford.edu/",
        "https://stanmed.stanford.edu/",
        "https://stanfordhealthcare.org/newsroom.html",
        "https://www.stanfordchildrens.org/en/about/news",
        "//med.stanford.edu",
        "https://med.stanford.edu/school.html",
        "https://med.stanford.edu/school/contacts.html",
        "https://med.stanford.edu/school/contacts/maps.html",
        "https://medcareers.stanford.edu/",
        "https://med.stanford.edu/school/directory/basic-science-departments.html",
        "https://med.stanford.edu/school/directory/clinical-science-departments.html",
        "https://med.stanford.edu/education.html",
        "https://med.stanford.edu/about/vision.html",
        "https://profiles.stanford.edu/",
        "http://med.stanford.edu/school/contacts/maps.html",
        "http://clinicaltrials.stanford.edu/",
        "http://medicalgiving.stanford.edu/",
        "http://www.stanford.edu/site/privacy",
        "http://www.stanford.edu/site/terms",
        "https://www.facebook.com/stanfordmedicine",
        "https://twitter.com/stanfordmed",
        "//www.stanford.edu",
        "//med.stanford.edu",
        "http://stanfordhealthcare.org",
        "http://www.stanfordchildrens.org",
        "http://ValleyCare.com",
        "http://universityhealthcarealliance.org",
        "#"
    ]
}