{
    "title": "Structural & Social Drivers of Health & Cancer Health Disparities Research Tickets, Wed, May 10, 2023 at 10:00 AM | Eventbrite",
    "body": "\n\n\n\n\n\nSkip Main NavigationEventbriteTrigger search event experienceBrowse EventsOrganizeHelpLog InSign UpMenuPage ContentActions PanelMay 10Structural & Social Drivers of Health & Cancer Health Disparities ResearchLecture given by Dr. Scarlett Lin Gomez, MPH, PhD, University of California, San Francisco, in honor of AANHPI Heritage MonthBy Chao Family Comprehensive Cancer CenterFollowWhen and whereDate and timeWednesday, May 10 · 10 - 11am PDTLocationGross Hall Thorp Conference Center (4th Floor) 845 Health Sciences Road Irvine, CA 92617Show mapAbout this event1 hourMobile eTicketThis lecture is sponsored by the Cancer Control Research Program, part of the UCI Chao Family Comprehensive Cancer Center, in honor of Asian American, Native Hawaiian, and Pacific Islander (AANHPI) Heritage Month. This is an IN-PERSON event. Lecture Title: Structural and Social Drivers of Health and Cancer Health Disparities Research Abstract: We are increasingly aware of the impact of structural and social determinants as fundamental drivers of health inequities, but how do we design and implement population-level studies to investigate the role of these factors? This presentation will present a framework and examples of \"cells to society\" studies utilizing this framework.Bio: Scarlett Lin Gomez, MPH, PhD, is Professor and Vice Chair for Faculty Development in the Department of Epidemiology and Biostatistics and Co-Leader of the Cancer Control Program of the Helen Diller Family Comprehensive Cancer Center, at the University of California, San Francisco. She is Director of the Greater Bay Area Cancer Registry, a participant in the NCI SEER (Surveillance, Epidemiology, End Results) program and the California Cancer Registry. Her research focuses primarily on cancer health disparities and aims to understand the multilevel drivers, particularly the structural and social determinants of health, of those disparities.----------P﻿lease register by Friday, May 5, 2023.About the organizerOrganized by Chao Family Comprehensive Cancer CenterContactFollowReport this eventSite NavigationUse EventbriteCreate EventsPricingEventbrite BoostEventbrite Mobile Ticket AppEventbrite Check-In AppEventbrite App MarketplaceEvent Registration SoftwareContent StandardsFAQsSitemapPlan eventsSell Tickets OnlineEvent PlanningSell Concert Tickets OnlineEvent Payment SystemSolutions for Professional ServicesEvent Management SoftwareCommunity EngagementVirtual Events PlatformQR Codes for Event Check-InPost your event onlineFind eventsBrowse Irvine EventsGet the Eventbrite AppConnect with usReport This EventHelp CenterTermsPrivacyCA Privacy NoticeAccessibilityCommunity GuidelinesEventbrite + Ticketfly© 2023 Eventbrite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#skip-heading",
        "https://www.eventbrite.com",
        "https://www.eventbrite.com/d/local/all-events/",
        "/how-it-works/",
        "https://www.eventbrite.com/support",
        "https://www.eventbrite.com/signin/?referrer=%2Fe%2F590187746437%2F%3Flang%3Den-us%26locale%3Den_US%26status%3D30%26view%3Dlisting",
        "https://www.eventbrite.com/signin/signup/?referrer=%2Fe%2F590187746437%2F%3Flang%3Den-us%26locale%3Den_US%26status%3D30%26view%3Dlisting&user_type=prebuyer&user_type_sig=AH_ElWFmqePQcLAAEoUyojlWYHb49v0cEw",
        "#",
        "https://www.eventbrite.com/o/chao-family-comprehensive-cancer-center-41256970253",
        "https://www.eventbrite.com/organizer/overview/",
        "https://www.eventbrite.com/organizer/pricing/",
        "https://www.eventbrite.com/boost/",
        "https://www.eventbrite.com/l/eventbrite-app/",
        "https://www.eventbrite.com/l/organizer-check-in-app/",
        "https://www.eventbrite.com/apps/",
        "https://www.eventbrite.com/l/registration-online/",
        "https://www.eventbrite.com/l/contentstandards/",
        "https://www.eventbrite.com/l/frequently-asked-questions/",
        "https://www.eventbrite.com/sitemap/",
        "https://www.eventbrite.com/l/sell-tickets/",
        "https://www.eventbrite.com/l/planning-an-event/",
        "https://www.eventbrite.com/l/music-venues/",
        "https://www.eventbrite.com/l/event-payment/",
        "https://www.eventbrite.com/l/professional-services/",
        "https://www.eventbrite.com/l/event-management-software/",
        "https://www.eventbrite.com/l/community-engagement/",
        "https://www.eventbrite.com/l/virtual-events-platform/",
        "https://www.eventbrite.com/l/how-to-use-qr-codes-for-events/",
        "https://www.eventbrite.com/l/post-events/",
        "https://www.eventbrite.com/d/ca--irvine/events/",
        "https://www.eventbrite.com/eventbriteapp/",
        "",
        "https://www.eventbrite.com/help/",
        "https://www.eventbrite.com/tos/",
        "https://www.eventbrite.com/privacypolicy/",
        "https://www.eventbrite.com/support/articles/en_US/Troubleshooting/supplemental-privacy-notice-for-california-residents?lg=en_US",
        "https://www.eventbrite.com/l/accessibility",
        "https://www.eventbrite.com/brite-community/",
        "https://www.eventbrite.com/r/ereg"
    ]
}