{
    "title": "Something in the Air | Chapman Newsroom",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nFind information for\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\n\nDegrees\n\n                & Programs\nMaps &\n\n                Directions\nAll Directories\nNews\nEvents\n\nSocial\n\n\n\n\n\n\n\nfacebook\n\n\n\n\n\n\n\ntwitter\n\n\n\n\n\n\n\npinterest\n\n\n\n\n\n\n\ninstagram\n\n\n\n\n\n\n\n\n\nyoutube\n\n\n\n\n\n\n\nlinkedin\n\n\n\n\n\n\n\n\n\nsnapchat\n\n\n\n\n\n\n\ntumblr\n\n\n\n\n\n\n\nitunes\n\n\n\n\n\n\nSocial hub\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\nNewsroom\n\n\n\n\n\n\n\n\nTopics\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind\n\n\n\n\n\n\n\n\n\n\nLog in\n\n\n\n\n\n\n\n\n\n\n                    Login\n\n                  \n\n\n\n\ncanva icon\n\n\nCanvas\n\n\n\n\n\n\n\n\n\n\n\n\n\nHandshake\n\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty & staff) \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n              Chapman University\n\n            \n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nChapman Newsroom\nMain Menu >\n\n\nTopics\n\n\nToggle\n\n\n\n\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\n\nToggle\n\n\n\n\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\nMain Menu\n< Chapman Newsroom \n\n\n\nAbout\n\n\n\nToggle About\n\n\n\n\n\nMaps & Directions\nVisit Chapman\nDiscover Chapman\nFacts & Rankings\nLeadership\nCampus Services\nConnect\n\n\n\nAcademics\n\n\n\nToggle Academics\n\n\n\n\n\nDegrees & Programs\n\nSchools & Colleges\nAcademic Calendar\nFaculty Directory\nLibraries\nCourse Catalogs\nInternational Study\n\n\n\nAdmission\n\n\n\nToggle Admission\n\n\n\n\n\nUndergraduate Admission\n\nUndergraduate Application\nGraduate Admission\nGraduate Application\nAffordability\nFinancial\n\n                    Aid\n\n                    Calculator\nCampus Tours\n\n\n\nAlumni\n\n\n\nToggle Alumni\n\n\n\n\n\nEvents\nGet Involved\nCareer\n\n                    Support\n\n\nArts\n\nCampus Life\n\n\n\nToggle Campus Life\n\n\n\n\n\nAthletics\nDiversity & Inclusion\nEvents\nFish Interfaith\n\n                    Center\nHealth & Safety\nResidence\n\n                    Life\nStudent Life\n\n\n\nResearch\n\n\n\nToggle Research\n\n\n\n\n\nPre-Award\n\n                    Administration\nPost-Award\n\n                    Administration\nResearch Integrity\nInstitutes &\n\n                    Centers\nCenter for\n\n                    Undergraduate\n\n                    Excellence\nGraduate Research\n\n                    Support\n\n\n\nSupport\n\n\n\nToggle Support\n\n\n\n\n\nContact Development\nGet Involved\nAreas to\n\n                    Support\nAlumni Involvement\n\n\n\n\n\n\nFind information for...\n\n\n\nToggle Find Information By Audience\n\n\n\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\nDegrees & Programs\nMaps & Directions\nAll Directories\nNews\nEvents\nSocial\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare via Facebook Share via Twitter Share via Reddit Share via Pinterest Share via Email Share via LinkedIn \n Print Friendly\n\n\n\n\n\n\n\n\nUncategorized \nSomething in the Air For the first time in history, scientists unearth extraterrestrial culture on the international space station, led by Chapman University Professor Justin Walsh.\n Cindy HarvardOctober 26, 202212 min read\n\n\n\n\n\n\n\n\n\n\nBy Dennis Arp\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNational recognition shines a light on Chapman Radio, where the freeform programming continues to evolve, but the strong sense of community endures.\n\n\n\n\n\n\nGive smart, inquisitive students the tools, training, and air time, then sit back and listen as they gain their bearings behind the microphone and beyond.\n\n\n\n\n\n\nS ometimes you go to college and you meet your new best friend. Sometimes you find your voice. Bella Gerencser ’24 and Emilie Haskell ’24 came to Chapman University and did both.\nThey met on a text chain a few months before they got to Chapman, and then the bond became unbreakable when, coincidentally, or perhaps karmically, they ended up living on the same floor of The K residence hall.\nAs they went the extra mile to meet new classmates during the pandemic, and as they navigated a new world they perceived to be full of smarter and cooler people than they are, Gerencser and Haskell found it comforting to have someone two doors down who just gets it.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJust Two Indie Girls Navigating\n\n\n\n\n\nA Male Manipulator World\n\n\n\n\n\n\nJust Two Indie Girls Navigating a Male Manipulator World\n\n\n\n\n\nSteadily, they found their communities, including Chapman Radio, where they started producing and co-hosting their own show about a week after they met in person. Now, two years later, their creation has been honored as the best college talk show in the nation.\nIn many ways, the experience of Gerencser and Haskell exemplifies what has been in the ether and on the air since Chapman Radio first launched more than half a century ago. Give smart, inquisitive students the tools, training and air time, then sit back and listen as they gain their bearings behind the microphone and beyond.\n“I like being 100% open and vulnerable – I like being 100% me – and Bella’s the same way,” says Haskell, a junior double majoring in political science and documentary and broadcast journalism. “So we love having Chapman Radio as an outlet, and we’ve found that we have really good radio chemistry.\n\n\n\n\n‘You’re Not Like Other Girls’\n\n\n\n\nThat chemistry is evident as, at 9 p.m. on a spring Wednesday, Gerencser and Haskell slip on their headphones and slide behind their mics in Chapman Radio’s Henley Hall basement studio. They seamlessly transition from off-air small talk to riffing on their topic of the day: music they’re embarrassed to admit they like. They laugh often as they share stories full of candor – “just two indie girls navigating a male manipulator world,” as they say in the description of their show “You’re Not Like Other Girls.\n“The more you get to know them, the more it’s clear that they just are not going to tap dance around issues,” says Travis Bartosh, the Chapman radio faculty advisor. “It’s just not in their nature to hold back. From a podcast and radio standpoint, that’s what we want from hosts. We don’t want them to be filtered, whether we agree with them or not. That’s why we listen.”\n\n\n\n\n“It’s just not in their nature to hold back. From a podcast and radio standpoint, that’s what we want from hosts… that’s why we listen.”\n– Travis Bartosh, Ph.D.\n\n\n\n\n\n\n\n\nGerencser and Haskell are far from alone in their commitment to the freeform and collaborative ethos of Chapman Radio, which often is ranked among the top 20 college radio stations nationally by the Princeton Review.\nOn any given day, the greater Henley Hall basement studio space pulses with activity as students not only produce and host their shows but also provide support for other members of the Chapman Radio community.\n\n\n\n\n\n\n\n\n\n\n\nStop by and you might meet Reese Velez ’25 (DJ Reese), who’s been performing almost all her life and provides voice coaching for kids. With her show “Asian Fusion,” she amplifies the music and voices of AAPI artists.\n\n\n\n\n\n\n\n\n\n\nThen there’s Ellis Pearson ’22, lead housing assistant at Chapman and contributor to the show “Live From the Henley Hall Basement,” which started this summer as a mix of music, talk and news.\n\n\n\n\n\n\n\n\n\nAnd don’t miss a chance to get to know Natasha Young ‘25, creator of the show “The Fisheye Forecast,” which draws inspiration from live radio theatre of the 1930s, with powerful threads of surreal scifi psychological horror comedy and elements of Grimm’s Fairy Tales woven in for good fun.\n\n\n\n\n\nStudent Producers Earn the License to Explore\n\n\n\n\nYou’re also likely to bump into Bartosh. While students create the programming and staff the station, he provides the mentorship as program advisor in the Chapman School of Communication. The school offers classes, workshops and other training for students interested in joining the Chapman Radio community.\n“Students take the class one semester so they get trained and get comfortable in the studio,” Bartosh says. “They have to earn what’s called their broadcast license, and once they do, they roll over into being a Chapman Radio club member and they have access to do their show each semester if they want.\nBartosh is a great ambassador for Chapman Radio. He’s eager to show visitors and new student talent the $30,000 industry-quality sound board in the studio – a space he gutted and rebuilt during the down time of the pandemic, with advice and hands-on help from Mike Boyle, a producer of Angels baseball broadcasts on AM 830 KLAA.\nThe space mirrors professional studios, “and our ability to livestream also is incredible,” Bartosh says. “We built this from scratch – we don’t use any third-party resources, which a lot of college stations do.”\n\n\n\n\n\n\n\n\n\nA $30,000 sound board helps students prepare to succeed in the radio and podcast industries.\n\n\n\n\n“We built this [studio] from scratch – we don’t use any third-party resources, which a lot of college stations do.”\n– Travis Bartosh, Ph.D.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman Radio faculty advisor Travis Bartosh, Ph.D., at left in the photo above, is a great ambassador and historian for the program.\n\n\n\n\n\nBartosh also makes sure that students know the historical foundation on which the current program is built.\nChapman Radio began in 1967, when students founded an over-the-air station (KNAB AM 890) in a control room that they created by converting a coat closet. From the beginning, “the leadership was the students,” one of the co-founders, Rick Eisleben ’69, recalled in 2015.\nThat student creative control over programming has endured as the station has converted from over–the-air to live streaming, at chapmanradio.live.\nEisleben is among the alumni who have built careers out of their Chapman Radio experience. Instead of becoming a minister, as he had planned, Eisleben created his own film and TV production company, working largely with faith leaders and their communities.\nOther graduates of the program include Ken Bunt ’93, now president of Disney Music Group; Jeff Levering ’05, TV and radio broadcaster for the Milwaukee Brewers; Cameron Louis ’13, executive producer for iHeartMedia and TV producer of “The Woody Show”; and Caroline Brown ’21, a board operator at iHeartMedia.\nOften those alumni return to speak with students about careers in media and music. Brown says that by the time she graduated, she was convinced of the rewards.\n\n\n\n\n\nChapman Radio ‘Changed my Life Path’\n\n\n\n\n“I love talking with people, and I love the connection radio provides,” she says. “Getting to hang out with these great people all the time and share my passion for music made the Chapman Radio experience stand out. It changed my life path.\nFor Gerencser and Haskell, the benefits of their experience include the technical and practical – they know how to run a soundboard, upload episodes of their weekly show to podcasting websites and promote their show via social media.\nThe experience also gives them a leg up within their disciplines. As a screenwriter, Gerencser listens to past shows with an ear for authentic dialogue. “It’s useful that for an hour Emilie and I are constantly going back and forth,” she says.\n\n\n\n\n“Getting to hang out with these great people all the time and share my passion for music made the chapman radio experience stand out. It changed my life path.”\n– Caroline Brown ’21\n\n\n\n\n\n“wait,\n\n\n\n\n\n\nDid we just hear that right?”\n\n\n\n\n\n\n“Wait, did we just hear that right?”\n\n\n\n\n\nStill, it’s the interpersonal rewards that make their show a passion project.\nI’ve had people tell me, ‘It’s nice listening to you guys because it feels like I’m talking with siblings or best friends back home,’” Gerencser says. “That’s something I really value – I’m very happy about that.”\nOf course, it was also a nice perk when the Intercollegiate Broadcasting System recognizes your work as the Best Talk Program in the nation.\nThe awards are usually handed out in New York, but since the pandemic hit, the ceremony has been held online. There were some connectivity issues this year, so when the award announcement was made, it was a “wait, did we just hear that right?” kind of a moment for Gerencser and Haskell. They celebrated with some ramen.\nBut that’s OK, they say, because in the end it’s about the show, their friendship and the community.\n“I make the joke about awards that they ensure Bella has a reason to hang out with me once a week,” Haskell says with a smile. “We went from being neighbors, to working on this show, to moving in together. It’s really lovely to have that chart of a relationship.”\nAnd the show? What does the national award say about “You’re Not Like Other Girls”?\n“A lot of people just really want to feel at home,” Haskell says. “That’s something Bella and I are really good at. Not only in radio, but in our everyday lives.”\n\n\n\n\n“A lot of people just really want to feel at home. That’s something Bella and I are really good at. Not only in radio, but in our everyday lives.”\n– Emilie Haskell ’24\n\n\n\n\n\n\n\n\n\n\n\nWhat’s on Chapman Radio?\nGive it a listen.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmergency \n\nMedia ContactsCerise Valenzuela Metzger\n\nDirector of Public Relations\n(714) 289-3143 (office)\n(657) 390-6760  (cell)\ncmetzger@chapman.edu\n\nOffice of Public Relations\n\nPR@chapman.edu \n\nNewsroom SiteChapman Magazine\n\nChapman Forward\nCOVID-19 Resources\n\nChapman Site\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment \n\nServices & PoliciesAccessibility Feedback \nWebsite Feedback \nDisability Services \nDirectory Emergency \nConsumer Disclosures \nPrivacy Policy Title IX \n\n\n\n\n\n© 2023 Chapman University           \n\n\n\n\n\n\nTopics\n\nAlumni\nArts & Film\nBusiness & Economy\nCampus & Students\nCollege Knowledge\nCommunity\nCOVID-19\nHealth & Behavior\nHumanities & Society\nScience & Engineering\nUniversity News\n\n\nOur Voices\nCOVID-19 Resources\nMagazines\n\nChapman Magazine\nChapman Forward\n\n\nPress Room\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#",
        "#",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "#",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://www.pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu/",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/edu/school?id=17838",
        "https://www.snapchat.com/add/chapmanu",
        "http://chapmanadmission.tumblr.com/",
        "http://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://social.chapman.edu/",
        "#",
        "https://www.chapman.edu/",
        "/",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "https://news.chapman.edu/wp-admin/ ",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "https://www.chapman.edu/campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu",
        "https://news.chapman.edu/work/",
        "/",
        "https://www.chapman.edu/",
        "#",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "#",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/discover/index.html",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "/about/connect",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/academics/course-catalogs/index.aspx",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "/admission/undergraduate/applynow",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/afford.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/net-cost-calculator/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/events/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/students/health-and-safety/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "/research/",
        "https://www.chapman.edu/research/sponsored-projects-services/pre-award/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/post-award/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index.aspx",
        "https://www.chapman.edu/research/graduate-research/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/contact-us.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/ways-to-give/areas-to-support.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/audiences/index.aspx",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "https://social.chapman.edu/",
        "#",
        "#",
        "#",
        "#",
        "mailto:?subject=Something%20in%20the%20Air&body=https%3A%2F%2Fnews.chapman.edu%2F2022%2F10%2F26%2Fsomething-in-the-air%2F",
        "#",
        "#",
        "https://news.chapman.edu/category/uncategorized/",
        "https://news.chapman.edu/author/harvardchapman-edu/",
        "https://chapmanradio.live/",
        "https://www.chapman.edu/emergency/index.aspx",
        "tel:+1714-289-3143",
        "tel:+1657-390-6760",
        "mailto:cmetzger@chapman.edu",
        "mailto:PR@chapman.edu",
        "/magazine",
        "/forward",
        "/coronavirus/",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/jobs/index.aspx",
        "https://www.chapman.edu/accessibility/feedback-form.aspx",
        "https://www.chapman.edu/website-feedback-form.aspx",
        "https://www.chapman.edu/students/health-and-safety/disability-services/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "emergency/index.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/index.aspx",
        "https://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "https://www.chapman.edu/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/"
    ]
}