{
    "title": "Make WordPress.org Marketing – Welcome to the official blog of the marketing team for the WordPress open source project.",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress.org Marketing\n\n\nWelcome\nHandbook\nTasks\n \n\n\n\nHide welcome box\n\n\n\n\n\nThe Marketing team promotes WordPress to current and future users and contributors. We create and amplify campaigns to support the growth of the WordPress project.\nOur work is tracked on the Marketing Tasks Board on the WordPress organization’s GitHub. If you are planning a Marketing Table at a Contributor Event, please let us know in the Slack channel.\nRead more about our team and how to get involved.\n\n\nJoin us!\nYou can be part of the #marketing channel on Slack. Join our next Weekly Marketing Chat at: Tuesday 15:00 UTC.Diary dates\n\nTo-do\n\n\n\n\n\n\n\n\n\n\n\n \nSé Reed\n\n12:41 am on May 2, 2023 \n\n\n\nTags: #FromBlogsToBlocks, Community ( 5 ), Contribute ( 2 ), Marketing Team ( 152 ), WP20 ( 5 )   \n\t\t\t\t\n\n20 Days to Celebrate 20 Years of WordPress, From Blogs to Blocks\n\n\nAs we approach the 20th anniversary of WordPress on May 27, 2023, the Make Marketing team is excited to announce #WP20 From Blogs to Blocks, a campaign to celebrate WordPress and the incredible WordPress community.\n\nFrom Blogs to Blocks creates intentional moments for the WordPress community to reflect on the journey we’ve gone on so far and to dream of what’s to come.\nEach daily action symbolizes the millions of individual actions that have come together to make WordPress what it is today.\n\n\nHere’s how it works:\n In the spirit of recognizing and empowering our diverse community, #WP20 From Blogs to Blocks celebrates a range of different interests and skill sets. Each day, from May 7 to May 27, 2023, the WordPress Make Marketing blog will feature five WordPress-related prompts:\nBlogging: WordPress-related questions or suggestions for a related action that can be expressed through writing, video, audio, or visual/digital art. The key is to post your responses on a WordPress blog or website, showcasing the versatility of WordPress as a platform.\n\nDeveloping: These prompts are for those who want to participate on the technical side of the platform, from testing and pull requests to building blocks. \n\nDesigning: With an emphasis on designing and creation, these prompts aim to inspire the creative minds who bring WordPress to life visually.\n\nPhotography: Aimed at anyone who likes to take pictures, prompts for contributions to the WordPress Photo Directory will bring our worlds together while enriching our community’s visual resources.\n\nCommunity:  Actions to support the WordPress community and the project as a whole. These prompts are meant to foster contribution and connection among community members.\nMix and match your focus for each day, or create your own daily action and let your WordPress memories, skills, and passion shine!\nParticipants who share at least one action during the campaign as a comment on a #WP20 From Blogs to Blocks post will have the achievement acknowledged by the Marketing team  (and possibly on their WordPress.org profile). Participants who share an action on all 20 posts before WCUS in August 2023 will get an additional acknowledgement of their accomplishment. We can’t wait to celebrate your commitment and your contributions to our thriving community!\nLet’s celebrate the past, present, and future of WordPress, and continue empowering each other to build a better web for everyone.  \n#WP20 From Blogs to Blocks starts May 7, 2023.\nSubscribe to the marketing blog to get the daily prompt post sent directly to your inbox (sign up in the sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme.)\nWant to help draft the prompts? Last day for prompt suggestions is May 2, 2023\n#fromblogstoblocks, #community, #contribute, #marketing-teamLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nPooja Derashri\n\n7:30 am on May 1, 2023 \n\n\n\nTags: make.wordpress.org/updates ( 26 ), p2-xpost ( 69 )   \n\t\t\t\t\n\nX-post: What’s new on Learn WordPress in April 2023\n\n\nX-comment from +make.wordpress.org/updates: Comment on What’s new on Learn WordPress in April 2023Login to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nJonathan Pantani\n\n9:05 pm on April 19, 2023 \n\n\n\nTags: Showcase ( 4 )   \n\t\t\t\t\n\nRevitalizing the Showcase \n\n\nSubmission guidelines on highlighting the best of what you can do with WordPress\nHighlighting the potential of what can be built with WordPress is both a testament to the incredible power of creating on WordPress and a testimonial that even the most noteworthy of brands are powering their content with WordPress. As the Make Marketing team updates the content of what’s in the Showcase, the team should aim to elevate and maintain the integrity of the platform. Read more on the additional background on the efforts to reinvigorate the Showcase.This is an excellent opportunity to get involved in a way that helps shape how others, especially those who aren’t intimately familiar with WordPress might come to view the excellent work that brands with their teams or designers, developers, and marketers are doing while utilizing WordPress.In order to fix the aforementioned issues, allow Showcase to reach its fullest potential, and make moderation sustainable, I’m proposing the following steps be taken:\nLimit the WordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ Showcase to 100 entries. Unlike the Photos Directory, websites aren’t static, they change frequently. Staying on top of which sites are still running and still using WordPress has been an ongoing and growing issue. Limiting the Showcase to the 100 most sites resolves this issue and also guarantees that the showcased sites are also fresh, demonstrating the latest and greatest WordPress possibilities. Bonus: Develop a script to automatically unpublish any sites still running on an old version within 30 days of a new release.\nGet details and data. The showcase should be more than just ‘shiny and new’ or a collection of Fortune 500 companies. Digging in and getting details like how the website was created will help answer the question of “Why is this in the Showcase?” MetaMeta Meta is a term that refers to the inside workings of a group. For us, this is the team that works on internal WordPress sites like WordCamp Central and Make WordPress. data that helps to answer this question will be prioritized throughout the curation process.\nReduce categoryCategory The 'category' taxonomy lets you group posts / content together that share a common bond. Categories are pre-defined and broad ranging. noise. Have fun with tags. The Showcase previously used an arbitrary collection of tags for navigation. Rather than carry that forward, there is an opportunity to simplify navigation through the use of select categories. Tags can then be used to arbitrarily group sites by technology, theme, host, etc. This will help keep the collection of sites and add some quirk and joy as well.\nUpdate the submission form to include additional metadata. While the Showcase has previously used single-sentence site descriptions, the hope is to expand entries to tell more of the story behind the sites. Adding form fields for the site creator, country of origin, and story (background) gives visitors insight into how these sites are built. These fields can also make the content creation process easier.\nMaintain and manage the list. While each site on the Showcase will embody the spirit of what it means to be powered by WordPress, some brands’ notoriety will underscore the breadth of what’s possible with WordPress. Keeping such sites as evergreen — or pinned — will be in the best interest of visitors. Innovation is also a key way of keeping the showcase fresh and some entries will help balance the showcase with evergreen content and user-generated submissions to help show off the beauty of WordPress.\nCreate credibility and trust. Adopting a policy that refreshes a portion of the showcase, rotating through new various sites, allows the WordPress Project to stay true to values like fostering creativity and innovation on the platform. When the Showcase exemplifies what’s possible, the Project will live its values. Brands that might make sense from a name recognition point of view might be best represented on /enterprise rather than the showcase.\nWhat’s next?\nSharing some of these thoughts with you and listening to your observations and ideas is a critical step in making the Showcase a valuable and successful brand asset. The project will only benefit from its collective community voice as it works to show off some of the excellent work that’s being done out in the wild world wide web!\nSo what do you think? Do these guidelines capture a strong way of revitalizing the Showcase? Please share your thoughts and ideas. Or join in the discussion on GitHub.\n#showcaseLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nJonathan Desrosiers\n\n1:16 pm on April 19, 2023 \n\n\n\nTags: make.wordpress.org/community ( 13 ), p2-xpost ( 69 )   \n\t\t\t\t\n\nX-post: Cultivating More Effective Contributing on Contributor Days\n\n\nX-comment from +make.wordpress.org/community: Comment on Cultivating More Effective Contributing on Contributor DaysLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nSantana Inniss\n\n3:05 pm on April 18, 2023 \n\n\n\nTags: Marketing Team ( 152 ), Meeting Notes ( 87 )   \n\t\t\t\t\n\nNotes: Global Marketing Team meeting, 11 April 2023\n\n\nPlease add any comments on the related Marketing Tasks GitHub issue or in the #marketing channel on the Make WordPress SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/.. \nThis meeting was organized on GitHubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/ card #210\nLeading the meeting:@sereedmedia\nTaking notes: @santana.inniss\nLink to meeting start in Slack: https://wordpress.slack.com/archives/C0GKJ7TFA/p1681225212224739\nLink to attendance thread in Slack (16 contribs): https://wordpress.slack.com/archives/C0GKJ7TFA/p1681225264757389\nTeam News\nNext coffee break was tentatively scheduled for 13 April 18:30 UTC to check out the Stories feature in Jetpack for possible use.\nPlease continue to provide feedback on the notes as we update our format. Please comment on GitHub Issue 194 or leave comments directly on notes posts. \nWordPress Publications\nWP Briefing: Episode 53: A Look at WordPress 6.2 “Dolphy”\nThe Month in WordPress:  March 2023 \nDeveloper Blog: What’s new for developers? (April 2023) \nWordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ social media updates\nNo stats were presented this week\nGitHub Issues\nNew Issues\nGet involved or Contribute tab for the About page — structure and the content #217\nOpen Issues\nGutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ and Blogging Campaign #199\nWe have kicked off an iteration of this campaign for the #WP20! It will start May 7 and run through the WP birthday of May 27. If you would like to help organize the campaign, please let the marketing team know in Slack.\n\nWordPress Media Outreach #135\nDiscussion is currently focused on press release process.\n\nCreate single source of reference/FAQ for Make WordPress contributors working on GitHub #167\nIdeally we could tackle this ticket before WCEU.\n\nUpdate Marketing Handbooks “Get Involved” pages to improve contribution process for Marketing contributors #169\nThis needs attention before WCEU\n\nWPPhotos campaign and the different ways to contribute #178 & Capturing Marketing Photos for the WordPress Photo Directory #189\nThe idea was to split the ‘How to contribute’ section of #178 into different GitHub issues\nNeeds to be finished before WCEU for contributor dayContributor Day Contributor Days are standalone days, frequently held before or after WordCamps but they can also happen at any time. They are events where people get together to work on various areas of https://make.wordpress.org/ There are many teams that people can participate in, each with a different focus. https://2017.us.wordcamp.org/contributor-day/ https://make.wordpress.org/support/handbook/getting-started/getting-started-at-a-contributor-day/.\n\nIdentify and update/create single page clarifying structure of WordPress pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party and theme ecosystem #179\nA marketing contributor has offered to work on this in the coming months.\n\nAdd ideas to the WP Campaigns Social Content Brainstorm doc #191\nThis ticket needs to be reviewed for good ideas that can be incorporated into the marketing team strategy/plan, and then revised for WCEU and additional “open brainstorming” opportunities\n\nCreate shortform video content from contributors for WordPress’ 20th Birthday! #190\nThis ticket needs to be updated and closed\n\nHelp create a plan for short form video on Tik Tok #114  AND Develop shortform video content and related copy with Learn Team #187\nThis week’s Marketing team coffee break focusing on Jetpack Stories is part of these efforts. We are looking at using Jetpack Stories to publish short-form vertical video on Learn\n\nCreate revised content for GitHub repo Contributor Day Handbook (cross-team collab) #192\nNeeds attention before WCEU\n\nDevelop a widgetWidget A WordPress Widget is a small block that performs a specific function. You can add these widgets in sidebars also known as widget-ready areas on your web page. WordPress widgets were originally created to provide a simple and easy-to-use way of giving design and structure control of the WordPress theme to the user. for WordPress dashboard to offer Mobile app installation #201\nContributor @OGlekler is developing tickets and doing research to determine how marketing can help with the Mobile app switch to dot-org/decoupling from Jetpack.\n\nLeveraging marketing strategies to eclipse WordPress competitors #202\nShould this be a discussion tticket first and then once campaigns are developed, those can be issues?\n\nWhat is WordPress? #205\nThis issue needs to be moved forward with project leadership. We have done outreach for comments.\n\nGithub recommended supporting docs #211\nPull requests have been submitted to help move along some of the GitHub documentation. We’ve got some key discussion happening in https://github.com/WordPress/Marketing-Team/issues/140, so please weigh in.\n\nClosing Soon\nFive for the Future Email Template for Contributors #18\nFlagged for FFTF contributors to be incorporated into FFTF docs\n\nOpen Floor\nNone\nNext Steps\nOur next meeting is 18 April, 2023 at 15:00 UTC.\nGitHub card for the next meeting: https://github.com/WordPress/Marketing-Team/issues/214\n#marketing-team, #meeting-notesLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nEstela Rueda\n\n10:38 am on April 17, 2023 \n\n\n\nTags: make.wordpress.org/docs ( 8 ), p2-xpost ( 69 )   \n\t\t\t\t\n\nX-post: Integrating the Mobile app documentation into HelpHub\n\n\nX-post from +make.wordpress.org/docs: Integrating the Mobile app documentation into HelpHubLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nSé Reed\n\n2:26 pm on April 11, 2023 \n\n\n\nTags: Marketing Team ( 152 ), Meeting Notes ( 87 )   \n\t\t\t\t\n\nNotes: Global Marketing Team meeting, 4 April 2023\n\n\nPlease add any comments on the related Marketing Tasks GitHub issue or in the #marketing channel on the Make WordPress SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/.. \nThis meeting was organized on GitHubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/ card #198\nLeading the meeting: @robinwpdeveloper\nTaking notes: @sereedmedia \nLink to attendance thread in Slack: https://wordpress.slack.com/archives/C0GKJ7TFA/p1680620501873609\nLink to meeting start in Slack: https://wordpress.slack.com/archives/C0GKJ7TFA/p1680620406262559\nTeam News\nThe next coffee break will be April 6 (note: this was postponed)\nPlease continue to provide feedback on the notes as we update our format. Please comment on GitHub Issue 194 or leave comments directly on notes posts. \nWe have closed the poll regarding the attendance process: 60% of those voting said no attendance list was needed in the notes, so, no attendance listed in the notes it will be! We will continue to link to the Slack attendance thread. \nWordPress Publications\nThe Month in WordPress: The Month in WordPress – March 2023\nWordPress Briefing:  Episode 53: A Look at WordPress 6.2 “Dolphy” \nWordPress Developer Blog: What’s new for developers? (April 2023)\nWordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ social media updates\nThere is new discussion on the Amplification request form #140\nWordPress had an excellent week in our social campaigns improving in all metrics and showing strong performances across all channels individually. Overall, net follower growth is 1,314, up significantly from the previous week with 954 new followers. The performance centered around WP 6.2 release as this campaign drove an amazing response from our followers who enjoyed discussing the release with us. Our engagement rate jumped to 2.4% over the week when we are usually satisfied with an overall 2% engagement rate which shows the level of participation from our followers to get on board and discuss the next version of WordPress.\nThe overall performance of the WP 6.2 campaign was strong enough to end up with all 3 of the top 3 posts for the week. The excitement during the release and the following day garnered lots of attention.\nHere is a look at some of the performance numbers for the last week:\nImpressions: 526,629\nEngagements: 12,794\nLink clicks: 3,032\nEngagement Rate: 2.4%\n\nGitHub Issues\nNew Issues\nMarketing Team text for WCEU Contributor DayContributor Day Contributor Days are standalone days, frequently held before or after WordCamps but they can also happen at any time. They are events where people get together to work on various areas of https://make.wordpress.org/ There are many teams that people can participate in, each with a different focus. https://2017.us.wordcamp.org/contributor-day/ https://make.wordpress.org/support/handbook/getting-started/getting-started-at-a-contributor-day/. #212\nWCEU Contributor Day Team looking for some details on each Make Team.\n\nGithub recommended supporting docs #211\nPer thread requests, we have replaced the CoC page with a direct link to the CoC instead of including a copy of the text\n\nOpen Issues\nGutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ and Blogging Campaign #199\nCollaboration meeting for this initiative is set for Thursday April 6, 15:00 UTC\n\nWordPress Media Outreach #135\nCould this be automated to send out using a form like the Amplification form?\n\nCreate single source of reference/FAQ for Make WordPress contributors working on GitHub #167\nIdeally this would be complete by WCEU\n\nWPPhotos campaign and the different ways to contribute #178\nThis campaign will be useful again for WCEU, but we need to make a new ticket for this and include links to the Handbook for details\n\nIdentify and update/create single page clarifying structure of WordPress pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party and theme ecosystem #179\nA marketing contributor has offered to work on this in the coming months.\n\nCapturing Marketing Photos for the WordPress Photo Directory #189\nThis will be a more relevant ticket to update for WCEU\n\nCreate shortform video content from contributors for WordPress’ 20th Birthday! #190\nThis ticket needs to be updated and closed\n\nHelp create a plan for short form video on Tik Tok #114  AND Develop shortform video content and related copy with Learn Team #187 AND Develop a widgetWidget A WordPress Widget is a small block that performs a specific function. You can add these widgets in sidebars also known as widget-ready areas on your web page. WordPress widgets were originally created to provide a simple and easy-to-use way of giving design and structure control of the WordPress theme to the user. for WordPress dashboard to offer Mobile app installation #201\nThere are notes on the Collaboration Session for these issues here: https://make.wordpress.org/marketing/2023/04/04/notes-global-marketing-team-meeting-28-march-2023/\n\nWhat is WordPress? #205\nWorking suggestions are in place  but nothing concluded yet. Once we do it is likely this will go on the front page of wordpress.org.\n\nOpen Floor\nInitiatives to bring aboard new contributors: https://core.trac.wordpress.org/ticket/23348\nHow was last week’s Collaboration Session?\nfantastic and that it should be a regular thing that the team does\nengaging/more fun, and felt it moved things along quicker on a particular topic.\n\nNext Steps\nOur next meeting is 11 April, 2023 at 15:00 UTC.\nGitHub card for the next meeting: https://github.com/WordPress/Marketing-Team/issues/210\n#marketing-team, #meeting-notesLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nBen Greeley\n\n3:37 pm on April 10, 2023 \n\n\n\nTags: make.wordpress.org/meta ( 8 ), p2-xpost ( 69 )   \n\t\t\t\t\n\nX-post: WordPress.org Redesign Update\n\n\nX-post from +make.wordpress.org/meta: WordPress.org Redesign UpdateLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nCourtney Robertson\n\n2:30 pm on April 8, 2023 \n\n\n\nTags: make.wordpress.org/training ( 4 ), p2-xpost ( 69 )   \n\t\t\t\t\n\nX-post: Proposal: Creating Learning Pathways for Learn WordPress\n\n\nX-comment from +make.wordpress.org/training: Comment on Proposal: Creating Learning Pathways for Learn WordPressLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n \nSé Reed\n\n12:30 am on April 4, 2023 \n\n\n\nTags: Jetpack, Meeting Notes ( 87 ), Mobile, Short-form video, Statistics   \n\t\t\t\t\n\nNotes: Global Marketing Team meeting, 28 March 2023\n\n\nPlease add any comments on the related Marketing Tasks GitHub issue or in the #marketing channel on the Make WordPress SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/.. \nThis meeting was organized on GitHubGitHub GitHub is a website that offers online implementation of git repositories that can easily be shared, copied and modified by other developers. Public repositories are free to host, private repositories require a paid subscription. GitHub introduced the concept of the ‘pull request’ where code changes done in branches by contributors can be reviewed and discussed before being merged be the repository owner.  https://github.com/ card #198\nLeading the meeting:@santanainniss and @sereedmedia\nTaking notes: @sereedmedia\nLink to attendance thread: https://wordpress.slack.com/archives/C0GKJ7TFA/p1680012168918869\nLink to meeting start: https://wordpress.slack.com/archives/C0GKJ7TFA/p1680012041922539\nTeam News\nDue to the timezone change, the team reps wanted to host a special longer meeting. The first segment will be the meeting as usual. The second segment will be an in-channel deep dive on some open GitHub issues.\nWe’re still collecting feedback on the notes as we update our format. Please comment on GitHub Issue 194 or leave comments directly on notes posts. We’ll collect feedback on what’s been shipped, and iterate!\nUpcoming Contributors Days:\nYoast Contributor DayContributor Day Contributor Days are standalone days, frequently held before or after WordCamps but they can also happen at any time. They are events where people get together to work on various areas of https://make.wordpress.org/ There are many teams that people can participate in, each with a different focus. https://2017.us.wordcamp.org/contributor-day/ https://make.wordpress.org/support/handbook/getting-started/getting-started-at-a-contributor-day/.: April 05, 2023, 10:00 – 15:30 – (UTC +02:00)\nWCEU Contributor Day: Thursday 8 June \n\nThe team held a coffee break and worked collaboratively on moving docs from GitHub to the Marketing Handbook #180\nWordPress Publications\nIntroducing the Developer Blog:  https://wordpress.org/news/2023/03/introducing-the-wordpress-developer-blog/\nWordPress News: https://wordpress.org/news/2023/03/wordpress-6-2-release-candidate-3/\nWordPress Briefing: https://wordpress.org/news/2023/03/episode-52-phase-three-with-hector-prieto/\nWordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ social media updates\nWordPress improved quite a bit this week as we saw performances across several campaigns jump in engagement. There was a drop in Twitter followers this week, but not related to content performance, but rather a small number of deactivated accounts on the platform. Despite the drops in Twitter, we still managed to improve our score by 991 net-new followers. However, the real winner this week is in our engagement. While we saw fewer impressions overall, we actually increased our engagement levels by 46.3% (7,045 total) and a 2.3% engagement percentage based on impressions.\nThe overall performance came from the WP 6.2 campaign. This campaign ended up with all 3 of the top 3 posts for the week, as excitement builds for the release and has garnered lots of attention.\nHere is a look at some of the performance numbers for the last week:\nImpressions: 300,977\nEngagements: 7,045\nLink clicks: 2,030\nEngagement Rate: 2.3%\n\nCollaboration Session\n#114 Discussion: Create plan for short-form video content on Tiktok\n#187 Develop shortform video content and related copy with Learn Team\nThis conversation focused on creating a plan for short-form video content on TikTok and developing short-form video content and related copy with Learn Team. Jetpack offers a Story BlockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. that could be used to make short-form content for TikTok, and LearnWP has Jetpack enabled. Currently, the Learn team is focusing more on clips and shorter versions of more traditional tutorials, but the original marketing ticket was intended to look at activating the WordPress TikTok account and using that vertical, quick in-and-out format. \nThe group discussed using the same videos on several sources in a vertical format, as well as multi-purposing the content to maximize its use. They suggest creating bite-sized hacks/tips content from existing tutorials instead of creating standalone, unconnected content. The group also plans to explore using the Jetpack stories block on a disposable site and to hold a Zoom session to discuss it. \nThe team discussed the use of TikTok for WordPress promotion, and Dan expressed his reservations about its effectiveness due to policy and government issues, the fact that people don’t go to TikTok to learn about WordPress, and that TikTok wouldn’t provide long-term value as a storage place for videos. However, the team pointed out that vertical videos could also be used on other platforms, such as Facebook, Instagram, and Jetpack Stories. The team also noted that TikTok can be viewed from the viewpoint that it is now the second-leading search engine for younger adults behind Google. When viewed as discovery tool rather than just a friend-to-friend chat app, it begins to see greater importance. \nThe team also discussed the need for content creators and suggested that the Learn/training team would be the primary creators, and that the person on camera doesn’t have to be the one who knows the content. Santana suggested revisiting a proposal to launch a pilot program, “A low-effort, time-limited test could help us begin answering some of those questions.”\n The team decided to dedicate the next coffee break to explore Jetpack Stories and how that feature could be used to develop and publish short-form vertical content on WP.org.\n\nGoogle Analytics Statistics for Docs and Learn\nThis conversation focused on whether there are statistics available for WP.org docs sites and who has access to them. Estelaris asked if there were any statistics available. Courtney suggested LearnWP is looking for similar stats. EidolonNight responded that they had access to Google Analytics and had previously provided stats to Hugh for Training; they can provide data on one-off requests, but there are some unspecified issues and caveats with the current Google Analytics setup. The LearnWP team is looking for more data on video playtime and would like to connect GA to their team email that only Learn Faculty have logins for. Dan Soschin will need to do some digging on Learn video performance as there have been difficulties connecting the dots in the past.\n\n#201 Develop a widgetWidget A WordPress Widget is a small block that performs a specific function. You can add these widgets in sidebars also known as widget-ready areas on your web page. WordPress widgets were originally created to provide a simple and easy-to-use way of giving design and structure control of the WordPress theme to the user. for WordPress dashboard to offer Mobile app installation\n#204 Mobile app promotion campaign\nThe conversation centered around developing a widget for the WordPress dashboard to offer mobile app installation and promoting mobile app marketing campaigns. The team discussed how the mobile app could be promoted and its possible promotion with a link in the WordPress dashboard. A member requested feedback from the mobile team about the idea, and another suggested that planning for the campaign should start early on, so they are ready when the mobile upgrades are complete. The team also mentioned the new mobile support forumSupport Forum WordPress Support Forums is a place to go for help and conversations around using WordPress. Also the place to go to report issues that are caused by errors with the WordPress code and implementations. that the mobile team has been working on for a few months.\nThe group continued the discussion of the mobile app dashboard widget, suggesting that it should be a marketing tool that links to a download page on dot-org with details and various download links, whereas the current Mobile page is extremely sparse. Many members emphasized that the mobile app can bring a lot of value to WordPress users, but many of them are not aware that it even exists. The team discussed additional ideas for promoting the mobile app, such as dashboard widgets, materials for meetups, and more. The group also suggested adding the mobile team to the conversation to provide more information and support for the promotion campaign. Three team members will work to combine the two tickets into a more specific ticket covering the mobile conversation to move it forward.\n\nNext Steps\nOur next meeting is 04 April, 2023 at 15:00 UTC.\nGitHub card for the next meeting: https://github.com/WordPress/Marketing-Team/issues/208\n#jetpack, #meeting-notes, #mobile, #short-form-video, #statisticsLogin to ReplyTo-do\n\n\n\n\n\n\n\nPost navigation\n← Older posts\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\nEmail Updates\n\n\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 284 other subscribers\t\t\t\t\n\nRecent UpdatesRecent CommentsTo DoDoneNo RepliesRecent UpdatesRecent CommentsTo DoDoneNo RepliesRecent Activity\n\n\n\t\t\tTeam Pledges\n\t\t\n\n1509 people have pledged time to contribute to Marketing Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/marketing/",
        "https://make.wordpress.org/marketing/welcome/",
        "https://make.wordpress.org/marketing/handbook/",
        "https://github.com/WordPress/Marketing-Team/issues",
        "https://github.com/orgs/WordPress/projects/21",
        "https://github.com/WordPress",
        "https://wordpress.slack.com/archives/C0GKJ7TFA",
        "https://make.wordpress.org/marketing/handbook/about/",
        "http://wordpress.slack.com/messages/marketing/",
        "https://chat.wordpress.org/",
        "https://make.wordpress.org/meetings/",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1500",
        "https://make.wordpress.org/marketing/2021/01/13/forthcoming-diary-dates/",
        "#",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://make.wordpress.org/marketing/tag/community/",
        "https://make.wordpress.org/marketing/tag/contribute/",
        "https://make.wordpress.org/marketing/tag/marketing-team/",
        "https://make.wordpress.org/marketing/tag/wp20/",
        "https://make.wordpress.org/marketing/2023/05/02/20-days-to-celebrate-20-years-of-wordpress-from-blogs-to-blocks/",
        "https://make.wordpress.org/marketing/tag/wp20/",
        "https://make.wordpress.org/marketing/tag/wp20/",
        "https://make.wordpress.org/marketing/tag/wp20/",
        "https://meta.trac.wordpress.org/ticket/6938",
        "https://make.wordpress.org/marketing/tag/wp20/",
        "https://github.com/WordPress/Marketing-Team/issues/220#issuecomment-1517053865",
        "https://make.wordpress.org/marketing/tag/fromblogstoblocks/",
        "https://make.wordpress.org/marketing/tag/community/",
        "https://make.wordpress.org/marketing/tag/contribute/",
        "https://make.wordpress.org/marketing/tag/marketing-team/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F05%2F02%2F20-days-to-celebrate-20-years-of-wordpress-from-blogs-to-blocks%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/webtechpooja/",
        "https://profiles.wordpress.org/webtechpooja/",
        "https://make.wordpress.org/marketing/tag/make-wordpress-org-updates/",
        "https://make.wordpress.org/marketing/tag/p2-xpost/",
        "https://make.wordpress.org/marketing/2023/05/01/xpost-whats-new-on-learn-wordpress-in-april-2023/",
        "https://make.wordpress.org/updates/",
        "https://make.wordpress.org/updates/2023/05/01/whats-new-on-learn-wordpress-in-april-2023/#comment-6091",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F05%2F01%2Fxpost-whats-new-on-learn-wordpress-in-april-2023%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/jpantani/",
        "https://profiles.wordpress.org/jpantani/",
        "https://make.wordpress.org/marketing/tag/showcase/",
        "https://make.wordpress.org/marketing/2023/04/19/showcase-submission-guidelines/",
        "https://make.wordpress.org/project/2023/04/17/revitalizing-the-showcase/(opens%20in%20a%20new%20tab)",
        "https://wordpress.org/",
        "https://github.com/WordPress/Marketing-Team/issues/221",
        "https://make.wordpress.org/marketing/tag/showcase/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F19%2Fshowcase-submission-guidelines%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/desrosj/",
        "https://profiles.wordpress.org/desrosj/",
        "https://make.wordpress.org/marketing/tag/make-wordpress-orgcommunity/",
        "https://make.wordpress.org/marketing/tag/p2-xpost/",
        "https://make.wordpress.org/marketing/2023/04/19/xpost-cultivating-more-effective-contributing-on-contributor-days/",
        "https://make.wordpress.org/community/",
        "https://make.wordpress.org/community/2023/04/19/cultivating-more-effective-contributing-on-contributor-days/#comment-30834",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F19%2Fxpost-cultivating-more-effective-contributing-on-contributor-days%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/santanainniss/",
        "https://profiles.wordpress.org/santanainniss/",
        "https://make.wordpress.org/marketing/tag/marketing-team/",
        "https://make.wordpress.org/marketing/tag/meeting-notes/",
        "https://make.wordpress.org/marketing/2023/04/18/notes-global-marketing-team-meeting-11-april-2023/",
        "https://github.com/orgs/WordPress/projects/21",
        "https://wordpress.slack.com/archives/C0GKJ7TFA",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://github.com/",
        "https://github.com/WordPress/Marketing-Team/issues/210",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://profiles.wordpress.org/santana/",
        "https://wordpress.slack.com/archives/C0GKJ7TFA/p1681225212224739%5C",
        "https://wordpress.slack.com/archives/C0GKJ7TFA/p1681225264757389",
        "https://wordpress.org/news/2023/04/episode-53-a-look-at-wordpress-6-2-dolphy/",
        "https://wordpress.org/news/2023/04/the-month-in-wordpress-march-2023/",
        "https://developer.wordpress.org/news/2023/04/whats-new-for-developers-april-2023/",
        "https://wordpress.org/",
        "https://github.com/WordPress/Marketing-Team/issues/217",
        "https://wordpress.org/gutenberg/",
        "https://github.com/WordPress/Marketing-Team/discussions/199",
        "https://make.wordpress.org/marketing/tag/wp20/",
        "https://github.com/WordPress/Marketing-Team/issues/135",
        "https://github.com/WordPress/Marketing-Team/issues/167",
        "https://github.com/WordPress/Marketing-Team/issues/169",
        "https://github.com/WordPress/Marketing-Team/issues/178",
        "https://github.com/WordPress/Marketing-Team/issues/189",
        "https://make.wordpress.org/",
        "https://2017.us.wordcamp.org/contributor-day/",
        "https://make.wordpress.org/support/handbook/getting-started/getting-started-at-a-contributor-day/",
        "https://github.com/WordPress/Marketing-Team/issues/179",
        "https://github.com/WordPress/Marketing-Team/issues/191",
        "https://github.com/WordPress/Marketing-Team/issues/190",
        "https://github.com/WordPress/Marketing-Team/issues/114",
        "https://github.com/WordPress/Marketing-Team/issues/187",
        "https://github.com/WordPress/Marketing-Team/issues/192",
        "https://github.com/WordPress/Marketing-Team/issues/201",
        "https://profiles.wordpress.org/oglekler/",
        "https://github.com/WordPress/Marketing-Team/issues/205",
        "https://github.com/WordPress/Marketing-Team/pull/211",
        "https://github.com/WordPress/Marketing-Team/issues/140",
        "https://github.com/WordPress/Marcomms-Rolling-tasks/issues/18",
        "https://make.wordpress.org/marketing/tag/marketing-team/",
        "https://make.wordpress.org/marketing/tag/meeting-notes/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F18%2Fnotes-global-marketing-team-meeting-11-april-2023%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/estelaris/",
        "https://profiles.wordpress.org/estelaris/",
        "https://make.wordpress.org/marketing/tag/make-wordpress-org-docs/",
        "https://make.wordpress.org/marketing/tag/p2-xpost/",
        "https://make.wordpress.org/marketing/2023/04/17/xpost-integrating-the-mobile-app-documentation-into-helphub/",
        "https://make.wordpress.org/docs/",
        "https://make.wordpress.org/docs/2023/04/17/integrating-the-mobile-app-documentation-into-helphub/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F17%2Fxpost-integrating-the-mobile-app-documentation-into-helphub%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://make.wordpress.org/marketing/tag/marketing-team/",
        "https://make.wordpress.org/marketing/tag/meeting-notes/",
        "https://make.wordpress.org/marketing/2023/04/11/notes-global-marketing-team-meeting-4-april-2023/",
        "https://github.com/orgs/WordPress/projects/21",
        "https://wordpress.slack.com/archives/C0GKJ7TFA",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://github.com/",
        "https://github.com/WordPress/Marketing-Team/issues/198",
        "https://profiles.wordpress.org/robinwpdeveloper/",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://wordpress.slack.com/archives/C0GKJ7TFA/p1680620501873609",
        "https://wordpress.slack.com/archives/C0GKJ7TFA/p1680620406262559",
        "https://wordpress.org/news/2023/04/the-month-in-wordpress-march-2023/",
        "https://wordpress.org/news/2023/04/episode-53-a-look-at-wordpress-6-2-dolphy/",
        "https://developer.wordpress.org/news/2023/04/whats-new-for-developers-april-2023/",
        "https://wordpress.org/",
        "https://github.com/WordPress/Marketing-Team/issues/140",
        "https://make.wordpress.org/",
        "https://2017.us.wordcamp.org/contributor-day/",
        "https://make.wordpress.org/support/handbook/getting-started/getting-started-at-a-contributor-day/",
        "https://github.com/WordPress/Marketing-Team/issues/212",
        "https://github.com/WordPress/Marketing-Team/pull/211",
        "https://wordpress.org/gutenberg/",
        "https://github.com/WordPress/Marketing-Team/discussions/199",
        "https://github.com/WordPress/Marketing-Team/issues/135",
        "https://github.com/WordPress/Marketing-Team/issues/167",
        "https://github.com/WordPress/Marketing-Team/issues/178",
        "https://github.com/WordPress/Marketing-Team/issues/179",
        "https://github.com/WordPress/Marketing-Team/issues/189",
        "https://github.com/WordPress/Marketing-Team/issues/190",
        "https://github.com/WordPress/Marketing-Team/issues/114",
        "https://github.com/WordPress/Marketing-Team/issues/187",
        "https://github.com/WordPress/Marketing-Team/issues/201",
        "https://make.wordpress.org/marketing/2023/04/04/notes-global-marketing-team-meeting-28-march-2023/",
        "https://github.com/WordPress/Marketing-Team/issues/205",
        "https://core.trac.wordpress.org/ticket/23348",
        "https://github.com/WordPress/Marketing-Team/issues/210",
        "https://make.wordpress.org/marketing/tag/marketing-team/",
        "https://make.wordpress.org/marketing/tag/meeting-notes/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F11%2Fnotes-global-marketing-team-meeting-4-april-2023%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/bengreeley/",
        "https://profiles.wordpress.org/bengreeley/",
        "https://make.wordpress.org/marketing/tag/make-wordpress-orgmeta/",
        "https://make.wordpress.org/marketing/tag/p2-xpost/",
        "https://make.wordpress.org/marketing/2023/04/10/xpost-wordpress-org-redesign-update-2/",
        "https://make.wordpress.org/meta/",
        "https://make.wordpress.org/meta/2023/04/10/wordpress-org-redesign-update-2/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F10%2Fxpost-wordpress-org-redesign-update-2%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/courane01/",
        "https://profiles.wordpress.org/courane01/",
        "https://make.wordpress.org/marketing/tag/make-wordpress-org-training/",
        "https://make.wordpress.org/marketing/tag/p2-xpost/",
        "https://make.wordpress.org/marketing/2023/04/08/xpost-proposal-creating-learning-pathways-for-learn-wordpress/",
        "https://make.wordpress.org/training/",
        "https://make.wordpress.org/training/2023/04/05/proposal-creating-learning-pathways-for-learn-wordpress/#comment-3808",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F08%2Fxpost-proposal-creating-learning-pathways-for-learn-wordpress%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://make.wordpress.org/marketing/tag/meeting-notes/",
        "https://make.wordpress.org/marketing/2023/04/04/notes-global-marketing-team-meeting-28-march-2023/",
        "https://github.com/orgs/WordPress/projects/21",
        "https://wordpress.slack.com/archives/C0GKJ7TFA",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://github.com/",
        "https://github.com/WordPress/Marketing-Team/issues/198",
        "https://profiles.wordpress.org/santanainniss/",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://profiles.wordpress.org/sereedmedia/",
        "https://wordpress.slack.com/archives/C0GKJ7TFA/p1680012168918869",
        "https://wordpress.slack.com/archives/C0GKJ7TFA/p1680012041922539",
        "https://make.wordpress.org/",
        "https://2017.us.wordcamp.org/contributor-day/",
        "https://make.wordpress.org/support/handbook/getting-started/getting-started-at-a-contributor-day/",
        "https://github.com/WordPress/Marketing-Team/issues/180",
        "https://wordpress.org/",
        "https://github.com/WordPress/Marketing-Team/issues/114",
        "https://github.com/WordPress/Marketing-Team/issues/187",
        "https://github.com/WordPress/Marketing-Team/issues/201",
        "https://github.com/WordPress/Marketing-Team/issues/204",
        "https://wordpress.org/mobile/",
        "https://make.wordpress.org/marketing/tag/jetpack/",
        "https://make.wordpress.org/marketing/tag/meeting-notes/",
        "https://make.wordpress.org/marketing/tag/mobile/",
        "https://make.wordpress.org/marketing/tag/short-form-video/",
        "https://make.wordpress.org/marketing/tag/statistics/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fmarketing%2F2023%2F04%2F04%2Fnotes-global-marketing-team-meeting-28-march-2023%2F%23respond&locale=en_US",
        "#",
        "https://make.wordpress.org/marketing/page/2/",
        "#",
        "https://make.wordpress.org/marketing/",
        "https://make.wordpress.org/marketing/?o2_recent_comments=1",
        "https://make.wordpress.org/marketing?resolved=unresolved",
        "https://make.wordpress.org/marketing?resolved=resolved",
        "https://make.wordpress.org/marketing/?replies=none",
        "https://make.wordpress.org/marketing/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}