{
    "title": "The Community for WordPress Professionals • Post Status",
    "body": "\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nAboutExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\nAccount\n Login\n\n\n\n\nSearch\n\n\n\n\n\nJoin\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nThe Community for the Business of WordPress\nPost Status is the membership community for people who grow and sustain the WordPress economy.\nOur goal is for all of us who make up the WordPress community to give and grow together. \nWe’re here for anyone seeking insight, analysis, guidance, and a community centered around the WordPress ecosystem. \nJoin Today! Our Vision\n\n\n\n\n\n\n\n\n\nChoose an Individual or Business Membership\nJoin our membership today! We have individual and business memberships available. Let us know if you need help finding the right plan for you!\n\nProfessionalProfessional+Agency OwnerProduct FounderPartner\n\n\n\nProfessional\nAre you working with WordPress every day? Do you want to stay up-to-date with the WordPress ecosystem? Join Post Status today! You’ll get access to our weekly newsletter for WordPress professionals and many points of contact for exploring deeper participation in our community.\n\n\nGET AHEAD & STAY AHEADGet the TL;DR of important WordPress news and events in our Weekly Newsletter.CAREER EXPOSURE & PROFESSIONAL BELONGING Claim your Professional Profile in the Post Status Index. Be seen and known as part of the premiere Professional Community for WordPress.\nJoin today for FREE\n\n\n\n\n\n\nProfessional+\nAre you working in business development, sales, marketing, or community management for a WordPress company? Do you need to build and develop great relationships in the WordPress ecosystem? Join Post Status today and get started!\n\n\n\nGET & STAY CONNECTED• Get the TL;DR of important WordPress news and events in our Weekly Newsletter.• Access to the Post Status Slack Community• Access to Members-Only Content• Access to Weekly Member HuddlesCAREER EXPOSURE & PROFESSIONAL BELONGING Claim your Professional Profile in the Post Status Index. Be seen and known as part of the premiere Professional Community for WordPress.\nJoin today for $197/year\nScholarships available, contact us or better yet … ask your boss/company to sponsor you! \n\n\n\n\n\n\nAgency Owners\nDo you own and run a service-oriented WordPress business? Stay informed about the WordPress ecosystem and connect with the top professionals in it. Find the talent you need for your growing agency. \n\n\nGET & STAY CONNECTED• A Professional+ Membership• Private Agency Owner Slack Channel Access• Access & Discounts to Post Status Business EventsFILL EMPTY SEATS WITH GREAT PEOPLE• Unlimited Job Listings — Only available to Business Members! Your listings will be promoted in our newsletters and social networks. BOOST YOUR AGENCY’S EXPOSUREPremium Agency Listing in Post Status Index\nJoin today for $500/year\n\n\n\n\n\n\nProduct Founders\nDo you own a WordPress product business? Stay connected to the WordPress ecosystem and build and develop great relationships with other founders to grow your business. Find the talent and support you need!\n\n\nGET & STAY CONNECTED• A Professional+ Membership• Private Product Founder Slack Channel• Access & Discounts to Post Status Business EventsFILL EMPTY SEATS WITH GREAT PEOPLE• Unlimited Job Listings — Only available to Business Members! Your listings will be promoted in our newsletters and social networks.BOOST YOUR PRODUCT’S EXPOSUREPremium Product Listing in Post Status Index\nJoin today for $500/year\n\n\n\n\n\n\nPartner Membership\nPost Status Partners share and support our mission of investing in the Open Web by growing the WordPress ecosystem. We support our partners by connecting them and promoting their work as they grow and give back.\nGet growth-oriented guidance, networking opportunities, peer support, unique group experiences, and greater insight into the industry as a Post Status Partner.\n\n\nGET & STAY CONNECTED TO COMMUNITY— YOU AND YOUR KEY LEADERS• Five (5) Professional+ Memberships for you and your key leaders.• Access & Discounts to Post Status Business EventsFILL EMPTY SEATS WITH GREAT PEOPLE• Unlimited Job Listings — Only available to Business Members! Your listings will be promoted in our newsletters and social networks. BOOST YOUR ORGANIZATION’S EXPOSURE• Three (3) Premium Partner Profile Listings in the Post Status Index.• Promote Your Events in the Post Status Events Calendar. They will be included in our newsletters and social networks.Plus, Dedicated Support and much more…\nJoin today for $5000/year\n\n\n\n\n\n\n\n\nPost Status Member Benefits \n\n\n\n\n\n\n\nEngaging Community. Access to the Post Status members-only Slack community and Weekly Member Huddles to connect virtually and discuss challenges and opportunities. \nGrow Your Business or Career. Access to the Post Status Job Board, which links to our member and business directories. And our Get Hired project, which fosters an inclusive workforce and supportive workplaces.\nGet the TL;DR — the WordPress News that Matters. The weekly Post Status newsletter provides insights, news, events, and opportunities in the WordPress community.\nDiscounts. Exclusive members-only offers from other members.\nSupport. Dedicated support to help connect you to other members with similar businesses or interests.\nNetworking and Growth Events. Post Status events provide members with a safe space to openly discuss challenges we face. We focus on offering guidance, connection, and support to grow your business.\nAdvocacy. Uniting our voices to guide the future of WordPress.\n\n\n\n\n\n\n\n\n\nGive \nPost Status members GIVE each other guidance to grow their WordPress businesses. From Founders to Freelancers, Post Status is a place for like-minded people to share the rich diversity of their experiences and perspectives. \nThe Post Status community gives WordPress Professionals a space to talk about the challenges we face and how to overcome them. We give each other frameworks, analysis, insights, and perspectives to help each other reach our goals. We share from our own experiences and a place of curiosity. We desire to make WordPress a true community of growth.\nPost Status can give you a sense of belonging and identity based in the values and goals we share. We’re all WordPress business owners, so we understand the highs and lows of entrepreneurship.\nPost Status is a place to GIVE to and share with one another.\n\n\n\n\nGrow \n\n\n\n\nPost Status members all want to grow their businesses. Growing businesses need support. The Post Status community gives you the support you need to grow — yourself and your business. \nNeed something done or figured out to help your business grow? Reach out and let us know. There are members who can help!\n\n\n\nPost Status provides a safe place for communication, questions, and connection with others who work in WordPress. We want to help you grow your knowledge through each other. We also want to help you build your own community within Post Status. \nPost Status wants to help you and your business GROW.\n\n\n\n\n\n\n\n\nTogether \nThousands of heads are better than one. Together, there’s no limit to what we can accomplish. That’s why Post Status wants to bring our professional community together. \nWe help our members unite through our fast-growing Slack community, events, and personal introductions. Partnership deals and acquisitions? A lot of those start with Post Status! \nWe succeed together by building each other up. Post Status brings people together to build better businesses and make the WordPress community exceptional. \n\n\n\n\n\n\n\n\n1Give Post Status provides a space for people to come together and solve problems. You’ll give knowledge to others and learn from them too. \n\n\n2Grow Post Status helps you grow your business and your network. We help you connect with like-minded people and potential business partners. \n\n\n3Together Post Status unites the WordPress community. We can build better networks, grow our businesses, and create a more exceptional WordPress together.  \n\n\n\n\nFrequently Asked Questions\nContact our Support Desk if you need assistance. \nGet Support →\n\n\n\nWhat Events does Post Status offer?\nPost Status offers several events throughout the year, both in-person and online. Some of our events are free to Business members and some have a cost associated with them. You can find a list of our current events here. \n\nWhy do Post Status Events have a cost, If I am already paying for a membership?\nWe try to keep the price for our events as low as possible, however we do charge a fee to help us recover the cost of the event, and to provide the best events for our Guests. \n\nHow can I know what Slack Channels are available? \nPost Status has Slack channels both public and private groups. Our full list of Channels will be available in the navigation soon. If you cannot find a channel you are looking for please reach out to our help center. We will gladly help you find the right channel for you. \n\nDo I have to be a member to post a job?\nYes, you do have to be a business member to post job listings at the Agency, Product or Partner level.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status is proudly supported by great partners\nPagelyGravity FormsElementorA2 HostingPressable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\nTwitter\nYouTube\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© Post Status, 2023 | Made with WordPress | Privacy Policy | Website Terms\n \n\n\n\n\n\n\n\n\n\n\nScroll to top\nScroll to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAboutExpand child menuExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand child menuExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand child menuExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand child menuExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand child menuExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu Close\n \n\n\n\n\nSearch for:\n\n\n\nSearch\n \n\n\n",
    "links": [
        "#main",
        "https://poststatus.com/",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner",
        "https://poststatus.com/login",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/",
        "https://poststatus.com/wordpress-20",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/contact/",
        "#Pro",
        "#Pro+",
        "#Agency",
        "#Founder",
        "#Partner",
        "https://poststatus.com/join/?level=1",
        "https://poststatus.com/join/?level=2",
        "https://poststatus.com/contact/",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/join/?level=3",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/join/?level=4",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/product/partner-membership/",
        "https://poststatus.com/join/?level=5",
        "https://poststatus.slack.com/",
        "https://poststatus.com/jobs",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/organizations/",
        "https://poststatus.com/get-hired",
        "https://poststatus.com/newsletter/",
        "https://poststatus.com/contact/",
        "/cdn-cgi/l/email-protection#c6b5b3b6b6a9b4b286b6a9b5b2b5b2a7b2b3b5e8a5a9ab",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner",
        "https://poststat.us/pagely",
        "https://poststat.us/gravity-forms",
        "https://poststat.us/elementor",
        "https://poststat.us/a2-hosting",
        "https://poststat.us/pressable",
        "https://www.facebook.com/poststatusblog",
        "https://twitter.com/post_status",
        "https://www.youtube.com/c/PostStatus",
        "https://poststatus.com/privacy-policy",
        "https://poststatus.com/website-terms",
        "#wrapper",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner"
    ]
}