{
    "title": "Technology Tools to Get Started at Stanford | University IT",
    "body": "\nSkip to content\nSkip to site navigation\n\n\n\n\n\n\n\n   \n\n\n\nUniversity IT\n\n\n\n\n\n\n\n\n Navigation menu    \n\n\nExplore services View all services\nView services approved for High Risk Data\n\nI want to ... Use video conferencing tools\nGet IT training\nCreate web forms and surveys\nSet up email\nSet up two-step authentication\nSponsor a SUNet ID\nGet software\nConnect to the network\nSecure my mobile device\nGet website hosting\nPublish a website\nGet started with IT at Stanford\n\nLog into ... Email and calendar\nZoom video conferencing\nMedicine Box file storage\nMailing lists\nStanford Accounts\nMyDevices\nQualtrics survey tool\nGoogle Drive\n\nUnderstanding single sign on\n\nView alerts\nGet support Find answers\nRequest something\nGet help\n\n Open Search\n\n\n   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTechnology Tools to Get Started at Stanford\nWe think you’ll find these technology resources immediately valuable as you start at Stanford.\n\n\n\n\n\n \n   \n\n\n \n\n\nUniversity IT is the central provider of technology services for the Stanford community, commonly used and supported by IT professionals at schools and units across campus. Together, our goal is to ensure we provide the technology services, systems, and support that you need to do your work.\nLocal IT professionals in individual schools and units may provide additional or alternative services and support. Be sure to check with them about specific technology resources available to you.\n\n\n\n\nEmail\n\n\nAccess your email from any computer with a web browser and internet connection using Stanford Webmail. Configure an email client on your desktop or mobile device. Manage your out-of-office email message, forward your email, create email aliases, and more.\n\n\n\n\nUniversity IT Service Desk\n\n\nYou may have local IT professionals on staff to help you, or your area may contract with University IT’s Computer Resource Consultants (CRC) to provide local IT support.\nEither way, the University IT Service Desk is available seven days a week to assist you with computer or communications issues, or route your request to the right person in your area to provide that local support.\nChat live with a specialist, submit a help ticket or call 5-HELP (4357) from any Stanford phone (or 650-725-4357 from all other phones).\n\n\n\n\nStanford Services IT Portal\n\n\nUse the Stanford Services IT Portal to:\n\nBrowse self-help resources for answers to common questions and solutions to technical problems.\nExplore the catalog of IT services to find what you need, and submit a request for a University IT service.\nSubmit a Help ticket to get help or report a problem.\n\n\n\n\n\nDocument Management Tools\n\n\nStanford provides a variety of free document management tools at no charge to help you store, share and collaborate on files. These tools provide additional data protection beyond the publicly available versions to keep Stanford information secure, and many provide integrations with other tools.\nYou can take advantage of one, some or all of the document management tools simultaneously. They include Google Drive, OneDrive for Business, Stanford Medicine Box, and more. Compare features of these tools, and access them, from this document management tools webpage.\n\n\n\n\nInstant Messaging\n\n\nStanford Slack is a free collaboration tool that enhances work group communications. It provides a platform for individual and groups to chat live online and keep conversations secure, organized, and accessible from anywhere, anytime.\nWith Stanford Slack, you can send direct messages to almost anyone at Stanford. Additionally, it’s easy to discover and join other workspaces that are central to your work, although some workspaces are private and require approval to join.\nStanford Slack, which is open to anyone with a SUNet ID, provides the best instant messaging experience at Stanford and is the preferred tool. However, some Stanford units are using Jabber for instant messaging. Check with your local technology support staff to determine which tool is best for you.\n\n\n\n\nID Cards\n\n\nYour Stanford University ID Card is your key to surviving on campus. It serves as an identification card and an electronic key, allowing you to easily enter facilities or use services for which you have privileges. Learn about all the ways you can use your Stanford ID Card.\n\n\n\n\nVideo Conferencing\n\n\nUniversity IT offers several video conferencing tools to meet and collaborate with colleagues across campus, or around the world, reducing travel time and expense while increasing communication and sharing.\nZoom is available at no charge. The online tool can be accessed from any computer or mobile device anywhere, and features screen sharing, chat and teleconferencing. Learn more and launch Zoom on this webpage.\nYou can also rent a video conferencing enabled room, or create a video conferencing enabled room in your department. Learn more about all video conferencing options.\n\n\n\n\nMobile Device Management\n\n\nIf you want to configure one or more of your mobile devices with Stanford email, contacts, and calendars, you need to install Mobile Device Manager (MDM) and register your device(s). This applies to your personal or Stanford-owned devices, including cell phones and tablets.\nWhy? Not only does MDM automatically configure all your Stanford data, it also allows you to remotely lock and wipe data from the device if it’s lost or stolen, detect when a device has been jailbroken, block intruders, and more. Overall, it provides security for Stanford’s data and yours. Learn more about and enroll your device in MDM.\n\n\n\n\nTelephone & Voicemail\n\n\nLearn about Stanford's telephone and voicemail systems, including how to place calls, and how to set up your voicemail. The latter is particularly important if you inherited a previous employee's phone.\nAlso, find out if you are eligible to get discounts on your personal mobile device plans with AT&T, Verizon or Sprint. Just by being a university or hospital employee, you may receive discounts of up to 18 percent on qualifying monthly service plan charges.\n\n\n\n\nTechnology Training Opportunities\n\n\nIf you’re looking to refresh your skills or hone some new ones, University IT provides technology training opportunities to do just that.\nTake advantage of in-person and online training sessions offered each month by our Technology Training group. These courses are fee-based and eligible for payment through the Staff Training Assistance Program (STAP).\nOr, dive into LinkedIn Learning, an online video training library with over 13,000 courses, available to you for free with unlimited access. These courses, which are designed for all levels of learners, are available 24/7 and can be viewed on your desktop or mobile device.\n\n\n\n\nIT Communities of Practice\n\n\nJoin one or more of the 20-plus technology-based Communities of Practice (COPs) channels on SLACK, aimed at supporting collaboration among Stanford professionals. These COPs foster open communication and information sharing around a common topic, and seek to create trusted relationships among Stanford colleagues who work in different areas of the university.\nBrowse the directory of COPs and/or sign up on SLACK.\n\n\n\n\nFind Other Services\n\n\nBut, be sure to browse all of our services. As technology evolves and the needs of our community change, we regularly roll out new services and enhance our existing offerings.\nIf there’s something you’re used to using that you don’t see, let us know. Chances are we have something similar.\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n  \n\n\n \n\n\n\n\n\n\n\n\n\n\n \n Services\n Explore all services\nCloud Solutions Q&As \nGet started with IT\nPractice secure computing\nTechnology Toolkit for Telecommuting and Remote Work\nIT perks\n \n\n Support\n Find answers\nRequest something\nGet help\nView system and project status\nBrowser recommendations\n \n\n University IT\n About us\nOrganization chart\nCurrent job openings\n \n\n Connect\n News\nEvents\nCommunities of Practice\nUIT Community (UIT staff only)\n \n\n UIT Web Editors\n Login \n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\nTerms of Use\nPrivacy Policy\nCopyright Complaints\nTrademark Notice\n\n\n\n© Copyright Stanford University. Stanford, California 94305.\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "#header-nav",
        "/",
        "/",
        "https://uit.stanford.edu/services",
        "https://uit.stanford.edu/services",
        "https://uit.stanford.edu/guide/riskclassifications#security-approved-services",
        "https://uit.stanford.edu",
        "/videoconferencing",
        "/service/techtraining/schedule",
        "/service/gsuite/google-forms",
        "/emailcalendar/config",
        "/service/authentication/twostep",
        "/service/sponsorship/person",
        "https://software.stanford.edu",
        "/guide/connecting-to-network",
        "/service/mobiledevice/management",
        "/guide/website/hosting",
        "/guide/website",
        "/guide/tools",
        "/",
        "https://webmail.stanford.edu",
        "https://stanford.zoom.us",
        "https://stanfordmedicine.box.com/",
        "https://mailman.stanford.edu/mailman/ownerlistinfo",
        "https://accounts.stanford.edu",
        "https://mydevices.stanford.edu",
        "https://stanforduniversity.qualtrics.com/",
        "https://drive.google.com/a/stanford.edu",
        "/guide/single-sign-on",
        "https://stanford.service-now.com/services?id=services_status",
        "https://stanford.service-now.com/it_services",
        "https://stanford.service-now.com/it_services?id=kb_home",
        "https://stanford.service-now.com/it_services?id=sc_home",
        "https://stanford.service-now.com/services?id=get_help",
        "/emailcalendar",
        "https://webmail.stanford.edu",
        "https://stanford.service-now.com/it_services?id=contact_us",
        "https://stanford.service-now.com/it_services?id=portal_home",
        "/guide/document-mgt",
        "/service/slack",
        "/service/jabber",
        "/service/campuscard/your-id-card",
        "/service/zoom",
        "/videoconferencing",
        "/service/mobiledevice/management",
        "/service/phone/singleline/placing",
        "/service/voicemessaging/univ_instr",
        "/mobile/personaluse",
        "/service/techtraining",
        "/service/linkedinlearning",
        "https://cop.stanford.edu/directory",
        "http://stanfordcop.slack.com/signup",
        "/services",
        "https://uitcomm.stanford.edu",
        "/services",
        "/cloudsolutions-q-a",
        "/guide/tools",
        "/guide/security",
        "/guide/telecommuting",
        "/guide/perks",
        "https://stanford.service-now.com/it_services?id=kb_home",
        "https://stanford.service-now.com/it_services?id=sc_home",
        "https://stanford.service-now.com/services?id=get_help",
        "/status-metrics",
        "/guide/browser-recommendations",
        "/organization/structure",
        "/organization/orgchart",
        "https://careersearch.stanford.edu/page/uit-jobs-at-stanford-23",
        "/news",
        "/events",
        "https://cop.stanford.edu/",
        "https://uitcommunity.stanford.edu/",
        "/sso/login?destination=node/26099",
        "https://www.stanford.edu",
        "https://www.stanford.edu/",
        "http://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "http://emergency.stanford.edu/",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4"
    ]
}