{
    "title": "Board of Trustees commits to accelerating transition to net-zero greenhouse gas emissions, reports major reduction in fossil fuel investments | Stanford News",
    "body": "\n\n\n\n \n \n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\nSearch form\n\n\n\nSearch term\n\n\n\n\n\n\nHome\nFind Stories\nFor Journalists\nContact\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJune 12, 2020 Board of Trustees commits to accelerating transition to net-zero greenhouse gas emissions, reports major reduction in fossil fuel investments Stanford’s active investment holdings in fossil fuels have declined more than 90% to now represent less than 1.5% of the university’s Merged Pool, the Board reported as it outlined further efforts in support of the clean-energy transition. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\nRelated Stories\n\n\n\n\n\nUniversity Affairs\nSchool focused on climate and sustainability will amplify Stanford’s impact\nIn his address to the Academic Council, President Marc Tessier-Lavigne announced a school focused on climate and sustainability that will help the university address the urgent challenges facing the planet.\n\n\n\nStanford to go 100% solar by 2021\nA second solar-generating plant, to be built in the next three years, will complete the university’s transition to clean power and further shrink campus greenhouse gas emissions.\n\n\n\n\n\n\nCampus Life\nLiving sustainably, with a little help from My Cardinal Green\nThrough My Cardinal Green, everyone in the Stanford community can set conservation goals, track their progress on personal dashboards, earn points and receive rewards.\n\n\n\nSustainable Stanford\nStanford aims to model sustainability across all aspects of campus life, and has worked to transform its campus into a living laboratory for environmental action.\n\n\n\nCalling climate change an urgent challenge, Stanford’s Board of Trustees this week reported a steep drop in the university’s oil and gas investments, and further committed to accelerating the transition to at least net-zero greenhouse gas emissions in both Stanford’s operations and its investments.\nThe Board, completing a year-long review of fossil fuel investments, reported that Stanford Management Company (SMC), applying economic assessment in the context of its Ethical Investment Framework, has reduced active fossil fuel holdings in Stanford’s Merged Pool of investments by more than 90% to now represent less than 1.5% of the portfolio, and that SMC has no direct holdings in the top 100 oil and gas companies.\nIn a resolution and accompanying statement, the Board expressed its commitment to the goals of the 2015 Paris Agreement on climate, which aims to limit the rise in global temperature this century. In line with that goal, the Board committed to “accelerating the university’s transition, including its operations and endowment, to at least net-zero greenhouse gas emissions by 2050.”\nStanford has undertaken aggressive efforts to support the transition to cleaner energy sources, including through its new solar-based energy system and a recently announced school focused on climate and sustainability that will draw on Stanford’s academic strengths in these fields to amplify the university’s impact.\n“Acting to support the climate of the planet is a critical priority for Stanford, across our activities,” said Board Chair Jeffrey S. Raikes. “Addressing the climate challenge involves an orderly transition to cleaner energy sources, and that requires addressing both the producer side and the consumer side. With this action, we are committing to accelerating the transition of both our operations and our investments at Stanford to support the net-zero emission targets that will be essential to meeting the objectives of the Paris Agreement.”\n“Net zero” refers to a condition in which human-generated greenhouse gas emissions are counterbalanced by activities that remove them from the atmosphere. Metrics have not yet been fully developed for measuring this balance and applying it to the activities of companies and institutions. To meet the Board’s commitment, Stanford intends to engage collaboratively with faculty experts and external partners, including other universities that have a similar focus, to develop mechanisms for determining the net emissions of companies in its investment portfolio, and then reduce those emissions in the portfolio as a whole in order to achieve at least the net-zero standard.\nIn their review, trustees did not conclude that fossil fuel investments currently meet the standard of “abhorrent and ethically unjustifiable,” which is required for a Board action of divestment under Stanford’s investment responsibility policy. Trustees said the actions or inactions of specific, individual companies could be judged against the standard, however.\nClean-energy efforts\nThe Board began its review in response to a request from the student group Fossil Free Stanford, which called for Stanford to divest from the top 100 oil and gas companies. The Board had previously divested from thermal coal, in 2014, concluding that coal was among the most carbon-intensive fossil fuels and that – in contrast with oil and gas – less carbon-intensive alternatives to coal were already broadly available.\nAs a backdrop to the new review, trustees noted Stanford’s institutional commitments to advance clean energy and sustainability in recognition of the global climate challenge. They include:\n\nA transformative investment by Stanford of more than $1 billion in clean energy systems and transportation – including the university’s innovative heating and cooling system and solar-based electricity initiative – which will result in an 80% reduction in campus emissions by 2021 and a 100% renewable electricity portfolio, more than 20 years ahead of the goal set by the State of California.\nInvestment in a range of new research and educational activities that support decarbonization, efforts that Stanford now seeks to take to the next level with the newly announced school that will draw on the university’s strengths in climate and sustainability studies to amplify impact.\nThe university’s platinum ranking from the Association for the Advancement of Sustainability in Higher Education, as well as its ranking first among Doctoral/Research Institutions in the association’s Sustainability Campus Index.\n\n“Stanford considers climate change an urgent challenge and is committed to the goals of the 2015 Paris Agreement,” the Board said in its resolution. “Stanford has made and continues to make significant investments on campus to transition an entire community to clean energy and to advance research and education to further the global transition to clean energy.”\nReview process with stakeholders and experts\nIn reviewing the Fossil Free Stanford proposal, the Board’s Special Committee on Investment Responsibility created a task force that met 42 times as it consulted with faculty researchers, students and experts.\n“Fossil Free Stanford catalyzed an important discussion for our community,” Raikes said. “We’re grateful to everyone in the Stanford community who has contributed their insights. Everything we heard reflected our community’s deep concern for the climate of the planet, even as individuals expressed varying views about the most effective means of addressing it.”\nWhile oil and gas companies are involved in providing financial support for energy research at universities including Stanford, Raikes said the Board’s review explicitly disregarded that fact in its consideration of the Fossil Free Stanford request. The review evaluated the request solely based on the parameters of the Board’s Statement on Investment Responsibility, he said.\nStanford’s Merged Pool of investments is managed by Stanford Management Company, though many assets are invested indirectly – that is, by external partners – rather than by the university directly. SMC operates under an Ethical Investment Framework that recognizes carbon-related damage to the environment as a factor in evaluating energy investments, as well as the importance of assessing companies’ concern “for the welfare of their stakeholders and the communities in which they operate.”\nIn its statement reporting on its deliberations, the Board of Trustees said the Merged Pool managed by SMC has no direct holdings in the 100 oil and gas companies identified by Fossil Free Stanford. It also reported that, as a result of rigorous application of the Ethical Investment Framework, total active investments in fossil fuels have fallen from 16% of the Merged Pool in 2011 to less than 1.5% — a 90% reduction. Meanwhile, alternative energy and sustainable investments have grown to now represent 4% of the Merged Pool.\nAffirming rigorous investment scrutiny\nThe Board reaffirmed the efforts SMC has undertaken.\n“One of the key findings of our review was that Stanford Management Company is doing an excellent job of evaluating investments and external partners, factoring in the effects of climate change, and recognizing the transition that is underway to the less carbon-intensive energy sources that our planet needs,” said Gene Sykes, chair of the Board’s Special Committee on Investment Responsibility. “We’re now taking additional steps to make clear our commitment as a Board, and to accelerate the important work of moving us to net-zero emissions.”\nThe Board outlined several steps to further Stanford’s commitment to the goal of shifting from carbon-intensive energy to cleaner energy sources. Under the resolution, the Board:\n\n“Supports SMC’s investment approach, governed by the Ethical Investment Framework, which reflects and anticipates the need to transition to cleaner and more sustainable economic activity, and has led to a dramatic restructuring of the energy portfolio;\n“Underscores that, under the Framework, SMC will not invest in energy firms that operate in a manner inconsistent with established climate science;\n“In order to support SMC’s effective application of the Framework, directs the chair of the Special Committee on Investment Responsibility to participate in SMC’s annual portfolio review of all investments;\n“Supports the continued vigorous exploration by SMC of promising opportunities in renewable energy and sustainable investments; and\n“Commits to accelerating the university’s transition, including its operations and endowment, to at least net-zero greenhouse gas emissions by 2050.”\n\nConsideration of divestment\nIn considering the Fossil Free Stanford request for divestment of any investments in the top 100 oil and gas companies, the Board was guided by its Statement on Investment Responsibility. That statement notes SMC’s approach to evaluating investments and also provides an avenue for the Board to require divestment, saying that “very rare occasions may arise when companies’ actions or inactions are so abhorrent and ethically unjustifiable as to warrant the University’s disassociation from those investments.”\nIn evaluating the request and consulting with stakeholders and experts, the Board said it was unable to conclude that all investments in oil and gas companies could be deemed to meet that threshold.\n“Based on the opinions of experts in the field, however, the Board has concluded that, in the absence of readily available alternatives at scale, the transition to clean energy will require the continued, time-limited use of less carbon-intensive fossil fuels, and that loss of these alternatives today is both unfeasible and would impose a particularly harsh cost on energy-impoverished communities,” the Board said in its statement.\nIn its review, the Board also considered the assertion that oil and gas companies have engaged in human rights violations that would warrant divestment from the industry as a whole. The Board concluded that such allegations should be evaluated on a specific, case-by-case basis, and that generalized claims were “insufficient to support a determination of blanket industry-wide culpability.”\nHowever, the Board said that the actions or inactions of individual companies could meet the “abhorrent and ethically unjustifiable” standard through a case-by-case evaluation.\n\n\n\n\n\n\n\n\n\n\n\n\nUniversity Affairs\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nScience & Technology\nA better, faster tool for saving water on farms\nA new tool for designing and managing irrigation for farms advances the implementation of smart agriculture, an approach that leverages data and modern technologies to boost crop yields while conserving natural resources.\n \n\n\n\n\n\n \nScience & Technology\nBanking on nature\nThe Natural Capital Project is working with development banks and 10 pilot countries to put the environment at the forefront of policy and investment decisions.\n \n\n\n\n\n\n \nLaw & Policy\nBeyond the room where it happened\nYou may have given little thought to the role Native Americans played in the creation of the U.S. Constitution. But SLS scholars argue that Native people profoundly shaped the conversation.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Report\nTo receive Stanford news daily,\nsubscribe to Stanford Report.\n\n\nFor Journalists\n\nPress Releases\nMedia Contacts\nStanford Experts\n\n\n\nSee Also\n\nContact Stanford News\nFaculty / Staff Resources \n\n\n\n\nEvents\n\nEvents calendar\n\n\n\nStanford News is a publication of Stanford University Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/find-stories/",
        "https://news.stanford.edu/for-journalists/",
        "https://news.stanford.edu/contact/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D34690",
        "https://news.stanford.edu/2020/05/21/school-focused-climate-sustainability-will-amplify-stanfords-impact/",
        "https://news.stanford.edu/section/university-affairs/",
        "https://news.stanford.edu/2020/05/21/school-focused-climate-sustainability-will-amplify-stanfords-impact/",
        "https://news.stanford.edu/2018/12/03/stanford-go-100-percent-solar-2021/",
        "https://news.stanford.edu/2020/01/28/living-sustainably-little-help-cardinal-green/",
        "https://news.stanford.edu/section/campus-life/",
        "https://news.stanford.edu/2020/01/28/living-sustainably-little-help-cardinal-green/",
        "https://sustainable.stanford.edu/",
        "https://news.stanford.edu/wp-content/uploads/2022/08/BOT_Statement_06.12.20_915am.pdf",
        "https://news.stanford.edu/2018/12/03/stanford-go-100-percent-solar-2021/",
        "https://news.stanford.edu/2020/05/21/school-focused-climate-sustainability-will-amplify-stanfords-impact/",
        "https://news.stanford.edu/wp-content/uploads/2022/08/RESOLUTION-IN-SUPPORT-OF-DIVESTING-STANFORDS-ENDOWMENT-FROM-FOSSIL-FUEL-COMPANIES.pdf",
        "https://sustainable.stanford.edu/campus-action/stanford-energy-system-innovations-sesi",
        "https://news.stanford.edu/2020/05/21/school-focused-climate-sustainability-will-amplify-stanfords-impact/",
        "https://sustainable.stanford.edu/recognition-awards",
        "https://news.stanford.edu/wp-content/uploads/2022/10/stanford_university_statement_on_investment_responsibility.pdf",
        "https://news.stanford.edu/wp-content/uploads/2022/10/SMC-Ethical-Investment-Framework.pdf",
        "https://news.stanford.edu/section/university-affairs/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D34690",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://news.stanford.edu/section/science-technology/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://news.stanford.edu/section/law-policy/",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "/report/subscribe/",
        "/press-releases/",
        "/contact/media-contacts/",
        "/experts/",
        "/contact/",
        "http://ucomm.stanford.edu/facstaff/",
        "http://events.stanford.edu/",
        "https://ucomm.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}