{
    "title": "Chris Field, global ecology and climate science pioneer, is pursuing impact at scale - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nOctober 13, 2022 Meet our faculty: Chris Field \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n“What I see are more and more opportunities to address the challenge”: Chris Field, a global ecology and climate science pioneer, is pursuing impact at scale at the new Stanford Doerr School of Sustainability.\n\n\n\n\n\n\n\n\n\n\n\n (Image credit: Andrew Brodhead) \n\nChris Field grew up around the sounds and smells of massive circular blades cutting trees into lumber. As his family moved from California’s Central Valley to Arizona and then Wyoming, their business remained the same – running sawmills.\n“In some ways, I became an environmentalist in order to make up for the environmental impacts of that historic logging,” said Field, a professor of biology and the Melvin and Joan Lane Professor for Interdisciplinary Environmental Studies in the School of Humanities and Sciences and a professor of Earth system science in the Stanford Doerr School of Sustainability. “But in other ways, I think that my background means that I have an appreciation for the way people can be involved as positive and negative influences in ecosystems.”\nAs a boy, Field felt at home outdoors. The Boy Scout and amateur mountaineer made up his mind to someday dedicate himself to protecting nature. In school, biology became a pathway for that goal. In junior high school, books by various philosophers of nature made a big impression on the young Field, who began to imagine himself a 20th-century Henry David Thoreau.\n“I never went to the woods to live deliberately as Thoreau did, but that approach to learning from nature kind of underscores everything I’ve done since,” said Field, who is also the Perry L. McCarty Director of the Stanford Woods Institute for the Environment and a senior fellow at the Precourt Institute for Energy.\nThrough a fascination with science fiction and science itself, Field became interested in integrating views of the future, and understanding how physics and how nature work. Gradually, as the magnitude of environmental threats became clear to him, and his engagement with science became deeper, Field came to see himself as a champion in the protection of nature.\nIn college, Field’s community of choice was the mountaineering club. It provided a way to get outside and explore, to go on climbing expeditions to Alaska and other parts of the world, and to deepen his appreciation of nature. It also solidified his desire to have a career that would allow him to work outdoors.\nAfter graduating, Field spent a year working in his father’s sawmill before setting his sights on graduate work. Impressed by a paper he had read by then Stanford ecologist Harold Mooney that elegantly compared Arctic and Alpine plants, Field set his sights on “the Farm.”\nField’s trajectory through scientific research has been one of thinking about integration to larger and larger scales. After doing his PhD work on understanding how individual plants coordinate functions across their leaves, Field studied how plants in a forest share resources, then how forests at the regional and global scale operate. At that point, Field began looking closely at how biological processes affect the global climate and vice versa.\nField was trained in the traditions of ecology to think about how relationships among organisms structure processes, rates of plant growth, and whether one population increases or decreases. But he quickly realized there were emergent properties that could only be understood by looking at relationships between the atmosphere and the biosphere, the oceans, and humans.\n“Global ecology is still very much my home discipline,” Field said. “But as time has gone on, I’ve shifted much more of my focus to thinking about the role of people in causing climate change, and the opportunities that we have for addressing the climate challenge, both through mitigation – decreasing the amount of climate change that occurs – and through adaptation – preparing not only humans but economies and ecosystems to cope as effectively as possible with the climate changes that we’re not avoiding.”\nSince 2008, Field has worked with the Intergovernmental Panel on Climate Change (IPCC), a partnership between the world’s governments and the scientific community. The first big project he led for the IPCC focused on understanding the relationship between climate change and extreme weather and disasters. The resulting paper established the foundation for the kinds of responses that need to be made when climate change causes large increases in extreme conditions, including heat waves and heavy precipitation.\nAt the new Stanford Doerr School of Sustainability, Field is helping chart a path by which the university can contribute meaningful solutions to the climate crisis, at scale—capitalizing on the historic success the institution has had in building tech ventures.\n“I’m an optimist about our ability to cope with climate change,” Field said. “As I’ve moved forward in my career, what I see are more and more opportunities to address the challenge, to put in place solutions that lead to better lives for individuals and communities.”\n\n (Image credit: Andrew Brodhead) \n\nShare this card\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\n\n\nWatch Video\n\n\n\n\n\n Kurt Hickman, Julia James & Harry Gregory\n\n\n\n\n\n\n\n\n\n\n\nStanford News\nUniversity Communications\nMeet Our Faculty\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D9187",
        "https://profiles.stanford.edu/chris-field",
        "https://humsci.stanford.edu/",
        "https://sustainability.stanford.edu/",
        "http://woods.stanford.edu/",
        "https://energy.stanford.edu/",
        "https://profiles.stanford.edu/harold-mooney",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D9187%23chris-field",
        "#",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/content-partner/university-communications/",
        "https://news.stanford.edu/report/topic/meet-our-faculty/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D9187",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}