{
    "title": "ByteDance - Inspire Creativity, Enrich Life",
    "body": "About UsPressJoin UsByteDanceOur Mission\nInspire Creativity, Enrich Life1234CultureAt ByteDance, we call our values \"ByteStyles.\" They help guide how we work together, and how we aim to bring our Mission and Vision to life. PreviousGrow TogetherLive and be driven by our mission and vision.\nShow patience and resilience in the face of short-term fluctuations. Solve problems together.\nKeep learning, keep pushing boundaries. Pursue mutual growth with the organization.Always Day 1Always maintain an entrepreneurial mindset. Keep pioneering and innovating instead of relying on resources or past achievements.\nStay agile and pursue efficiency and simplicity. Reduce unnecessary procedures. \nReject complacency.\nStay open and humble.Champion Diversity and InclusionValue individual differences, and focus on people's unique strengths. \nThink global. Understand and celebrate different cultures, views, and experiences.\nFacilitate effective collaboration by assuming good intent and trusting by default.Be Candid and ClearSpeak your mind. Expose problems candidly. Avoid \"managing up\".\nBe accurate, concise, and straightforward. Avoid overusing jargon or elaborate terms.\nDrive communication and form conclusions with facts, instead of assumptions or emotions.Seek Truth and Be PragmaticBe an independent thinker. Get to the bottom of things. Distill ideas down to their fundamental truths.\nDive deep into facts. Seek direct experience and first-hand data and information.\nBe grounded and focus on real impact.Be Courageous and Aim for the HighestDare to take calculated risks for bigger gains, with a focus on return on investment. \nExplore alternative solutions in a larger scope for the optimal result.\nInsist on high standards. Don't just get the job done, execute with excellence.Grow TogetherLive and be driven by our mission and vision.\nShow patience and resilience in the face of short-term fluctuations. Solve problems together.\nKeep learning, keep pushing boundaries. Pursue mutual growth with the organization.Always Day 1Always maintain an entrepreneurial mindset. Keep pioneering and innovating instead of relying on resources or past achievements.\nStay agile and pursue efficiency and simplicity. Reduce unnecessary procedures. \nReject complacency.\nStay open and humble.Champion Diversity and InclusionValue individual differences, and focus on people's unique strengths. \nThink global. Understand and celebrate different cultures, views, and experiences.\nFacilitate effective collaboration by assuming good intent and trusting by default.Be Candid and ClearSpeak your mind. Expose problems candidly. Avoid \"managing up\".\nBe accurate, concise, and straightforward. Avoid overusing jargon or elaborate terms.\nDrive communication and form conclusions with facts, instead of assumptions or emotions.Seek Truth and Be PragmaticBe an independent thinker. Get to the bottom of things. Distill ideas down to their fundamental truths.\nDive deep into facts. Seek direct experience and first-hand data and information.\nBe grounded and focus on real impact.Be Courageous and Aim for the HighestDare to take calculated risks for bigger gains, with a focus on return on investment. \nExplore alternative solutions in a larger scope for the optimal result.\nInsist on high standards. Don't just get the job done, execute with excellence.Grow TogetherLive and be driven by our mission and vision.\nShow patience and resilience in the face of short-term fluctuations. Solve problems together.\nKeep learning, keep pushing boundaries. Pursue mutual growth with the organization. NextBoard MembersRubo LiangChairman of the BoardArthur DantchikBoard MemberWilliam E. FordBoard MemberPhilippe LaffontBoard MemberNeil ShenBoard MemberSelect InvestorsIn alphabetical orderHistory of ByteDanceByteDance was founded in 2012 by a team led by Yiming Zhang and Rubo Liang, who saw opportunities in the then-nascent mobile internet market, and aspired to build platforms that could enrich people's lives. The company launched Toutiao, one of its flagship products, in August 2012. It followed that success with the launch of Douyin in September 2016. Approximately a year later, ByteDance accelerated globalization with the launch of its global short video product, TikTok. It quickly took off in markets like Southeast Asia, signaling a new opportunity for the company. ByteDance acquired Musical.ly in November 2017 and subsequently merged it with TikTok. Today, the TikTok platform, which is available outside of China, has become the leading destination for short-form mobile videos worldwide.In support of its mission to Inspire Creativity and Enrich Life, ByteDance has made it easy and fun for people to connect with, create and consume content. People are also able to discover and transact with a suite of more than a dozen products and services such as TikTok, CapCut, TikTok Shop, Lark, Pico and Mobile Legends: Bang Bang, as well as products and services specific to the China market, including Toutiao, Douyin, Fanqie, Xigua, Feishu and Douyin E-commerce.ByteDance has over 150,000 employees based out of nearly 120 cities globally, including Austin, Barcelona, Beijing, Berlin, Dubai, Dublin, Hong Kong, Jakarta, London, Los Angeles, New York, Paris, Seattle, Seoul, Shanghai, Shenzhen, Singapore, and Tokyo.Corporate StructureCode of ConductWe believe at ByteDance that high ethical standards and a culture of integrity play a pivotal role throughout the development of the company. Therefore, we have developed the ByteDance Code of Conduct and ByteDance Partner Code of Conduct.View the Code of Conduct(PDF)→Milestonesgettext(`date.months.3`) 2012ByteDance founded in a four-bedroom apartmentgettext(`date.months.8`) 2012Toutiao launches as one of ByteDance's first products gettext(`date.months.9`) 2016Douyin launches in China and quickly becomes a popular short-video sharing platformgettext(`date.months.12`) 2016ByteDance becomes the controlling stakeholder of Indonesian news app BABEgettext(`date.months.5`) 2017TikTok launches outside of mainland Chinagettext(`date.months.11`) 2017ByteDance acquires popular short-video platform musical.lygettext(`date.months.6`) 2018Helo launches in India as a social media platformgettext(`date.months.8`) 2018musical.ly merges with TikTok to unify the two platformsgettext(`date.months.3`) 2019Lark launches in Japan and Singapore as ByteDance's first enterprise productContactMedia Inquiriespress@bytedance.comCareershr@bytedance.comAdvertisingadvertise@bytedance.comAbout UsCultureSelect InvestorsCode of ConductMilestonesContactPrivacy PolicyPressBlogMedia AssetsJoin UsCareers at ByteDanceEnglishEnglish中文简© 2012-2023 ByteDance",
    "links": [
        "/en/",
        "https://sf16-sg.tiktokcdn.com/obj/eden-sg/ptvaeh7vbozps/Code_Of_Conduct.pdf",
        "Mailto:press@bytedance.com",
        "Mailto:hr@bytedance.com",
        "Mailto:advertise@bytedance.com",
        "/en/"
    ]
}