{
    "title": "Defining the Polyglots contributor ladder – Translate WordPress",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nTranslate WordPress\n\n\nTeams\nRequests\nWeekly Chats\nTranslate\nHandbook\nGet News\n \n\n\n\nHide welcome box\n\n\n\nWelcome to the official blog of the translator team for the WordPress open sourceOpen Source Open Source denotes software for which the original source code is made freely available and may be redistributed and modified.  Open Source **must be** delivered via a licensing model, see GPL. project. This is where we discuss all things related to translating WordPress. Follow our progress for general updates, status reports, and debates.\nWe’d love for you to help out!\n\n\nTranslate WordPress\nYou can help translate WordPress to your language by logging in to the translation platform with your WordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ account and suggesting translations (more details).\nWant to help in managing and validating translations? Get in touch with the existing language team and follow the glossaries & style guides if the team has them.\nDon’t see your language? You can request support for it.\n\n\nWeekly Meetings\nWe have meetings every week on SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. in polyglots (the schedule is on the sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme. of this page). You are also welcome to ask questions on the same channel at any time!\nPosting here\nIn order to post to this site, you will need to log in with your wordpress.org account. Your first post may take a while to show up, as it is moderated. Please follow our tag policy when posting.\n\n\n#polyglotsTo-do\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nErica Varlese\n\n1:21 pm on April 24, 2023 \n\n\n\n\t\t\t\t\t \n\t\t\t\t\n\nDefining the Polyglots contributor ladder\n\n\nExpectations for translators and translation editorsTranslation Editor Translation editors can approve translations for projects. The GTE (General Translation Editor) and LM (Locale Manager) roles can add new users with the \"Project Translation Editor\" role that can approve translations for specific projects. There are two different Translation Editor roles: \nGeneral Translation Editor and Project Translation Editor were a common piece of feedback I received in the Polyglots outreach effort. Most, if not all, teams wanted to set clearer expectations for new translators; other teams struggled with translation editors who were no longer available to help grow the team.\nThis reminded me of my previous exercise with the Make/Training team to define a contributor ladder. While the Polyglots teamPolyglots Team Polyglots Team is a group of multilingual translators who work on translating plugins, themes, documentation, and front-facing marketing copy. https://make.wordpress.org/polyglots/teams/. has clear roles—particularly because most roles are tied to permissions—I’m unsure of when expectations related to these roles were last discussed.\nAs a result of this feedback, I’d like to present my understanding of what a contributor’s progression may look like on the Polyglots team. In presenting this resource, I hope it can define current expectations for Polyglots contributors and potentially identify any gaps that may exist.\nCurrent Polyglots Roles\nWhen I think of the Polyglots team, this is how I see the team roles. If I align these roles with the concept of the contributor ladder, it might look like:\nTranslator (Connecting)\nContributes suggested translations\nCommunicates with local translation editors for feedback\n\nProject Translation EditorProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves. (Understanding/Engaging)\nContributes translations \nResponsible for maintaining specific translation projects in translate.wordpress.orgtranslate.wordpress.org The platform for contributing to the translation of WordPress core, themes and plugins., including translation review and feedback\n\nGeneral Translation EditorGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale. (Leading)\nSets priorities for their individual localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ team\nMentors and provides feedback to new translators\nMaintains translation consistency, quality, and related resources (Glossary, Style Guide) \n\nLocale Manager (Leading)\nManages the locale’s RosettaRosetta The code name of the theme for the local WordPress sites (eg. bg.wordpress.org is a “Rosetta” site). All locale specific WordPress sites are referred to as “Rosetta sites.” The name was inspired from the ancient Rosetta Stone, which contained more or less the same text in three different languages. site, including adding or promoting users\nOften performs many of the same activities listed under General Translation Editors\n\nGlobal Mentor (Leading)\nHelps set priorities for the global team\nProvides mentorship for any/all locale teams and translation editors\nResponsible for technical maintenance, e.g. new locale requests, communicating WordPress release schedule\n\nIn brainstorming the Polyglots team structure, two things stood out to me:\nSome of the steps between roles are pretty large.\nThere’s a lot of responsibility for some roles.\nWith that in mind, I made a slightly revised map of the Polyglots team.\nRevised Polyglots Roles\nContributors, especially translation editors, can ideally use many different skills at once to manage translations, maintain translation quality, highlight priorities, and still build the translation community. It’s a lot, especially with a small team!\nCurrently, the Polyglots Global Mentors have two sub-roles: a Global Mentor and a Tech Lead. Similarly, I’d like to propose distinct sub-roles for General Translation Editors: \nTranslation Quality → Review translations and proactively provide feedback to translators.\nCommunity → Recruit and mentor translators.\nDocumentation → Maintain team documentation, such as the Glossary or local Handbooks.\nMarketing → Coordinate local marketing efforts, such as translating /news posts.\nExploring ways to highlight expectations for Project Translation Editors in each locale may also be interesting. When approving a PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves., would it be helpful to share if they’re also expected to review and provide feedback on suggested translations for your locale? What might those expectations look like? \nThe benefits of outlining these specialties are that they highlight the many different roles translation editors play. Clearly outlining these tasks may make it easier for teams to decide if and how to divide these responsibilities. \nFeedback and improvements\nWhile I recognize that more documentation won’t immediately help resolve the challenges that inspired this post, I believe it’s useful to agree on a definition and expectations for these roles. For the locale teams that are specifically struggling to add new GTEs when others are inactive, it’s particularly important to ensure everyone is clear on the expectations of their role. Things change, and stepping back from a position or inviting others to help is okay.\nWith that in mind, I would appreciate any feedback you have. In particular, I would like to know:\nAm I missing any roles in these diagrams?\nDoes this match your experience with contributing to Polyglots?\nDoes this match your team’s structure?\nWould you add any roles? Has your locale team added any roles?\nWhat do you think of creating “sub-roles” for translation editors? \nHow could this resource be useful to you?\nI would love to use this to enhance existing documentation in the Polyglots Handbook, especially the Roles and Capabilities page. Your feedback on this post is welcome, either in the comments or in SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. for any additional discussion. Ideally, I would like to collect as much feedback as possible within the next two weeks by Monday, May 8th, 2023.\nThank you to @casiepa and @harishanker for reviewing this post. Share this:FacebookTwitterLogin to ReplyTo-do\n\n\n\n\n\n\n\n\n\n\n\n\nPeter Smits\n\n10:42 am on April 25, 2023 \n\n\n\n\nAm I missing any roles in these diagrams?\n  Yes we have discussed the in the past to add a new role between PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves. and GTEGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale.. In our localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ nl_NL we have a roll called GPTE. This roll can approve/reject all projects within Themes and Plugins and in our case also for MetaMeta Meta is a term that refers to the inside workings of a group. For us, this is the team that works on internal WordPress sites like WordCamp Central and Make WordPress..\nDoes this match your experience with contributing to Polyglots?\n  Yes it does, although the activities of GTE’s are low and not very active.\nDoes this match your team’s structure?\n   No as indicated we have a roll GPTE added.\nWould you add any roles? Has your locale team added any roles?\n   Yes we have (GPTE), I think it would be great to generally add the GPTE roll. So the GTE’s will have less work checking translations. And also this roll could help training new translators\nWhat do you think of creating “sub-roles” for translation editorsTranslation Editor Translation editors can approve translations for projects. The GTE (General Translation Editor) and LM (Locale Manager) roles can add new users with the \"Project Translation Editor\" role that can approve translations for specific projects. There are two different Translation Editor roles:\nGeneral Translation Editor and Project Translation Editor?\n   Depends on which activities you are thinking about.\nHow could this resource be useful to you?\n   For me as a GPTE not that much as I am already involved with education.\nCommon thoughts:\nTelling the PTE to check his project is something I did, but the GTE team was not that happy with it. I think if you give a PTE role to someone, he/she should take care of the project. Problem with this is the fact that you do not get notified when new texts arrive of translation suggestions or fuzzes are present. To be able to do this, it would require new functionality “Send an email if something happens in the project you are PTE for”. Add an opt-in option so people can refuse the messages.\nThe problem with most of these PTE’s is the fact, that they translate the project because they use it, and do not want to get involved with other projects or even their own. Also in my experience, people start translating and after it is ready stop using the project because they lost interest or the project becomes to bad, and other better projects will be used.\nAlso depending on the locale, I think mentoring the group of GTE’s actively would help improving the process. There are sometimes discussions that do not lead to a solution, or simply are not answered. I do not know if it exists, but a template of what the roll of GTE, GPTE, PTE exactly is, would be helpfull. There is some documentation, but obviously looking at the amount of comments after requesting PTE, people did not read it.\nAlso what needs to be changed is the standard answer if someone asks for the PTE roll. I personally find some messages a bit annoying, as it does not motivate people to proceed with translating. If someone has added a lot of translations, I think the message should only be “We will check your suggestions and come back to you with granting the roll, or we will advice you how to improve the suggestions by providing the necessary links to be able to do that. \nMost people start translating like I did, without knowing that there exists documentation how to translate. A possible solution would be to provide default links after clicking the link “You can help improving the translation of this project. E.g. show a popup and give the links depending on the locale or the general links to the documentation.\n\n\n\n\n\n\n\n\nErica Varlese\n\n4:24 pm on April 27, 2023 \n\n\n\n\nThank you for such a thoughtful reply, @psmits1567! I found it really helpful to hear how the nl_NL team has approached the Super PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves./GPTE role. \nWhen I was writing this post, I had the feeling that there was a big leap from PTE to GTEGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale.. At the same time, we don’t often explicitly talk about this type of PTE, and it seems like an excellent “in-between” role.\nAlso what needs to be changed is the standard answer if someone asks for the PTE roll.\nThis is interesting! For the standard answer, are you referring to the standard email, or something specific to your localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ team? I’m curious to learn more about how that’s currently handled by default and if the team has ever experimented with other ideas.\n\n\n\n\n\n\n\n\n\n\ntobifjellner (Tor-Bjorn Fjellner)\n\n6:32 pm on April 25, 2023 \n\n\n\n\nOur various roles (PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves./GTEGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale./etc.) are a construction in our MetaMeta Meta is a term that refers to the inside workings of a group. For us, this is the team that works on internal WordPress sites like WordCamp Central and Make WordPress. environment. In GlotPressGlotPress GlotPress is the translation management software that powers Translate.WordPress.org. More information is available at glotpress.org. these roles boil down to two basic contributor roles: Translator (can suggest stringsString A string is a translatable part of the software. A translation consists of a multitude of localized strings.) and Translation editorTranslation Editor Translation editors can approve translations for projects. The GTE (General Translation Editor) and LM (Locale Manager) roles can add new users with the \"Project Translation Editor\" role that can approve translations for specific projects. There are two different Translation Editor roles:\nGeneral Translation Editor and Project Translation Editor (can approve and reject strings, and entered strings are in most cases immediately saved as approved).\nI believe Peter touched upon the “Super PTE”. This is still a PTE, but where one or several complete categories are added (like “all plugins”; “all themes”; “All WordPress coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress.”; etc.).\nThe translation editor is our quality assurance step. This contributor shall make sure that the translations follow the “General expectations” in Polyglots’ handbook.\nGTE/PTE is a role that gets awarded to individual contributors. If a developer company would like their employees to help with translation of their pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party/theme, and an employee that knows Danish, and another employee that knows Afrikaans, then both of these individuals should register their individual accounts via https://login.wordpress.org/register start contributing and interact with their respective localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ teams.\nI’d also like to mention that a CL-PTE is an administrative role. The CL-PTE is NOT able to approve, reject, or edit strings from other users, but can upload a translation if there is no approved translation present since before. The “quality assurance” here lies one step earlier. A CL-PTE is only supposed to upload translations that have been sourced from professional translators. (And if we see that this role gets abused, then it can, obviously, be removed from the user.)\nThe CL-PTE should not be anybody’s personal account. If the person/people that administrate the CL-PTE also act as PTE for certain languages, then their PTE contribution should be done from their individual accounts.\n\n\n\n\n\n\n\n\nNaoko Takano\n\n9:44 am on April 26, 2023 \n\n\n\n\nAm I missing any roles in these diagrams?\nWould you add any roles? Has your localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ team added any roles?\nAfter reading Peter’s comment about the “Super PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves.” type of role, I’m thinking the existing “hidden/inexplicit” role is where we need to clarify and modify the current role setup.\nDoes this match your team’s structure?\nLooking at the Revised Polyglots Roles version, I’d say in my local team we do have several contributors who are working on one or more of the roles. There isn’t a super clear structure, but all roles are certainly covered.\nDoes this match your experience with contributing to Polyglots?\nI don’t remember exactly how I first became a global mentor. I may have joined after I talked to Petya at an event. It would be useful to have clear onboarding steps (and offboarding, too… I wouldn’t say I’m very active these days but I’d be happy to answer questions when asked. But staying in the same role may create confusion).\nWhat do you think of creating “sub-roles” for translation editorsTranslation Editor Translation editors can approve translations for projects. The GTE (General Translation Editor) and LM (Locale Manager) roles can add new users with the \"Project Translation Editor\" role that can approve translations for specific projects. There are two different Translation Editor roles:\nGeneral Translation Editor and Project Translation Editor? \nFor a larger or more mature team, dividing roles and responsibilities creates opportunities for more contributors.\nAlso, this is somewhat of a wishlist item but it would be nice if Marketing and Documentation role contributors can have access to the backend of necessary websites more easily.\nHow could this resource be useful to you?\nClear documentation on the contributor ladder would be beneficial for explaining potential areas of contribution during events and mentorship conversations.\nHighlighting sub-roles such as community, marketing, and documentation conveys the message that these tasks are crucial for a team.\nCLPTECross-locale Project Translation Editor A Cross-Locale Project Translation Editor is an account owned by a plugin or theme author (or the authoring organization), which uses professional translators to localize their product. The cross-locale project translation editor can import/validate strings on a specific project for more than one locale. This role has the same capabilities as a Project Translation Editor over multiple locales instead of one. Cross-Locale Project Translation Editors need to meet a set of criteria before being appointed by General Translation Editors. tends to create confusion, so it’s good to be able to see they are very different from the rest of the roles.\n\n\n\n\n\n\n\n\nErica Varlese\n\n4:27 pm on April 27, 2023 \n\n\n\n\nThank you, Nao!\nBased on your comment, and the other comments here, it seems worthwhile to include the Super PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves. role. I’m curious if you think a helpful approach might be to update the ladder to include that as an option, but the documentation around this resource should strongly encourage localesLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ to use it as a rough guide. Are there any downsides to that?\nGreat point about offboarding! @tobifjellner and I were chatting the other day about how useful it would be to highlight when a GTEGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale. is stepping down or less available, so other contributors could volunteer – similar to MeetupMeetup All local/regional gatherings that are officially a part of the WordPress world but are not WordCamps are organized through https://www.meetup.com/. A meetup is typically a chance for local WordPress users to get together and share new ideas and seek help from one another. Searching for ‘WordPress’ on meetup.com will help you find options in your area. groups without an organizer. A good start might be including some key steps in the Handbook!\n\n\n\n\n\n\n\n\n\n\nLidia Pellizzaro\n\n10:04 am on April 27, 2023 \n\n\n\n\n| “Am I missing any roles in these diagrams?”\n| “Would you add any roles? Has your localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ team added any roles?”\nAs mentioned by Peter, Tor-Bjorn, and Naoko in previous comments, even in the Italian Polygots team we assign a de facto “Super PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves.” role to very active contributors who follow up on team activities and are very good at coming up with new activities.\nExample: in the last few months we have received huge help in growing the approved translations of TOP 400 themes from a volunteer, who spontaneously proposed to help us with this goal and is very good with translations, guidelines and terms definitions, so we assigned her the role of editor for all themes.\n| “What do you think of creating “sub-roles” for translation editorsTranslation Editor Translation editors can approve translations for projects. The GTE (General Translation Editor) and LM (Locale Manager) roles can add new users with the \"Project Translation Editor\" role that can approve translations for specific projects. There are two different Translation Editor roles:\nGeneral Translation Editor and Project Translation Editor?”\nIn the past, we simply had published a page in our local handbook with the list of activities and the contact person for each activity; we are updating it now, but it is still a good reference to get a general overview of the various activities of the team, for example:\n\nLocale SVNSVN Apache Subversion (often abbreviated SVN, after its command name svn) is a software versioning and revision control system. Software developers use Subversion to maintain current and historical versions of files such as source code, web pages, and documentation. Its goal is to be a mostly compatible successor to the widely used Concurrent Versions System (CVS). WordPress core and the wordpress.org released code are all centrally managed through SVN. https://subversion.apache.org/. Releases\n\nWeekly Meeting and Weekly Meeting Recap\n\nFollow the international Polyglots meeting and share important news on our local SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. channel\n\nGutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ PluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party (and FSE material)\n\nLocale Handbook\n\nTop 400 Plugins\n\nTop 400 Themes\n\nManaging responses to PTE requests on Make\n\nMentoring management\n\nGlossary – Update it\n\nGlossary – Check proposed posts in our Team on terms to discuss and planning the discussion in our weekly meeting and all subsequent activities\n\nGlossary – Managing massive bulk editing of translations when needed\n\n\nAll new stringsString A string is a translatable part of the software. A translation consists of a multitude of localized strings. for CoreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. and important projects are constantly manually checked by GTEs and we try to involve contributors to partecipate, usually with a message on Slack. (The last part could be a “Community” activity.)\nRecently we have also some persons who are “bridge” with other teams like with Learn and FSE’s stuff (a GTEGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale. of us).\nRecently we have also added scheduled monthly video meeting between GTEs, because a vis-a-vis meeting strengthens our connection and motivates us better. Maybe we need to consider also a “motivator” role 😉 .\n\n\n\n\n\n\n\n\nErica Varlese\n\n4:30 pm on April 27, 2023 \n\n\n\n\nThank you, Lidia! I remember when I was first learning about the Italian localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ team, I found that documentation about who to pingPing The act of sending a very small amount of data to an end point.  Ping is used in computer science to illicit a response from a target server to test it’s connection. Ping is also a term used by Slack users to @ someone or send them a direct message (DM). Users might say something along the lines of “Ping me when the meeting starts.” to be extremely helpful.\nI asked Nao the same question above, but I’m curious to hear your thoughts about including the Super PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves. role in the contributor ladder. From what you’ve shared, it sounds like that approach has been very helpful for mentoring (or motivating!) active contributors.\n\n\n\n\n\n\n\n\nLidia Pellizzaro\n\n10:07 am on April 29, 2023 \n\n\n\n\nI think the “Super PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves.” could be in some cases a separate role to follow up on specific activities (mentoring, TOP plugins or themes, … and it can be granted only for plugins, only for themes or for both) and in other cases it could also be the previous step when a stable localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ team identifies a future GTEGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale. and wants to see how they behave (for example when training a new translator is needed) before proposing and granting the GTE status. For our locale continued efforts in the team activities, not just translations, is needed.\n\n\n\n\n\n\n\n\n\n\n\n\ntobifjellner (Tor-Bjorn Fjellner)\n\n3:28 pm on April 27, 2023 \n\n\n\n\nI think it’s overall a good description. But I don’t know if we need to formally specify a bunch of sub-roles. Especially for smaller teams, we might create more confusion that way.\nBut it’s very good to somehow describe various things that need to be done. In the Swedish team, for instance, we’ve got 4 GTEGeneral Translation Editor A General Translation Editor (often referred to as GTE) is a person, who has global access to validate strings on all projects for a specific locale.’s. One hero does some 80% of the stringsString A string is a translatable part of the software. A translation consists of a multitude of localized strings. checking, and one other person (me, actually), the rest.\nThe other two GTE’s are currently not contributing actively (due to work/life/balance…). But it’s still good. They’re welcome to come back any minute, and yes, they have contributed a lot in the past.\nSo my view is that each team would need to somehow decide how they internally will make sure that all important corners are covered. But I don’t see a need for more specific roles with gradual access.\n\n\n\n\n\n\n\n\nLidia Pellizzaro\n\n4:23 pm on April 27, 2023 \n\n\n\n\n+1\nTo be clear, I also think an internal or public document to organize the activities is sufficient.\n\n\n\n\n\n\n\n\nErica Varlese\n\n4:33 pm on April 27, 2023 \n\n\n\n\nThank you! The descriptions in your earlier comment were really helpful, and I think should be the basis for any updates to our documentation. (I know some of that exists in the Handbook already, but from the comments, it sounds like extra clarity is a good thing!)\nI’d love your perspective both from your local team and as a global mentor:\n\n\nDo you have any concerns about including Super PTEs in the ladder, or might that also create more confusion for smaller teams?\n\nWhat do you think of encouraging localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ teams to use this documentation to build their own, localized version? That way, these sub-roles can exist for larger teams, but smaller teams can do away with them altogether if it doesn’t make sense.\n\n\n\n\n\n\n\n\n\n\ntobifjellner (Tor-Bjorn Fjellner)\n\n9:18 pm on April 27, 2023 \n\n\n\n\n@evarlese\nIt makes sense to mention the convenience and the possibility for some midway stop in the “ladder” of a localeLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/ team. But technically, it’s just a click IN the categoryCategory The 'category' taxonomy lets you group posts / content together that share a common bond. Categories are pre-defined and broad ranging. box instead of outside… (That UIUI UI is an acronym for User Interface - the layout of the page the user interacts with. Think ‘how are they doing that’ and less about what they are doing. needs to get improved soon 🙂 )\n\n\n\n\n\n\n\n\ntobifjellner (Tor-Bjorn Fjellner)\n\n9:25 pm on April 27, 2023 \n\n\n\n\nOf course they’re welcome to do that. But it would be relevant mostly for bigger teams.\nFor smaller teams it’s better to use the available resources for translation, reviews, glossary maintenance, recruitment, etc. rather than spending time on unnecessary detailed process documents 🙂\n\n\n\n\n\n\n\n\n\n\n\n\nErica Varlese\n\n10:33 am on May 1, 2023 \n\n\n\n\nBased on the feedback so far, I’ve updated the images to include the optional Super PTEProject Translation Editor A Project Translation Editor (often referred to as PTE) is a person, who has access to validate strings on a specific project (for example BuddyPress, WooCommerce or Twenty Fourteen) for one specific locale. A project translation editor can approve strings that are added by translation contributors. Per project translation, editors are appointed by a general translation editor after a request by the project author or by the contributors themselves. role as well. In the documentation, I’d like to make it clear that this is optional, but has been helpful for some larger localesLocale Locale = language version, often a combination of a language code and a region code, for instance es_MX denotes Spanish as it’s used in Mexico. A list of all locales supported by WordPress in https://make.wordpress.org/polyglots/teams/. Thank you, @tobifjellner, @lidialab, and @psmits1567! \n\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \n\n\n\nPost navigation\n← PTE Request for onOffice for WP-Websites Merged →\n\n\n\n\n\n\n\n\nSearch\n\n\n\nMain PostsUse this button to show the main posts only and exclude all requests (e.g. CLPTE/PTE and locale requests).\nMain PostsPlanned team meetings Polyglots Team Chat (Asia-Pacific)Wed May  3 07:00:00 2023 UTC (1 day from now) at #polyglots on SlackGlotPress chat (once every four weeks)Wed May  3 08:00:00 2023 UTC (1 day from now) at #glotpress on SlackPolyglots Team Chat (Europe)Wed May 10 13:00:00 2023 UTC (1 week from now) at #polyglots on Slack\n\nPolyglots Meeting Agendas\nWordPress Meeting Calendar\n\n\n\n\nSign up for Top Polyglots News\nEnter your email address to receive a monthly newsletter, featuring important updates from the Polyglots team.\n\n\n\n\n\nSubscribe\n\n\n\n\n\t\t\t\tProcessing…\t\t\t\n\n\t\t\t\tSuccess! You're on the list.\t\t\t\n\n\t\t\t\tWhoops! There was an error and we couldn't process your subscription. Please reload the page and try again.\t\t\t\n\n\nSubscribe to All New Posts\n\n\nEnter your email address to immediately receive an email for all new posts on this blog.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 2,660 other subscribers\t\t\t\t\n\nEditor RequestsLocale RequestsGeneral RequestsGlobal Polyglots team mentorsThese are the people who review new locale requests and can help you with questions about translating WordPress.\n\n\nPetya Raykovska\nDominik Schilling\nNaoko Takano\nPascal Casier\nSergey Biryukov\nTor-Björn Fjellner\nAli Darwich\nFelipe Elia\nRecent Posts and Comments\n\n\n\t\t\tTeam Pledges\n\t\t\n\n1204 people have pledged time to contribute to Polyglots Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tYou must be logged in to post a comment.\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fpolyglots%2F2023%2F04%2F24%2Fdefining-the-polyglots-contributor-ladder%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/polyglots/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://make.wordpress.org/polyglots/?resolved=unresolved",
        "https://make.wordpress.org/polyglots/category/weekly-chats/",
        "https://translate.wordpress.org/",
        "https://make.wordpress.org/polyglots/handbook/",
        "https://make.wordpress.org/polyglots/get-polyglots-news/",
        "https://login.wordpress.org/wp-login.php?redirect_to=https%3A%2F%2Ftranslate.wordpress.org%2F",
        "https://wordpress.org/",
        "https://make.wordpress.org/polyglots/handbook/translating/how-to-translate/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://make.wordpress.org/polyglots/handbook/translating/glossaries-and-style-guides-per-locale/",
        "https://make.wordpress.org/polyglots/handbook/translating/requesting-a-new-locale/",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://wordpress.slack.com/messages/polyglots",
        "https://login.wordpress.org/wp-login.php?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fpolyglots%2F",
        "https://make.wordpress.org/polyglots/tag-policy/",
        "https://make.wordpress.org/polyglots/tag/polyglots/",
        "#",
        "https://profiles.wordpress.org/evarlese/",
        "https://profiles.wordpress.org/evarlese/",
        "#general-translation-editor",
        "#project-translation-editor",
        "https://make.wordpress.org/polyglots/tag/polyglots-outreach/",
        "https://make.wordpress.org/training/2021/04/23/discussion-contributor-ladders-for-the-training-team-and-learn-wordpress/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://make.wordpress.org/polyglots/files/2023/04/image-2.png",
        "https://make.wordpress.org/updates/2019/06/17/observations-on-wordpress-contributor-team-structure/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://make.wordpress.org/polyglots/teams/",
        "https://en.wikipedia.org/wiki/Rosetta_Stone",
        "https://make.wordpress.org/polyglots/files/2023/04/image-3.png",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://make.wordpress.org/polyglots/handbook/about/roles-and-capabilities/",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://profiles.wordpress.org/casiepa/",
        "https://profiles.wordpress.org/harishanker/",
        "https://make.wordpress.org/polyglots/2023/04/24/defining-the-polyglots-contributor-ladder/?share=facebook",
        "https://make.wordpress.org/polyglots/2023/04/24/defining-the-polyglots-contributor-ladder/?share=twitter",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fpolyglots%2F2023%2F04%2F24%2Fdefining-the-polyglots-contributor-ladder%2F%23respond&locale=en_US",
        "#",
        "https://profiles.wordpress.org/psmits1567/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://make.wordpress.org/polyglots/teams/",
        "#general-translation-editor",
        "#project-translation-editor",
        "https://profiles.wordpress.org/evarlese/",
        "https://profiles.wordpress.org/psmits1567/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://make.wordpress.org/polyglots/teams/",
        "https://profiles.wordpress.org/tobifjellner/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "http://translate.wordpress.org",
        "http://glotpress.org/",
        "#general-translation-editor",
        "#project-translation-editor",
        "https://login.wordpress.org/register",
        "https://make.wordpress.org/polyglots/teams/",
        "https://profiles.wordpress.org/nao/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "#general-translation-editor",
        "#project-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#cross-locale%c2%a0project-translation-editor",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://profiles.wordpress.org/evarlese/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://make.wordpress.org/polyglots/teams/",
        "https://profiles.wordpress.org/tobifjellner/",
        "https://www.meetup.com/",
        "https://profiles.wordpress.org/lidialab/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "#general-translation-editor",
        "#project-translation-editor",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://wordpress.org/gutenberg/",
        "https://profiles.wordpress.org/evarlese/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://profiles.wordpress.org/lidialab/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://make.wordpress.org/polyglots/teams/",
        "https://profiles.wordpress.org/tobifjellner/",
        "https://profiles.wordpress.org/lidialab/",
        "https://profiles.wordpress.org/evarlese/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://profiles.wordpress.org/tobifjellner/",
        "https://profiles.wordpress.org/evarlese/",
        "https://make.wordpress.org/polyglots/teams/",
        "https://profiles.wordpress.org/tobifjellner/",
        "https://profiles.wordpress.org/evarlese/",
        "https://make.wordpress.org/polyglots/glossary/#general-translation-editor",
        "https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/#requesting-new-translation-editors",
        "https://make.wordpress.org/polyglots/teams/",
        "https://profiles.wordpress.org/tobifjellner/",
        "https://profiles.wordpress.org/lidialab/",
        "https://profiles.wordpress.org/psmits1567/",
        "https://make.wordpress.org/polyglots/files/2023/05/Revised-Roles.png",
        "/polyglots/2023/04/24/defining-the-polyglots-contributor-ladder/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fpolyglots%2F2023%2F04%2F24%2Fdefining-the-polyglots-contributor-ladder%2F&locale=en_US",
        "https://make.wordpress.org/polyglots/2023/04/24/pte-request-for-onoffice-for-wp-websites-4/",
        "https://make.wordpress.org/polyglots/2023/04/25/pte-request-for-taxopress-is-the-wordpress-tag-category-and-taxonomy-manager-wordfence-security-firewall-malware-scan-and-login-security-wp-optimize-cache-clean-compre/",
        "#",
        "https://make.wordpress.org/polyglots/?tags=-editor-requests,-request,-clpte,-locale-requests",
        "https://make.wordpress.org/polyglots/?tags=-editor-requests,-request,-clpte,-locale-requests",
        "https://wordpress.slack.com/messages/polyglots",
        "https://wordpress.slack.com/messages/glotpress",
        "https://wordpress.slack.com/messages/polyglots",
        "https://make.wordpress.org/polyglots/category/weekly-chats/",
        "https://make.wordpress.org/meetings/",
        "https://make.wordpress.org/polyglots/tag/polyglots-monthly-newsletter/",
        "https://profiles.wordpress.org/petya",
        "https://profiles.wordpress.org/ocean90",
        "https://profiles.wordpress.org/nao",
        "https://profiles.wordpress.org/casiepa",
        "https://profiles.wordpress.org/sergeybiryukov",
        "https://profiles.wordpress.org/tobifjellner",
        "https://profiles.wordpress.org/tokyobiyori",
        "https://profiles.wordpress.org/felipeelia",
        "https://make.wordpress.org/polyglots/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress",
        "#",
        "#",
        "#"
    ]
}