{
    "title": "Newly Rewritten WordPress SQLite Database Integration Plugin Needs Testing – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nApril 21, 2023\nSarah Gooding\nNewly Rewritten WordPress SQLite Database Integration Plugin Needs Testing\n\nWordPress contributors are making progress on officially supporting SQLite in core, a project that would benefit less complex sites (small to medium sites and blogs) that don’t necessarily require WordPress’ standard MySQL database. In a recent update, Yoast-sponsored core contributor Ari Stathopoulos said the SQLite Database Integration feature plugin has been rewritten, with the help of Automattic-sponsored core contributor Adam Zielinski, to be a more future-proof implementation.\n“The code has been completely rewritten to use an SQL Lexer and is now stable and able to handle all WordPress queries properly,” Stathopoulos said. “The SQL Lexer is part of the PHPMyAdmin/SQL-Parser project (licensed under the GPL 2.0) and it was adapted for WordPress, effectively implementing a MySQL to SQLite translation engine. This provides improved security, as well as compatibility.”\nStathopoulos contends that the next step is to implement these changes in WordPress core “instead of using a plugin,” because in its current form it can only be tested on pre-existing websites that already have a MySQL database.\n“Using the featured plugin is a great way to allow users to test the implementation and iron out any issues etc,” he said. “However, long-term, it doesn’t make sense to use it as a plugin.” \nStathopoulos created a draft Pull Request and an accompanying Trac ticket proposing the new implementation be merged into core.\nAlthough the effort has received positive feedback and support from the community and WordPress lead developer Matt Mullenweg, the feature plugin has only 30 active installs and the new implementation has received very little testing.\nMultiple participants in the discussion, including core committer Aaron Jorbin and lead developer Andrew Ozz, expressed concerns about the proposal’s call for merging the changes to core as the next step. \n“Talk of merging to core feels incredibly premature for a couple of reasons,” Jorbin said. “The plugin now only has around 30 installations. I think there needs to be much higher adoption in order to understand how the near-infinite number of plugins will work with this deep underlying change to WordPress.”\nJorbin also referenced WordPress’ philosophy of building things for end users who don’t want to have to make decisions about the underlying tech but simply want things to work.\n“Assuming that a user is going to understand different database engines and the potential tradeoffs feels far stretched to me,” Jorbin said. “Therefore, any implementation really needs to be rock solid and extremely thoroughly tested.”\nJorbin also echoed concerns of other contributors in previous conversations, about SQLite’s bizarre religion-infused “code of ethics.”\nOzz suggested the plugin could be added to WordPress as a mu-plugin or a “drop-in” similar to how caching add-ons are implemented, pushing back on the rigidity of the requirement to fully merge it into core.\n“Both of these methods are also better/more suitable for the users as they can be done by the hosting company or the script used for WordPress installation,” Ozz said. “There are some other benefits like independent updates, etc.”\nStathopoulos responded to these concerns, saying that he sees the merge to core as a long-term goal, although the proposal communicated more of an urgency that confused participants in the discussion.\n“It is premature,” Stathopoulos admitted. “However, looking at the bigger picture, it is not premature to plan for the future and get ready for it.\n“It may be premature now, but it won’t be 2 years from now… The problem is that we won’t be able to do it in the future unless we start working on it now.SQLite is not something that can – or should – happen in Core now, or even a year from now. It’s a long-term goal, and should be treated as such.”\nStathopoulos agreed that the plugin needs more adoption to see how it works with plugins across the ecosystem. He also responded to concerns about users not fully understanding the implications of the database engine they select on installation.\n“The proof-of-concept UI I put in place in the Core PR is just that – a proof of concept,”  Stathopoulos said. “Something to trigger discussion and allow us to find solutions. It can be anything, even installation scenarios (do you want to create a blog? A small e-commerce site? A large news outlet? The next Amazon?) That is a discussion that will need to happen when the time is right to discuss UI, but it’s is a bit too early for that, I don’t think we’re there yet.”\nStathopoulos recommends contributors test the new implementation with all the plugins they normally use, via the SQLite Database Integration plugin or by testing the draft pull request in WordPress Core.\nCategory: News, PluginsShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n3\n\n\n\n\t\t3 responses to “Newly Rewritten WordPress SQLite Database Integration Plugin Needs Testing”\t\n\n\n\n\n\n\n\n\n\n Sean Peckman says: \n\nApril 22, 2023 at 1:28 PM \n\n\nI’d there really any point in this? I’ve never seen a host with MySQL or Maria db, even low end ones\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n Cristian Drucioc says: \n\nApril 24, 2023 at 3:42 PM \n\n\nI’m curious to know if this update will have any impact on overall page speed and performance.\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n Kevin Shenk says: \n\nApril 26, 2023 at 1:10 AM \n\n\nI just converted a site over from Mariadb to SQLite and it feels quite a bit snappier so far. I used https://github.com/dumblob/mysql2sqlite for conversion.\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Notify me of follow-up comments by email. Notify me of new posts by email. \n\n Join the discussion via emailGet only replies to your comment, the best of the rest, as well as a daily recap of all comments on this post. No more than a few emails daily, which you can reply to/unsubscribe from directly from your inbox.Δ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nYou may also like\nSQLite Database Integration Now Available as a Plugin for  TestingJanuary 25, 2023Performance Lab Plugin to Add New Experimental SQLite Integration Module in Upcoming 1.8.0 ReleaseDecember 14, 2022Yoast and Google-Sponsored Core Contributors Propose New WordPress Performance TeamOctober 14, 2021\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing",
        "https://make.wordpress.org/core/2023/04/19/status-update-on-the-sqlite-project/",
        "https://wordpress.org/plugins/sqlite-database-integration/",
        "https://github.com/phpmyadmin/sql-parser",
        "https://github.com/WordPress/sqlite-database-integration/pull/9",
        "https://github.com/WordPress/wordpress-develop/pull/3220",
        "https://core.trac.wordpress.org/ticket/57793",
        "https://sqlite.org/codeofethics.html",
        "https://w.org/plugins/sqlite-database-integration/",
        "https://github.com/WordPress/wordpress-develop/pull/3220",
        "https://wptavern.com/category/news",
        "https://wptavern.com/category/plugins",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?share=twitter",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?share=mastodon",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?share=facebook",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?share=telegram",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?share=jetpack-whatsapp",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?share=pocket",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20Newly%20Rewritten%20WordPress%20SQLite%20Database%20Integration%20Plugin%20Needs%20Testing&body=https%3A%2F%2Fwptavern.com%2Fnewly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing&share=email",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing#comment-438542",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?replytocom=438542#respond",
        "https://bestmktsoftware.com/",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing#comment-438600",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?replytocom=438600#respond",
        "https://avu.nu/",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing#comment-438650",
        "https://github.com/dumblob/mysql2sqlite",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing?replytocom=438650#respond",
        "/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing#respond",
        "https://akismet.com/privacy/",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing",
        "https://wptavern.com/performance-lab-plugin-to-add-new-experimental-sqlite-integration-module-in-upcoming-1-8-0-release",
        "https://wptavern.com/performance-lab-plugin-to-add-new-experimental-sqlite-integration-module-in-upcoming-1-8-0-release",
        "https://wptavern.com/yoast-and-google-sponsored-core-contributors-propose-new-wordpress-performance-team",
        "https://wptavern.com/yoast-and-google-sponsored-core-contributors-propose-new-wordpress-performance-team",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge"
    ]
}