{
    "title": "2022 Campus Housing Fire Safety Report | Residential Education and Campus Housing",
    "body": "\n\nJump to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApply\nVisit\nGive\nLogin\nSearch\nToggle Menu\n\n\n\n\n\n\n\n\n\nClose Nav\nsearch query *\n\n\n\n\n\nCommon Searches\n\nWhat majors and minors are offered?\nWhere can I find information about graduate programs?\nHow much is tuition?\nWhat financial aid packages are available?\nWhere can I log in to SSU Online?\n\n\nClose Nav\n\n\nClose Nav\nsearch query *\n\n\n\n\n\n\nApply\nVisit\nGive\nLogin\nA-Z\nLibrary\nDirectory\nStudents\nMaps\nFaculty & Staff\nAthletics\nAlumni\nAbout UsToggle Submenu Mission\nHistory\nFacts\nDiversity\nPresident\nAdministration\nDivisions & Departments\nStrategic Plan\nSustainability\n\nAcademicsToggle Submenu Degree Programs\nSchools & Departments\nAcademic Calendar\nAcademic Support\nAdvising Central\nSchedule of Classes\nCatalog\n\nAdmissions & AidToggle Submenu Experience SSU\nHow to Apply\nI Have Applied\nForms\nFinancial Aid\nStudent Fees & Charges \nRegistrar\n\nCampus LifeToggle Submenu Seawolf Living\nClubs & Organizations\nCampus Recreation\nAssociated Students\nFraternities & Sororities\nHousing\nCulinary Services\nThings to Do at SSU\nAbout the Area\n\nNews & EventsToggle Submenu Seawolf Calendar\nSocial Media Feeds\nInsights Magazine\nCampus Updates\nFor News Media\nGreen Music Center\nBox Office Tickets\n\n\n\nClose Nav\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nMove Out 2023\n\n\nStudents, please be aware that the deadline to move out is 24 hours after your last final. Students who have a final on Friday of Finals Week are required to move out no later than 11:00 a.m. on May 20, 2023. Before you move out, make sure to change your mailing address, recycle, donate, and, throw away trash, and restore your residence. For more information, visit the Move Out webpage.\n\n\n\n  \n\n\n\n\n\n\nYou are hereREACH Home › Resident Services & Resources › Emergency Preparedness ›  \n2022 Campus Housing Fire Safety Report\n\n\n\n\n\n\nIn compliance with The Campus Fire Safety Right-to-Know Act, included as part of the reauthorization of the Higher Education Opportunity Act, the following is Sonoma State University’s Campus Housing Fire Safety Report for the 2021 calendar year.  PDF version of the 2022 Campus Housing Fire Safety Report available here.\nMandatory Supervised Fire Drills\nDuring this reporting period there were two mandatory supervised fire drills involving the campus housing community. The drills were conducted on February 4, 2021 and August 20, 2021.\nReportable Statistics - Summary for 2019-2021 Calendar Years\nFire Summary for 2019\n \nVillage\nAddress\nReportable Fires\nCause of each fire\nNumber of deaths related to fire\nValue of property damaged caused by fire:\nZinfandel\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nCabernet\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nVerdot\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nSauvignon\n1801 East Cotati Ave\n1\nIncense\n0\n$0\nBeaujolais\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nTuscany\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\n \n\nFire Summary for 2020\n\nVillage\nAddress\nReportable Fires\nCause of each fire\nNumber of deaths related to fire\nValue of property damaged caused by fire:\nZinfandel\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nCabernet\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nVerdot\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nSauvignon\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nBeaujolais\n1801 East Cotati Ave\n2\nCooking\n0\n$0\nTuscany\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\n \n\nFire Summary for 2021\n\nVillage\nAddress\nReportable Fires\nCause of each fire\nNumber of deaths related to fire\nValue of property damaged caused by fire:\nZinfandel\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nCabernet\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nVerdot\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nSauvignon\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nBeaujolais\n1801 East Cotati Ave\n3\nCooking\n0\n$0\nTuscany\n1801 East Cotati Ave\nN/A\nN/A\nN/A\nN/A\nNote:  The fire incident log is maintained by Residential Education and Campus Housing and is available for public review during normal business hours at the Sonoma State Residential Education and Campus Housing office located in Zinfandel Hall, 1801 E Cotati Ave, Rohnert Park, California.\nPolicies on Portable Appliances, Open Flames, Smoking, and Other Relevant to Fire Safety\n​\nPortable Appliances - In order to maintain a safe environment within the Residential Community, refrigerators 3 cubic feet or smaller, microwaves, and coffee pots are the only kitchen appliances allowed in residential suites. All other exposed coils and other electrical cooking appliances are prohibited including hot plates, rice makers, panini presses, small grills, pressure or slow cookers, etc. Space heaters, 3-D printers, portable air conditioners, clothes washers and dryers, Halogen lamps, and additional full size refrigerators are prohibited. All other electrical equipment must be UL approved and in safe operating condition. CSU Chancellor’s Office Executive Order 785, Provision Nine – Operations & Maintenance – prohibits the use of space heaters in campus buildings including the Residential Community.\nOpen Flames - Open flames are prohibited in the Residential Community to include, but not limited to, lit candles, incense, laboratory burners, and torches. Cooking is prohibited in any residential space other than a kitchen. Flammable or dangerous materials such as lighter fluid, gasoline, solvents, and caustic chemicals other than household cleaning agents are also prohibited. Only charcoal grills with lids and legs are allowed in the Residential Community. Gas grills of any kind are prohibited. Charcoal lighter fluid is prohibited; pre-soaked briquettes or a chimney style paper charcoal lighter should be used. Grills may only be used outside and at least 10 feet away from building walls. Grills may not be used on balconies or in corridors. Briquettes and ashes must be completely cold before being properly disposed of in a dumpster, and may not be thrown on the lawns or any other grounds locations.\nSmoking - Sonoma State University is a smoke and tobacco free campus. The smoking policy defines “smoking” as lighting, burning, carrying, inhaling, exhaling, or holding a lit cigarette, cigar, bidi, pipe, or other smoking or recreational vapor delivery apparatus containing tobacco or another substance. To view the full smoking and tobacco use policy, please visit the Smoking and Tobacco Free Policy.\nResidents are expected to be responsible regarding fire safety and the prevention of harm to the community. Residents and guests must follow procedures and immediately evacuate a building upon the sound of an alarm. Fire safety violations may be subject to local, state, and federal laws. Violations of the Fire Safety REACH Regulations include, but are not limited to:\nStarting, or attempting to start, fires or creating a high risk fire situation.\nJeopardizing the ability of University or local officials to respond to a fire situation; or the ability for individuals to evacuate a building. \nActivating a false alarm.\nMisusing, tampering with, disabling, covering, or removing any fire safety devices including: fire extinguishers, exit signs, smoke detectors, and door self-closing mechanisms.\nPossession of laboratory burners, butane torches, tiki torches, or other similar items.\nHaving any open flame in the Residential Community, including lit candles or incense. Residents may possess decorative candles, as long as the wick remains whole and unburnt.\nCooking in any residential space other than a kitchen. \nPossession of flammable or dangerous materials such as lighter fluid, gasoline, solvents, and caustic chemicals other than household cleaning agents. \nPossession of, discharging or attempting to discharge firecrackers or fireworks of any kind within or adjacent to the Residential Community.\nFailure to follow evacuation instructions and procedures. Residents should evacuate promptly upon becoming aware of a fire alarm in the building. If the alarm has ceased sounding, it does not mean the building is cleared for re-entry; wait for instruction from REACH staff and/or authorized personnel. \n \nPlease be advised that local emergency agencies, when responding to fires, medical assists, and other emergency situations in the Residential Community can legally charge the responsible student(s) reimbursement fees or fines. \nEvacuation and Fire Safety Education and Training Programs\nUpon assuming occupancy in the fall semester, all campus residents receive a move-in written publication which includes “What To Do in Case of an Emergency”. This emergency information includes what to do in case of fire: i.e., how and where to evacuate, contacting authorities, and activating fire alarms. There is also a permanent emergency information decal mounted on the inside of every living unit’s entry door stating how to report an emergency and what to do in case of fire. This decal also includes the 24 hour emergency information hotline maintained by the university.  In addition, Resident Advisors host a mandatory neighborhood meeting at the start of every semester where they welcome students, provide evacuation, fire safety, and general policy information as a means to provide a safe living environment for all students. Emergency preparedness and evacuation information are also maintained and available online.\nCampus Housing Facilities\nSonoma State University has six on-campus student housing villages with the following building, unit, and occupancy capacity counts.\nHousing Facilities\nVillage\nOccupied\nBuildings in Village\n# of Units\nCapacity\nZinfandel\n\n1972\n\n\nBarbera, Chardonnay, Flora, Riesling, Semillon, Traminer\n\n\n96\n\n\n408\n\nCabernet\n\n1985\n\n\nGamay, Merlot, Muscat, Pinot, Tokay\n\n\n52\n\n\n244\n\nVerdot\n\n1991\n\n\nSauterne, Chablis, Chenin Blanc, Claret, Meritage\n\n\n60\n\n\n300\n\nSauvignon\n\n1999 & 2000\n\n\nAlicante, Burgundy, Colombard, Fume Blanc, Grenache, Marsanne, Sirah\n\n\n160\n\n\n935\n\nBeaujolais\n\n2003\n\n\nAlsace, Bordeaux, Classico, Loire, Madiera, Medoc\n\n\n171\n\n\n654\n\nTuscany\n\n2009\n\n\nMosel, Piemonte, Provence, Rhone, Savoie, Trentino, Veneto\n\n\n128\n\n\n698\n\nFire Safety Systems\nThe following is a description of the fire safety systems in the respective villages:\nFire Alarms\nAll villages are all equipped with a Nodifier Onyxworks Fire Alarm System, fire and smoke (heat/smoke) detection, on the interior of each unit per the National Fire Protection Association - NFPA - 72 and maintained per California Code of Regulations Title -19 Section 1.14. Each fire and smoke detector alarm signals and reports all trouble to Police Services and the Boiler Plant only, and do not directly signal to the local Fire Department - Rancho Adobe Fire Protection District, Rancho Adobe Station No. 1, (707) 795-5455.  The Nodifier Onyxworks Fire Alarm System is a proprietary, 24 hour continuously monitored system.  Each individual heat/smoke device and pull station is tested and serviced annually.  All of the campus housing buildings are equipped with manual pull stations in various exterior locations tied into an audible horn fire alarm system, per the National Fire Protection Association - NFPA - 72 and maintained per California Code of Regulations Title -19 Section 1.14, with one exception.   Audible horns equipped with strobe lights are installed in selected suites designed to house hearing impaired students, and are installed in accordance with National Fire Protection Association - NFPA-72.  In the Merlot building, which is part of the Cabernet Village, (three story building with interior exit passageways) manual pull stations - audible horn/strobe fire alarm system are located on the interior exit passageways, per the National Fire Protection Association - NFPA - 72 and maintained per California Code of Regulations Title -19 Section 1.14. \nFire Panels\nAll villages have fire alarm panels and sub-panels with emergency back-up power, via dry cell battery designed to last for a 24-hour period in the event of a power outage, per the National Fire Protection Association - NFPA - 72 and maintained per California Code of Regulations Title -19 Section 1.14. \nFire Extinguishers\nAll villages are equipped with fire extinguisher cabinets - located on the exterior of each building, (MP Series - Multi-Purpose Dry Chemical Class ABC Fire - Fire Extinguishers).  In addition Beaujolais Village, Cabernet Village, Sauvignon Village and Tuscany Village (the “apartment villages”) provide MP Series - Multi-Purpose Dry Chemical Class ABC Fire - Fire Extinguishers in the interior of each unit in the kitchen area, per NFPA - 72 and maintained per California Code of Regulations Title -19 Section 1.14. \nFire Sprinkler Systems\nBeaujolais, Tuscany and Zinfandel Villages are equipped with a fully functioning and certified fire sprinkler system; each building and unit in Beaujolais Village and Tuscany Village has fire sprinkler coverage, per the National Fire Protection Association - NFPA - 13 and maintained per California Code of Regulations Title -19.   The Zinfandel Village has limited fire sprinkler coverage in buildings and units.  Zinfandel Village is maintained per California Code of Regulations Title -19.  Cabernet Village, Sauvignon Village and Verdot Village are not equipped with a fire sprinkler system, none of the buildings and/or units has fire sprinkler coverage. The Barbera and Traminer buildings in the Zinfandel Village are each equipped on the exterior with a Standpipe System Fire Type - II hose cabinet, with a 100 foot hose length.\nEmergency Blue Light Phones\nAll villages are provided with an emergency blue phone to directly call 911 Emergency, Police and Safety Services 24 - hours, 7 days per week.\nCarbon Monoxide Devices\nCarbon monoxide devices are installed in apartments with gas units.\nInspections\nThe Office of the State Fire Marshal, (Deputy State Fire Marshal) inspects, tests and certifies annually the fire safety systems in each of the campus housing villages to confirm the systems are fully functioning and maintained, per the California Code of Regulations Title -19 Section 1.14. \nFuture Improvements and Continued Efforts with Fire Safety\nIn 2019 Residential Education and Campus Housing (REACH), in conjunction with the Disability Services for Students Office, developed a evacuation plan for students with disabilities. Monitary and student conduct sanctions are assessed to the residents if a smoke detector is discovered to be tampered with in a bedroom or common area.  Emailed notifications reminding students about the policies surrounding smoke detectors and fire safety.\nReporting Procedures\nOnce a fire has been extinguished, the incident should be reported to the Director of Residential Education and Campus Housing at 707-664-2541 or by email at housing@sonoma.edu.\nJeanne Clery Act Annual Report\nThe Sonoma State University Jeanne Clery Act Annual Report is located on the Clery Act website, overseen by Risk Management & Safety Services.\nFire Log\nResidential Education and Campus Housing maintains the required campus housing fire log.  The log can be accessed at the Residential Education and Campus Housing office, located in Zinfandel Village.  Paper copies can be made available.\n\n\n\n\n\n\n\n\nResidential Education and Campus Housing\n\nREACH  Home\nApply for Housing\nHousing Options\nOn Campus Rates & Installments\nHousing Portal\nMove In & Move Out\nResident Services & ResourcesEmergency Preparedness3 Day Emergency Checklist\nPower Outages\nFire Safety Report\n\nForms and Publications\nGuest Regulation and Registration\nCancellations\nHousing License Agreement\nMail and Packages\nMaintenance\nRoom Change Requests\nPetition to Break Housing License Agreement\nRoommate Agreements\nStudent Conduct\nSustainability\nXfinity TV (\"Cable\" & Streaming)\nFall, Winter, and Spring Breaks\nMove Out\n\nFire Safety Report\nEmployee Housing\nLiving Off-Campus\nParent/Guardian\nWhy Live at SSU?\nAbout REACH\nContact\n\n\n\n\n\n\n \n\n\nFacebook for REACH \n\n\nInstagram for REACH\n\n\nYouTube for REACH\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSSU Facebook\nSSU Twitter\nSSU Instagram\nSSU Youtube\nSSU News RSS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1801 East Cotati Ave\nRohnert Park, CA 94928\n707.664.2880\n\n\n\n\n\n\n\nContact SSU\nPrivacy Notice\nCalifornia State University\n\n\n\nAccessibility\nSafeSSU\nWebsite Feedback\n\n\n\nEmergency Information\nJobs\nTitle IX\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "http://www.sonoma.edu/",
        "http://www.sonoma.edu",
        "http://admissions.sonoma.edu/apply",
        "https://www.sonoma.edu/visit",
        "http://www.sonoma.edu/give",
        "https://login.sonoma.edu/",
        "#",
        "#",
        "#",
        "http://www.sonoma.edu//academics/degree-programs",
        "http://www.sonoma.edu/aa/gs/",
        "http://www.sonoma.edu/registration/fees.html",
        "http://www.sonoma.edu/finaid",
        "https://login.sonoma.edu/",
        "#",
        "#",
        "http://admissions.sonoma.edu/apply",
        "https://www.sonoma.edu/visit",
        "http://www.sonoma.edu/give",
        "https://login.sonoma.edu/",
        "http://www.sonoma.edu/a-z",
        "http://library.sonoma.edu",
        "https://ldaps.sonoma.edu/fasd/",
        "http://www.sonoma.edu/students",
        "http://www.sonoma.edu/maps",
        "http://www.sonoma.edu/faculty-staff",
        "http://sonomaseawolves.com/",
        "http://www.sonoma.edu/alumni",
        "http://www.sonoma.edu/about",
        "#",
        "http://www.sonoma.edu/about-us/mission",
        "http://www.sonoma.edu/about-us/history",
        "http://www.sonoma.edu/about-us/facts",
        "http://diversity.sonoma.edu",
        "http://www.sonoma.edu/about-us/president",
        "http://www.sonoma.edu/about-us/administration",
        "http://www.sonoma.edu/divisions-departments",
        "http://strategicplan.sonoma.edu/",
        "http://sustainablessu.sonoma.edu/",
        "http://www.sonoma.edu/academics",
        "#",
        "http://www.sonoma.edu/academics/degree-programs",
        "http://www.sonoma.edu/academics/schools-departments",
        "http://www.sonoma.edu/academics/calendar",
        "http://www.sonoma.edu/academics/support",
        "//advising.sonoma.edu/",
        "http://www.sonoma.edu/academics/schedule-classes",
        "http://catalog.sonoma.edu/",
        "http://admissions.sonoma.edu/",
        "#",
        "http://admissions.sonoma.edu/experience",
        "http://admissions.sonoma.edu/how-apply",
        "http://admissions.sonoma.edu/i-have-applied",
        "http://admissions.sonoma.edu/forms",
        "http://www.sonoma.edu/finaid",
        "http://seawolfservices.sonoma.edu/fees",
        "https://registrar.sonoma.edu/",
        "http://getinvolved.sonoma.edu/",
        "#",
        "http://www.seawolfliving.com/",
        "http://getinvolved.sonoma.edu/recognized-student-organizations",
        "http://campusrec.sonoma.edu/",
        "http://as.sonoma.edu/",
        "http://getinvolved.sonoma.edu/fraternity-and-sorority-life",
        "http://housing.sonoma.edu",
        "http://culinary.sonoma.edu/",
        "http://www.sonoma.edu/campus-life/things-to-do",
        "http://www.sonoma.edu/campus-life/about-area",
        "http://news.sonoma.edu/",
        "#",
        "http://www.sonoma.edu/calendar",
        "http://news.sonoma.edu/social-media-feeds",
        "http://news.sonoma.edu/insights",
        "http://www.sonoma.edu/updates",
        "http://news.sonoma.edu/media",
        "http://gmc.sonoma.edu/",
        "https://tickets.sonoma.edu",
        "#",
        "https://housing.sonoma.edu/move_out_information",
        "/",
        "/resources",
        "/resources/emergency-preparedness",
        "https://housing.sonoma.edu/sites/housing/files/files/2022_campus_housing_fire_safety_report_0.pdf",
        "http://policies.sonoma.edu/policies/smoking-and-tobacco-free-environment",
        "https://emergency.sonoma.edu/procedures",
        "mailto:housing@sonoma.edu",
        "http://clery.sonoma.edu/annual-security-report",
        "/",
        "/apply-housing",
        "/housing-options",
        "/rates",
        "/housing-portal",
        "/move-in-move-out",
        "/resources",
        "/resources/emergency-preparedness",
        "/resources/emergency-preparedness/3-day-emergency-checklist",
        "/resources/emergency-preparedness/power-outages",
        "/resources/emergency-preparedness/fire-safety-report",
        "/resources/forms-and-publications",
        "/resources/guest-regulation-and-registration",
        "/resources/cancellations",
        "/License-Agreement",
        "https://mailservices.sonoma.edu/services-students",
        "/resources/maintenance",
        "/resources/room-change-request",
        "/resources/petition-break-housing-license-agreement",
        "/resources/roommate-agreements",
        "/resources/student-conduct",
        "/resources/sustainability",
        "/resources/xfinity-tv-cable-streaming",
        "/resources/fall-winter-and-spring-breaks",
        "https://housing.sonoma.edu/Move-Out",
        "https://housing.sonoma.edu/resources/emergency-preparedness/fire-safety-report",
        "https://www.sonoma.edu/employee-housing",
        "/contact/living-off-campus",
        "/parentguardian",
        "/why-live-ssu",
        "/about",
        "/contact",
        "https://www.facebook.com/ssuhousing",
        "https://www.instagram.com/sonomastatehousing/?igshid=YmMyMTA2M2Y%3D",
        "https://www.youtube.com/channel/UCPuZdBiwwTv0EYQwfqvGYsQ?",
        "https://sonoma.rms-inc.com/Page/SSULanding",
        "https://sonoma.metabim.com/login/Welcome.htm",
        "https://www.hud.gov/program_offices/fair_housing_equal_opp",
        "https://www.facebook.com/sonomastateuniversity",
        "https://twitter.com/ssu_1961",
        "https://instagram.com/sonomastateuniversity",
        "https://www.youtube.com/csusonoma/",
        "http://news.sonoma.edu/rss.xml",
        "http://www.sonoma.edu",
        "http://www.sonoma.edu/contact-ssu",
        "http://www.sonoma.edu/privacy",
        "https://www.calstate.edu/",
        "http://accessibility.sonoma.edu",
        "https://safessu.sonoma.edu",
        "https://www.sonoma.edu/website-feedback",
        "http://www.sonoma.edu/ps/emergency/",
        "http://www.sonoma.edu/employment",
        "http://ophd.sonoma.edu/"
    ]
}