{
    "title": "Alumna Chloe Gharios Breaks Barriers and Stereotypes in STEM | Titan - The Digital Magazine of Cal State Fullerton",
    "body": "Some page features may require javascript to run.Skip to Content (Press Enter)Alumna breaks barriers in STEM: â\u0080\u0098You can succeed in engineering and be a girl in pink heels.â\u0080\u0099By Debra Cano Ramos / Photos By Matt GushChloe Gharios Osorio is on a mission to empower young women in STEM.It all began with her parents. At a young age, they gave her the confidence to step into a â\u0080\u009cmanâ\u0080\u0099s worldâ\u0080\u009d in pink high heels and steel-toe construction boots â\u0080\u0094 and succeed.â\u0080\u009cI am lucky to have grown up with parents who never allowed me to believe that being a girl closed any doors. I could do, and succeed, at whatever I put my mind to as a woman,â\u0080\u009d says the Cal State Fullerton alumna.Whether sheâ\u0080\u0099s in her high-rise office in downtown Los Angeles, at a jobsite or leading a viral social media movement to break stereotypes in STEM, Osorio declares that women can be girly-girls â\u0080\u0094 and engineers. The self-proclaimed â\u0080\u009cSTEMinistâ\u0080\u009d boldly wears pink, sometimes hot pink, and her work cubicle is bedecked in pink decor.â\u0080\u009cI love pink and anything fun and sparkly. My mom taught me that being feminine should never take away from my professionalism and ability to do a job well,â\u0080\u009d says Osorio, a civil engineering associate for the Los Angeles Department of Water and Power.That encouragement from her mother fueled her determination to become an engineer. Her father, an environmental engineer, introduced her to the world of engineering.â\u0080\u009cMy dad would come to my elementary school classroom on career day with cool models and stories about engineering. He and my mom are my inspiration,â\u0080\u009d she says.I am lucky to have grown up with parents who never allowed me to believe that being a girl closed any doors.- Chloe Gharios Osorio â\u0080\u009917Shattering Stem StereotypesOsorio â\u0080\u009917 (B.S. civil engineering) is no stranger to overcoming obstacles and shattering gender stereotypes.When she was 8 years old, she wanted to play basketball like her older brother. Since there were no teams for girls in her Long Beach neighborhood, she played on a team with all boys.â\u0080\u009cMy mom told me, â\u0080\u0098You are not a girl basketball player, you are just a basketball player, and you can be as good as anyone on the court.â\u0080\u0099 That has stuck with me throughout my entire education and career, and I apply it to everything I do.â\u0080\u009dWhen she entered the engineering workforce, some people remarked about her being â\u0080\u009ctoo girlyâ\u0080\u009d to be an engineer.â\u0080\u009cI realized I needed to be involved in changing those attitudes and showing young girls and women that there is a place for them in STEM if that is where they want to be,â\u0080\u009d she says.To inspire women to break through barriers and become STEM â\u0080\u0094 science, technology, engineering and mathematics â\u0080\u0094 professionals, the millennial who grew up with social media turned to platforms like Instagram and TikTok.View post on InstagramÂ In 2020, she posted a photo of her feet â\u0080\u0094 one foot in a high heel and the other in a construction boot on Instagram @chloetheengineer.â\u0080\u009cThe photo went viral, and people commented to make it a challenge. The #stompingoutstereotypes movement was born,â\u0080\u009d recalls Osorio. â\u0080\u009cI was surprised by how it resonated with so many people. What this movement means to me is that my femininity, and my STEM career, can coexist.â\u0080\u009dThroughout 2020, women all over the world posted their versions of #stompingoutstereotypes pairing stilettos, ballet slippers and roller skates with construction boots.â\u0080\u009cMore recently, Instagram reels have been created,â\u0080\u009d adds Osorio, who has 11,000 followers. â\u0080\u009cNow, there are hundreds and hundreds of posts with the hashtag. The movement is alive and well.â\u0080\u009dOsorio also is paving the way for other women by promoting her message of inclusion and diversity at outreach events for K-12 girls.â\u0080\u009cI want to show them that they can be themselves and thrive in STEM.â\u0080\u009dSolving Real-World ProblemsChloe Gharios Osorio â\u0080\u009917, a civil engineering associate for the Los Angeles Department of Water and Power, is a self-proclaimed â\u0080\u009cSTEMinist.â\u0080\u009dIn college, Osorio was in the President's Scholars program for high-achieving students and a student-athlete on the womenâ\u0080\u0099s soccer team. After an undetected heart issue ended her soccer career during her sophomore year, she became involved with College of Engineering and Computer Science student organizations.She served as chapter president of the American Society of Civil Engineers during her junior year and was involved with Associated General Contractors of California. In 2021, she was honored by the American Society of Civil Engineers as a New Face of Civil Engineering for her early-career accomplishments.â\u0080\u009cBeing a woman in an engineering or computer science major can sometimes feel lonely and difficult,â\u0080\u009d she says. â\u0080\u009cThese organizations were my greatest support in school and where I made some of my best friends.â\u0080\u009dOsorio built concrete canoes and stabilized retaining walls for collegiate competitions. She attended conferences in places like San Antonio, New York City and Portland.â\u0080\u009cThese competitions taught me real-world problem-solving and how to apply engineering principles to a project,â\u0080\u009d she shares.For the past five years, Osorio has worked at the Los Angeles Department of Water and Power on projects to provide clean, safe and reliable electricity through renewable energy sources and conservation.â\u0080\u009cItâ\u0080\u0099s an exciting time to work in the power industry since innovation and new infrastructure are needed to help us achieve our clean energy goals,â\u0080\u009d she says.One day she could be working on a transmission line project, and the next day, on a new distribution station.â\u0080\u009cEngineers can change the lives of thousands of people and entire communities. I find that extremely rewarding â\u0080\u0094 and itâ\u0080\u0099s why I do what I do.â\u0080\u009d Support Women in Computer Science and Engineering:give.fullerton.edu/WiCSEEmpowering Women for the Stem WorkforceOver the last decade, the College of Engineering and Computer Science has made strides to close the gender gap through programs that engage, retain and prepare women for the STEM workforce.These include:Since 2012, the Women in Computer Science and Engineering program has provided academic support and an inclusive community to help women succeed in their STEM majors.A $325,000 grant from Bank of America, coupled with a matching gift from MacKenzie Scott and Dan Jewett, established a nearly $500,000 endowment to triple the number of women served by WiCSE and support students during all four years of their undergraduate education.A $650,000 â\u0080\u009cBest Practiceâ\u0080\u009d grant from the Center for Inclusive Computing at Northeastern University is building a pipeline of community college students to CSUF to boost the number of women in highly skilled computing jobs.The state allocated $67.5 million toward building the new Engineering and Computer Science Innovation Hub. The state-of-the-art instructional and research spaces will help to further attract women to engineering and technical careers.This spring, the college launched the design phase of the ECS Innovation Hub. Additional state funding and fundraising are being sought to move from concept to groundbreaking.â\u0080\u009cThe ECS Innovation Hub allows us to greatly expand and elevate our academic offerings to meet our regionâ\u0080\u0099s workforce demands,â\u0080\u009d says Dean Susan Barua. â\u0080\u009cIt will provide equitable learning opportunities, enrich pathways to student success and attract a more diverse student body. This in turn will help diversify â\u0080\u0094 both in gender and ethnicity â\u0080\u0094 the engineering and technology workforce.â\u0080\u009dFor more information or to donate to the ECS Innovation Hub, contact Michael Karg, executive director of development, at mkarg@fullerton.edu. More StoriesOnce a Titan, Always a TitanA Titan Takes the FieldThe Secretâ\u0080\u0099s in the Hot SauceRaising $270 Million: A Titan Success StoryPresidentâ\u0080\u0099s MessageThis site is maintained by Division of University AdvancementTo report problems or to comment about this site, please contact strategiccomm@fullerton.eduÂ Â |Â Â Privacy PolicyÂ© California State University, Fullerton. All Rights Reserved.Additional ResourcesEmergency InformationUniversity PoliceCSUF Accessibility Â  | Â  Feedback FormDownload Adobe Acrobat Reader Acrobat Reader Â  | Â  Download Word viewer, or download Excel viewer, or download PowerPoint viewer Microsoft ViewerPrivacy PolicyAnnual Security Report (Clery)Title IXContacts and AddressesSite IndexCampus MapCSUPresidentFramroze M. Virjee, JDVice President, University AdvancementGregory J. SaksAssociate Vice President, Strategic Communications and Brand ManagementEllen TreanorEditorialTaylor Arrey, Lynn Juliano, Valerie Orleans, Debra Cano RamosDesign and VisualsHoward Chang, Matt Gush, Robert Huskey, Robert Rodriguez, Mishu VuProductionJillian Brander, Denise Del Cid, Michael Mahi, Savannah Terrazas",
    "links": [
        "#MainContent",
        "https://www.instagram.com/p/CDeHmLTj09U/",
        "https://www.youtube.com/watch?v=_A8Q2mCGtpc",
        "https://give.fullerton.edu/WiCSE",
        "http://www.fullerton.edu/ecs/wicse/",
        "https://news.fullerton.edu/2021/12/grant-from-bank-of-america-supports-csufs-women-in-computer-science-and-engineering-program/",
        "https://news.fullerton.edu/2021/03/650000-grant-to-attract-retain-and-graduate-women-in-computer-science/",
        "https://news.fullerton.edu/2022/05/governors-may-revise-includes-67-5-million-for-cal-state-fullertons-engineering-and-computer-science-innovation-hub/",
        "mailto:mkarg@fullerton.edu",
        "/spring-summer-2023/i-am-and-always-will-be-a-titan/",
        "/spring-summer-2023/titan-in-the-outfield/",
        "/spring-summer-2023/the-secrets-in-the-hot-sauce/",
        "https://titanmag.fullerton.edu/spring-summer-2023/raising-270-million/",
        "/spring-summer-2023/presidents-message/",
        "http://www.fullerton.edu/advancement",
        "mailto:strategiccomm@fullerton.edu",
        "https://www.fullerton.edu/it/iso/policy/online-privacy.php",
        "http://emergency.fullerton.edu",
        "https://police.fullerton.edu/",
        "http://www.fullerton.edu/ati",
        "http://www.fullerton.edu/ati/reportati",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/",
        "https://www.fullerton.edu/it/iso/policy/online-privacy.php",
        "https://police.fullerton.edu/jeanneclery",
        "http://www.fullerton.edu/titleix/",
        "https://www.fullerton.edu/contact.aspx",
        "https://www.fullerton.edu/a-z.aspx",
        "http://www.fullerton.edu/campusmap/",
        "https://www2.calstate.edu/"
    ]
}