{
    "title": "Uncategorized | Watershed Review",
    "body": "\n\n\n\n\n\n\n\nWatershed Review\nEst. 2012\n\n\n\n\nMenu\n\nSkip to content\n\nHomeAbout This Blog\nHistory\nSubmit\n\n\n\n\n\n\n\t\t\t\t\tCategory Archives: Uncategorized \n\n\n\nWR Intern Spotlight: Confessions of an English Major, or Four Years of English Classes in 750 Words \n\nBy Isabel Henson\nMay we never again write a five paragraph essay.\nDo you remember it? The one we were taught in high school: Introduction, three concrete paragraphs, then conclusion? Some might have even shown it as a hamburger with each bun, lettuce, cheese, and patty paralleling a specific paragraph. Well, it sucks. \nDon’t misunderstand me. I think it has its time and place between learning how to write and well…only during learning how to write, but anything past that holds no substance. No real weight. To stay placidly within that structure creates a kind of self bondage that doesn’t translate into the real world. It taught us how to organize thoughts: but only in one specific way. There are a myriad of ways.\nGive praise where it is due.\nI do concede that if it hadn’t been for that five paragraph essay, however, I don’t know if I would have ever ran far away from it, to the opposite point of the spectrum and found my passion.\nUnpopular opinion: anyone who hates poetry is wrong.\nPoetry can be the opposite of the previously mentioned rigid structure. Run ons that just keep on going and going and going taught me that they are not the hearsay that I was taught and instead they have purpose and create an urgency that can only be matched or stopped by the use of fragments. Beautiful little sentences. Two words. Sometimes. Only. One. These weave focus and pointed meaning. Let us come up for a swallow of air. Everything I was taught never to use are the breaths that contribute to the lungs of the poem. \nIt only takes one. \nI always claimed I was a poet. Turned my nose up to any prose partially because I thought poetry was superior, but mostly because I had a disastrous writing experience at my community college that solidified my belief that I could never write fiction. Pair that with back to back heartbreaks and nothing can remedy the soul like a poem. And all was going fine until my last semester of undergrad where I stumbled upon a new medium to color my world.\nYou must know the rules to break the rules\nBut this also means pushing past one’s own creative comfort zone: willingly…or sometimes unwillingly. Writing does not live within a set of lexical walls and boundaries. It does not reside within a prescriptive fortress. It is formed from experience, from hopes and dreams, from fears and nightmares. \nNow break the rules:\nMy very first class at Chico State was Literary Genres. I walked in ready to listen to the usual poetry/prose, nonfiction/fiction ideas and was instead confronted with the idea and possibility that literature is all around us. In the signs we read, in the syllabus we idly toss, in the posters held at BLM or Roe v. Wade protests. It was not confined to the historically straight male white cannon but moved fluidly in social media and also in the lyrics of J Cole. \nTime and time again I encountered this stretch of norms and steered to uphold writing to the honor it deserves. Not by rules. By content, by ferocity, by impact.\nSo I consumed it all and took as many poetry classes as I could to move into the space I had been taught until\nI was forced to take a nonfiction class.\nAnd the only reason I took it was because my advisor “encouraged” me (basically told me) I should not take any more poetry classes. Maybe branch out a bit. Become a little more well rounded. Appalled and annoyed, I agreed and landed myself in a nonfiction creative writing class. Once again I assumed that I would hear the poetry/prose, nonfiction/fiction talk. Turned out to be one of my favorite classes at Chico State.\nIs it cheating if I still love both?\nMy creative nonfiction professor told me one day that I don’t know where I had been hiding, or what this “I’m not a prose writer” nonsense I had been claiming, but that I had to recognize that I was one. But the best writers of the field are those that read everything and try their hand, even for fun at a different genre. The five paragraph essay, though dull and terrible, gave me one set of tricks. Poetry handed me many more. Research papers, term papers about Shakespeare or projects on Walt Whitman, and reading Claudia Rankine’s Citizen or Mai Der Vang’s Afterland gave me more. How beautifully coincidental that the last class I take here mirrors the one that began my career. That I would work for the same Watershed Review that was handed to me during my introduction to this university. If there is anything we English majors take away, it is that we are taught to admire the complex ending. It does not come neatly tied with string but rather is up to interpretation and is full of twists, leaving it up to interpretation if it is the end or the beginning.. \nEven a graduate still loves a cheesy happy ending. \n\n \n\nMay 24, 2022watershedcsuc\n\n\n\n\nWR Intern Spotlight: Graduate, Student \n\nBy Jenna Welton\n\nCreative writing cradles the aspiring author in a cocoon of captivating craft elements and wild ideas. The undergraduate balances work and school, work, procrastination, and mind blanks.\nTry to stay productive because undergrad is almost over. You’ve almost made it! Wildfires swallow the surrounding communities. Sit and stare at articles for hours without processing a single thing.\nSit bare naked and exposed in front of the laptop screen. There’s nothing to hide but no words to write. Barricaded by the barriers of a traumatized mind.\nWait and worry about those pre-requisites instead.\nLet the pain dissipate gradually.\nGraduate.\nThe virus hits right as the imposter syndrome was starting to subside. Second-semester spirals. Home becomes school becomes work which became a cage as we scramble searching for a separate space.\nThis is grad school—keep up the momentum. You’re a grad student—keep up the momentum. This is grad school? This is your kitchen, your living room, and your cat who won’t stop getting on top of the counter.\nSummer swells with the exhaustion of the last semester and the scattered sentences of a thesis yet to be written. Autumn comes. Those page counts need to be reached soon if those deadlines are to be kept.\nThose deadlines are being pushed back again.\nA flash-fiction collection concept. Pages that seem to add up with every editing attempt. Try to expand on this. Please provide further explanation for your reader. We need more context. More inner dialogue, please. \nFluid short fiction flows from the fingertips with ease. A larger commitment comes with wordier literary works. Suddenly the piece has inner faucets that need tending to like those loose ends and pacing problems. You’d better revise any problematic plot holes or faulty character arcs as well. \nDiscussion Questions to Consider:\n    1. Who’s the killer of the story?\n    2. Which twists and turns are too trope-thick?\n    3. Is this influence-soaked work even yours anymore?  \nPiles of papers containing comments keep the thoughts flowing but at too rampant of a pace. The revision process returns once again. Try to reestablish what the work was hoping to accomplish before being dissected. Is it still the same story? Is it successful? What does successful art look like?\nWait. Worry about what happens after all this and after your defense.\nGet it together and let these extra months be your saving grace.\nGraduate.\n\n\n \n\nMarch 2, 2022watershedcsuc\nLeave a comment\n\n\n\n\nWR Intern Spotlight: A Charge of First-Degree Writing: Almost Objective Notes from a Slush Reader \n\nBy Morgan Konefal\nTwenty chapbook manuscripts. Hundreds of poems. Hours reviewing, pitching, and selecting pieces to share with a world. As an editor, this is the delicious bread and butter sprinkled with inspiration and cheddar cheese, lots of cheddar cheese. And believe it or not, depending on your astute knowledge of the enigmas of the publishing world, us editors are writers as well.  \nAs verbally inclined artists, we are plagued (or blessed depending on your state of being) with a need to give a fraction of our jotted-down soul to anyone willing to hold it. Books. Zines. Facebook posts. A message in a bottle. Bathroom graffiti. A mother’s day card that only one person in the entire world willingly wants to read. \nMost importantly (and subjective to both you and me) are the beautiful forms of poetry and the literature that falls under the umbrella term “short stories”. And as an editor, I am often asked by invisible and imaginary enthusiastic submitters: “How do I go from hopeful applicant to slapping Take That, Doubters! onto my list of published praised places?” My answer? Maximum effort. Purpose. Passion. Think you’ve got all the ingredients mixed without lumps or an accidental addition of Chemical X? Look into the mirror and interrogate your reflection with the following script before pushing the “submit” button. \n  Why are you submitting? \n  To get published. \n  Don’t we all?\n  I want to get published so I can go on and on and on and on and on and on   about it at the office Christmas party.\n  Wrong.\n  Why is this poem going first in the collection? \n  It’s the titular piece.\n  Is it the strongest one?\n  No.\n  Wrong.\n  Why does this character need to die?\n  Because I hate my mother-in-law.\n  But does it complicate the story? Does it produce that sweet, sweet nectar of   character development? Is there a lesson learned at her expense? Will the   reader be impacted? Think hard about it.\n  You mean is this only a way to force my readers to live out a fantasy that is   concerning as it is cliche? \n  Yes. \n  Yes. \n  Wrong.\n            Why\t\n                    are\n                    the\n            words \n                    placed\n                    this \n                               way?\n  It’s a poetic, artistic choice.\n  Yes, but does the form make sense with the message? Are the white spaces a   way to denote the slowly melting polar regions in a poem about poisons   pouring into the elements? Are alignments given to show the divide between   two lovers as they realize their whirlwind relationship truly should stay in   Vegas? \n  No, it just looks cool.\n  Wrong.\n  Did Grammarly correct all your grammar mistakes for you?\n  Mayb.\n  Wrong.\nIs this really a piece containing an idiosyncratic, beautiful voice that sings lyrics to awaken the soul of a nonbeliever? Did you really spend hours and hours rehearsing it before declaring it could not possibly have a higher potential for greatness? You’re really auditioning this work of magnificence because it means something to you and you hope it can to others?\nYes.\nCongratulations, you’ve been selected for this edition of _______.\n\n\nMarch 2, 2022watershedcsuc\n\n\n\n\nWith Great Design Comes Immense Power \n\nThrough my semester-long internship with Watershed Review (@watershed.csuc), I was tasked with refining the aesthetic and creating ongoing features for the literary magazine’s Instagram account. When approached to do this, the bold letters that screamed NERVOUS in my head could not be more apparent, my experience with Instagram posts limited to viewing, not creating. After some much needed research I was able to build a foundation for what it takes to make a literary magazine’s Instagram work. Once I sat down to make a list of the essential things, I realized just how daunting a task this can be. Instagram is an important platform, the extent of design possibilities unknown. As well, using this tool to gather a loyal following can really make or break a literary magazine. Through my research, I’ve come to see that two categories are the most crucial: design and connectivity.\n… \nDesign\n\nWhen thinking about design I knew just as much as my grandmother Mimi knows about Twitter, which is not a lot, but with some help, examples, and several books I was able to get a handle on a couple of important design considerations—color scheme and font.         \nColor\nWhether that is a simple color scheme like black and white which Instant, A Literary Magazine (@instantlitmag) does so beautifully, or a cohesive color scheme with a subtle color accent, like Shenandoah Literary Magazine (@shenandoah_literary), both give the viewer a full picture when looking at the feed from a grid without the eye getting overwhelmed. Another aspect to visual happiness is a design that flows throughout each post, Pathos Literary Magazine (@pathoselitmag) shows this with ease through their spunky cartoons. \nFont\nFont, like color, is also very important when making a magazine’s Instagram work. Robin Williams, author of The Non-Designer’s Design Book states, “a reader should not have to try to figure out what is happening on the page—the focus, the organization of material, the purpose, the flow of information, all should be recognized instantly with a single glance.” Keeping one or a few similar fonts consistent across posts is a way a magazine, like Honey & Lime Literary Magazine (@honeyandlimelit), is able to have a busier background but still keep a post soothing to the eye. \n\nAs a viewer I saw fonts as the most basic form of design, something I hadn’t even thought about past MLA format, but now as a learner and creator I see it for what it is. Ellen Lupton, author of Thinking with Type states “typefaces are an essential resource employed by graphic designers, just as glass, stone, steel, and other materials are employed by architects.” This idea of font being the base for design is a great way of starting to understand the link between all elements that go into designing an Instagram post. Shenandoah Literary Magazine also does a great job at melding their fonts with the design, as well as sticking with just a few fonts throughout their entire feed. \n\nThe connection between the words, the image and the font needs to be strong—an idea I am still trying to bring to life in my own mind. Scott Thomas, the design director of the 2007-2008 Obama presidential campaign explains in Abstract: The Art of Design, “when you look at a letter form or you look at a word, does it actually communicate something deeper than the word itself?” Thomas continues to demonstrate the weight of font by asking “does it actually drive some other meaning to you, and subconsciously, I think all letter forms do. It comes down to what is the emotional quality that we are trying to say in this word”\n… \nAt the end of the day we are talking about literary magazines, and so the text should be visually appealing, easy to read, and without errors. When stripped down, Instagram is there to enhance the core aesthetic of the magazine. The design and essence of the magazine should be shining through; all the ways listed above are simple steps to making that happen.\n \nConnectivity\nThe obvious purpose of social media is to connect with followers. Instagram can be used as a platform for information sharing, event details, and calls for submission (to just name a few). More importantly, Instagram aids in creating a community for people who love the same thing to connect online and in person. At this time, when connecting face-to-face is ill advised, Instagram can be a great way to keep communities together remotely. While I may be a complete amateur when it comes to making Instagram posts, I can say with 100% certainty I am an expert viewer of Instagram. When thinking of my favorite Instagrams all of them include some form of interactivity. \nPrompts\n\nSince the shelter-in-place order in the US began, The Poetry Lab (@thepoetrylab) has been posting daily writing prompts, giving their hundreds of followers something to do with their copious time indoors. River Heron Review (@riverheronreview) has also done their part in aiding the people staying home with their post of “7 Prompts for the Week Ahead.”\n#fromthearchives\nAnother way to keep viewers engaging with previous issues of your publication is a reoccurring feature Watershed Review (@watershed.csuc) calls #fromthearchives. Featuring quotes from current and past issues of the literary magazine is a great way to connect viewers from the Instagram page to the magazine itself, hopefully keeping them there for a little while too! This practice of posting quotes from a variety of issues of the magazine is something many magazines are doing including Cream City Review (@cream_city_review), Ecotone (@ecotonemagazine) and Epiphany Magazine (@epiphanylitjournal), among many others. When adapting a technique many use, it is crucial to make yours stand out and ensure the creativity of your Instagram page matches the aesthetic of the magazine. As we have already established, I am a complete beginner when it comes to creating Instagram posts, so Canva is one way magazines have been able to make unique posts easily. It is actually difficult to find a literary magazine’s Instagram page that doesn’t have at least one post made on Canva, so changing up the color, font, and design of a Canva template can be as essential as proofreading. \n\nHighlighting Writers\nShoutouts or Spotlights of past writers can be a great addition when trying to connect to a viewership. This can be done by recognizing past writers who have won awards, achieved something noteworthy like being published again or simply by posting their published piece in your article to show their talents. Not only can this give the viewer a varied reading experience, but also show interested writers the type of work the magazine is interested in publishing, express that the magazine is competitive and worth submitting to, and that the magazine values its past writers.\n… \nPaula Scher, quoted in Abstract:The Art of Design, explains that design “can create immense power” by stating that “before you even read [something] you have a sensibility and spirit.” For a literary magazine, an Instagram post can be the viewer’s first window into exploring the world the magazine creates on a page. The first impression is the most important and can be done through carefully placed flowers and lines, a choice between Arial or Futura and a whole lot of creativity.\nWritten by Lily Anderson\n\n\nMay 6, 2020watershedcsuc design, instagram, literary magazine\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Peg Alford Pursell \n\n\nPeg Alford Pursell is an award-winning author, editor, and publisher. She has published multiple short stories, as well as two books–the 2017 Indies Book of the Year Show Her a Flower, a Bird, a Shadow, and her most recent book A Girl Goes into the Forest, which has been referred to as “sharp and disturbing” (Publishers Weekly) and “dexterous in anatomizing the relationships between mothers and daughters, emulating Henry James-like restraint to articulate that which is left unsaid between them” (San Francisco Chronicle).\nIn an interview with Litstack, Pursell who founded Why There Are Words (WTAW) Press spoke of her hopes for publishing, “I want to publish books that are unforgettable. Books that challenge, that evoke and provoke, that immerse readers. Books that confront issues, and by that I don’t mean books that must shock or that are in-one’s-face, necessarily. I value nuance and subtlety and beauty. Essentially, I want to publish books that endure.” Peg Alford Pursell is dedicated to fostering creative voices, supporting and helping to create a better and thriving literary community. She recognizes that in order to produce and publish works that endure the method is “quite simply, to publish the best books we can find.” Their publication embraces all voices regardless of cultural or socio-economic background. \nHer most recent book A Girl Goes into the Forest (Dzanc Books) is a collection of 78 individual short stories, most of which are but a couple of pages long. Yet, all of which showcase her incredible ability to create atmosphere, and to carve out intimate and sophisticated relationships. In truth, in just the first pages of her book, I was savoring every word of her prose and jealous of the talent she was able to display within merely one paragraph. And it is in my own humble opinion that her stories are universal and will endure the test of time.\nIn the story “Old Church by the Sea” the story begins with a mother and her teenage daughter visiting an abandoned church by the sea, and slowly and subtly blossoms into a short but poignant meditation on the relationship between the mother and daughter from the very beginning: “Having and wanting at the same time—that’s what it was to carry my daughter inside me. After, I was emptier than I could ever have imagined, I thought then.” Her prose is direct, effective, and leaves just enough unsaid to inspire the minds of the reader to contemplate emotions that are curious but also utterly familiar. \nPlease join us for a thought-provoking evening with Peg Alford Pursell on Wednesday, October 30th at 7:30 pm in Colusa Hall Room 100B. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nAuthor Website: https://www.pegalfordpursell.com/\nWTAW Press: https://www.wtawpress.org/\nSample Work: https://themuseumofamericana.net/a-man-with-horses-flash-fiction-by-peg-alford-pursell/\nWritten by Nicholas Shi\n\n\nOctober 29, 2019watershedcsuc\nLeave a comment\n\n\n\n\nWR Intern Spotlight: The Eternal Question \n\n\nBy Kelly Hack\nIt was a normal Saturday morning for me. I woke up early and was watching Youtube videos in bed before my daily venture downstairs to make breakfast when I saw a new video from PBS Digital Studios, which releases a series of studies regarding certain facets of the literary world in a series called “It’s Lit!” It just so happened that on this day, they were discussing “Death, Personified.” I watched, in awe, as they listed the endless examples of authors crafting “Death” a physical character. I began to wonder: Why are writers so fascinated with death? I decided to launch a personal investigation and go in search of the truth behind this phenomenon.\nSo I asked professors and graduate students in the CSUC English department, what about the theme of mortality makes it such a rich muse for writers? I began to notice a trend in their answers. Most agreed the use of death and its symbolism in literature is an inevitable constant. Professor Matt Brown, who focuses on American Literature and Culture in his courses, offered, “Death may be the only universal human experience and nobody in the world can tell us what it’s like.” In this way, Professor Brown believes personifying death gives readers a way to feel closer to understanding death as a whole, without having to experience it firsthand. \nGrad student, Mary Gibaldi, who focuses on 20th-century American Literature and Feminist Theory, went a step further with her interpretation: “Not only is death an inevitable part of life, but it is often linked to other themes writers tend to gravitate towards power, identity, the social and socioeconomic spaces created after a person’s passing.” Upon speculation, these themes, in correspondence with one another, is what drives most plots in stories. Death, especially, serves as an unwanted change that forces the reader to be more open-minded and grow in some way. \nInterestingly, Professor Jeanne Clark and Professor Rob Davidson, who both teach creative writing, gave a more poetic answer to the question. Clark reported, “It’s inevitability. The way it forces us to ask the hardest questions, to make meaning of suffering, to find consolation; it takes us to our edge. The ways it opens our hearts & minds.” Davidson added, “Surely the inescapable nature of our own demise—we are endlessly fascinated with questions of what death means, what happens after death, how death gives shape & meaning to our lives, and of course what one’s own death might mean: a reckoning, a release, an apocalypse, a rebirth.” The mere intricacy of these explanations adds the type of reasoning only a creative writer could offer. Somehow, their perspectives paint the concept of death as a vital and beautiful aspect of life. \nPerhaps, in this way, it has managed to remain timelessly relevant in all genres of literature. While this question may never be truly answered, this at least gives me some idea about why writers remain fascinated with Death. \n \nFaculty Recommendations:\nMary Gibaldi: Daniel Woodrell’s Winter’s Bone, Toni Morrison’s Beloved\nProfessor Matt Brown: There are dead bodies all over almost everything I read or teach. Leaves of Grass has 15 corpses in it and it is, by far, the most cheerful and optimistic text I teach. Nearly everyone dies in Moby Dick. And of course, the blues songs and Appalachian ballads I love so much are all populated by murderers and the murdered.\nProfessor Jeanne Clark: Elegy, Edward Hirsh; Elegy, Mary Jo Bang; The Duino Elegies, Rainer Maria Rilke; Brother, Matthew & Michael Dickman; Death Tractates & Bright Existence, Brenda Hillman; Trapeze, Deborah Digges; Prayer in Wind, Eva Saulitis\nProfessor Rob Davidson: Dante quickly comes to mind. Faulkner’s As I Lay Dying. From more contemporary authors, I am enormously fond of George Saunders. His story “Sea Oak” is a zombie story in which a woman who, in her mortal life, was a passive pushover; as a zombie, she seeks lovers and adventure—death becomes, for her, an opportunity for a “do-over.” Sadly, it doesn’t work out, but Saunders’s moral is clear: carpe diem.\n \n\n\nMay 1, 2019watershedcsuc\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: An Interview with José Antonio Rodríguez \n\n\nRecently, I had the opportunity to read José Antonio Rodríguez’s memoir house built on ashes. Written in vignettes, the stories create a rich tapestry of Rodríguez’s experiences as the child of immigrant parents, their impoverished life in Texas, his trips back and forth across the border to visit family in Mexico, and how he grapples with his emerging sexuality. Rodríguez’s brief vignettes exemplify his background as a poet with the work’s lyrically constructed snapshots, oftentimes resembling prose poems. Written from Rodríguez’s perspective as a young boy, the characters he portrays—Amá, Tía Eugenia, and his often-absent father, Apá—illuminate the immigrant experience and how it feels to grow up in a country where they are often perceived as outsiders. The memoir is a captivating story of a young boy’s coming-of-age, his struggle to navigate the complex world located between two cultures, and his advancing sense of personal identity. \nIn preparation for Rodríguez’s April 18th Writer’s Voice reading at CSU Chico, I had the opportunity to interview him about his writing.\n***\nWhen did you first realize that you wanted to be a writer?\nInitially it wasn’t a “want” so much as a slow realization that perhaps writing could be a possibility, perhaps I had some talent and something that warranted sharing with a reader. That happened when I enrolled in my first creative writing course as part of my master’s degree, which came after earning undergraduate degrees in other fields. I stumbled around for a while before coming to writing. \nHow did you decide to write house built on ashes?\nFor years I’d been carrying a deep desire to tell my coming-of-age story because I intuited that it was interesting and significant in some way, though I couldn’t exactly articulate how. Then as a graduate student at Binghamton University, I learned much about creative nonfiction but also about literary theory, which offered me new lenses by which to interpret my past, my experiences as an immigrant, as queer, as a member of the poverty class, as…. Eventually I reached a point where I had a good grasp of both my experiences and their larger or deeper significance, which is necessary to reach the reader.\nWhat were you hoping to achieve with your memoir?\nI had two main objectives. One, to show the reader who shares a similar background that our lives of dirt and sweat and want can also be the stuff of literature, can also be artistic, valuable, and beautiful. Two, to show the reader who has a vastly different background than my own how the Other becomes other-ed, and how that Other may not be so different after all, if we recognize the social, cultural, and political forces that form and deform the self. This isn’t to say that I presume to have succeeded at both objectives, only that those were my aims.\nWhy did you choose to structure house built on ashes in vignettes? What do you like about that particular form?\nI love the form’s lyrical potential, how suggestive it can be, how much like poetry. It allowed me the space and rhythm to develop mood, to highlight the intimate details so significant to the narrator’s deep desire for beauty and belonging, for home. Also, I think it worked well to echo the very nature of memory, which is fragmentary and mysterious.\nHow did you learn how to write in the voice of a child/adolescent?\nBefore anything else, I had to understand that the individual’s past is always informing the present in ways both beautiful and terrible. And so I had to honor that past that I carry, accept the value and significance of those memories lived by my younger self. This felt more like emotional labor. Then came what felt more like intellectual labor: the mapping out of the institutions of power and influence that shaped the narrator and the ways they did it, from the macro to the micro, and then stripping them away to begin at the beginning. In other words, I learned about what the adult knows that the child doesn’t know and how the child begins to know, how that knowledge comes to him, and how that knowledge and those “lessons” are often contradictory or dissonant. For example, the memoir’s adolescent narrator is conflicted about his sexual orientation and his sense of masculinity. If I want to make that significant in the narrative, make that something the reader ought to be aware of, I will want to show where and how it might have started. For that and other reasons, I had to include the memories of the narrator being ostracized by the boys of the village. But I had to include them in such a way that would communicate the young child’s bewilderment based on what he did and did not yet know.\n What can you tell us about your forthcoming The American Autopsy: Poems?\nThe collection is centered on the various manifestations of violence in the U.S., from personal to communal, private to public. And it investigates the ways this violence challenges the nation and its subjects. That was the aim, anyway; we’ll see what the reader makes of it.\nDo you have plans for other books of poetry? \nI imagine I do because I feel I have more to say and explore, except that I’m not certain what shape the next project will take until I’ve amassed a group of poems that might fit together. And how they might fit together is mostly a mystery until the project comes together. I’m also superstitious about articulating the project before it has manifested itself, because the project may evolve, and my having already articulated its shape may prove stifling to its evolution. I guess I prefer to work in the amorphous dark.\nWhat’s next for you? What are you working on now?\nNew poems. Translating the memoir into Spanish. Translating a Mexican poet’s work into English. \n***\n\nBefore house built on ashes, Rodríguez was best known for his poetry. His works include Backlit Hour (SFA Press/Texas A&M Consortium, 2013), The Shallow End of Sleep (Tia Chucha Press/Northwestern UP, 2011), and Borderlines: Drawing Border Lives (Wings Press). His latest book This American Autopsy: Poems is forthcoming in October of 2019 from University of Oklahoma Press.  You can read more about José Antonio Rodríguez and his work at  www.jarodriguez.org\nHere are some other links to a sampling of Rodríguez’s work : \n“Sunflowers”  (Poetry Foundation), “On Shakespeare: ‘Shall I compare thee to a summer’s day'” (Poetry Society of America), “Double Glass Doors”  (Connotation Press).\nPlease join us for an exciting evening with José Antonio Rodríguez, this Thursday, April 18th at 7:30 pm, Zingg Recital Hall (ARTS 150). Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public. This Writer’s Voice reading is also sponsored by the Office of Diversity and Inclusion and the Office of Undergraduate Education, in support of the 2018-2019 Book-in-Common.\nWritten by Jeanette Keables\n\n\nApril 13, 2019watershedcsuc\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Lynn Freed \n\n\nLynn Freed has been described as the literary love child of Joan Didion and Fran Lebowitz. Often wry and satirical, she writes with a powerfully determined voice about women, writing, and travel. Her most recent publication, The Romance of Elsewhere (Counterpoint Press), is a collection of essays about intense wanderlust and the struggle of defining “home.” Lynn says the central question of the collection is “where or what is home?’ To which I’d have to say, nowhere.” She continues, “Which is not to say there aren’t places in which I feel at home—Greece, for instance, and the African bush. I also feel at home in the past. And yet there is also a certain liberation in being untied from the past—from the bonds of home. And a sadness, a great sadness. As you see, I’m still looking for an answer.”\nFreed grew up in Durban, South Africa, and moved to New York as a graduate student to study English Literature at Columbia University. She is Professor Emerita of English at the University of California in Davis and has published numerous, award-winning works in fiction and nonfiction. Her most recent novel is The Last Laugh (Sarah Crichton Books), about a group of older women who flee their previous lives by moving to a Greek island—something many of us have fantasized about. It delves into what freedom really entails and the dynamic complexity of friendships between women.\nOn writing, Lynn says “leaving home is perhaps the central experience of the writer’s life. The restless pursuit of a way back while remaining steadfastly at a distance — this is the enigma that informs the writer’s perspective.” By her own account she is neither fast nor disciplined as a writer. She says “I’m hard put to know which obsess me. The cult of the self? The self-promotion, selfies, self-this, self-that to which we’re all subjected? Old age? Grown children?…Something will come up, or nothing. If nothing, I’ll try not to force something onto the page.” The result is prose full of candor and wit that looks deeply at what it means to be a woman and what it means to be a writer.\nTo read more about Lynn Freed and her writing, check out this interview on The Rumpus.\nPlease join us for a thought-provoking evening with Lynn Freed this Thursday, November 1st at 7:30 pm in Zingg Recital Hall (ARTS 150). Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nWritten by Alyssa Cox\n\n\nOctober 29, 2018watershedcsuc CSUC, fiction, Lynn Freed, nonfiction, Writer's Voice Reading Series\nLeave a comment\n\n\n\n\n2018 Best of the Net Nominations \n\nWatershed Review is pleased to nominate the following poetry and prose for the 2018 Best of the Net anthology. Good luck to all of our contributors!\nPoetry: \nChristopher Emery: “Moon City, 1933” https://www.csuchico.edu/watershed/2017-fall/poetry/emery-christopher.shtml (Fall 2017)\nLinette Reeman: “Sometimes There is a Boy Who Wants to Love the Girl Back Into Me” https://www.csuchico.edu/watershed/2017-fall/poetry/reeman-linette.shtml (Fall 2017\nJohn Sibley Williams: “Forest // Trees” https://www.csuchico.edu/watershed/2017-fall/poetry/williams-john-sibley.shtml (Fall 2017)\nMichelle Tong: “The Joy of Painting” https://www.csuchico.edu/watershed/2018-spring/poetry/tong-michelle.shtml (Spring 2018)\nRae Gouirand: “Arils on Velvet” https://www.csuchico.edu/watershed/2018-spring/poetry/gouirand-rae.shtml (Spring 2018)\nAddison Hoggard: “Coy” https://www.csuchico.edu/watershed/2018-spring/poetry/hoggard-addison.shtml (Spring 2018)\nFiction:\nJennifer Popa: “Useless Prey” https://www.csuchico.edu/watershed/2017-fall/fiction/popa-jennifer.shtml (Fall 2017)\nMehdi M. Kashani: “5-Across” https://www.csuchico.edu/watershed/2018-spring/fiction/kashani-mehdi.shtml (Spring 2018)\nNonfiction:\nDavid Tromblay: “Yabba Dabba Do” https://www.csuchico.edu/watershed/2017-fall/nonfiction/tromblay-david.shtml (Fall 2017)\nSjohnna McCray: “Love and Illness” https://www.csuchico.edu/watershed/2018-spring/nonfiction/mccray-sjohnna.shtml (Spring 2018)\n\n\nOctober 10, 2018watershedcsuc\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Michelle Tea \n\n\nMichelle Tea, author of the newly minted Against Memoir: Complaints, Confessions & Criticisms (Feminist Press, 2018), excels in bringing together her transgressive worldview with the kind of wit and humor that help readers inconspicuously tackle tough subjects like financial struggle, self care, and what it means to truly be an adult—and you’d be surprised what that includes, because adulthood isn’t always about living in a nice clean home and having your entire life in order; sometimes it’s being 40 and living with a bunch of 20-year-olds with a penchant for partying. Michelle got her start like many of us: writing and hoping for the best, even when sometimes the “best” takes us down a path we didn’t prepare for. Tea doesn’t hold back in her work as she navigates what being a person trying to stay true to themselves means.\nIn the 90’s, Michelle found herself overwhelmingly surrounded by the testosterone and misogyny found in the literary community. Instead of retreating, she decided to take the initiative, grab the literary community by the balls, and create her own open mic with friend Sini Anderson. This new program, called Sister Spit, strove to create a place for the queer literary community to gather and share their spoken word. Tea’s inspiration to start the group started with questioning:\n“Where are all the other queer female writers?…They’re not coming cause they don’t feel welcome and it makes sense that they don’t feel welcome. You had to really fight for a space there” (Michelle Tea, Electric Literature).\nAlthough Sister Spit was originally geared towards cis women in the queer community, the fluidity of gender and the social acceptance emerging in the past years have pushed Sister Spit to widen their audience and participant demographics to engage people from all walks of life, so long as they vibe with their original message of “feminism, queerness, humor and provocation.”\nIn 2003, Michelle created Radar Productions to give the queer community of San Francisco  access to free and affordable literary arts programs that they weren’t finding in the male-saturated literary community. This nonprofit organization still hosts a traveling Sister Spit tour every year, featuring authors like MariNaomi, Wo Chan, Jay Dodd, and Virgie Tovar. In addition to her work with Radar Productions and Sister Spit, Michelle Tea is the curator for Amethyst Editions, a Feminist Press Imprint, and continues to strive to unapologetically share her art and create an inclusive environment for the queer literary community.\nMichelle Tea’s new, razor-sharp essay collection, Against Memoir: Complaints, Confessions & Criticisms, reflects on the cultural artifacts that have challenged and calibrated her against the world. She writes on “Art and Music,” “Love and Queerness,” and her usual spectrum, “Writing and Life.” In her writing, Michelle is someone we all can easily relate to. From pondering her personal struggles, to demonstrating what life means to her, Tea’s life stories allow us to truly understand how our own unique situations are what define us. Her fearless reflection on times of previous struggle has allowed her to see her growth and acceptance, which is something we all can take from. Tea has a knack for slaying her inner demons and conveying her stories to the audience in the most comical way possible. Her overall style makes people think that we can still find light even in the darkest of situations. \nAgainst Memoir rebels against the traditional autobiographical text we have seen in Tea’s previous works. In this essay collection, she interweaves her thoughts and experiences with film, books, and important figures to move past a singular narrative into a collective one about our time. Some of the pieces within the collection have been published from previous speeches, readings, and talks, including one from 2016 at Butte College. Within her work, she keeps her readers entranced with her powerful yet quirky assertions all while offering herself as a model for activism. In her essay, “The City to a Young Girl,” she says, “I guess that’s my issue with writing as activism: how hard it is for it to change the actual systems that oppress and limit and kill.” Through her writing we see a queer woman who fights for the freedom of those who are chained by the stigma of social and political views. \nOther works by Michelle Tea include Valencia—which has received the Lambda Literary Award for Best Lesbian Fiction, and was adapted into a movie in 2013—and the young adult fantasy trilogy Mermaid In Chelsea Creek, among many others. \nPlease join us for an exciting evening with Michelle Tea this Monday, October 8th at 7:30 in PAC 134 for a reading from Against Memoir, a Q&A, and book signing. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nWritten by Emily Ribeiro and Jazmin Gomez\n \n\n\nOctober 6, 2018watershedcsuc\nLeave a comment\n\n\n\nPost navigation\n← Older posts\n\n\n\n\n\nBlogroll\n\nDiscuss\nGet Inspired\nGet Polling\nGet Support\nLearn WordPress.com\nTheme Showcase\nWordPress Planet\nWordPress.com News\n\n\nTopics\n\nIntern Spotlight\n\nUncategorized\n\n\nUpcoming Events No upcoming events\nArchives\n\nMay 2022\nMarch 2022\nMay 2020\nOctober 2019\nMay 2019\nApril 2019\nOctober 2018\nJanuary 2018\nDecember 2017\nOctober 2017\nSeptember 2017\nApril 2017\nNovember 2016\nOctober 2016\nSeptember 2016\nDecember 2015\nOctober 2015\nSeptember 2015\nApril 2015\nMarch 2015\nFebruary 2015\nNovember 2014\nOctober 2014\nSeptember 2014\nApril 2014\nFebruary 2014\nNovember 2013\nOctober 2013\nAugust 2013\nApril 2013\nMarch 2013\nFebruary 2013\nJanuary 2013\n\n \n\nFollow me on TwitterMy Tweets \n\n\n\n\nCreate a free website or blog at WordPress.com.\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\tPrivacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. \nTo find out more, including how to control cookies, see here:\n\t\t\t\t\n\t\t\tCookie Policy\t\t\n\n\n \n\n\n\nFollow\n\n\nFollowing\n\n\n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\nJoin 44 other followers\n\n\n\n\n\n\n\n \n\n\t\t\t\t\t\t\t\t\t\t\t\tSign me up\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tAlready have a WordPress.com account? Log in now. \n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\n\n Customize\n\n\n\n\nFollow\n\n\nFollowing\n\n\nSign up\nLog in\n\n\n\t\t\t\t\t\t\t\t\t\t\tReport this content\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tView site in Reader\t\t\t\t\t\t\t\t\t\t\n\n\nManage subscriptions\n\nCollapse this bar\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n\n",
    "links": [
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/",
        "#content",
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/about/",
        "https://watershedcsuc.wordpress.com/history/",
        "https://watershedcsuc.wordpress.com/submit/",
        "https://watershedcsuc.wordpress.com/2022/05/24/wr-intern-spotlight-confessions-of-an-english-major-or-four-years-of-english-classes-in-750-words/",
        "https://watershedcsuc.wordpress.com/2022/05/24/wr-intern-spotlight-confessions-of-an-english-major-or-four-years-of-english-classes-in-750-words/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2022/03/02/wr-intern-spotlight-graduate-student/",
        "https://watershedcsuc.wordpress.com/2022/03/02/wr-intern-spotlight-graduate-student/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2022/03/02/wr-intern-spotlight-graduate-student/#respond",
        "https://watershedcsuc.wordpress.com/2022/03/02/a-charge-of-first-degree-writing-almost-objective-notes-from-a-slush-reader%ef%bf%bc/",
        "https://watershedcsuc.wordpress.com/2022/03/02/a-charge-of-first-degree-writing-almost-objective-notes-from-a-slush-reader%ef%bf%bc/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2020/05/06/with-great-design-comes-immense-power/",
        "https://www.instagram.com/watershed.csuc/",
        "https://www.instagram.com/instantlitmag/",
        "https://www.instagram.com/shenandoah_literary/",
        "https://www.instagram.com/pathoslitmag/",
        "https://www.powells.com/book/non-designers-design-book-9780133966152#",
        "https://www.instagram.com/honeyandlimelit/",
        "https://www.powells.com/book/-9781568989693",
        "https://www.netflix.com/watch/80237098?trackId=13752289&tctx=0%2C0%2C08231de1bdf39d9cacab53af049874e9221f3f34%3A39638ccca151963d9d27eb46203982a1b7f55cd8%2C%2C",
        "https://www.instagram.com/thepoetrylab/",
        "https://www.instagram.com/riverheronreview/",
        "https://www.instagram.com/watershed.csuc/",
        "https://www.instagram.com/cream_city_review/",
        "https://www.instagram.com/ecotonemagazine/",
        "https://www.instagram.com/epiphanylitjournal/",
        "https://www.netflix.com/watch/80093802?trackId=200257859",
        "https://watershedcsuc.wordpress.com/2020/05/06/with-great-design-comes-immense-power/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/design/",
        "https://watershedcsuc.wordpress.com/tag/instagram/",
        "https://watershedcsuc.wordpress.com/tag/literary-magazine/",
        "https://watershedcsuc.wordpress.com/2020/05/06/with-great-design-comes-immense-power/#respond",
        "https://watershedcsuc.wordpress.com/2019/10/29/writers-voice-spotlight-peg-alford-pursell/",
        "https://www.wtawpress.org/single-post/2016/08/18/Litstack-Interviews-WTAW-Press-Editor-Peg-Alford-Pursell",
        "https://www.pegalfordpursell.com/",
        "https://www.wtawpress.org/",
        "https://themuseumofamericana.net/a-man-with-horses-flash-fiction-by-peg-alford-pursell/",
        "https://watershedcsuc.wordpress.com/2019/10/29/writers-voice-spotlight-peg-alford-pursell/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2019/10/29/writers-voice-spotlight-peg-alford-pursell/#respond",
        "https://watershedcsuc.wordpress.com/2019/05/01/wr-intern-spotlight-the-eternal-question/",
        "https://watershedcsuc.wordpress.com/2019/05/01/wr-intern-spotlight-the-eternal-question/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2019/05/01/wr-intern-spotlight-the-eternal-question/#respond",
        "https://watershedcsuc.wordpress.com/2019/04/13/writers-voice-spotlight-an-interview-with-jose-antonio-rodriguez/",
        "http://www.jarodriguez.org",
        "https://www.poetryfoundation.org/poetrymagazine/poems/55290/sunflowers",
        "https://www.poetrysociety.org/psa/poetry/crossroads/old_school/Jose_Antonio_Rodriguez/",
        "https://www.connotationpress.com/hoppenthaler-s-congeries/2015-08-19-18-45-41/june-2014/2320-jose-antonio-rodriguez-poetry",
        "https://watershedcsuc.wordpress.com/2019/04/13/writers-voice-spotlight-an-interview-with-jose-antonio-rodriguez/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2019/04/13/writers-voice-spotlight-an-interview-with-jose-antonio-rodriguez/#respond",
        "https://watershedcsuc.wordpress.com/2018/10/29/writers-voice-spotlight-lynn-freed/",
        "https://therumpus.net/2018/02/the-rumpus-interview-with-lynn-freed/",
        "https://watershedcsuc.wordpress.com/2018/10/29/writers-voice-spotlight-lynn-freed/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/fiction/",
        "https://watershedcsuc.wordpress.com/tag/lynn-freed/",
        "https://watershedcsuc.wordpress.com/tag/nonfiction/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice-reading-series/",
        "https://watershedcsuc.wordpress.com/2018/10/29/writers-voice-spotlight-lynn-freed/#respond",
        "https://watershedcsuc.wordpress.com/2018/10/10/2018-best-of-the-net-nominations/",
        "https://www.csuchico.edu/watershed/2017-fall/poetry/emery-christopher.shtml",
        "https://www.csuchico.edu/watershed/2017-fall/poetry/reeman-linette.shtml",
        "https://www.csuchico.edu/watershed/2017-fall/poetry/williams-john-sibley.shtml",
        "https://www.csuchico.edu/watershed/2018-spring/poetry/tong-michelle.shtml",
        "https://www.csuchico.edu/watershed/2018-spring/poetry/gouirand-rae.shtml",
        "https://www.csuchico.edu/watershed/2018-spring/poetry/hoggard-addison.shtml",
        "https://www.csuchico.edu/watershed/2017-fall/fiction/popa-jennifer.shtml",
        "https://www.csuchico.edu/watershed/2018-spring/fiction/kashani-mehdi.shtml",
        "https://www.csuchico.edu/watershed/2017-fall/nonfiction/tromblay-david.shtml",
        "https://www.csuchico.edu/watershed/2018-spring/nonfiction/mccray-sjohnna.shtml",
        "https://watershedcsuc.wordpress.com/2018/10/10/2018-best-of-the-net-nominations/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2018/10/10/2018-best-of-the-net-nominations/#respond",
        "https://watershedcsuc.wordpress.com/2018/10/06/writers-voice-spotlight-michelle-tea/",
        "http://www.radarproductions.org/sister-spit/",
        "http://www.radarproductions.org/about/",
        "https://marinaomi.com/",
        "https://twitter.com/wochanofficial?lang=en",
        "https://www.jayydodd.net/",
        "https://www.virgietovar.com/",
        "https://www.goodreads.com/author/show/16059.Michelle_Tea",
        "https://watershedcsuc.wordpress.com/2018/10/06/writers-voice-spotlight-michelle-tea/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2018/10/06/writers-voice-spotlight-michelle-tea/#respond",
        "https://watershedcsuc.wordpress.com/category/uncategorized/page/2/",
        "http://en.forums.wordpress.com/",
        "http://www.plinky.com/",
        "http://polldaddy.com/",
        "http://en.support.wordpress.com/",
        "http://learn.wordpress.com/",
        "http://theme.wordpress.com/",
        "http://planet.wordpress.org/",
        "http://en.blog.wordpress.com/",
        "https://watershedcsuc.wordpress.com/category/intern-spotlight/",
        "https://watershedcsuc.wordpress.com/category/uncategorized/",
        "https://watershedcsuc.wordpress.com/2022/05/",
        "https://watershedcsuc.wordpress.com/2022/03/",
        "https://watershedcsuc.wordpress.com/2020/05/",
        "https://watershedcsuc.wordpress.com/2019/10/",
        "https://watershedcsuc.wordpress.com/2019/05/",
        "https://watershedcsuc.wordpress.com/2019/04/",
        "https://watershedcsuc.wordpress.com/2018/10/",
        "https://watershedcsuc.wordpress.com/2018/01/",
        "https://watershedcsuc.wordpress.com/2017/12/",
        "https://watershedcsuc.wordpress.com/2017/10/",
        "https://watershedcsuc.wordpress.com/2017/09/",
        "https://watershedcsuc.wordpress.com/2017/04/",
        "https://watershedcsuc.wordpress.com/2016/11/",
        "https://watershedcsuc.wordpress.com/2016/10/",
        "https://watershedcsuc.wordpress.com/2016/09/",
        "https://watershedcsuc.wordpress.com/2015/12/",
        "https://watershedcsuc.wordpress.com/2015/10/",
        "https://watershedcsuc.wordpress.com/2015/09/",
        "https://watershedcsuc.wordpress.com/2015/04/",
        "https://watershedcsuc.wordpress.com/2015/03/",
        "https://watershedcsuc.wordpress.com/2015/02/",
        "https://watershedcsuc.wordpress.com/2014/11/",
        "https://watershedcsuc.wordpress.com/2014/10/",
        "https://watershedcsuc.wordpress.com/2014/09/",
        "https://watershedcsuc.wordpress.com/2014/04/",
        "https://watershedcsuc.wordpress.com/2014/02/",
        "https://watershedcsuc.wordpress.com/2013/11/",
        "https://watershedcsuc.wordpress.com/2013/10/",
        "https://watershedcsuc.wordpress.com/2013/08/",
        "https://watershedcsuc.wordpress.com/2013/04/",
        "https://watershedcsuc.wordpress.com/2013/03/",
        "https://watershedcsuc.wordpress.com/2013/02/",
        "https://watershedcsuc.wordpress.com/2013/01/",
        "https://twitter.com/466661251926335488",
        "https://wordpress.com/?ref=footer_website",
        "https://automattic.com/cookies/",
        "",
        "",
        "https://watershedcsuc.wordpress.com",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2022%2F05%2F24%2Fwr-intern-spotlight-confessions-of-an-english-major-or-four-years-of-english-classes-in-750-words%2F&signup_flow=account",
        "https://watershedcsuc.wordpress.com",
        "https://watershedcsuc.wordpress.com/wp-admin/customize.php?url=https%3A%2F%2Fwatershedcsuc.wordpress.com%2Fcategory%2Funcategorized%2F",
        "",
        "",
        "https://wordpress.com/start/",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2022%2F05%2F24%2Fwr-intern-spotlight-confessions-of-an-english-major-or-four-years-of-english-classes-in-750-words%2F&signup_flow=account",
        "http://en.wordpress.com/abuse/?report_url=https://watershedcsuc.wordpress.com",
        "https://wordpress.com/read/feeds/7518230",
        "https://subscribe.wordpress.com/",
        "",
        "#",
        "#"
    ]
}