{
    "title": "Appalachian Awakening | Chapman Newsroom",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nFind information for\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\n\nDegrees\n\n                & Programs\nMaps &\n\n                Directions\nAll Directories\nNews\nEvents\n\nSocial\n\n\n\n\n\n\n\nfacebook\n\n\n\n\n\n\n\ntwitter\n\n\n\n\n\n\n\npinterest\n\n\n\n\n\n\n\ninstagram\n\n\n\n\n\n\n\n\n\nyoutube\n\n\n\n\n\n\n\nlinkedin\n\n\n\n\n\n\n\n\n\nsnapchat\n\n\n\n\n\n\n\ntumblr\n\n\n\n\n\n\n\nitunes\n\n\n\n\n\n\nSocial hub\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\nNewsroom\n\n\n\n\n\n\n\n\nTopics\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind\n\n\n\n\n\n\n\n\n\n\nLog in\n\n\n\n\n\n\n\n\n\n\n                    Login\n\n                  \n\n\n\n\ncanva icon\n\n\nCanvas\n\n\n\n\n\n\n\n\n\n\n\n\n\nHandshake\n\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty & staff) \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n              Chapman University\n\n            \n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nChapman Newsroom\nMain Menu >\n\n\nTopics\n\n\nToggle\n\n\n\n\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\n\nToggle\n\n\n\n\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\nMain Menu\n< Chapman Newsroom \n\n\n\nAbout\n\n\n\nToggle About\n\n\n\n\n\nMaps & Directions\nVisit Chapman\nDiscover Chapman\nFacts & Rankings\nLeadership\nCampus Services\nConnect\n\n\n\nAcademics\n\n\n\nToggle Academics\n\n\n\n\n\nDegrees & Programs\n\nSchools & Colleges\nAcademic Calendar\nFaculty Directory\nLibraries\nCourse Catalogs\nInternational Study\n\n\n\nAdmission\n\n\n\nToggle Admission\n\n\n\n\n\nUndergraduate Admission\n\nUndergraduate Application\nGraduate Admission\nGraduate Application\nAffordability\nFinancial\n\n                    Aid\n\n                    Calculator\nCampus Tours\n\n\n\nAlumni\n\n\n\nToggle Alumni\n\n\n\n\n\nEvents\nGet Involved\nCareer\n\n                    Support\n\n\nArts\n\nCampus Life\n\n\n\nToggle Campus Life\n\n\n\n\n\nAthletics\nDiversity & Inclusion\nEvents\nFish Interfaith\n\n                    Center\nHealth & Safety\nResidence\n\n                    Life\nStudent Life\n\n\n\nResearch\n\n\n\nToggle Research\n\n\n\n\n\nPre-Award\n\n                    Administration\nPost-Award\n\n                    Administration\nResearch Integrity\nInstitutes &\n\n                    Centers\nCenter for\n\n                    Undergraduate\n\n                    Excellence\nGraduate Research\n\n                    Support\n\n\n\nSupport\n\n\n\nToggle Support\n\n\n\n\n\nContact Development\nGet Involved\nAreas to\n\n                    Support\nAlumni Involvement\n\n\n\n\n\n\nFind information for...\n\n\n\nToggle Find Information By Audience\n\n\n\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\nDegrees & Programs\nMaps & Directions\nAll Directories\nNews\nEvents\nSocial\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare via Facebook Share via Twitter Share via Reddit Share via Pinterest Share via Email Share via LinkedIn \n Print Friendly\n\n\n\n\n\n\n\n\nArts & FilmChapman ForwardChapman Magazineeditors-picks \nAppalachian  Awakening Documentarian Sally Rubin trains her lens on the shallow stereotypes  of a region and ends up diving deeply into a whole new conversation. \n Dennis ArpOctober 9, 20189 min read\n\n\nSally Rubin was determined to get to know Appalachia – to untie the knot and disentangle the misconceptions that attach themselves to the region. But first she had to find her way there.\n\n\n\n\n\n\n\n\n\n\n“Appalachia is a wound and a joy and a poem. A knot of complication.\nBut you cannot know a place without loving it and hating it and feeling everything in between.”\nSilas House | Writer, Appalachian studies scholar\n\nAPPALACHIAN\nAWAKENING\nDocumentarian Sally Rubin trains her lens on the shallow stereotypes of a region and ends up diving deeply into a whole new conversation.\nBy Dennis Arp\nArts and Entertainment Chapman Forward\n\n\n\n\n\nPhoto by Challenge Roddie\n\n\n\n\n\n\nSally Rubin was determined to get to know Appalachia –  to untie the knot and disentangle the misconceptions that attach themselves to the region. But first she had to find her way there.\n“Appalachia is a construction, a social and cultural invention,” says Chad Berry, a professor of Appalachian studies at Berea College in Kentucky. “Iowa is a construction, too. The difference is that you know you’re in Iowa because there’s a sign there that says, ‘Welcome to Iowa.’ There’s no such sign with Appalachia.” \nBerry is among those interviewed in Rubin’s new feature-length documentary “hillbilly.” In researching and shooting the film, Rubin not only found that perceptions of Appalachia are a timely subject for exploration. She learned that Appalachia itself is amorphous, evolving and more diverse than she, and certainly America, might ever have imagined. \n“At first, we set out to do a historical survey of the development of the hillbilly stereotype in film and TV,” says Rubin, an assistant professor of documentary film at Chapman University.  “Then, several months in, we came to realize that if this film is going to be about what Appalachia isn’t, we have to tell what Appalachia is.  That’s when we started including the alternative Appalachian perspective.”\nA journey of more than four years is bound to provide twists and turns along the way. This project had plenty, including one the filmmakers didn’t see coming.\n“The results of the (2016 presidential) election changed the entire context of the film and how we told the story,” said Rubin, who co-directed “hillbilly” with Kentucky native Ashley York, who now lives in Los Angeles and teaches at the USC School of Cinematic Arts. “We always thought the film would be relevant, but suddenly it went from niche-relevant to nationally relevant.”\nToward the end of production, the filmmakers realized they needed a throughline to link all of the story’s themes. So York, who like Rubin is committed to social justice and a feminist approach in her filmmaking, stepped before the cameras to become a character in the film. Weaved throughout are scenes in which York reconnects with her Appalachian family members who attended rallies and voted for President Trump. These nuanced, sometimes tense but always loving conversations add intimacy and urgency to the film. \nIn one scene, York visits her Granny Shelby in Jonesville, Ky. They trade hugs as they’re joined by several other family members who had voted for Barack Obama but now wear MAGA hats. York eases into the role of neutral interviewer as she probes their enthusiasm for Trump. “People from the mountains,” she hears, “really had no one to have our back before.” There’s a long pause while York nods awkwardly, and then the inevitable question: “Who’d you vote for?” She purses her lips and reveals that she voted for Hillary Clinton.\n“I must not have burped you girls just right,” her grandmother deadpans. “I should have held you upside down and patted you on your butt.”\n\nFrustrated by Hypocrisy\nFor Rubin, the filmmaking journey connects to the roots of her mother, who grew up in Calderwood, Tenn., in the Great Smoky Mountains. The filmmaker also knows coal country from her 2010 film “Deep Down,” which chronicles friendships and divisions as a way of life erodes in eastern Kentucky. \n“From the time I was younger, I’ve been frustrated by the hypocrisy and stereotypes around rural white people,” says Rubin. “Growing up in liberal Boston, those in my circle wouldn’t be caught dead saying the N word or anything like that, but they would very happily throw around terms like redneck, hillbilly and poor white trash. I noticed that, and it pissed me off.”\n\n\nSally Rubin and her Chapman documentary film students discuss a scene from “hillbilly.”\n\nRubin’s pop-culture flashpoint for the project was the character Pennsatucky on the Netflix series “Orange Is the New Black.”\n“It’s this innovative show, with risky storytelling and gender-nonconforming  characters, and at the same time there’s this character who’s a tired old mashup of every stereotypical quality of an Appalachian person – holy roller, meth head, abuser of the welfare system,” Rubin says. “For me, it was ‘enough is enough.’”\nOnce York came onboard as a partner in the project, the two launched into a review of scholarly research.\n“There’s a huge body of scholarship on the history of Appalachian identity and representation,” Rubin says.\nKey texts include “Hillbilly” by Tony Harkins and “Hillbillyland” by Jerry Williamson. “Ashley and I practically memorized those texts,” says Rubin, who adds that “Belonging” by Bell Hooks also was enlightening. “It’s all about Southern and Appalachian identity, especially from the vantage point of a woman of color who left and then came back. It helped me look at the region in a new way.”\nIn March 2014, the filmmakers attended the annual Appalachian Studies Association Conference, where they met and interviewed a host of key scholars.\n“Every single scholar we interviewed became an advisor on our film,” Rubin notes.\nThe Road to a Gripping Story\n\n\nRubin shares insights with students and with Andre Dhont in the Dhont Documentary Film Center of Chapman Studios West.\n\nRubin’s research goals were twofold: “Making sure we have a wide, diverse and thorough handle on the concepts of the film, and then deciding, ‘Is this going to make a compelling story?’”\nValidation came in the form of outside funding from state humanities councils in South Carolina, Virginia, Ohio, Kentucky and West Virginia. Later “hillbilly” earned two major grants from the National Endowment for the Arts and one from the National Endowment for the Humanities.\nThat support allowed the filmmakers to gather stories during field research trips that crisscrossed six states. “We knew we needed media clips, and we knew we needed experts talking about what we were seeing in the media clips. But we also wanted stories, so we sought out characters who could bring the human element to the film,” Rubin says.\nIn addition to Billy Redden, the actor who portrayed the banjo player in “Deliverance’’ (and now a Walmart worker in Georgia), “hillbilly” gives voice to artists and activists, queer musicians and “Affrilachian” poets – the flipside of the hackneyed regional stereotypes.\n\n\n\n\n\n“I’m happy to see somebody trying to cover us as we really are and not what some people think we are. It’s wonderful the attention you’ve paid to so many areas that are so important to all of us. I’m proud to have been mentioned in the film a time or two. “\n– Dolly Parton –\n\n\n\n\n\n\n“I’m very proud that we were careful to showcase the diversity of the region,” says Samantha Cole, a native of Lee County, Ky., who was interviewed for the film and eventually took on the role of associate producer. “I had known for some time that Appalachia was home to all these different folks, but all those narratives had been buried, shut down.”\nCole has helped the filmmakers develop a companion piece to “hillbilly” called\n“Her Appalachia,” which shares interviews with women of the region and takes a critical look at female Appalachian archetypes like the “mountain mawmaw,” “sex pot” and “freeloader.”\n\n\n\n\n\n\n“The film is surprising and refreshing, treating white rural voters generously and expanding cultural understanding of the region. … For outsiders, the film could potentially challenge viewers’ perceptions; for Appalachians, it’s a cinematic portrayal of which they can be proud.”\n– From a review by The Nashville Scene –\n\n\n\n\n\n“The diverse nature of the region had been at the periphery of my thoughts,” Cole says. “Now I want to seek out those diverse voices that are of and for the region.”\n\n\nCinematographer Bryan Donnell and co-directors Rubin, seated, and Ashley York traversed six states shooting scenes for “hillbilly.”\n\nWhen Rubin first reached out to her about a possible on-camera interview more than four years ago, Cole didn’t imagine the journey that would result, including her writing proposals and securing grants.\n“Sally was fabulous to work with,” Cole says. “She provided this big overarching picture, but she was also attentive to details. She’s a great artist and creative thinker, but also a fantastic teacher.”\nCole was there when “hillbilly” premiered in May at the Nashville Film Festival, where attendees filled a 250-seat theater and a 115-seat spillover venue as well. Cole saw filmgoers “connect with the story and afterward say that they had never seen anyone express the same thoughts and feelings they had been holding in for years.”\n“It’s like we’re empowered to have pride in the place we call home,” Cole adds. “This film not only invites conversations but deep thinking about the media we consume – in terms of the hillbilly figure yes, but also any minority or oppressed group.”\nRubin says she’s eager to see “hillbilly” prompt conversations in family rooms and over kitchen tables, but also in group forums and classrooms, perhaps even after a screening on Capitol Hill.\n“Hopefully the film will live in the world for decades and have a broad impact,” Rubin says. “My dream would be that we would see less vitriol between people from urban and rural backgrounds. The film has universal themes and offers a lot to unpack, so it lends itself to rich conversations. I’d like to see all of those continue.”\n\n\n\n\n\n\n\n\n\n\nChapman Dedicates Keck Center for Science and Engineering, Which Promises ‘an Incredible Future’\n\n\n\n\n\nDrama from the Front Lines\n\n\n\n\n\n\n\nYou may also like\n\n\n\n\n\n\n\n\n\n\nChapman Family Donors Make a Collective Impact On Giving Day  Thanks to the enthusiasm of the Chapman Family, Chapman University’s fifth annual Giving Day was an unrivaled success. The 24-hour online fundraising event surpassed its goal of 1,000 donations on April 25, raising more...\n\n\nApril 28, 2023 Staci Dumoski\n\n \n\n\n\n\n\n\n\n\n\nDaniel Canogar’s “Pareidolia” Multimedia Artwork Unveiled at Chapman University On April 13, the Phyllis and Ross Escalette Permanent Collection of Art in Wilkinson College of Arts, Humanities, and Social Sciences unveiled its newest artwork installation, “Pareidolia,” by internationally renowned...\n\n\nApril 27, 2023 Staci Dumoski\n\n \n\n\n\n\n\n\n\n\n\nArgyros School Climbs to No. 60 Chapman University’s Argyros School of Business and Economics rose to No. 60 in the new Best Business School rankings by U.S. News & World Report. It’s the school’s highest-ever position in rankings of business...\n\n\nApril 25, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nEmergency \n\nMedia ContactsCerise Valenzuela Metzger\n\nDirector of Public Relations\n(714) 289-3143 (office)\n(657) 390-6760  (cell)\ncmetzger@chapman.edu\n\nOffice of Public Relations\n\nPR@chapman.edu \n\nNewsroom SiteChapman Magazine\n\nChapman Forward\nCOVID-19 Resources\n\nChapman Site\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment \n\nServices & PoliciesAccessibility Feedback \nWebsite Feedback \nDisability Services \nDirectory Emergency \nConsumer Disclosures \nPrivacy Policy Title IX \n\n\n\n\n\n© 2023 Chapman University           \n\n\n\n\n\n\nTopics\n\nAlumni\nArts & Film\nBusiness & Economy\nCampus & Students\nCollege Knowledge\nCommunity\nCOVID-19\nHealth & Behavior\nHumanities & Society\nScience & Engineering\nUniversity News\n\n\nOur Voices\nCOVID-19 Resources\nMagazines\n\nChapman Magazine\nChapman Forward\n\n\nPress Room\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#",
        "#",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "#",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://www.pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu/",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/edu/school?id=17838",
        "https://www.snapchat.com/add/chapmanu",
        "http://chapmanadmission.tumblr.com/",
        "http://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://social.chapman.edu/",
        "#",
        "https://www.chapman.edu/",
        "/",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "https://news.chapman.edu/wp-admin/ ",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "https://www.chapman.edu/campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu",
        "https://news.chapman.edu/work/",
        "/",
        "https://www.chapman.edu/",
        "#",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "#",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/discover/index.html",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "/about/connect",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/academics/course-catalogs/index.aspx",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "/admission/undergraduate/applynow",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/afford.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/net-cost-calculator/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/events/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/students/health-and-safety/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "/research/",
        "https://www.chapman.edu/research/sponsored-projects-services/pre-award/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/post-award/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index.aspx",
        "https://www.chapman.edu/research/graduate-research/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/contact-us.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/ways-to-give/areas-to-support.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/audiences/index.aspx",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "https://social.chapman.edu/",
        "#",
        "#",
        "#",
        "#",
        "mailto:?subject=Appalachian%20%20Awakening&body=https%3A%2F%2Fnews.chapman.edu%2F2018%2F10%2F09%2Fappalachian-awakening%2F",
        "#",
        "#",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/chapman-forward/",
        "https://news.chapman.edu/category/chapman-magazine/",
        "https://news.chapman.edu/category/editors-picks/",
        "https://news.chapman.edu/author/arp/",
        "/author/arp/",
        "https://news.chapman.edu/category/arts-and-entertainment/",
        "https://news.chapman.edu/category/chapman-forward/",
        "https://news.chapman.edu/2018/10/12/chapman-dedicates-keck-center-for-science-and-engineering-which-promises-an-incredible-future-2/",
        "https://news.chapman.edu/2018/10/09/drama-from-the-front-lines/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/04/27/daniel-canogars-pareidolia-multimedia-artwork-unveiled-at-chapman-university/",
        "https://news.chapman.edu/2023/04/27/daniel-canogars-pareidolia-multimedia-artwork-unveiled-at-chapman-university/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://www.chapman.edu/emergency/index.aspx",
        "tel:+1714-289-3143",
        "tel:+1657-390-6760",
        "mailto:cmetzger@chapman.edu",
        "mailto:PR@chapman.edu",
        "/magazine",
        "/forward",
        "/coronavirus/",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/jobs/index.aspx",
        "https://www.chapman.edu/accessibility/feedback-form.aspx",
        "https://www.chapman.edu/website-feedback-form.aspx",
        "https://www.chapman.edu/students/health-and-safety/disability-services/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "emergency/index.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/index.aspx",
        "https://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "https://www.chapman.edu/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/"
    ]
}