{
    "title": "SQLite Database Integration Now Available as a Plugin for  Testing – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nJanuary 25, 2023\nSarah Gooding\nSQLite Database Integration Now Available as a Plugin for  Testing\n\nWordPress’ Performance Team is working on unbundling the Performance Lab plugin after feedback from Matt Mullenweg who requested large features become their own community plugins with the possibility of becoming canonical plugins. As part of this effort, the new SQLite database integration is now available for testing as a standalone plugin.\nYoast-sponsored contributor Ari Stathopoulos, who is leading the initiative to develop the SQLite implementation, requests that hosting companies, plugin developers, and theme authors test the plugin. Contributors are aiming to put it on track to become a canonical plugin and eventually merge the SQLite implementation into WordPress Core in a future release.\nStathopoulos updated the call for testing with instructions for how to test the standalone plugin. This is not something that should be tested in production. After activating the plugin, users can just follow the instructions on the screen to install the SQLite database.\n\nWhen testing I found that I had to delete the wp-content/db.php file in order to get the plugin to install, because it displayed the following error:\n\nThe SQLite plugin cannot be activated because a different wp-content/db.php drop-in already exists. \n\nAfter clicking the Install button, the plugin takes you to the familiar WordPress install screen where you select the language and enter the site name and password. \nIn the testing instructions, Stathopoulos noted that the plugin will create a fresh database and no content will be migrated from the original database. The old database will remain and if the plugin is deactivated the site will go back to using MySQL. Stathopoulos explained why  users will not see content from their old database when the new one is active:\n\nThe SQLite implementation does not include a way to migrate data from one database to another. Since this is a proposal for an implementation to be merged in WordPress Core, we need to follow the WordPress Core principles. Data migration is not something that Core should do; it is clearly plugin territory. Your data remains safely in your previous database, and you can access it again by disabling the SQLite module.\nWhen SQLite gets merged in Core, migration and backup plugins will add support for it.\n\nThe repository for the SQLite Database Integration plugin has been moved to the WordPress organization on GitHub and testers can offer feedback there. \nResults of the vote on the best approach to unbundling the Performance Lab plugin indicate that contributors are more in favor of keeping the Performance Lab plugin as is, but additionally deploying modules as individual plugins (32 votes) versus the alternative of making PL a wrapper focused on central infrastructure and recommendation of individual plugins (10 votes). \nIt’s possible the SQLite Integration Plugin may accessed as an independent module or recommended through the Performance Lab plugin in some way in the future, but it’s not yet been decided. Once a path forward is formalized, it will be more clear how the Performance Lab’s new structure will affect the standalone SQLite integration plugin. \nCategory: NewsShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n6\n\n\n\n\t\t6 responses to “SQLite Database Integration Now Available as a Plugin for  Testing”\t\n\n\n\n\n\n\n\n\n\n Kristina Ponting says: \n\nJanuary 26, 2023 at 12:39 AM \n\n\nNO! please no! I do not want SQLite implementation in my WP:( If I need to look for another blogging tool.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Ari says: \n\nJanuary 26, 2023 at 1:50 AM \n\n\nIf you don’t want it, you don’t have to use it!\nMySQL will always be the default database engine for WP, that can’t change. However, some sites, under some circumstances, might benefit from a lighter database – like SQLite.\nIf it’s not for you and you prefer your current database, then that’s fine.\n\nLoading…\n\n\n\n\n\n\n\n\n\n J. Brand says: \n\nJanuary 26, 2023 at 8:20 AM \n\n\nIt won’t be the default or required. Why all the drama? Also, blogging tool? It’s a bit more than that these days.\n\nLoading…\n\n\n\n\n\n\n\n\n\n wzy says: \n\nJanuary 26, 2023 at 7:35 PM \n\n\nI get the distinct impression you do not know or understand what SQLite is or what is does. Also, referring to WordPress as a “blogging tool” in 2023… Mhmm…\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Lewis Cowles says: \n\nJanuary 27, 2023 at 8:53 AM \n\n\nThis is great, although there was an existing plugin to do this. Is it time to build a legacy wrapper around wpdb, so that people can use hooks to add in different implementations and not fiddle with the filesystem too much.\nAlso, as myself and sqlite have different features. is it worth considering that this might break a lot of other community plugins?\n\nLoading…\n\n\n\n\n\n\n\n\n\n Lewis Cowles says: \n\nJanuary 27, 2023 at 9:03 AM \n\n\nThis is great, although there was an existing plugin to do this.\nIs it time to build a legacy wrapper around wpdb, so that people can use hooks to add in different implementations? The benefit being not to fiddle with the filesystem too much.\nAlso, as mysql and sqlite have different features. is it worth considering that this might break a lot of other community plugins?\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou may also like\nPerformance Lab Plugin to Add New Experimental SQLite Integration Module in Upcoming 1.8.0 ReleaseDecember 14, 2022Newly Rewritten WordPress SQLite Database Integration Plugin Needs TestingApril 21, 2023WordPress Performance Team Working Towards Unbundling Performance Lab PluginJanuary 10, 2023\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://wptavern.com/wordpress-performance-team-working-towards-unbundling-performance-lab-plugin",
        "https://wordpress.org/plugins/sqlite-database-integration/",
        "https://make.wordpress.org/core/2022/12/20/help-us-test-the-sqlite-implementation/",
        "https://github.com/WordPress/sqlite-database-integration",
        "https://github.com/WordPress/performance/issues/618#issuecomment-1377598692",
        "https://wptavern.com/category/news",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing?share=twitter",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing?share=mastodon",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing?share=facebook",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing?share=telegram",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing?share=jetpack-whatsapp",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing?share=pocket",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20SQLite%20Database%20Integration%20Now%20Available%20as%20a%20Plugin%20for%20%20Testing&body=https%3A%2F%2Fwptavern.com%2Fsqlite-database-integration-now-available-as-a-plugin-for-testing&share=email",
        "https://bloggligan.com",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing#comment-436222",
        "http://aristath.github.io",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing#comment-436223",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing#comment-436236",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing#comment-436246",
        "https://lewis.cowles.uk",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing#comment-436265",
        "https://lewis.cowles.uk",
        "https://wptavern.com/sqlite-database-integration-now-available-as-a-plugin-for-testing#comment-436266",
        "https://wptavern.com/performance-lab-plugin-to-add-new-experimental-sqlite-integration-module-in-upcoming-1-8-0-release",
        "https://wptavern.com/performance-lab-plugin-to-add-new-experimental-sqlite-integration-module-in-upcoming-1-8-0-release",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing",
        "https://wptavern.com/newly-rewritten-wordpress-sqlite-database-integration-plugin-needs-testing",
        "https://wptavern.com/wordpress-performance-team-working-towards-unbundling-performance-lab-plugin",
        "https://wptavern.com/wordpress-performance-team-working-towards-unbundling-performance-lab-plugin",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge",
        "#",
        "#"
    ]
}