{
    "title": "Social Science  and Special Programs – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Social Science  and Special Programs\n\t\t\t    \n                            SOSC Menu\n                        Show search box.Social ScienceProgramsProgramsThe Master's Program in Social ScienceStaffScholarshipsInternshipsMission and GoalsDonating to the Social Science ProgramFaculty and StaffSocial ScienceProgramsProgramsThe Master's Program in Social ScienceStaffScholarshipsInternshipsMission and GoalsDonating to the Social Science ProgramFaculty and Staff\n        Our Office\n        Location Icon\n                                                                            Butte Hall, Room 611\n                                                                530-898-5688sosc@csuchico.eduRegular Hours\n                                                                            8 a.m.–5 p.m.\n                                                                \n                                                                                Monday–Friday\n                                                                    Mailing Address\n                                                                            Department of Social Science\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0475\n                                                                    \n                Give a Gift\n    Current page:  SOSC\n                                        \n    \t\tSocial Science\n    \tA myriad of opportunities!The BA in Social Science is designed for students who have a broad interest in the behavioral and social sciences. It is an interdisciplinary program with a curriculum from the disciplines and programs of the College of the Behavioral and Social Sciences and the Department of History. The program has two options to best meet the needs of our students: multidisciplinary studies and specialization studies. Both options are available to distance education students who do not reside in Chico.  We have increased our online options from 2 to 8 beginning AY 23-24.The multidisciplinary option is chosen by students desiring a general social science background. It contains coursework in Economics, History, Geography, and Political Science. Some students plan to pursue a secondary (grades 6-12) teaching credential and select this option to prepare for the California Subject Examinations for Teachers (CSET) in Social Science, a subject matter competency requirement for secondary teacher preparation programs. The BA in Social Science can be used to fulfill the Subject Matter Requirement for pre-credential students seeking admission to a teacher credential program and meets the Subject Matter requirements in lieu California Subject Examination for Teachers (CSET). The option in Multidisciplinary Studies is available for students attending either on campus or online. The specialization studies option allows students to focus on one discipline or area of concentration offered by the College of Behavioral and Social Sciences and the Department of History. Many of our students plan to apply these concentrations in a variety of specialized fields. There are 20 areas of concentration from which to choose: Alternative Dispute Resolution, Anthropology, Asia, California Studies, Career and Life Planning, Child Development, Community Organizing for Social Change, Economics, Environmental Planning, Environmental Studies, Family Relations, Geography, Gerontology, Health Science, History, International Relations, Multicultural and Gender Studies, Political Science, Psychology, and Public Administration.The option in Specialization Studies offers online concentrations in Anthropology, Career and Life Planning, Child Development, Community Organizing for Social Change, Environmental Planning, Family Relations, and Gerontology.Social Science graduates are in demand for a variety of professions. Graduates are employed in public education, career centers, human resource organizations, local government agencies, non-profit organizations, and the public sector.For more information please email our program advisor at soscadvisor@csuchico.edu.The MA in Social ScienceThe MA in Social Science is a flexible interdisciplinary program which allows students to tailor a program to their specific academic or career goals, drawing on curricula from departments in the College of Behavioral and Social Sciences, as well as history, and other university programs. While possibilities are varied, some examples include focusing on higher education administration, cultural and gender studies, and career development counseling. To learn more about the MA in Social Science program requirements click here(opens in new window).Virtual and In person ServicesThe physical office for the Social Science Program is OPEN. However, most services are still available online. Please visit our Faculty and Staff(opens in new window) page to find any contact information you may need.For general questions email Jocelyn Ahern(opens in new window).For Undergraduate advising email Taylor Hinchcliff.For Graduate advising email Dr. Darin Haerle.To schedule an Advising appointment click HERE. \n                        Our Mission \n                    \n                        Programs\n                    \n                        Internships \n                    \n                        Scholarships\n                    \n                        Social Science in Action\n                    College of Behavioral & Social SciencesButte Hall, Room 701530-898-6171bss@csuchico.eduwww.csuchico.edu/bssSupport Our CollegeProgram PortfolioBSS Majors & ProgramsAnthropologyChild DevelopmentEconomicsGeography & PlanningPublic Health & Health Services AdministrationMulticultural & Gender StudiesPolitical Science & Criminal JusticePsychologySocial ScienceSocial WorkSociology\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "index.shtml",
        "programs/index.shtml",
        "programs/ma-in-social-science.shtml",
        "people/index.shtml",
        "scholarships.shtml",
        "internships.shtml",
        "mission.shtml",
        "donating.shtml",
        "faculty-staff.shtml",
        "index.shtml",
        "programs/index.shtml",
        "programs/ma-in-social-science.shtml",
        "people/index.shtml",
        "scholarships.shtml",
        "internships.shtml",
        "mission.shtml",
        "donating.shtml",
        "faculty-staff.shtml",
        "tel:530-898-5688",
        "mailto:sosc@csuchico.edu",
        "https://securelb.imodules.com/s/1751/wide.aspx?sid=1751&gid=2&pgid=405&cid=1058&dids=4.35.36.37.38.39.40.41.42.43.44.45.46.47.48.49.50.51.151.1.154&bledit=1&sort=1",
        "mailto:soscadvisor@csuchico.edu",
        "https://catalog.csuchico.edu/colleges-departments/college-behavioral-social-sciences/social-science/social-science-ma/",
        "faculty-staff.shtml",
        "mailto:jmahern@csuchico.edu",
        "mailto:thinchcliff@csuchico.edu",
        "mailto:dhaerle@csuchico.edu",
        "https://outlook.office365.com/owa/calendar/SocialScienceAdvising@csuchico.onmicrosoft.com/bookings/",
        "mission.shtml",
        "programs/index.shtml",
        "internships.shtml",
        "scholarships.shtml",
        "announcements/soscial-science-in-action.shtml",
        "mailto:bss@csuchico.edu",
        "https://www.csuchico.edu/bss/index.shtml",
        "https://www.csuchico.edu/bss/support.shtml",
        "https://www.csuchico.edu/bss/program-portfolio/index.shtml",
        "https://www.csuchico.edu/anth/index.shtml",
        "https://www.csuchico.edu/chld/index.shtml",
        "https://www.csuchico.edu/econ/index.shtml",
        "https://www.csuchico.edu/geop/index.shtml",
        "https://www.csuchico.edu/phha/index.shtml",
        "https://www.csuchico.edu/mcgs/index.shtml",
        "https://www.csuchico.edu/pols/index.shtml",
        "https://www.csuchico.edu/psy/index.shtml",
        "index.shtml",
        "https://www.csuchico.edu/swrk/index.shtml",
        "https://www.csuchico.edu/soci/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}