{
    "title": "Accessibility and Accommodations – Accessible Technology Initiative – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Accessible Technology Initiative\n\t\t\t    \n                            ATI Menu\n                        Show search box.Accessible Technology  Initiative HomeCampus Plans & ProceduresProcurementAccessible Instructional MaterialsWeb Accessibility StatementSteering CommitteeATI for VendorsCSU, Chico ReportsChancellor PoliciesHigher Education LawsuitsResourcesAccessible Technology  Initiative HomeCampus Plans & ProceduresProcurementAccessible Instructional MaterialsWeb Accessibility StatementSteering CommitteeATI for VendorsCSU, Chico ReportsChancellor PoliciesHigher Education LawsuitsResourcesLive Chat SupportConnect Now(opens in new window)ATICampus Plans & ProceduresCurrent page:  Web Accessibility Statement\n                        \n    \t\tAccessibility and Accommodations\n    \tChico State is committed to ensuring that accessibility and accommodations are a key aspect of our organization’s mission. Below is a list of our disability-related resources. For immediate help, try our live chat.Common RequestsReport an accessibility issueReport an accessibility issue with a campus website.Register with Accessibility Resource Center (ARC)For students to get accommodations related to accessibility.Campus AccessibilityAccessibility Resource Center (ARC)The best starting point for students and employees looking to receive accommodations from the University.Location:\u2028Student Services Center, Room 170\u2028530-898-5959\u2028arcdept@csuchico.eduOffice of Accessible Technology and Services (OATS)Technology-related help for students and staff. Includes captioning, content remediation, and Blackboard ALLY help.Location\u2028:Student Services Center, Room 320\u2028530-898-6532\u2028oats@csuchico.eduWeb ServicesFor staff and faculty maintaining a campus website. See our Accessible Content service offerings.webservices@csuchico.edu\u2028Submit a support ticketWeb Accessibility StatementChico State is committed to ensuring that the campus web is accessible to everyone. As a community, we work together to address the usability and accessibility of the websites contained within our web environment.Our goal is that all campus websites meet the World Wide Web Consortium's Web Content Accessibility Guidelines (WCAG 2.0 AA). All campus and community members play a part in creating accessible, usable information.Campus Web Accessibility StatementWeb Services is continually working to create a more accessible framework for campus sites in the Cascade web content management system (WCMS). The framework has been built using code compliant with W3c standards for HTML and CSS.The accessibility of the content within those sites is the responsibility of site owners and content maintainers. Neither campus users nor Web Services is permitted to upload inaccessible content to any campus website—this includes inaccessible PDFs and Word documents, uncaptioned videos, or graphics with insufficient contrast, among other things.Cascade sites are automatically checked every month using Siteimprove, and reports are sent to website owners and content maintainers. Key web pages are manually checked every six months.Sites outside of the Cascade WCMS are not provided by Web Services. The owners of these sites strive to adhere to the same guidelines and standards as the campus web. For more information, see the Campus Web Accessibility Plan.We are dedicated to continual improvement. Please report an accessibility issue if you experience any difficulty accessing the content on any Chico State site.Students, instructors, employees, and campus visitors are encouraged to contact the Accessibility Resource Center for accessibility accommodations, training, and partnerships related to any aspect of campus life.\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "../index.shtml",
        "javascript:void(0)",
        "../index.shtml",
        "procurement.shtml",
        "accessible-instructional-materials.shtml",
        "web-acccessibility.shtml",
        "steering-committee.shtml",
        "vendors.shtml",
        "../chico-reports.shtml",
        "../chancellor-policies.shtml",
        "../lawsuits.shtml",
        "../resources.shtml",
        "../index.shtml",
        "procurement.shtml",
        "accessible-instructional-materials.shtml",
        "web-acccessibility.shtml",
        "steering-committee.shtml",
        "vendors.shtml",
        "../chico-reports.shtml",
        "../chancellor-policies.shtml",
        "../lawsuits.shtml",
        "../resources.shtml",
        "https://chat.csuchico.edu/",
        "../index.shtml",
        "index.shtml",
        "https://chat.csuchico.edu/",
        "https://www.csuchico.edu/contact/change-request/?change=accessibility",
        "https://www.csuchico.edu/contact/change-request/?change=accessibility",
        "https://www.csuchico.edu/arc/students/register.shtml",
        "https://www.csuchico.edu/arc/students/register.shtml",
        "https://www.csuchico.edu/arc/index.shtml",
        "https://www.csuchico.edu/arc/index.shtml",
        "tel:530-898-5959\u2028",
        "mailto:arcdept@csuchico.edu",
        "https://www.csuchico.edu/tein/services.shtml",
        "https://support.csuchico.edu/TDClient/1984/Portal/Requests/ServiceCatalog?CategoryID=5535",
        "tel:530-898-6532",
        "mailto:\u2028oats@csuchico.edu",
        "https://www.csuchico.edu/web/index.shtml",
        "https://www.csuchico.edu/web/index.shtml",
        "https://support.csuchico.edu/TDClient/1984/Portal/Requests/ServiceCatalog?CategoryID=5535",
        "mailto:webservices@csuchico.edu",
        "https://support.csuchico.edu/TDClient/1984/Portal/Requests/ServiceCatalog?CategoryID=3197",
        "https://www.csuchico.edu/web/accessibility/index.shtml",
        "https://www.csuchico.edu/contact/change-request/?change=accessibility",
        "https://www.csuchico.edu/arc/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}