{
    "title": "History | Federated Indians Graton Rancheria",
    "body": "\n \n\n\n\n\n\n\n\n\n\n\nGovernment\n\nAdministration\nEducation\nEnvironmental\nFiscal\nHousing\nTANF\nTribal Citizenship\nTribal Council\nTHPO\n\n\nCulture\n\nBasketry\nHistory\nLanguage\nPreservation\nTraditional & Cultural Territory\n\n\nCommunity\n\nScholarship Fund\nDonations\nEvent Calendar\nNews\n\n\nBusiness\n\nGraton Resort & Casino\n\n\nEmployment\nContact Us\nCitizen Portal Login\n \n\n\nSelect Page\n\n\n  \n \n \n\n\n\n\n\n\n\n\n\n\n\nHistory\n\n\n\n\n\n\n\n\n\nOur History\n\nHistorical Background & Timeline\n\n\n\nThe Graton Rancheria community is a federation of Coast Miwok and Southern Pomo groups recognized as a tribe by the U.S. Congress. The Miwok of west Marin County have, through the years, been referred to as Marshall Indians, Marin Miwok, Tomales, Tomales Bay, and Hookooeko. The Bodega Miwok (aka, Olamentko) traditionally lived in the area of Bodega Bay. The neighboring Southern Pomo Sebastopol group lived just north and east of the Miwok. The town of Sebastopol is located about one mile midway between the north boundary of Miwok territory and the southern edge of Southern Pomo territory.\n \n \n9\n\n\n1579\nThe earliest recorded account of the Coast Miwok people made by the Europeans was found in a diary kept by Chaplain Fletcher aboard Sir Francis Drake’s ship, which landed in Marin County that year.\n\n\n \n9\n\n\n1595 - 1812\nThe Spanish and Russian voyagers provided additional information about encounters with the Coast Miwok and their occupancy of the area, proving these Indian peoples continued to live in this area over the ensuing centuries. Russian outposts were established at Bodega Bay and Fort Ross in 1809 and 1812, respectively.\n\n\n \n9\n\n\n1769 - 1834 \nThe Mission Period. The Spanish missions and the Mexican occupancy impacted this area of California. Mission San Francisco de Asisi (Mission Dolores), Mission San Rafael Archangel and Mission San Francisco Solano used Indians, including the Coast Miwok and Southern Pomo people, as their labor source. Records from these Missions are still used to substantiate the Native culture and genealogical research.\n\n\n \n9\n\n\n1834 - 1850\nAfter the Mission period ended in the 1830s, Indian people were kept in servitude by Mexican land grant owners all across the confiscated tribal territories. During Mexican occupation, a Coast Miwok, Camilo Ynitia, obtained a land grant for Olompali, the site of a large Coast Miwok village existing from prehistoric times which is still an important historic site today. After the Mexican government secularized the Church, the San Rafael Christian Indians were granted 20 leagues (80,000 acres) of mission lands at Nicasio in 1835. Approximately 500 Indians settled there. By 1850, confiscation of land by non-Indians had quickly reduced these Indian lands to a single league (4,000 acres).\n\n\n \n9\n\n\n1861\nThe United States Congress enacts legislation which effectively extinguishes Indian title to almost all land in California, leaving most tribes, including Graton Rancheria’s ancestors, entirely landless.\n\n\n \n9\n\n\n1880\nThe 36 Indian people remaining at Nicasio were persuaded to leave when funds were cut to all Indians (except those at Marshall) who were not living at the Poor Farm, a place for “indigent” peoples.\n\n\n \n9\n\n\nMid 1880s\nBy this time, as a result of the loss of homelands, European disease, mistreatment, and enslavement, the Indian population in California, which at European contact was estimated at 30,000 – 40,000, had declined dramatically. In the late 1800s, Indian people of this area were employed as farm workers. Although the work was seasonal and itinerant, Coast Miwok and Southern Pomo preferred to work in Marin and Sonoma counties. Bodega Miwok William Smith and his relatives founded the commercial fishing industry in the Bodega area. One family continued as commercial fisherman into the 1970s, while another family maintained an oyster harvesting business.\n\n\n \n9\n\n\n1905 - 1936\nReports by scholars and by the Bureau of Indian Affairs demonstrate that Coast Miwok and Southern Pomo continued to live in Marin and Sonoma even though deprived of a land base by non-Indians. In 1920, the Bureau of Indian Affairs purchased a 15.45 acre tract of land in Graton, CA for the “village home” of the Marshall, Bodega, Tomales, and Sebastopol Indians. Through the purchase of this land, which was put into federal trust, the federal government consolidated these neighboring, traditionally interactive groups into one recognized entity, Graton Rancheria; thus establishing them as a federally recognized tribe of American Indians.\n\n\n \n9\n\n\n1924\nCongress grants all Native Americans born in the United States full citizenship.\n\n\n \n9\n\n\n1958\nCongress passes the California Rancheria Act of 1958 calling for the termination of 41 California Rancherias, including the Graton Rancheria. Under the Act, Graton Rancheria was removed from federal trust and the land was distributed to three residents (now deceased) as private property. This action terminated federal recognition of a tribe of American Indians. The termination was done in the absence of, and without the consent of the tribal members.\n\n\n \n9\n\n\n1960 - Early 1990s\nDespite the federal government’s termination of federal recognition of the Graton Tribe, Tribal members continued to protect the cultural identity of their people by preserving tribal and other archeologically important sites throughout their aboriginal territory.\n\n\n \n9\n\n\n1990 - 1992\nIn a continuing effort to protect their aboriginal territory and their cultural and political identity, tribal members, led by Chairman Greg Sarris, raised money to travel to Washington to fight for restoration of their federal status. The Tribe at this time (numbering 152) was established and operating as the Federated Coast Miwok, later renamed the Federated Indians of Graton Rancheria (FIGR).\n\n\n \n9\n\n\n1997\nA Congressionally mandated study recommended the immediate restoration of three California tribes, including the Federated Indians of Graton Rancheria.\n\n\n \n9\n\n\n2000\nOn December 27, 2000, President Clinton signed into law legislation restoring federal recognition to the Federated Indians of Graton Rancheria. The legislation also provided for the restoration of land to this now landless tribe. Since the land of the original Graton Rancheria was transferred to three distributees, now deceased, the only land still belonging to the tribe was a one-acre parcel held in private ownership by one Coast Miwok family.\n\n\n \n9\n\n\n2002\nThe Bureau of Indian Affairs ratifies the tribe’s base roll and tribal constitution. The tribe then begins to establish a land base for its people.\n\n\n \n9\n\n\n2003 - 2004\nIn October 2003, the Tribe enters into an enforceable and binding agreement with the City of Rohnert Park to mitigate the potential impacts of the operation of its proposed Gaming Facility on the City and to establish mechanisms for sustained charitable giving designed to benefit the City and the Tribe. In November 2004, the Tribe enters into a similar enforceable and binding agreement with the County.\n\n\n \n9\n\n\n2004\nThe Tribe forms a Language Group of Tribal Citizens who are dedicated to learning the Coast Miwok Language. And as part of their efforts, the Tribe applied for and received their first ANA Language Grant and publish a Coast Miwok Dictionary for the Tribe, based on recordings from Sarah Smith-Ballard, one of the last fluent Coast Miwok speakers. The Language Group continues to meet monthly.\n\n\n \n\n\n\n2005\nThe Tribe purchases approximately 254 acres of land for its reservation just outside of Rohnert Park, of which a portion of the land is to be used for a proposed gaming facility. The Tribe also agrees to wait until the environmental review of the proposed gaming facility is complete before exercising its right under the Graton Rancheria Restoration Act to put the land into trust.\n\n\n \n9\n\n\n2008\nIn 2008, after six years of applying, the Tribe receives grant funding from the U.S. Department of Health and Human Services through the Administration of Children and Families to launch its own Tribal TANF program for low-income Native American families in Sonoma and Marin counties, including programs and services to strengthen families such as employment assistance, job training, and child care assistance.\n\n\n \n9\n\n\n2009\nThe Notice of Availability of a Final Environmental Impact Statement is published in the Federal Register on February 19, 2009\n\n\n \n9\n\n\n2010\nIn October 2010, the NIGC issues its Record of Decision for the Tribe’s project, concluding that the land is eligible for gaming under IGRA. Also in October 2010, the Bureau of Indian Affairs of the U.S. Department of the Interior accepts the 254 Acre Parcel into trust on behalf of the Tribe.\n\n\n \n9\n\n\n2012\nOn July 12, 2012 the Tribe holds a Special Election to amend the Tribe’s Constitution to prohibit disenrollment, which was later ratified by the Secretary of the Interior on January 14, 2013.\n\n\n \n9\n\n\n2013\nIn November 2013, the Tribe opens the Graton Resort and Casino, and in doing so, is able to provide programs and services to Tribal Citizens to realize their dreams of self-sufficiency.\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nFederated Indians of Graton Rancheria (FIGR)\n\n\nEmployment\nAdministration\nEnvironmental\nFiscal\nHousing\nTANF\nTHPO\nTribal Council\n\n\n(Coming Soon) Follow us\n\n\nFollowFollowFollowFollow\n\n\n\nAddress\n\n\n\n6400 Redwood Drive, \nSuite 300\n\n\n\n\nRohnert Park, CA. 94928\n\n\n\n\n\nContact us\n\n\n\nPhone (707) 566-2288\n\n\n\nFax (707) 566-2291\n\n\n\n\n\n\nPrivacy Policy | Terms & Conditions | Site by Dahotra\n\n\nImages of Tolay. NewYear2016. CCoughlin\n\n\n\n\n©Copyright 2023 Federated Indians of Graton Rancheria\n\n\n\n\n\n\n\nEmployment\nAdministration\nEnvironmental\nFiscal\nHousing\nTANF\nTHPO\nTribal Council\n \n \n\n\n\n\n\nFacebook\n\n\n\n\nTwitter\n\n\n\n\nRSS\n\n\nDesigned by Elegant Themes | Powered by WordPress  \n\n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n",
    "links": [
        "https://gratonrancheria.com/",
        "#",
        "https://gratonrancheria.com/government/admin/",
        "https://gratonrancheria.com/government/education/",
        "https://gratonrancheria.com/government/environmental/",
        "https://gratonrancheria.com/government/fiscal/",
        "https://gratonrancheria.com/government/housing/",
        "https://gratonrancheria.com/government/tanf/",
        "https://gratonrancheria.com/government/tribal-citizenship/",
        "https://gratonrancheria.com/government/tribal-council/",
        "https://gratonrancheria.com/government/thpo/",
        "#",
        "https://gratonrancheria.com/culture/basketry/",
        "https://gratonrancheria.com/culture/history/",
        "https://gratonrancheria.com/culture/language/",
        "https://gratonrancheria.com/culture/preservation/",
        "https://gratonrancheria.com/culture/traditional-cultural-territory/",
        "#",
        "https://gratonrancheria.com/ucscholarship/",
        "https://gratonrancheria.com/community/donations/",
        "https://gratonrancheria.com/community/events/",
        "https://gratonrancheria.com/blog/",
        "#",
        "https://www.gratonresortcasino.com/",
        "https://gratonrancheria.com/employment/",
        "https://gratonrancheria.com/contact/",
        "https://gratonrancheria.com/login/",
        "https://gratonrancheria.com/employment/",
        "https://gratonrancheria.com/government/admin/",
        "https://gratonrancheria.com/government/environmental/",
        "https://gratonrancheria.com/government/fiscal/",
        "https://gratonrancheria.com/government/housing/",
        "https://gratonrancheria.com/government/tanf/",
        "https://gratonrancheria.com/government/thpo/",
        "https://gratonrancheria.com/government/tribal-council/",
        "#",
        "#",
        "#",
        "#",
        "https://gratonrancheria.com/privacy-policy/",
        "https://gratonrancheria.com/terms/",
        "http://www.dahotra.com/",
        "https://gratonrancheria.com/employment/",
        "https://gratonrancheria.com/government/admin/",
        "https://gratonrancheria.com/government/environmental/",
        "https://gratonrancheria.com/government/fiscal/",
        "https://gratonrancheria.com/government/housing/",
        "https://gratonrancheria.com/government/tanf/",
        "https://gratonrancheria.com/government/thpo/",
        "https://gratonrancheria.com/government/tribal-council/",
        "#",
        "#",
        "https://gratonrancheria.com/feed/",
        "https://www.elegantthemes.com",
        "https://www.wordpress.org"
    ]
}