{
    "title": "Box Plans & Pricing From $5 Per User/Month | Start a Free Trial",
    "body": "\n\n\n\n\n\n\nClose\nCome learn how to optimize Box for your business needs at the Content Cloud Summit on 5/9. \nRegister for free\n\n\n\n\n\n\n\n\n\n\nMain Navigation\n\n\n\n\n\nProducts\nCircle enterprisecircle-enterpriseOverviewThe Content CloudCircle securityandcompliancecircle-securityandcomplianceSecurity & ComplianceEnd-to-end data protectionCircle collaborationcircle-collaborationCollaborationSecurely work together on filesCircle workflowcircle-workflowWorkflowAutomate processes with Box RelayCircle box sign2circle-box-sign2E-signatureNative signature with Box SignCircle integrationscircle-integrationsIntegrationsThousands of connected appsCircle developertools2circle-developertools2Developer Tools & APIsExtend Box with APIsCircle itadmincircle-itadminIT Administration & ControlsEnterprise visibility and controls\nSee all products & features\n\nFeatured\n\nBox Canvas is here\nUnleash your creativity with our new visual collaboration and whiteboarding capabilities.Learn more\nSolutions\n\nIndustries\nSplash industry financialservicessplash-industry-financialservicesFinancial ServicesSplash industry governmentsplash-industry-governmentState & Local GovernmentSplash industry nonprofitsplash-industry-nonprofitNonprofitSplash industry educationsplash-industry-educationEducationSplash industry professionalservicessplash-industry-professionalservicesProfessional ServicesSplash industry lifesciencessplash-industry-lifesciencesLife SciencesIcon industry federal government (5)Icon industry federal government (2)Federal GovernmentSplash industry healthcaresplash-industry-healthcareHealthcareSplash industry retailsplash-industry-retailRetailSplash industry mandesplash-industry-mandeMedia & Entertainment\nDepartments\nSplash lob financesplash-lob-financeFinanceSplash lob salessplash-lob-salesSalesSplash lob hrsplash-lob-hrHuman ResourcesSplash lob marketingsplash-lob-marketingMarketingSplash lob engineeringsplash-lob-engineeringEngineering Splash lob legalsplash-lob-legalLegal\nServices\nCircle box consulting2circle-box-consulting2Box ConsultingYour transformation partnersCircle box shuttle bluecircle-box-shuttle-blueBox ShuttleSeamlessly migrate to the cloudCircle box premier servicescircle-box-premier-servicesProduct SupportKeep business moving\nCustomers\n\nResources\n\nResources\nSplash resources downloadssplash-resources-downloadsApp DownloadsSplash resources resourcecentersplash-resources-resourcecenterResource CenterSplash resources knowedge centersplash-resources-knowedge-centerKnowledge CenterSplash support trustsplash-support-trustTrust\nLearning\nSplash resources webinarssplash-resources-webinarsWebinarsSplash resources demossplash-resources-demosDemos & Use Cases\nSupport\nSplash resources communitysplash-resources-communitySupportSplash support communitysplash-support-communityCommunitySplash support trainingsplash-support-trainingTraining\nPartners & Developers\nSplash resources partnerssplash-resources-partnersPartnersSplash resources developerssplash-resources-developersDevelopers\nFeatured\n\nGet free, unlimited e-signatures\nStop overpaying for e-signatures. Empower your teams with natively integrated Box Sign. It's all yours in the Content Cloud.Learn more\nPricing\n\nContact\n\n1.877.729.4269\n\n\n\n\n\nGet startedLog in\n\n\n\n\n\n\n \nChoose the best plan for your businessIndividuals and TeamsBusiness PlansIndividuals and TeamsBusiness PlansMonthly\nAnnually(Save*)\nFOR INDIVIDUALS\nIndividualFree\nsingle user\nSign Up \nSign up with Google Secure file storage, sharing and native e-signatures for personal useUp to 30GB¹Limited promotion250 MB file upload limit1 file versionAccess to 1 version of each fileBox Sign: 5 docs for e-sign per monthStandard e-sign features incl. real-time audit trail¹ Earn 30 GB by signing up on Box Mobile (iOS or Android) with your business email from 4/17-5/31Show featuresHide features\nFOR INDIVIDUALS\nPersonal Pro$14 $10\nper month\npaid annuallysingle user\nBuy it Upgrade your personal plan for more flexibility, storage and e-signatures100 GB of storage5 GB file upload10 file versionsAccess to 10 versions of each fileBox Sign: 15 docs for e-sign per month; Unlimited templatesAdvanced e-sign features incl. signer verification and password protectionShow featuresHide features\nFOR BUSINESS TEAMS\nBusiness Starter$7 $5\nper user/month\npaid annuallyminimum of 3 users\nBuy It Try ItSecure file collaboration, storage and native e-signatures for up to 10 users100 GB of storage2 GB file upload25 file versionsAccess to 25 versions of each fileBox Sign: 10 docs for e-sign per user per month; Unlimited templatesAdvanced e-sign features plus customizable disclosureTechnical Support during local business hoursShow featuresHide featuresAll the plans include these featuresBox CanvasnewUnlimited infinite canvases and standard featuresSecure File sharing2-factor authenticationAdded security for your usersAnytime, anywhere accessBuilt-in integrations with Microsoft 365\nand Google WorkspaceBox Mobile App CollaborationIntegrated desktop experienceShared folders and linksBox Community accessOnline/self-paced trainingOur extensive Box Education libraryNote-taking and project managementEasy ways to collaborate in real timeShow more featuresShow less featuresTrusted by the world's leading organizationsUsing Box for work?\nWe’ve got you covered.Check out our Business plans: the fastest way to get your whole team collaborating securely. You get all the features in the plans above, plus unlimited external collaborators, unlimited storage, unlimited web-based e-signatures, and 1,500+ enterprise app integrations. You also get data loss protection, custom branding, document watermarking, and Admin Console access. The best part? Our plans won’t break the bank.\nView Business plans Explore how the Content Cloud worksFrequently asked questionsHow much data can 10GB hold?The average user stores a mix of digital media (photos and videos) and documents. 10GB gives you the option of storing roughly:2,000 songs or picturesMore than 50,000 documentsCan I share my files and folders with someone who doesn’t have a Box account?Yes! You can create an external link that can be shared with anyone, even people without a Box account. (Though while you’re at it, why not encourage them to start a free Box account?! That way you can collaborate with them and co-edit the document.)Can I buy more storage space on my plan?If you have an Individual plan, you can free up space by deleting unused files and folders, or you can choose an upgraded plan (with unlimited storage available) that meets your needs.Can I access my Box account via mobile?Absolutely! Download the Box Mobile App here to access your content anywhere, anytime.Have another question?Check out our help center.Need help finding the right solution? Start by contacting our sales team. Tell us what you're hoping to accomplish with Box and how we can help simplify the way your organization works.Business$20 $15\nper user/month\npaid annuallyminimum of 3 users\nBuy It Try ItTeam collaboration for any businessOrganization-wide collaborationUpload files up to 5GBUnlimited storageTechnical Support during local business hours1,500+ integrations like Microsoft Office and Teams, Salesforce, Google Workspace, Slack, and moreBox Sign: Unlimited e-signatures via web app**Standard Sign features and unlimited e-signatures via Box web appBox CanvasnewUnlimited infinite canvases and advanced featuresBox Relay: Standard workflow automationData loss protectionCustom metadata and metadata templatesHIPAA/FedRAMP complianceDocument watermarking2FA for external usersPassword policy enforcementShow featuresHide features\nMOST POPULAR\nBusiness Plus$33 $25\nper user/month\npaid annuallyminimum of 3 users\nBuy It Try ItContent management for your entire organizationUnlimited external collaboratorsUpload files up to 15GBUnlimited storageTechnical Support during local business hours1,500+ integrations like Microsoft Office and Teams, Salesforce, Google Workspace, Slack, and moreBox Sign: Unlimited e-signatures via web app**Standard Sign features and unlimited e-signatures via Box web appBox CanvasnewUnlimited infinite canvases and advanced featuresBox Relay: Standard workflow automationData loss protectionAdvanced search filtersCustom metadata and metadata templatesHIPAA/FedRAMP complianceDocument watermarking2FA for external usersPassword policy enforcementShow featuresHide featuresEnterprise$47 $35\nper user/month\npaid annuallyminimum of 3 users\nBuy It Try ItAdvanced content management and data protectionUnlimited external collaboratorsUpload files up to 50GBUnlimited storageTechnical Support during local business hours1,500+ integrations like Microsoft Office and Teams, Salesforce, Google Workspace, Slack, and moreBox Sign: Unlimited e-signatures via web app**Advanced Sign features and unlimited e-signatures via Box web appBox CanvasnewUnlimited infinite canvases and advanced featuresBox Relay: Advanced workflow automationData loss protectionAdvanced search filtersCustom metadata and metadata templatesHIPAA/FedRAMP complianceDocument watermarking2FA for external usersPassword policy enforcementShow featuresHide featuresNewnew\nNEW PLAN\nEnterprise PlusCustom\n\nContact us Learn moreThe power of the Content Cloud in one simple planEverything in Enterprise, along with:Upload files up to 150GBBox ShieldSophisticated threat detection and smart access controls to prevent data lossBox GovernanceAdvanced retention, disposal, and legal holds to manage the entire content lifecycleBox Sign: Unlimited e-signatures via web app, and Salesforce**Advanced Sign features, unlimited e-signatures via Box web app and Salesforce, and use of custom/third-party app signaturesBox CanvasnewUnlimited infinite canvases and advanced featuresBox RelayNo-code workflow automation for key business processesBox Shuttle20 terabytes of standard content migrationBox PlatformDeveloper tools and open APIs for custom developmentBox Zones***Data residency controls for your contentBox GxP***A validated platform for both regulated and non-regulated contentEnhanced Services24/7/365 support and more, plus access to the Box Consulting Accelerator ProgramShow featuresHide featuresFeatures\nBusiness Starter\n\nBuy It Try It\nBusiness\n\nBuy It Try It\nMOST POPULAR\n\nBusiness Plus\n\nBuy It Try It\nEnterprise\n\nBuy It Try It NEW PLAN\n\nEnterprise Plus\n\nContact us Learn moreStorage\n100 GB\n\nUnlimited\n\nUnlimited\n\nUnlimited\n\nUnlimited\nSingle file upload limit\n2 GB\n\n5 GB\n\n15 GB\n\n50 GB\n \n150 GB\nEnterprise app integrations\n0\n\n1\n\n10\n\nUnlimited\n\nUnlimited\nVersion history\n25\n\n50\n\n50\n\n100\n\nUnlimited\nMinimum users\n3\n\n3\n\n3\n\n3\n\nContact us\nMaximum users\n10\n\nUnlimited\n\nUnlimited\n\nUnlimited\n\nUnlimited\nExternal collaborators\nRequire paid accounts\n\nRequire paid accounts\n\nUnlimited\n\nUnlimited\n\nUnlimited\nAPI calls per month\n25,000\n\n50,000\n\n50,000\n\n100,000\n\n100,000\nIncluded Box Sign documents for native signatures via web app\n10 per user per month\n\nUnlimited\n\nUnlimited\n\nUnlimited\n\nUnlimited\nIncluded Box Sign documents for signatures via 3rd party & custom integrations\n-\n\n100\n\n150\n\n250\n\nUnlimited (3rd party), 1000 (custom)\nGranular sharing permissions & access controlsBuilt-in integrations with Microsoft 365, Google Workspace and SlackDesktop accessMobile accessSSL & at-rest encryptionTwo-factor authenticationStandard business supportUser managementData loss protectionAdvanced user & security reportingActive directory & SSO (Single Sign-On) integrationCustom brandingMobile security controlsBox Sign - Box Relay integrationAdvanced admin & controlsFull content visibility & managementFull user activity trackingAdmin role delegationMetadata & custom templatesCustom terms of servicePCI DSSOptional: Box Governance, Box ZonesOptional: Box KeysafeOptional: Box ShieldHIPAA/HITECH-eligible, FedRAMPUnlimited integrations, including DLP & eDiscoveryDevice trust (advanced mobile requirements)Password policy enforcementDocument watermarkingBox Sign: Batch send for sending documents in bulkBox Sign: Ready-sign links to post documents online for signature\nShow more featuresShow fewer featuresCheck out Enterprise PlusEnterprise Plus brings the best of the content cloud to customers in one single plan. We’ve included our most-valued products and services to help power your organization. And it saves you up to 35%.\nLearn more Our most popular add-on productsBox ShieldPrevent data breaches with classification-based security controls and intelligent threat detectionLearn moreBox GovernanceSet advanced retention policies, disposals, and legal holds on your contentLearn moreBox PlatformExtend the power of the Content Cloud with APIs to connect content across your business appsLearn moreBox ZonesHelping you comply with multi-regional data residency requirementsLearn moreTrusted by the world's leading organizationsFrequently asked questionsHow much data can 10GB hold?The average user stores a mix of digital media (photos and videos) and documents. 10GB gives you the option of storing roughly:2,000 songs or picturesMore than 50,000 documentsCan I share my files and folders with someone who doesn’t have a Box account?Yes! You can create an external link that can be shared with anyone, even people without a Box account. (Though while you’re at it, why not encourage them to start a free Box account?! That way you can collaborate with them and co-edit the document.)Can I buy more storage space on my plan?If you have an Individual plan, you can free up space by deleting unused files and folders, or you can choose an upgraded plan (with unlimited storage available) that meets your needs.Can I access my Box account via mobile?Absolutely! Download the Box Mobile App here to access your content anywhere, anytime.Have another question?Check out our help center.Need help finding the right solution? Start by contacting our sales team. Tell us what you're hoping to accomplish with Box and how we can help simplify the way your organization works.*Annual per-user pricing shown has been reduced by 25% and rounded to the nearest whole USD. Prices listed are valid for new customers only.**Staged roll-out - available when provisioned in Admin Console***Available on request\n\n\n\n\n\n\n\n\nYouTube\n\n\nBlog\n\n\nTwitter\n\n\nFacebook\n\n\n\n\n\n\n\n\nCompanyUse CasesService & SupportResourcesInternational sites\n\n\nAbout UsLeadershipESGPressBox BlogInvestor RelationsBox.orgCareersPartnersLegalCollaborationCloud StorageMobilitySecurityBox for ECMSend Large Files FastCloud Content ManagementRemote WorkFile SharingDocument ManagementProject ManagementFTP AlternativeFile TransferCloud BackupProduct SupportTrainingCommunityContact Us 1.877.729.4269GDPR ComplianceGxP ValidationDemosDownloadsResource centerUnited States (English)United Kingdom (English)India (English)Netherlands (English)Sweden (English) Australia (English)Canada (English)France (Français)Deutschland (Deutsch)Italia (Italiano)日本 (日本語)한국 (한국어)América Latina (Español)\n\n\n\n\n\n\nHomeCareersPartnersEventsPricingDownloadsResourcesService & SupportTrainingTech SupportContact UsBlogsCommunityDevelopers\n\n\n\n\n\n\n\n\n\n©2023 Box\n\n\nSitemap\n\n\nSubscriptions\n\n\nTerms of Service\n\n\nPrivacy Policy\n\n\nDo Not Sell My Info\n\n\nCookie Notification\n\n\n\n\nEnglish (US)\nEnglish (UK/Europe)\nEnglish (Canada)\nEnglish (Australia)\nEnglish (India)\nEnglish (Netherlands)\nEnglish (Sweden)\nFrançais\nDeutsch\nItaliano\n日本語\n한국어\nSpanish\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://events.box.com/content_cloud_summit_2023",
        "/home",
        "/overview",
        "/security-compliance",
        "/collaboration",
        "/collaboration/relay-workflow",
        "/esignature",
        "/integrations/page",
        "/platform",
        "/security/it-admin-controls",
        "/products-and-features",
        "/canvas",
        "/industries",
        "/industries/financial-services",
        "/industries/government",
        "/industries/non-profit",
        "/industries/education",
        "/industries/professional-services",
        "/industries/life-sciences-biotech",
        "/industries/government-federal",
        "/industries/healthcare",
        "/industries/retail",
        "/industries/media-and-entertainment",
        "/departments/finance-accounting",
        "/departments/sales",
        "/departments/human-resources",
        "/departments/marketing",
        "/departments/engineering",
        "/departments/legal",
        "/customer-success/box-consulting",
        "/products-and-features/shuttle",
        "/customer-success/support-services",
        "/customers",
        "/resources/downloads",
        "/resources",
        "/resources/knowledge-center",
        "/trust",
        "/events/webinars",
        "/events/live-demos",
        "https://support.box.com/hc/en-us",
        "https://support.box.com/hc/en-us/community/topics",
        "https://box.csod.com/client/box/default.aspx",
        "/partners",
        "https://developer.box.com/",
        "/esignature",
        "/pricing",
        "/about-us/contact-us",
        "/quote",
        "https://account.box.com/signup/n/business?toggle=1#eg3o5",
        "https://account.box.com/login",
        "https://account.box.com/signup/n/personal",
        "https://account.box.com/integrations/googleplus/beginAuthorization?redirect_url=/&action=sign_up_freemium&tc=annual",
        "https://apps.apple.com/us/app/box-cloud-content-management/id290853822",
        "https://play.google.com/store/apps/details?id=com.box.android&hl=en_US&gl=US",
        "https://account.box.com/signup/n/propersonal",
        "https://account.box.com/signup/n/starter/buynow?tc=annual",
        "https://account.box.com/signup/n/starter?tc=annual",
        "/pricing/business",
        "/resources/downloads",
        "https://support.box.com/hc/en-us",
        "/about-us/contact-us",
        "https://account.box.com/signup/n/business/buynow",
        "https://account.box.com/signup/n/business",
        "https://account.box.com/signup/n/businessplus/buynow",
        "https://account.box.com/signup/n/businessplus",
        "https://account.box.com/signup/enterprise-plan/buynow",
        "https://account.box.com/signup/enterprise-plan",
        "/quote",
        "/enterprise-plus",
        "https://account.box.com/signup/n/starter/buynow?tc=annual",
        "https://account.box.com/signup/n/starter?tc=annual",
        "https://account.box.com/signup/n/business/buynow",
        "https://account.box.com/signup/n/business",
        "https://account.box.com/signup/n/businessplus/buynow",
        "https://account.box.com/signup/n/businessplus",
        "https://account.box.com/signup/enterprise-plan/buynow",
        "https://account.box.com/signup/enterprise-plan",
        "/quote",
        "/enterprise-plus",
        "/enterprise-plus",
        "/shield",
        "/shield",
        "/security/governance-and-compliance",
        "/security/governance-and-compliance",
        "/platform",
        "/platform",
        "/zones",
        "/zones",
        "/resources/downloads",
        "https://support.box.com/hc/en-us",
        "/about-us/contact-us",
        "https://www.youtube.com/user/box",
        "https://blog.box.com/",
        "https://twitter.com/box",
        "https://www.facebook.com/box",
        "/about-us",
        "/about-us/leadership",
        "/about-us/esg",
        "/about-us/press",
        "https://blog.box.com",
        "https://www.boxinvestorrelations.com/home/default.aspx",
        "https://www.box.org/",
        "https://careers.box.com/",
        "/partners",
        "/legal",
        "/use-cases/digital-workplace",
        "/cloud-storage",
        "/mobility",
        "/security-compliance",
        "/content-management/enterprise",
        "/send-large-files-fast",
        "/cloud-content-management",
        "/remote",
        "/file-sharing",
        "/collaboration/document-management",
        "/project-management-software",
        "/cloud-storage/ftp-alternative",
        "/file-transfer",
        "/cloud-backup",
        "/customer-success/support-services",
        "https://box.csod.com/client/box/default.aspx",
        "https://support.box.com/hc/en-us/community/topics",
        "/about-us/contact-us",
        "/quote",
        "/gdpr",
        "/gxp",
        "/events/live-demos",
        "/resources/downloads",
        "/resources",
        "/en-us/home",
        "/en-gb/home",
        "/en-in/home",
        "/en-nl/home",
        "/en-se/home",
        "/en-au/home",
        "/en-ca/home",
        "/fr-fr/home",
        "/de-de/home",
        "/it-it/home",
        "/ja-jp/home",
        "/ko-kr/home",
        "/es-419/home",
        "/home",
        "https://careers.box.com/",
        "/partners/programs",
        "/events",
        "/pricing",
        "/resources/downloads",
        "/resources",
        "/node/911",
        "https://box.csod.com/client/box/default.aspx",
        "https://community.box.com/t5/Contact-Support/ct-p/BoxSupport",
        "/about-us/contact-us",
        "https://blog.box.com/",
        "https://community.box.com/t5/Box-Community/ct-p/English",
        "https://developer.box.com/",
        "/resources/sitemap",
        "https://go.box.com/preferences.html",
        "/legal/termsofservice",
        "/legal/privacypolicy",
        "/legal/regionalnotice",
        "/legal/cookie-notification"
    ]
}