{
    "title": "Herbarium – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Herbarium\n\t\t\t    \n                            HERBARIUM Menu\n                        Show search box.DatabaseDepartment of Biological SciencesFriends of the Ahart HerbariumHerbarium LinksStaffStudies from the HerbariumWorkshopsCalifornia Phenology Thematic Collections NetworkDatabaseDepartment of Biological SciencesFriends of the Ahart Herbarium(opens in new window)Herbarium LinksStaffStudies from the HerbariumWorkshops(opens in new window)California Phenology Thematic Collections Network\n        Our Office\n        Location Icon\n                                                                            Holt Hall, Room 129\n                                                                530-898-5381Regular Hours\n                                                                            Friday\n                                                                \n                                                                                9 a.m.–5 p.m.\n                                                                    Mailing Address\n                                                                            Ahart Herbarium\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0515\n                                                                    Making a donation to Ahart Herbarium has never been easier!\n                Give a Gift\n    Current page:  HERBARIUM\n                                        \n    \t\tAhart Herbarium\n    \tAhart Herbarium presentsAll Things Botanically Related (Series)Vernal PoolsWhiskeytown: A Goldmine of Botanical Treasuresby Chris McCarronThursday, April 27, 20237-8pmRegister for Zoom >>After registering, you will receive a confirmation email containing information about joining the meeting.The Whiskeytown National Recreation Area is located on the southwestern edge of Shasta CNPS's border. This National Park is uniquely situated at the southeastern edge of the Klamath Range, adjacent to the intersection of the North Coast Range Interior and the Cascade Range Foothill bioregions (as denoted by The Jepson Manual). The elevation gradient within the park extends from 900ft, below Whiskeytown Dam, to 6200ft on the summit of Shasta Bally. As a result, the park has a diversity of vegetation types, species found at the edge of their range, and disjunct taxa from neighboring bioregions. In 2018, 97% of the park was burned during the Carr Fire, opening up over 42,000 acres of land that was previously heavily vegetated. Beginning in 2021, the National Park Service partnered with the Great Basin Institute, hiring a crew to survey the PG&E infrastructure within the park for botanical resources. The following year, the Great Basin Institute hired an additional crew to survey fuel treatment areas within the park. Over 2023, a third Great Basin Institute crew will be tasked with surveying the park, building on what has been discovered over the past two years. Significant discoveries have been made in the park during these surveys that deserve to be shared and celebrated with the botanical community. Chris McCarron has been the crew leader for all three years and will be presenting some of the key findings and discoveries made during these surveys, along with future plans for botanical work in the park. All are encouraged to attend this talk, as you will almost certainly be excited by the work being done to explore this unique and underappreciated corner of the state.Chris McCarron has been leading a Great Basin Institute crew since 2021 at Whiskeytown National Recreation Area to survey for rare, invasive, and unrecorded taxa in the park. Prior to that, he attended the University of California Berkeley for his undergraduate degree and worked at the University and Jepson Herbaria along with the East Bay Regional Parks Botanic Garden. At the moment, he has been focusing his work on elaborating on what has been discovered during his time at Whiskeytown over the past few years.All Things Botanically Related - Past Presentations:Vernal PoolsDistribution and Ecology of Vernal Poolsby Carol WithamThursday, March 16, 20237-8pmView presentation recording >>(opens in new window)After registering, you will receive a confirmation email containing information about joining the meeting.Kaleidoscopes were a favorite holiday gift for children many years ago. They displayed a quickly and constantly changing series of brilliantly colored patterns. The metaphor works for California’s vernal pool landscapes. Carol Witham will help us to explore the short-lived, weird-looking, fascinating fauna that evolved millions of years ago, and dazzling swaths of tens of thousands of tiny flowers that change from week to week through a two- to- three month “season”. This tour of California vernal pools will answer questions such as “what makes a vernal pool” and “why are they found almost nowhere but California” plus explore vernal pools from throughout the state.Carol Witham is a self-taught vernal pool ecologist and has been studying that ecosystem for over three decades. She is a private consultant specializing rare plants and animals of vernal pools plus their management. Carol is author of Field Guide to the Vernal Pools of Mather Field, Sacramento County and co-editor of Jepson Prairie Preserve Handbook, 3rd Edition. She is also very active in vernal pool conservation advocacy and education. Carol is currently the treasurer for the Sacramento Valley Chapter and a member of the state board of directors of CNPS. In the past she has served in several leadership roles within the statewide organization including president, vice-president and treasurer.Check out previous presentations in the All Things Botanically Related Series >>(opens in new window)California Phenology Thematic Collections NetworkAhart Herbarium is actively photographing specimens in the collection and linking the images to the collection information for each species. This information is accessible through the California Phenology Thematic Collections Network (www.CCH2.org(opens in new window)). Through a National Science Foundation grant, the Herbarium will be imaging over 30,000 specimens in the collection which will be similar to the one here. Collectively, over 23 different herbaria and collections across California will be located on CCH2. Check out the website!(opens in new window)  Ahart Herbarium passed another minor milestone by accessioning its 120,000th specimen – see the number 120,000 stamped in the middle of the Herbarium logo on the lower left side of the sheet in the left photograph. This specimen is another fine example of the collecting and specimen mounting of Lowell Ahart – his collection number 21,434 from last summer.Located in Holt Hall room 129, the Herbarium is the most complete repository of plant specimens from northeastern California. The emphasis is on the northern California flora, and includes a great number of rare, threatened, and endangered plant species. Established with specimens donated by the late Professor Vesta Holt in the 1950's, the herbarium now contains more than 107,000 dried and mounted plant specimens. The majority of samples are flowering plants, conifers, and ferns, but bryophytes, lichens, and especially slime molds, are also well represented. The herbarium is used extensively for identification of sensitive and other plant species by various agencies and individuals. Loans of herbarium specimens are made to any higher academic institutions who request them.Facilities available to visitors to the herbarium include the use of high-quality dissecting scopes, a compound microscope, an extensive reference library, an internet-connected computer, an internet connection for personal computers, and, with suitable training, access to the collection of specimens.Users of the herbarium facilities and collection are encouraged to make plant collections during their field excursions and donate them to the herbarium. This is how the collection grows and increases its utility and importance to the whole botanical community.\nThe Friends of the Ahart Herbarium are once again sponsoring a Native Plant Photo Contest. Contest runs through May 31, 2023. For more details and how to submit your photo, please check out Events on the Friends website.Friends of the Ahart Herbarium Workshops!Save the Date! Introduction to the Willows of California (Salicaceae)by John BairSaturday, June 24, 2023California is home to over one quarter of the estimated 120 willow species growing in North America. Cottonwoods and willows are the most common riparian hardwood species in California and yet many of us have little idea of how to tell them apart. Species identification is often neglected because willows are thought to frequently hybridize, which is further compounded by only having vegetative material during field visits when we think we need flowers to make a positive identification. The workshop will focus on the leaf, stem, and other vegetative growth characteristics that are useful in making identification while also emphasizing the regional distributions of the different species. The goal of the workshop is to provide a broad overview of willows, highlight vegetative characteristics used in the identification keys in The Jepson Manual (second edition) and familiarize participants with the six most common willows in California.Check back soon for more info!View the Friends of the Herbarium Calendar >>(opens in new window)We can now process book orders from Studies of the Herbarium >>Ahart Herbarium is again open to the public!Hours are Fridays 9:00 am to 5:00 pm, and by appointment.Visiting the herbarium is by appointment only, by contacting the Curator at ljaneway@csuchico.edu.Visitors accessing campus facilities must comply with CSU Chico vaccination policy.Thank you.If you need special accommodation to access any document on this page, please contact the Office of Accessible Technology (OATS): Call OATS (530-898-6532) | Email OATS.College of Natural SciencesScience Building, Room 413 530-898-6121naturalsciences@csuchico.eduwww.csuchico.edu/nsciSupport our College(opens in new window)Program PortfolioDepartmentsBiological SciencesChemistry & BiochemistryEarth and Environmental SciencesMathematics & StatisticsNutrition & Food SciencesPhysicsSchool of NursingScience Education\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "database/index.shtml",
        "https://www.csuchico.edu/biol/",
        "http://www.friendsofthechicostateherbarium.com/",
        "links.shtml",
        "staff/index.shtml",
        "studies/index.shtml",
        "http://www.friendsofthechicostateherbarium.com/eventsviewcalendar/",
        "california-phenology-thematic-project.shtml",
        "database/index.shtml",
        "https://www.csuchico.edu/biol/",
        "http://www.friendsofthechicostateherbarium.com/",
        "links.shtml",
        "staff/index.shtml",
        "studies/index.shtml",
        "http://www.friendsofthechicostateherbarium.com/eventsviewcalendar/",
        "california-phenology-thematic-project.shtml",
        "tel:530-898-5381",
        "https://securelb.imodules.com/s/1751/wide.aspx?sid=1751&gid=2&pgid=405&cid=1058&dids=9.96.97.98.99.100.101.102.104.105.103.156.106.107.108.10.110.109.114.113.115.111.1.154&bledit=1&sort=1",
        "https://csuchico.zoom.us/meeting/register/tZYvce2hrzMtHtBPZRFX8FeWzWKZ6cq15Dhz",
        "https://cdnapisec.kaltura.com/html5/html5lib/v2.85/mwEmbedFrame.php/p/670832/uiconf_id/29182902/entry_id/1_62wscb31?wid=1_vkpjn6ox",
        "http://www.friendsofthechicostateherbarium.com/eventsviewcalendar",
        "http://www.cch2.org",
        "http://www.cch2.org",
        "https://friendsoftheahartherbarium.org/eventsviewcalendar/2023photocontest",
        "https://www.friendsofthechicostateherbarium.com/eventsviewcalendar",
        "studies/book-list.shtml",
        "mailto:ljaneway@csuchico.edu",
        "tel:530-898-6532",
        "mailto:oats@csuchico.edu",
        "mailto:naturalsciences@csuchico.edu",
        "https://www.csuchico.edu/nsci/index.shtml",
        "https://securelb.imodules.com/s/1751/lg21/form.aspx?sid=1751&gid=2&pgid=405&cid=1058&dids=9.156.96.97.98.99.100.101.102.104.110.162.154&bledit=1&sort=1",
        "https://www.csuchico.edu/nsci/program-portfolio/index.shtml",
        "https://www.csuchico.edu/biol/index.shtml",
        "https://www.csuchico.edu/chem/index.shtml",
        "https://www.csuchico.edu/nsci/index.shtml",
        "https://www.csuchico.edu/math/index.shtml",
        "https://www.csuchico.edu/nfsc/index.shtml",
        "https://www.csuchico.edu/physics/index.shtml",
        "https://www.csuchico.edu/nurs/index.shtml",
        "https://www.csuchico.edu/sced/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}