{
    "title": "Reducing campus emissions focus of new Stanford program | Stanford News",
    "body": "\n\n\n\n \n \n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\nSearch form\n\n\n\nSearch term\n\n\n\n\n\n\nHome\nFind Stories\nFor Journalists\nContact\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAugust 20, 2021 Reducing campus emissions focus of new Stanford program Achieving Stanford’s goal of reaching at least net-zero emissions from its operations will require developing new tools and strategies, which could also help businesses and governments reach their own emissions goals. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Amy Adams\n\nStanford has committed to reaching at least net-zero emissions from its operations by 2050, but that goal won’t be possible without reducing emissions generated through operations like business travel and purchasing of supplies and services, known as Scope 3 emissions.\n\nA new effort is underway at Stanford to reduce emissions from campus operations like commuting and business travel. (Image credit: Getty Images)\n\nThese are the emissions a new program led by Randy Livingston, vice president for Business Affairs, has begun systematically to tackle, not only to help Stanford reach its goal but also to establish a path for other institutions and for the more than 100 companies that have pledged to reach net-zero emissions by 2040.\n“We have a lot of work to do,” Livingston said. “We have to define the emissions categories, determine how to measure them, count our own emissions in each category, and identify and implement mitigations.”\nHe added that many university campuses, businesses and governments are increasingly focused on this work as the risks of climate change become more apparent, but little exists as a framework for measuring Scope 3 emissions, much less for reducing them.\nDefining emissions\n\n\nThis Scope 3 work is on part of a larger effort at Stanford to create a more sustainable campus and develop solutions that can help others reach sustainability goals. As part of that, the university had previously committed to use 100% renewable energy sources and to have greenhouse gas emissions levels at 80% below peak by 2025, goals the university will reach when a new solar installation goes online in 2022.\nThese campus sustainability efforts, and others that address water use, waste and individual action, helped the university achieve a Platinum ranking from the Association for the Advancement of Sustainability in Higher Education – one of nine universities to earn that ranking out of more than one thousand members.\n\n\nThe first step for Livingston’s team is defining what Scope 3 emissions are on a university campus. The most commonly used protocol for defining Scope 3 emissions includes 15 categories that encompass business travel, employee commuting, purchased goods and services, facility construction, campus leaseholders and properties outside the main campus, among others. But although those categories are defined, the standard definitions don’t always apply to campuses. For example, business travel would generally include travel for meetings or conferences, but universities also have students traveling to come to school.\n“Student travel is akin to employee travel, but it isn’t defined in the protocol,” said Moira Zbella, program manager for the Scope 3 Emissions Program. Zbella also pointed to other aspects of campus life that are unique to university emissions, such as the abundance of dorm mini-fridges chilling late-night study snacks.\nA running start\nLivingston said that an early goal for the program is to update the standard definitions for each of the 15 categories to include university activities. Some of the categories are well defined for a university campus, Livingston said, but others are lagging.\n\n\n\n\nStanford’s Long-Range Vision lays out the future direction for the university’s research, education and impact.\nRead our updates about those initiatives and their progress.\n\n\nNext, the team will adopt or develop methodologies for measuring emissions in each of the categories. As with definitions, some already have standard ways of measuring emissions while others are just getting started.\nFor example, Stanford and some other universities have started exploring ways to measure emissions from purchasing food for dining halls, and Stanford graduate student Rebecca Grekin is developing a tool other campuses or businesses can use to calculate those emissions in a consistent way. Ultimately, the work on food purchasing with R&DE Stanford Dining could inform best practices for tracking emissions from all campus purchasing.\n“The Office of Sustainability has already initiated work on several categories that will give us a running start,” Zbella said. Those categories that are further behind, she said, will be good research opportunities for faculty and students.\n“We’ll have to attack the categories in parallel over many years,” Livingston said.\nAs the group develops ways of measuring and tracking emissions, they plan to release data on Stanford emissions in each category at least yearly. And as it becomes possible to track emissions over time, Zbella hopes to develop data-driven mitigations for each category.\nFor example, Zbella is working with R&DE Stanford Dining and a group of interested students – in conjunction with research being led by the Menus of Change University Research Collaborative – to understand if and how carbon labels influence food choices in dining halls. Other potential mitigations could include initiatives to reduce or offset business travel or incorporate sustainability into purchasing contracts. Long-term, the team will weigh the anticipated emissions impacts of these types of measures against economic and user experience considerations to inform a long-term plan.\nIn the meantime, some personal Scope 3 mitigations are integrated into MyCardinal Green, an opt-in program to help the Stanford community live more sustainably. Over time Livingston’s group will recommend more personal actions to be added to the platform.\nLivingston and Zbella said they expect to collaborate with other Stanford groups working on sustainability issues, including the Office of Sustainability, the new school focused on climate and sustainability and the Office of Community Engagement, which can help identify community partners to develop and test possible solutions. They are also working closely with a group of peer universities each addressing Scope 3 emissions to reach their own campus goals.\n\n\nMoira Zbella, program manager, said individuals looking to make a difference now could consider the following:\n\nUse the Climate Pledge Friendly filter when shopping on Amazon for Business – this filter shows only products that meet sustainability certifications and standards.\nThink twice about flying: consider attending events virtually or taking another mode of transportation if the event location is close enough.\nReduce meat consumption: reducing meat – and particularly beef – consumption is one of the most impactful ways to reduce your carbon footprint. When eating on campus, choose one of the many tasty, plant-forward options prepared by R&DE Stanford Dining. Learn more in the in their One Plate, One Planet resource, “How to Eat Sustainably On Campus.“\nUse alternative transportation: when commuting to work, avoid driving alone. Find sustainable commute options here!\nMake sure to recycle and compost. Recycling and composting reduce emissions not only by saving space in landfills, but also through the avoided extraction of raw materials for new goods. Find out what goes where by referencing the Zero Waste Guidelines for main campus and for Stanford Redwood City.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMedia Contacts\nAmy Adams, University Communications: (650) 497-5908; amyadams@stanford.edu\n\n\n\nUniversity Affairs\nOur Vision\nSustainability\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nScience & Technology\nA better, faster tool for saving water on farms\nA new tool for designing and managing irrigation for farms advances the implementation of smart agriculture, an approach that leverages data and modern technologies to boost crop yields while conserving natural resources.\n \n\n\n\n\n\n \nScience & Technology\nBanking on nature\nThe Natural Capital Project is working with development banks and 10 pilot countries to put the environment at the forefront of policy and investment decisions.\n \n\n\n\n\n\n \nLaw & Policy\nBeyond the room where it happened\nYou may have given little thought to the role Native Americans played in the creation of the U.S. Constitution. But SLS scholars argue that Native people profoundly shaped the conversation.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Report\nTo receive Stanford news daily,\nsubscribe to Stanford Report.\n\n\nFor Journalists\n\nPress Releases\nMedia Contacts\nStanford Experts\n\n\n\nSee Also\n\nContact Stanford News\nFaculty / Staff Resources \n\n\n\n\nEvents\n\nEvents calendar\n\n\n\nStanford News is a publication of Stanford University Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/find-stories/",
        "https://news.stanford.edu/for-journalists/",
        "https://news.stanford.edu/contact/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D40809",
        "https://news.stanford.edu/2020/06/12/trustees-commit-accelerating-transition-to-net-zero-greenhouse-gas-emissions/",
        "https://news.stanford.edu/wp-content/uploads/2021/08/GettyImages-487748498.jpg",
        "https://sustainable.stanford.edu/campus-action/energy/stanford-energy-system-innovations-sesi/emissions-inventory/scope-3-emissions",
        "https://ghgprotocol.org/scope-3-technical-calculation-guidance",
        "https://news.stanford.edu/wp-content/uploads/2018/11/OurVision-Logo-Red-grey.jpg",
        "https://ourvision.stanford.edu/",
        "https://news.stanford.edu/topic/our-vision/",
        "https://news.stanford.edu/2021/04/20/hard-quantify-emissions-next-frontier-stanford-sustainability-goals/",
        "https://rde.stanford.edu/dining/one-plate-one-planet",
        "https://www.moccollaborative.org/",
        "https://sustainable.stanford.edu/",
        "https://sustainabilityinitiative.stanford.edu/",
        "https://community.stanford.edu/",
        "https://www.amazon.com/b?ie=UTF8&node=21417959011",
        "https://rde.stanford.edu/dining/one-plate-one-planet",
        "https://rde.stanford.edu/dining/one-plate-one-planet",
        "https://rde-stanford-edu.s3.amazonaws.com/RDE_sustainability%20ethos_3_OPOP.pdf",
        "https://transportation.stanford.edu/commute/find-your-sustainable-commute-options",
        "https://lbre.stanford.edu/sites/lbre-production/files/zerowasteguidelines2016.pdf",
        "https://sustainable.stanford.edu/sites/default/files/RWC_WaterPoint-WasteSortingCheatSheet_1.29.pdf",
        "mailto:amyadams@stanford.edu",
        "https://news.stanford.edu/section/university-affairs/",
        "https://news.stanford.edu/topic/our-vision/",
        "https://news.stanford.edu/topic/sustainability/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D40809",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://news.stanford.edu/section/science-technology/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://news.stanford.edu/section/law-policy/",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "/report/subscribe/",
        "/press-releases/",
        "/contact/media-contacts/",
        "/experts/",
        "/contact/",
        "http://ucomm.stanford.edu/facstaff/",
        "http://events.stanford.edu/",
        "https://ucomm.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}