{
    "title": "Students and Postdocs - Research Initiatives and Infrastructure (RII)",
    "body": "\n Skip to main content \n\n\nUniversity of Southern California\n\n\nResearch and Innovation\n\n\n\nPrimary Menu\n\nMenuAn icon that consists of three parallel horizontal lines suggestive of a list.\n\nNews\nEvents\nResearch and Scholarship\nResearch Administration\nFunding\nTraining\nAbout\nMore…Show More Menu \nSearchAn icon of a magnifying glass.\n\n\n\n\n\n\n\n\nSearch for:\n\n\n\nCloseAn icon of a letter X.\n\n\n\n\n\n\n\n\n\nStudents and Postdocs \n\n\n\n\nStudents and Postdocs\n\n\n\n\n\n▶ Postdoctoral Scholars▶ Graduate Students▶ Undergraduate Students▶ High School Students\n\n\nWorking with faculty, USC students at all levels have opportunities to participate in research in labs, the community, the field, and sometimes around the globe. Below you can find opportunities and financial aid to do research as a student.\nTo add or update a program below, please fill out this form.\n\n\n\n\n\n\n\n\nPostdoctoral Scholars\n\nUSC’s Office of Postdoctoral Affairs and individual schools manage postdoctoral scholar programs.\nIn addition to working directly with faculty advisors and mentors, postdoctoral scholars can get involved in USC research centers and institutes:\n\nCenter for Advanced Genocide Research awards doctoral candidates, USC undergraduate and graduate students who use the Visual History Archive or other genocide-related resources at USC for innovative research projects across academic disciplines. Learn more.\nInstitute on Inequalities in Global Health offers several fellowship opportunities for students and postdocs interested in conducting research both in the U.S. and internationally. Learn more.\nUSC Stem Cell invites applications for the Broad Collaborative Challenge Grant for Graduate Students and Postdoctoral Fellows to stimulate new interdisciplinary stem cell research across the USC community and provide a means of enhancing student/postdoc creativity and independence. Learn more.\nWrigley Marine Science Center offers several opportunities for graduate students and postdoctoral researchers. Through fellowships at Catalina Island and on the USC main campus, graduate students and postdocs develop research capabilities, advance fundamental knowledge, and become the next generation of science leaders. Learn more.\nFind more USC research centers and institutes.\n\nDiversity in Research provides examples of existing programs for students and postdocs at USC that support diversity and scholarship in research as a foundation toward future efforts. Learn more.\nCenter for Excellence in Research (CER) organizes workshops for USC researchers. These courses are designed to provide faculty, postdocs and graduate students across all fields of study with specialized skills and knowledge in seeking funding from government, foundation, and corporate organizations as well as a variety of other topics. Learn more.\nCenter for Excellence in Teaching (CET) promotes a vibrant culture of teaching and learning for the university community, for schools, and for faculty. Through a variety of programs and resources for USC faculty and future faculty (graduate fellows/TAs), CET encourages best practices in course design, instruction, and evaluation. Learn more.\nOffice of International Services supports USC’s international students and scholars with information about visas, employment, etc. Learn more.\nWomen in Science and Engineering (WiSE) Program is attracting outstanding postdoctoral researchers to USC and providing them for successful academic careers by providing them excellent opportunities and mentoring. Learn more.\n\nBack to Top\n\n\n\n\n\n\n\n\n\nGraduate Students\n\nUSC’s Graduate School and individual schools manage graduate student programs.\nIn addition to working directly with faculty advisors and mentors, graduate students can get involved in USC research centers and institutes:\n\nBridge Art + Science Alliance (BASA) at the Bridge Institute is a self-governed creation of USC students who are creating connections and catalyzing collaborations between artists and scientists. Learn more.\nCenter for Advanced Genocide Research awards doctoral candidates, USC undergraduate and graduate students who use the Visual History Archive or other genocide-related resources at USC for innovative research projects across academic disciplines. Learn more.\nCenter for Dark Energy Biosphere Investigations (C-DEBI) offers a number of resources and funding for graduate students who are contemplating a career in scientific research. Learn more.\nInstitute on Inequalities in Global Health offers several fellowship opportunities for students and postdocs interested in conducting research both in the U.S. and internationally. Learn more.\nUSC Stem Cell invites applications for the Broad Collaborative Challenge Grant for Graduate Students and Postdoctoral Fellows to stimulate new interdisciplinary stem cell research across the USC community and provide a means of enhancing student/postdoc creativity and independence. Learn more.\nWrigley Institute for Environmental Studies offers several opportunities for graduate students and postdoctoral researchers. Through fellowships at Catalina Island and on the USC main campus, graduate students and postdocs develop research capabilities, advance fundamental knowledge, and become the next generation of science leaders. Learn more.\nFind more USC research centers and institutes.\n\nBlackstone Launchpad pairs students with consultants to help the develop their business ideas. As their ideas mature, students are connected to venture coaches to help them bring their ideas to market. Learn more.\nCenter for Excellence in Research (CER) organizes workshops for USC researchers. These courses are designed to provide faculty, postdocs and graduate students across all fields of study with specialized skills and knowledge in seeking funding from government, foundation, and corporate organizations as well as a variety of other topics. Learn more.\nCenter for Excellence in Teaching (CET) promotes a vibrant culture of teaching and learning for the university community, for schools, and for faculty. Through a variety of programs and resources for USC faculty and future faculty (graduate fellows/TAs), CET encourages best practices in course design, instruction, and evaluation. Learn more.\nDiversity in Research provides examples of existing programs for students and postdocs at USC that support diversity and scholarship in research as a foundation toward future efforts. Learn more.\nLloyd Greif Center for Entrepreneurial Studies offers interdisciplinary minors and a certificate in entrepreneurship for undergraduates, as well as an entrepreneurship concentration for MBA students, a master of science in entrepreneurship and innovation and a graduate certificate in technology commercialization. Learn more.\nSpark SC is a student-run entrepreneurship ecosystem at USC dedicated to building communities, unlocking opportunities, and expanding social impact for current and budding entrepreneurs. Learn more.\nUSC Stevens Student Innovator Showcase provides an opportunity for USC students to present their inventions, startups and prototypes (in all disciplines) to faculty and leaders from the local venture, entrepreneur, and business community. Learn more.\nViterbi Student Innovation is a crucible for innovation for Viterbi students, who learn how to turn their ideas or research into successful business ventures, including educational programs, new venture creation support and networking opportunities. Learn more.\nWomen in Science and Engineering (WiSE) Program is facilitating the recruitment of outstanding postdoctoral researchers to USC by supplementing their financial support packages. Learn more.\n\nBack to Top\n\n\n\n\n\n\n\n\n\nUndergraduate Students\n\nUndergraduate research is a key part of USC’s research ecosystem and USC’s many researchers, labs, center, and institutes actively welcome undergraduate researchers.\nUndergraduate research opportunities in various USC schools:\n\nAnnenberg School for Communication and Journalism\nDornsife College of Letters, Arts and Sciences\nPrice Sol Price School of Public Policy\nViterbi School of Engineering\n\nIn addition to working directly with faculty advisors and mentors, undergraduate students can get involved in USC research centers and institutes:\n\nBridge Art + Science Alliance (BASA) at the Bridge Institute is a self-governed creation of USC students who are creating connections and catalyzing collaborations between artists and scientists. Learn more.\nBridge Undergraduate Science Program (BUGS) at the Bridge Institute is training the next generation of students to surmount disciplinary boundaries as they work to better understand the human body. Learn more.\nCenter for Advanced Genocide Research awards doctoral candidates, USC undergraduate and graduate students who use the Visual History Archive or other genocide-related resources at USC for innovative research projects across academic disciplines. Learn more.\nCenter for Dark Energy Biosphere Investigations (C-DEBI) offers a number of resources and funding for undergraduate students who are contemplating a career in scientific research. Learn more.\nChildren’s Hospital Los Angeles Medical Preceptorship Program is for pre-medical students interested in learning more about the field of Pediatric Medicine. Students will shadow physicians at CHLA after commencement. Learn more.\nDiabetes and Obesity Research Institute (DORI) funds a summer research experience providing outstanding underrepresented students in science and medicine an opportunity to gain meaningful exposure to the exceptional research and clinical programs at the Keck School of Medicine (KSOM) of USC. Learn more.\nInstitute on Inequalities in Global Health offers several fellowship opportunities for students and postdocs interested in conducting research both in the U.S. and internationally. Learn more.\nKaiser Permanente Medical Preceptorship Program is for pre-medical students interested in learning more about the field of General Medicine. Students will shadow physicians in five different Kaiser Permanente departments during spring break. Learn more.\nLloyd Greif Center for Entrepreneurial Studies offers interdisciplinary minors and a certificate in entrepreneurship for undergraduates, as well as an entrepreneurship concentration for MBA students, a master of science in entrepreneurship and innovation and a graduate certificate in technology commercialization. Learn more.\nSouthern California Earthquake Center seeks to enhance the competency and diversity of the STEM workforce by engaging students and early career scientists in the SCEC Community and offers a number of undergraduate opportunities. Learn more.\nWrigley Institute for Environmental Studies offers several programs and internships for undergraduate students including the Research Experiences for Undergraduates (REU). Learn more.\nFind more USC research centers and institutes.\n\nBlackstone Launchpad pairs students with consultants to help the develop their business ideas. As their ideas mature, students are connected to venture coaches to help them bring their ideas to market. Learn more.\nDiscovery Scholars is intended to recognize and celebrate USC undergraduates who have excelled academically while making a meaningful contribution to their field of study through exceptional new scholarship or artistic work. Learn more.\nDiversity in Research provides examples of existing programs for students and postdocs at USC that support diversity and scholarship in research as a foundation toward future efforts. Learn more.\nMellon Mays Undergraduate Fellowship (MMUF) Program is a partnership between Dornsife and the Office of the Provost to identify, support, and mentor highly qualified underrepresented undergraduate students and other students interested in diversifying faculties in higher education, and encourage them to pursue a Ph.D. in fields where diversity has not been historically present. Learn more.\nProvost’s Undergraduate Research Fellowships provides a limited number of fellowships for undergraduate research each academic year in the fall, spring and summer terms. Learn more.\nOffice of Undergraduate Programs (UGP) offers a limited number of travel grants each year to undergraduate students presenting at a professional conference in their academic field of study. Learn more.\nResearch Gateway Scholars Program is a student academic services initiative sponsored by the Office of Undergraduate Programs to provide educational and career advising, academic skills building workshops/seminars, research training and other research-related opportunities. Learn more.\nSOAR program provides funding to Dornsife undergraduates for participation as a research assistant in a faculty member’s project during the fall and spring semesters of the academic year. For students interested in summer undergraduate research funding, please visit the SURF/SHURE page. Learn more.  \nSpark SC is a student-run entrepreneurship ecosystem at USC dedicated to building communities, unlocking opportunities, and expanding social impact for current and budding entrepreneurs. Learn more.\nStevens Student Innovator Showcase provides an opportunity for USC students to present their inventions, startups and prototypes (in all disciplines) to faculty and leaders from the local venture, entrepreneur, and business community. Learn more.\nUndergraduate Student Government Academic Research Fund provides support for undergraduate students who conduct research projects, attend academic conferences, and pursue other research-oriented academic interests. Learn more.\nUndergraduate Symposium provides students with the unique opportunity to exhibit and share examples of their significant research and creativity with the university community. Learn more.\nViterbi Student Innovation is a crucible for innovation for Viterbi students, who learn how to turn their ideas or research into successful business ventures, including educational programs, new venture creation support and networking opportunities. Learn more.\nWomen in Science and Engineering (WiSE) Program is providing upper level undergraduate students with first-hand experience in laboratory based research, and to thereby encourage promising students to pursue graduate studies in the sciences and/or engineering. Learn more.\nFederal Work-Study Awards are eligible to be used for undergraduate research positions.\n\nBack to Top\n\n\n\n\n\n\n\n\n\nHigh School Students\n\nIn addition to instruction-based programs for high-school students, USC features a variety of research opportunities for high school students at USC research centers and institutes:\n\nBridge Undergraduate Science Program (BUGS-Jr) at the Bridge Institute is training the next generation of students to surmount disciplinary boundaries as they work to better understand the human body. Learn more.\nCenter for Dark Energy Biosphere Investigations (C-DEBI) offers a weeklong Summer Science Camp providing high school students from underrepresented backgrounds the opportunity to visit the USC Wrigley Marine Science Center on Catalina Island. Learn more.\n\nSummer High School Intensive in Next-Generation Engineering (SHINE) is a unique seven-week opportunity to participate in hands-on engineering laboratory and/or computational research focused on real-world problems at one of the top-ranked engineering schools in the nation. Learn more.\nUSC STAR Program brings together USC scientists and engineers with Francisco Bravo Medical Magnet High School students in Los Angeles. STAR students learn about STEM in world class laboratories that advances scientific breakthroughs at the bench and around the globe. Learn more.\nUSC Young Researchers Program is a six-week program that matches talented and motivated Los Angeles-area high school rising seniors with USC research groups for a summer of research under the supervision of faculty and graduate students. Learn more.\n\nBack to Top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNews\nMonthly Update – April 2023\nUSC Ranked in NAI’s Top 100 Worldwide University Utility Patent Holders\nAndrew T. Guzman Named USC Provost and Senior Vice President for Academic Affairs\nMonthly Update – March 2023\nDental Day 2023 Winners Announced by USC Stevens Center\n\nMore News\nEvents  Designing and Writing a Successful NSF Broader Impacts Friday, May 19, 2023  10:00 am PDT – 12:00 pm PDT   Introduction and Strategies for ARPA-H Thursday, May 25, 2023  10:00 am PDT – 12:00 pm PDT  \n\nMore Events\nQuick LinksAbout\nContact Us\nNews\nResearch and Scholarship\nResearch Administration\nFunding\nLimited Submissions\nCOVID-19 Research Continuity\nTotal Access for Research Administration\nCenters and Institutes\nShared Resources\nStudents and Postdocs\nTraining\nEvents\n \nUniversity of Southern CaliforniaContent managed by USC Research and Innovation TwitterTwitterThe logo for the social media platform Twitter.\nLinkedInLinkedInThe logo for the social media platform LinkedIn.\nSlackLinkAn icon of a link in a chain.\nYouTubeYouTubeThe logo for video sharing platform YouTube.\n \nWe're happy to announce new grant programs supporting a diverse range of research areas, scholarship, and artistic and cultural expression! Click to learn more.\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "http://www.usc.edu",
        "https://research.usc.edu/",
        "https://research.usc.edu/news/",
        "https://research.usc.edu/events/",
        "https://research.usc.edu/research-and-scholarship/",
        "https://research.usc.edu/research-administration/",
        "https://research.usc.edu/funding/",
        "https://research.usc.edu/training/",
        "https://research.usc.edu/about/",
        "#postdocs",
        "#grad",
        "#undergrad",
        "#highschool",
        "#highschool",
        "https://forms.gle/uruwsEBqKEBtdV7t9",
        "https://postdocs.usc.edu/",
        "https://dornsife.usc.edu/cagr/fellowships",
        "https://globalhealth.usc.edu/resources/opportunities/",
        "https://stemcell.keck.usc.edu/2023-2024-broad-collaborative-challenge-grant/",
        "https://dornsife.usc.edu/wrigley/undergraduate/",
        "https://research.usc.edu/centers/",
        "https://research.usc.edu/diversity/",
        "http://orif.usc.edu/cer",
        "http://cet.usc.edu/",
        "https://ois.usc.edu/",
        "https://wise.usc.edu/programs/grants-and-awards/postdocs-and-phd/",
        "#top",
        "https://graduateschool.usc.edu/",
        "https://dornsife.usc.edu/bridge-institute/bridge-art-science-alliance-basa/",
        "https://dornsife.usc.edu/cagr/fellowships",
        "https://www.darkenergybiosphere.org/education-diversity/for-graduates-and-postdocs/",
        "https://globalhealth.usc.edu/resources/opportunities/",
        "https://stemcell.keck.usc.edu/2023-2024-broad-collaborative-challenge-grant/",
        "https://dornsife.usc.edu/wrigley/graduate/",
        "https://research.usc.edu/centers/",
        "https://www.marshall.usc.edu/departments/lloyd-greif-center-entrepreneurial-studies/programs/blackstone-launchpad",
        "http://orif.usc.edu/cer",
        "http://cet.usc.edu/",
        "https://research.usc.edu/diversity/",
        "https://www.marshall.usc.edu/departments/lloyd-greif-center-entrepreneurial-studies",
        "http://sparksc.org/",
        "https://stevens.usc.edu/events/student-innovator-showcase/",
        "https://viterbiinnovation.usc.edu/community/usc-students/",
        "https://wise.usc.edu/programs/grants-and-awards/postdocs-and-phd/",
        "#top",
        "https://undergrad.usc.edu/experience/research/",
        "https://annenberg.usc.edu/current-students/resources/research-opportunities",
        "https://dornsife.usc.edu/undergraduate-research-opportunities/",
        "https://priceschool.usc.edu/programs/undergraduate/research/",
        "http://viterbiundergrad.usc.edu/research/",
        "https://dornsife.usc.edu/bridge-institute/bridge-art-science-alliance-basa/",
        "https://dornsife.usc.edu/bridge-institute/bugs/",
        "https://dornsife.usc.edu/cagr/fellowships",
        "https://www.darkenergybiosphere.org/education-diversity/for-undergraduates/",
        "https://undergrad.usc.edu/experience/research/chlamedical",
        "https://usc-dori.org/education-enrichment/",
        "https://globalhealth.usc.edu/resources/opportunities/",
        "https://undergrad.usc.edu/experience/research/kaisermedical",
        "https://www.marshall.usc.edu/departments/lloyd-greif-center-entrepreneurial-studies",
        "https://www.scec.org/internships",
        "https://dornsife.usc.edu/wrigley/undergraduate/",
        "https://research.usc.edu/centers/",
        "https://www.marshall.usc.edu/departments/lloyd-greif-center-entrepreneurial-studies/programs/blackstone-launchpad",
        "https://ahf.usc.edu/commencement-honors/scholar-distinctions/discovery/",
        "https://research.usc.edu/diversity",
        "https://dornsife.usc.edu/mmuf-programs/",
        "https://undergrad.usc.edu/experience/research/undergrad_research/",
        "https://undergrad.usc.edu/experience/research/travelgrants/",
        "https://gatewayscholars.usc.edu/",
        "https://dornsife.usc.edu/soar/",
        "http://sparksc.org/",
        "https://stevens.usc.edu/events/student-innovator-showcase/",
        "https://usg.usc.edu/branches/funding/",
        "https://ahf.usc.edu/programs/symposium/",
        "https://viterbiinnovation.usc.edu/community/usc-students/",
        "https://wise.usc.edu/programs/grants-and-awards/undergraduate-students/undergraduate-research-experience/",
        "#top",
        "https://summerprograms.usc.edu/",
        "https://dornsife.usc.edu/bridge-institute/bugs/",
        "https://www.darkenergybiosphere.org/education-diversity/for-high-school-students/",
        "https://viterbik12.usc.edu/shine/",
        "http://www.uscstar.org/",
        "https://www.youngresearchers.usc.edu/",
        "#top",
        "https://research.usc.edu/news/2023/05/monthly-update-april-2023/",
        "https://research.usc.edu/news/2023/04/usc-ranked-in-nais-top-100-worldwide-university-utility-patent-holders/",
        "https://research.usc.edu/news/2023/04/announcing-uscs-new-provost/",
        "https://research.usc.edu/news/2023/03/monthly-update-march-2023/",
        "https://research.usc.edu/news/2023/03/dental-day-2023-winners-announced-by-usc-stevens-center/",
        "https://research.usc.edu/news/",
        "https://calendar.usc.edu/event/designing_and_writing_a_successful_nsf_broader_impacts_5148",
        "https://calendar.usc.edu/event/introduction_and_strategies_for_arpa-h",
        "https://research.usc.edu/events/",
        "https://research.usc.edu/about/",
        "https://research.usc.edu/about/leadership/",
        "https://research.usc.edu/news/",
        "https://research.usc.edu/research-and-scholarship/",
        "https://research.usc.edu/research-administration/",
        "https://research.usc.edu/funding/",
        "https://orif.usc.edu/limited-submissions/",
        "https://research.usc.edu/coronavirus/",
        "https://research.usc.edu/research-administration/usc-research-administration-system/",
        "https://research.usc.edu/research-and-scholarship/centers/",
        "https://orif.usc.edu/shared-resources/",
        "https://research.usc.edu/research-and-scholarship/students/",
        "https://research.usc.edu/training/",
        "https://research.usc.edu/events/",
        "https://twitter.com/ResearchAtUSC",
        "https://www.linkedin.com/company/researchatusc",
        "https://join.slack.com/t/researchatusc/shared_invite/zt-dcn18aif-9NXRJSDZrk1U~uuG6RQwFg",
        "https://youtube.com/researchatusc",
        "https://research.usc.edu/new-funding-opportunities/"
    ]
}