{
    "title": "Talking With Valet’s Ceo Kimberly Lipari About The Changing Value Of Websites To Organizations-Post Status Draft • Post Status",
    "body": "\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nAboutExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\nAccount\n Login\n\n\n\n\nSearch\n\n\n\n\n\nJoin\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nHome / Post Status Podcasts / Draft / Talking With Valet’s Ceo Kimberly Lipari About The Changing Value Of Websites To Organizations-Post Status Draft\nByCory Miller \nPosted onApril 27, 2023May 1, 2023 \n\nUpdated onMay 1, 2023 \n\n\n\nBusiness Draft Planet Post Status Podcasts WP Products \n\n\n\nIn this episode, Kimberly Lipari and Cory Miller discuss the ups and downs of building and selling WordPress companies. They share their experiences, including the challenges they faced and lessons learned. They also give advice to entrepreneurs and business owners looking to grow and sell their own WordPress companies. \n\nEstimated Reading Time:  30 minutes\n\n\nTranscript ↓\nKim Lipari, owner and CEO of Valet, talks with Cory Miller about their insights and experiences on entrepreneurship, including how to handle challenges, the importance of building relationships, and the role of vulnerability in leadership. They offer advice on building a successful WordPress business and emphasize the need for continuous learning and personal growth. Overall, this episode provides valuable insights and advice for anyone interested in entrepreneurship and building a successful WordPress-based business.\nTop Takeaways:\n\nOutsourcing Infrastructure. WordPress hosting companies can benefit from outsourcing their infrastructure to specialized providers such as WP Cloud. This can free up their customer support team from dealing with infrastructure-related issues and enable them to focus on providing better customer service and value-added services.\nIncrease Customer Satisfaction. By democratizing publishing and providing a superior WordPress experience, hosting companies can reduce churn and retain customers who may otherwise switch to other platforms if their WordPress experience is subpar.\nSet Up for Speed. While many factors can impact website speed, some of the most important ones include optimizing images, using a content delivery network (CDN), and minimizing the use of plugins. By focusing on these areas, WordPress agencies can help their clients improve their website speed and ultimately provide a better user experience for their visitors.\n\n\n\n\n\n\n🙏 Sponsor: Pagely\nTop-Tier Managed WordPress hosting solutions for Enterprise, the Public Sector, and Media companies. We invented Managed WordPress and we never stopped raising the bar. Expect Extraordinary\n\n\n\n\n\n🔗 Mentioned in the show:\n\nValet\nNathan Wrigley\nBeaver Builder\nPagely\nWP Engine\nGoDaddy\nFlywheel\nMedia Temple\nKinsta\nLiquid Web\nPippin Williamson\nRestrict Content Pro\nAffiliateWP\nSandhills Development\nEasy Digital Downloads\nGravity Forms\niThemes\nLiquid Web\nCarl Alexander\nLindsay Halsey\nNathan Ingram\nJason Resnick\nMatt Medeiros\nHallway Chats \nTrello\nSlack\nZoom\nHubSpot\nInfusionsoft\nActiveCampaign\nSalesforce\nAgileCRM\n\n🐦 You can follow Post Status and our guests on Twitter:\n\nKimberly Lipari (Owner and CEO of Valet)\nCory Miller (CEO, Post Status)\nOlivia Bisset (Intern, Post Status)\n\nThe Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧\nTranscript\nCory Miller: [00:00:00] hey everybody. Welcome back to Post Status Draft. This is part of our agency series, and I’m talking to a longtime friend and an awesome agency owner in the space, Kimberly Lepar of Valet Fame. \u2028\nWe’re gonna be talking about, um, The role in the changing value of websites to organizations. Um, Vale’s been around so long and has so much experience and just diving into that with Kimberly is gonna be really, really exciting for me because updating her knowledge for how websites and their role, uh, in the world and businesses and organizations, she’s got a front seat view to that with her team, what they do for their clients. \u2028\nAnd we’re gonna talk about, um, some of those elements that, um, an organization should. Outsource stick to their core competency and outsource. But before we get all of that, we’re gonna have a fun conversation talking about where websites sit today in the market, on the internet, their value and role, and no better person to talk about that than Kimberly. \u2028\nSo Kimberly, would you mind sharing a little bit about [00:01:00] yourself and what you do at ballet?  \u2028\nKimberly Lipari: Yeah, absolutely. First of all, thanks for having me. It’s always a pleasure. I . Love hanging out and having conversations like this. I think they’re so important. Um, and I am the owner of valet.io. We offer comprehensive end-to-end website management services for businesses that wanna have a strong brand presence, um, want to make sure they’re communicating themselves well online and need a team to support them so that they can focus on the things that they do best every day. \u2028\nCory Miller: Gosh, you’re awesome. I, I’m gonna come back to the end to end because I think that’s one of the compelling parts of this conversation too. All that you do health. And then having a, a firm, an agency, a partner really that can do so much for the website. Um, but Okay, let’s dive in. So we’ve been talking about this for a couple of months now, but I saw you posted on LinkedIn and I’ll put those in the show notes. \u2028\nThat post, I think it was so timely and so [00:02:00] good. I’ve been kind of updating my view about all this. Mm-hmm. And you know, in the old days, Websites for these, like, and I find myself still referring to him like they’re, they’re a brochure at the base. Mm-hmm. A 24 7, 365 days, a, a year where your clients can go in and kind of check out what you do, but your post really illuminated something that’s all evolved and changed as the world has changed and business. \u2028\nAnd, um, what are you seeing there? Um, with the changing value and importance and focus on websites for business and organizations that you serve.  \u2028\nKimberly Lipari: Well, I think namely the, the chief change is that Gone is the, uh, my business at webmaster email address, uh, that used to be, uh, the sole, uh, provider and contact point for what websites were for a lot of companies. \u2028\nUh, they were kind of these closed off boxes where only, you know, two people could edit the HTML and, [00:03:00] and change things up. So, um, from that, And you say the olden days, which it feels like that, but I think maybe even just in the past, I don’t know, probably five, five years or so, it, it’s escalated very quickly to become, uh, that the website is important to the CEO, uh, for one reason or another, probably more for. \u2028\nUm, brand identity so that, you know, how are we putting our best space forward, right? These, uh, very broad, uh, strokes of what the business means. Uh, it’s important to marketing, uh, to make sure that they are communicating the services effectively, that there’s good copy, good, uh, interaction, uh, social integrations, right? \u2028\nIt’s also important to, uh, sales managers and even, um, other line level employees. Um, and other parts of the business to be able to share what they’re doing or provide. PDFs, white papers, all kinds of registrations. I mean, all those [00:04:00] different things. So it’s become a very, uh, Uh, crowdsourced, um, important piece of, of a business. \u2028\nAnd so that’s changed a lot. It’s no longer one person kind of holding the keys that can understand. It’s now really commonplace for everybody in a business to, to think of the website in a different way with a different sort of use for the role that they play.  \u2028\nCory Miller: One of the things that strikes me from what you’re saying in our discussions in the past, particularly with your, your clients and what you see is this, when you said webmaster, it’s this thought of a supplemental thing, like an a, almost an afterthought that websites were once mm-hmm. \u2028\nThought of now to be in very integral to everything the business and organization does. Um, I remember talking with some of your, About some of your clients that you all work with and, and you, you had an interesting way to say it. You’re like, maybe they weren’t straight on e-commerce, so at Ithe or post status for [00:05:00] instance. \u2028\nUm, you know, that was, that was it like, yeah. If, if the website’s down we’re not making money, you know? Mm-hmm. But you’re seeing a multifaceted, uh, approach now where it’s not just an afterthought and supplemental, it’s really key to driving the mission and goals of the organization. And I thought that was really interesting and awesome for WordPress, by the way. \u2028\nMm-hmm. And the internet that. Seeing that value change, I wonder if some of that got spur on with pandemic. You know, I’ve heard a lot of, let’s say a yo yoga studio or those in-person physical location, bricks and mortar businesses go, yeah, what do we do now? Well, I loved if there’s positives that came outta covid. \u2028\nIt was the fact that it pushed people to go. That’s not our only means of business. But can you talk a little bit and share what you see from client perspective about the role of websites in these organizations?  \u2028\nKimberly Lipari: Absolutely. Absolutely. I think I have two, um, two very specific examples. I think, uh, [00:06:00] from very different sides of the coin, um, that kind of point out some of the changes that we’re seeing. \u2028\nUm, working on a project with a client who, uh, is trying to consolidate, um, a few different brands, uh, under an umbrella into one, um, during the meetings throughout this project. We can hear the different. Stakeholders in the project, throughout the company, um, really communicating what’s important to them. \u2028\nAnd this kind of goes back to what each person in the web, in the business thinks the website should do. Right. Um, you know, the CEO is is much more concerned about. The, the layout, how things are presented. Uh, you have marketing and other, um, sub-departments of, of that worried about, well, it’s, is it flashy enough? \u2028\nYou know, where’s the, where’s the pizazz? And then you have, um, someone else who. Has submitted copy and then it gets pulled a week later because no one [00:07:00] within the confines of the project had really taken the time to dig deep into what those words were. So that actually became kind of an afterthought, but then it bumped up in priority. \u2028\nSo you have all of these different things that should matter. But there’s no, uh, kind of cohesive brain on, uh mm-hmm. When and where they matter, right. Uh, because this kind of traditional business roles, right? So I think even, even business itself is kind of catching up to how it feels about what its website is and what it does. \u2028\nUm, alternatively, um, outside of the web presence, businesses that traditionally take place, With more, uh, one-on-one, um, interactions. I have, um, a, a dear friend who I spoke with a couple weeks ago who works in oil field sales and they typically do their, their sales and marketing person to person, right? \u2028\nIt’s, let’s, let’s go on a fishing charter, let’s go have lunch and all these things. And I. They are, they’re not leveraging their website well enough to actually say, Hey, we now do these four [00:08:00] other things, uh, that we haven’t, you know, we only tell people in, in person to person meetings, uh, and the CEO says, you know, oh, well, yeah, we have one. \u2028\nAnd that’s fine enough. But is is person to person, um, enough nowadays, are they gonna go to lunch with you and then go check out your website? Right? Do you offer a brochure of services, um, within that and explain what it is that you do? So, um, I think it’s, it’s such a widely used normal tool now to just go to someone’s url, um, that from, from online focused. \u2028\nPrimary businesses and person to person, um, based, you know, formally traditional, right? Brick and mortar or service, service style companies, even in large industries, you know, million dollar year industries like oilfield. Um, it’s, it’s changing. It has to. It’s, it’s, yeah. I think I lost the thread there a little, but  \u2028\nCory Miller: No. \u2028\nAnd why not? Why not [00:09:00] utilize this amazing technology, for instance? So, you know, you can use WordPress to build a website, but then the advent of Google and the search engines that push traffic, people are looking for destinations to find problem, you know, answers to their. Challenges. And so the advent of marketing and understanding with SEO and paid traffic and things like that, back to a site where you could convert it, measure it. \u2028\nKimberly Lipari: Yeah. Even, yeah, even on the back end. And that was one of the things that I talked about, uh, with my friend. They don’t have a A A CRM of, of much of any kind. It just kind of lives in these guys’ heads that go out to these travel routes. You know, we always live on this hit by a bus scenario mm-hmm. Of what happens if I get hit by a bus tomorrow? \u2028\nWhat is my team, you know, gonna do what have, what have I laid for information and documentation and. You know, formally, uh, businesses that have been person to person are, are missing an opportunity to kind of move into that digital age of, of finding [00:10:00] clients and putting them on a journey or, um, even, even if it’s just a, a consideration of the journey you wanna put people on outside of the web experience. \u2028\nRight? It’s all, it’s a, it’s a good. Um, what am I thinking of? Mind mapping? Mm-hmm. Um, I guess of, of how you want all that to work. So from, from the backend, from the actual interfacing with the customer to the front end to how the customer sees you. There’s a lot of that in between, but it’s, it’s now all being laid on the, on the website. \u2028\nThis is the website’s job and that’s, there’s, that’s a lot. There’s a lot going on.  \u2028\nCory Miller: Well, you mentioned two, two kind of groups. It’s either marketing managers that I assume could have different title, but somebody that manages the marketing, seeing the value of websites for marketing their business. Uh, and then you also mentioned CEOs. \u2028\nSo that to me just instantly says, Importance, like recognizing the importance that a website can do all these functions. Add [00:11:00] to not just supplement, supplement, but be very complimentary and strengthen cells. You know, if you’re in B2B cells, I have a friend, I think we, you and I have talked about as a manufacturing company, sells all over the world. \u2028\nWell, the search results for those are probably very small, but they’re long tail and very easily capturable. You know, like, yep. Um, they’re, somebody’s going online to find that part or that. Particular, you spell those compressors, but you know, and then so like you could grow your bottom line or your top line really easily, just with some simple things with a WordPress website. \u2028\nAbsolutely. And then like you said, for those b2b, it’s, there’s so many things. Support is another bucket of things. I think of a website is like, I can’t remember who I’m supposed to call for this. Or I need to ask a question, go to the website right there. Mm-hmm.  \u2028\nKimberly Lipari: Absolutely.  \u2028\nCory Miller: So I think that’s good. Very good. \u2028\nIn terms of the industry, in terms of the [00:12:00] internet, of course, we love the open web post status and you did too of la um, through WordPress. So that’s, that’s good seeing that value, knowing it has such utility for the overall growth and seeing the mm-hmm. Importance of that. And then, um, but this is interesting. \u2028\nSo are you seeing, uh, from the role perspective, they’ve now seen it. Now you have a different people coming in with different. Needs and wants for their website. And is there someone unifying that from the client perspective or is it a lot of different stakeholders coming, going, well, we need this. Okay. \u2028\nIs there somebody synthesizing all of that?  \u2028\nKimberly Lipari: We play that role where we can, uh, where, where we have been allowed to. I think we st oftentimes we’ll get very lucky and we’ll have a C-level, um, stakeholder involved that can do, uh, the, I think of as like a Venn diagram where you have linear thinkers and strategic [00:13:00] thinkers. \u2028\nAnd that overlapping section is someone who can live in both worlds or at least empathize very well, uh, with one or the other. So, Um, we play that role as often as we can, uh, and we try to move people into a space where they realize that is possible. Uh, two things can be true. Uh, you can want to have a very grand strategic, um, uh, presence, you know, with, with wonderful colors and layout and good copy, but at the same time, There’s some technical decisions that need to be made. \u2028\nUm, you know, and some research that needs to be done kind of in between. So overlapping, uh, you’ll see, um, there are specific roles. Marketing managers I find are kind of expanding into that. Um, and they’re sourcing companies like us to handle the technical depth, um, and to help us translate that, that gray area, um, where you have strategy. \u2028\nKind of overlapping with this linear direction of where people wanna go. [00:14:00]  \u2028\nCory Miller: So oftentimes it’s the CEO marketing manager type that is your point person. But then are there other teams or are they funneling through that person, or are they coming straight to valet, for instance, on those?  \u2028\nKimberly Lipari: Oh, they’ll come straight to us. \u2028\nThey’ll come straight to us. We work with a lot of different people within, uh, within the. The org chart. Um, but really the kind of, you have to be in a position. Where you are looking at the forest and the trees. Mm-hmm. Um, to be able to kind of drive direction or, um, get the most value out of the advice in the consultation, you know, that, that an agency like our can offer. \u2028\nBecause we can’t come across too, um, too bossy, right? You’re using the wrong thing. Why would you tell me that? I researched and it’s fine. No, I’m not saying it because you’re wrong. I’m saying because, you know, we, we have experience. We can give you a better option. So, um, you know, it’s, and we can see the [00:15:00] forest, you know, we know what else is going on. \u2028\nI know you really wanna use this one tool, but you have this other one over here that you’re not aware of that someone else installed. Um, you know, and those won’t work together. So, you know, it’s, it’s. We work really well with roles that kind of have essentially the same purview in their job that we have in ours as tech advisors. \u2028\nCory Miller: Yeah. Uh, it’s, it’s so interesting cuz you mentioned kind of in the, first of all this, the role of the webmaster. That’s, and you know, in the early days it was maybe find somebody that can cobble this stuff together. Uh, but that changing role where they see the importance and then go, but they still need someone with expertise that can advise them, should I, I can go left or right, which way should I go? \u2028\nYeah. And it seems like which the role you’re, you all are providing too is offer, there’s a couple of paths here and maybe steer them to one particular path.  \u2028\nKimberly Lipari: Yeah. Yeah, that’s a lot of what it is, is what’s the best path for you? [00:16:00] You know, it, you may be, uh, if there’s these three or four very important things, which one would benefit you the most? \u2028\nYou know, let’s go there first and then we can go back to the three or four important things. That’s, there’s no static list of what’s best. Mm-hmm. I mean, there’s a static list of, um, what’s good. But what’s best? I mean, that depends. What do you, what do you need? Are you interested in growth? Are you interested in converting, are you interested in education? \u2028\nYou know, those are all very different, very different things.  \u2028\nCory Miller: And you said too, like depth. So there’s someone here at the organization has these strategic goals, things they want to do, um, but the depth part, and that’s where, you know, Online work is pretty deep. It’s so nuanced. There’s so much stuff going on. \u2028\nRight. In your post, you mentioned, you know, performing well in the search engine, the SEARCHs, the search engine results, um, speed. Mm-hmm. All those kind of things they probably don’t think about. And the work I’ve done or helped [00:17:00] with, um, Lindsey’s, my wife’s Lindsey that you know real well. Um, what’s her marketing agency is love her. \u2028\nThat’s about it. They understand strategic strategy, that what they need to do and what they need to get accomplished, but don’t always have that level of depth in-house. Mm-hmm. And we were talking before we got started on the recording here, about kind of the changing roles of like, the importance of having vendors out here. \u2028\nMm-hmm. That. You know, to hire someone with this type of expertise is probably gonna be pretty hard. Uh, at almost any level. There’s obviously enterprise, you know, companies that have whole teams that do web stuff. But still probably, I think, and I’ve seen from our membership at Post Status still outsource a lot of the depth we’re talking about because yes, it’s hard to hire a WordPress professional that knows all these things and run this gamut. \u2028\nMm-hmm. And we were talking specifically about this role. Um, my view is, [00:18:00] When I was helping a client a couple years ago, uh, they’d often referred to me, I was doing consulting with him as a vendor, and I’d go, but. But I feel more, I care about the mission and goals of what you’re trying to get accomplished. \u2028\nMm-hmm. And I don’t think of myself as just someone that comes in, slots in, doesn’t work, comes back out leaves. Yep. Uh, I might have multiple clients and stuff, and I think that has to shift a little bit because of the nature of the work that we’re doing, that you can’t maybe just hire a professional that has all that. \u2028\nI need 10 of those with all the verticals you could think. Right. And so we’re kind of talking about that shift and that’s where that see Vale, you’re truly not a vendor, you’re partner mm-hmm. In what you’re doing with them. Like you’re saying, stick to what you do best. We’ll take this part, these parts that you don’t do best and go deep in those. \u2028\nAnd, and I’m curious your thoughts about all that. You mentioned fractional, so I, I’m curious what your perspective is of this shift and what you see in the market.  \u2028\nKimberly Lipari: Oh. [00:19:00] Um, I think it’s, it’s similar to the, the culture shift, uh, within companies where they want everybody to have culture, but they don’t necessarily hire based on culture, you know? \u2028\nUm, I think, um, building, um, building a team, people talk about fractionals now, right? Oh, fractional cmo, fractional, CFO, and. It, it implies that something’s broken. I don’t know, just the language, you know, like fractional. I don’t need you all the time. I just need you to solve these specific problems. But that’s inherently broken in and of itself in that, um, you’re not incorporating someone into the big picture. \u2028\nI think of it sort of, uh, my kiddo play soccer, right? So you have these forward positions, these midfield positions, and these, these defensive positions. And not everybody plays at the same time, but they’re all very important to have on the field. I mean, I wouldn’t call one a fractional forward, right? I wouldn’t call one a fractional defender. \u2028\nThey [00:20:00] know their positions deeply and they operate with the other team members in a way that. Is holistic. It makes sense. You know, they, they work together and they do their job when the time comes. So instead of fractional, um, you know, it, it’s like a world of fractionals. Now everybody’s fractional. Um, but if, if we could just reposition the way that vendor relationship, that vendor ideal. \u2028\nThe, the, oh, you’re a contractor. No, you, you, if you hire for, for depth in a specific subject matter, then you have a defender standing on the back line. Waiting for their time to, to come in. They know their job. They know their, and you don’t have to sit up there as forward worrying about will this person be able to handle, handle that role in that, in that attack that’s coming on. \u2028\nRight. So it’s a mindset shift, I think, for the businesses, and I think it’s a struggle because. I mean, what? It’s, it’s either part-time work or full-time work, right? All of our employment and labor laws are, are based around [00:21:00] 32 hours or 40 hours a week. You have to give people a certain amount of breaks after if they’ve done so much work. \u2028\nYou know, this is how the world was built. This is how our, our knowing and understanding of working is. So, uh, I think it’s, it’s probably a little more high level than thinking about this idea of fractional and having someone come in and tell me what I need to do and then let me work on it. Um, you know, you, you bring someone in to give you good advice and then map out the action steps. \u2028\nAnd if you’re capable and you have a team member to do that, then fine. But don’t, don’t think I can’t, I don’t need a full-time, um, you know, financial officer e who does, you know, I mean, unless you have a huge company, no one’s sitting there flipping through spreadsheets all day long, making sure that your numbers are in the right column in the spreadsheets, right? \u2028\nThey, that that financial officer often acts in other capacities. So what’s the difference, right? If you have a vendor that just doesn’t do that all the time for you, you pay them whatever that time is worth and valuable to you to do what [00:22:00] you need them to do effectively. And that’s okay. It doesn’t need to be defined as anything other than teamwork. \u2028\nUh, but that’s a hard concept to wrap your mind around when you’re in a traditional business setting. Does that make sense?  \u2028\nCory Miller: Oh, it does. It illuminated so much for me with that. I think it’s an analogy, but, um, if, you know businesses are in a game, Organizations are in a game to do something, make money, whatever those. \u2028\nYou know, from your nonprofits too, is make impact too. Um, but you think about that if the game is business or like soccer. Right. I loved when you said that you st you need certain players on the field to accomplish that and I love that how you said like a defender back here might not. Be the one that everybody thinks about. \u2028\nYou know, the one that’s gonna score the goal, but you need someone with the goal going so the ball goes over the heads and you’re someone there to do this role. And I, I love that. Cause I think it really paints it very beautifully. You’re trying to do that shift you talked [00:23:00] about too. You need to fill the whole team. \u2028\nMm-hmm. And you need certain players on the team to get that job done. And I love that, like valet in this instance might have four players. On the team. Mm-hmm. Um, that, that quote aren’t full-time employees, obviously, but you still need those, you need a goalie back here. You need, uh, those degrees, \u2028\nKimberly Lipari: right. We can still supply you with technical depth. \u2028\nWe can supply you with design depth. We can supply you with content depth. You know, it, that, that’s the, that’s the benefit of the different players on the field, whereas you’re not hiring one person to do SEO 24 hours. You know, a day, uh, or eight hours a day, 40 hours a week rather for going with the working analogy. \u2028\nBut the, the idea is you, it’s, it’s not any less important to have. To have that available.  \u2028\nCory Miller: Well, if you use this, I might just kind of continue to, to, to expand on this cause I love it.  \u2028\nKimberly Lipari: Should we say football? Uh, do we have an international audience, should we say?  \u2028\nCory Miller: [00:24:00] I, I think soccer’s pretty international so we can stay there. \u2028\nSoccer, I just don’t know as much about soccer, but I’ll say like, If you think about there as offensive players, and I’m not sure what they’re called in soccer, but they’re the ones that need to go score the, score the goals, hit the hit the goal, hit the mission that you’re trying to do. The way I think about that before this conversation was stay in your core genius. \u2028\nWhat’s the thing that people come to you? Because that’s the word, the magic happens, right? Those are the people you probably might need to continue to retain as a full-time employee, as part of your team.  \u2028\nKimberly Lipari: Well, that’s your marketing director, right? That’s your person. That’s the attacker going up, scoring the goals they know. \u2028\nThey’re supported. The ball has been passed up to them. A beautiful cross from, you know, your tech team or your, your content writing team, whatever supports your mm-hmm. Your major goals that you got going on. And then they, they dive right in and. Kick one in the corner of the net because they know, they know the, the, the consumer base. \u2028\nThey know your customers, they know your keywords. They know what your strategy should be. They know where you wanna go next, you know, and then someone else helps them implement [00:25:00] that. That’s the most powerful. It’s not, it’s no longer a, a game of, uh, how many balls can I juggle, and how many skills can I put on my resume? \u2028\nIt’s. It’s how, how much time have I spent on this one skill has become, um, I, I don’t know if it’s valued as much as it should be. It’s something that businesses value in vendors, which I find very interesting. But they don’t necessarily value in, in immediate hires, I think some, as much as they should. \u2028\nMm-hmm. You know, vendors. How, how many times have you, have you, uh, drawn a red balloon for a company in the healthcare space like me? Right? Is that really important or should you be more concerned about. What kind of tools do I use to draw my red balloon? What color red am I using? You know, is there a specific healthcare friendly color palette that we’re using or, or those sorts of things that are, that are supportive of, of the skill that I’ve spent so much time working on design, and can I make a realistic balloon? \u2028\nDoesn’t matter if I’ve drawn 500 of them, if they look like. Anime and that’s not what you want then. Mm-hmm. You know, it doesn’t really help you out any. Right. Do you want a realistic [00:26:00] balloon then? Yes. I’ve drawn hundreds of realistic balloons in many different colors. Or, you know, it’s, I’m probably going off the rails with that, but point being, it’s not, it’s not valued as much, uh, with vendors or, or, uh, it’s not valued much with instant hires as much as it’s required of vendors. \u2028\nRight. You have, you have to have this very deep and specific knowledge. Well, you hire, you hire in-house, and you want someone to have 17 skills. I’ve seen so many LinkedIn, WordPress, uh, job postings in the last couple of months, especially with the flood in the market. And it’s like, must have deep knowledge of c s s must be able to project, manage and communicate effectively across team members must be able to, uh, turn concepts into action plans and must know css. \u2028\nDo you know if you want anybody to know? Sorry. You know, if you want anybody to know those things deeply enough to do them effectively at well, You know, with all of the cross browser, um, things that you need to know and, and accessibility and, and all that kind of stuff, like, [00:27:00] that’s a big, big ask. Yeah. Big ask for one human. \u2028\nCory Miller: Absolutely. And that, that’s just defining that role too of agency. You think about what you do at Val as you find, recruit, train, uh, hire all those, those professionals that fit that job description. But would go, I probably wouldn’t be as interested doing that role at an organization, but that you find a team of those there. \u2028\nYou’re doing all of that work that takes time, energy, all that expertise to do all that. Why not let it over here? And you think about, there’s one note you mentioned in the job skills. It’s like being able to communicate across team. It’s like that’s your role as CEO of valet is to make sure that your team here of experts. \u2028\nInward press in particular are communicating as a team back to customers. So like why would you take that extra cognitive load too, would be my thought. Stick to the things you do best, the things that, [00:28:00] what you’re scoring the goals back to soccer, you’re, you’re the star. Those stars do that for them. What you get to do for those that are the backstop, the defenders, like you said back there. \u2028\nI, I, to me I think that’s way more efficient and realistic. Um, because we know, uh, Lindsay is in the process of hiring under pressure right now, and it just takes so much time to source, find, go through the vetting process, have those co, it’s just extremely time intensive. And then when we’re talking to the pre-roll, it’s like, You know, oftentimes when you’re hiring somebody, you wanna find the right fit, but you, you always end up, uh, onboarding, training, guiding those people to do the best for what you’re trying to do as an agency. \u2028\nAnd, uh, I just go, that’s a lot of effort. We’ve at, at our previous company, at Themes. That’s what we did. We hired experts. The things that we weren’t good at, couldn’t be good at to, couldn’t even be. Close to good at find experts with experience and [00:29:00] expertise, pull them in and like back to soccer, I go, the coach is your CEO, your marketing manager out there that needs to execute, but should spend majority of their time on those star players on their team. \u2028\nAnd then source the rest of their team through quality people that are worrying about that all the time. To me, that just feels like no-brainer, by the way, Kimberly. But you know, I’m, uh, I say I’m biased, but I just look at it from a business perspective and I go, I like this trend, uh, where that typical vendor relationship should get an enhancement. \u2028\nYou shouldn’t think about. Well, You know, they get paid from valet or whatever it is, whatever agency. They’re not part of our team. But if you think about it and find an agency like Valet that really cares, wants to do a great job and play that role on their team, hey, I think we should upgrade that, that. \u2028\nMindset and approach and attitude of contractors, vendors, and say, well, are they part of our [00:30:00] team? They might be fractionally part of our team, but we don’t need them a hundred percent of the time. Right. And that’s where I think about what, what you all offer, and I’ve told you this for years, I love what you offer because it’s not just maintenance, it’s not just these things that you can probably get. \u2028\nA number of agencies. It’s, it’s understanding that mindset, playing those roles on the field for your client. Mm-hmm. Because you all do. And I wanna talk about that. I wanna shift gears a little bit about what you do, because I think your approach is pretty awesome, authentic, I think you all created this category. \u2028\nUm, and, but you do it to this level, high level that is, Not just, well, but if you just maintain my website and my updates and my plugin themes, all that kind of stuff, that’s cool. But it doesn’t, it doesn’t to me go that to be that player on the field. Could you talk a little bit about the holistic service? \u2028\nCause you said in the, in the beginning, end to end, it’s really compelling, but what does that mean?  \u2028\nKimberly Lipari: Okay, well we had many iterations of this. I think we had the [00:31:00] website, health pyramid, and then we had these pillars at one point. Um, but it’s, it’s really the idea that, um, expanding on the, the beliefs of what different stakeholders in a business can do for the, or the website can do for them. \u2028\nIt’s, it’s kind of the flip side of that in the tech stack where now, because there are so many different things required, And so many different niches and expertise and all of these people that follow that you can follow that say, I can tell you how to do X really well. Uh, but that’s one out of a thousand things that your website does or one out of a thousand things that your, your marketing manager does really end to end is, is conceptual in, um, conversion traffic or can people use your website? \u2028\nIs the tech stack healthy? Um, are you performing? You know, are there any opportunities for improvement? But it’s iterative, right? Because as you, as you grow, as you change things, you need to go back and kind of reevaluate all those. It’s a [00:32:00] shifting. I haven’t been able to find a really good graphic for it. \u2028\nAnd I feel like even the pyramid, when we had it, it was probably, it was good, but it wasn’t the best. Um, still it wasn’t the most accurate way of, of kind of, Displaying and visually how these things shift, uh, with new people, new processes, new ideas, new initiatives within a company. You know, it, there’s always something that you, you can look at and there’s always something to revisit. \u2028\nAnd then when you tie in metrics, right? We started doing these data dashboards and you start tying in metrics and looking at things that you can actually measure and set goals with. Um, you know, then it becomes a whole new ballgame. Well, now you’re, now you’re tweaking. Now you’re, you’ve entered Formula One and. \u2028\nYou know, you’re moving little tiny notches on the engine to get that extra, you know, half a second off your start time or your run time, uh, because you’re, you’re really in the big leagues at that point, right? So, um, but even, even in the smaller, the smaller, um, medium business sector, there’s a lot of people that don’t realize that [00:33:00] there’s a lot of layers. \u2028\nUh, good example. Um, we have a wonderful client. Who was looking at their Google page speed times. And of course, we all know it’s a rabbit hole, right? I want a hundred. No, you don’t want a hundred, you can’t get a hundred, uh, for many reasons. But, um, you know, and even if you do, it doesn’t, it doesn’t, if you get a hundred, it doesn’t knock up your, your search engine ratings, right? \u2028\nSo, you know, what are you actually going for there, right? But, um, we’re looking at some page speed, low times and had to have a, a big discussion about. Image sizes on a page image weight. So how big the actual file size is. Also, you’re using a page builder also you’re using, um, this thing in here. Also, you’re maxing out two PHP workers every week, um, with the stuff that you need on your tech stack. \u2028\nSo it’s not the hosting that’s your problem necessarily, but you could be giving your hosting an easier time. So all these things intertwine. They intermix. I had an email [00:34:00] today. You know, uh, I need to move hosting, um, but also wanna do registration and, and webinars later. Glad you mentioned that because just hosting and hosting with webinars and registration for things is, you know, those are two different considerations. \u2028\nYou need two different things. So, um, it’s is a, a big. A big thread that runs through all of these things that you need as far as user experience, um, accessibility, usability, tech stack, speed, performance, you know, I mean, optimization, you know, there’s a lot of, a lot of, a lot of things that overlap. You can’t just kind of dive deep into one anymore, so you need that end to end where people, you know, you may not. \u2028\nNeed to dive into all of those things. But you need to, to understand or work with someone who understands that those are all part of the equation. When you’re having a conversation, it’s not hitting a hammer, I’m not hitting a nail with a hammer. You know, you’re mm-hmm. You’re looking at, you know, an entire piece of furniture that you’re trying to put together. \u2028\nSo if you [00:35:00] cut this one part, maybe those four things fall down. Um, or if you add something here, maybe you weaken another part of the structure. What if we put something here, we can bolster everything. You know, so having that comprehensive knowledge of that’s what end-to-end, I get in, in, in my words, my many words mm-hmm. \u2028\nMeans,  \u2028\nCory Miller: well, we, we talked about the first is like if a web, the website, your organization’s website is vitally important to your strategy and what you’re trying to get done. You need someone to go to that has depth of knowledge and breadth. Of, of services that can get you to where you’re going. So I think at some point you’re part mechanic, part your tuner upper performance. \u2028\nUm, but it’s like when you are trying to, to do something that’s integral to your business, that involves your WordPress website, that’s where valet comes in and why this is compelling to me, cuz you know, one of our, uh, the businesses we have an investment in, we brought to valet because we go, she doesn’t [00:36:00] need, um, development all the time. \u2028\nRight, but sometimes she needs functionality, new features, new things for the website to get done what she’s trying to get done. And that was why it was so compelling that you also offer bundles. I think of development time where you know, to try to hire that out or try to do a full-time employee is gonna be, I think, near impossible. \u2028\nBut I love that cause it was co so compelling. She might need this month, three hours of development type work. Well, they have someone to go to that’s trusted, trained, great communicators to do all that, to get it done. And that’s why that end ends so interesting. Cause I know in the health pyramid that we talked about, uh, a while back, um, you’re thinking about all, all, all the way to analytics and metrics. \u2028\nTo features and functionality too. I just need to create a new page that has these things to, to promote my new, you know, offering those types of services. That’s what you all offer and I think that’s [00:37:00] why Vale is really compelling in the space. I wish not to get you just more competitors here, but I wish there was more people that understood like businesses and organizations need this. \u2028\nThey can’t, they’re not just gonna go higher, you know, develop, develop full-time developer rates right now are. Insane. They’re pretty, and I’m glad because our professionals are worth it, but that you’re like, I, I couldn’t even think 120, $150,000 a year to just get someone that knows the stuff. But from a fractional, time wise, I can get those three, that expertise in bundles just when I need it. \u2028\nMm-hmm. Um, and then someone that knows all the way from development to metrics, health analytics, performance that understands the connection of faster spot site equals. SEO equals more traffic equals potentially more conversions in that holistic way, I think is pretty, pretty and compelling. Yeah.  \u2028\nKimberly Lipari: Being able to give advice with, um, [00:38:00] with a, with all of that depth of experience. \u2028\nThere’s a, there’s a story, um, The guy with the hammer that goes to work on a, on a submarine. Have you heard that one? Uhuh? Uh, there’s, um, they’re working on a submarine and, and this guy just can’t quite get, uh, the backend, the propeller work in something’s going on with it. So he, he goes through his Rolodex and finds this propeller specialist. \u2028\nThat, that he knows that they’ve called it in the past when they’ve hit really, really tough problems. Cuz he is gotta get the submarine work in, he wants to get it going. He, this is the one thing that he just can’t, you know, solve for some reason. And so he calls the guy in and the guy comes in, he is got this giant toolbox and he spends about 10 minutes looking, poking around, moving some things. \u2028\nAnd he opens up his toolbox and pulls out this teeny tiny hammer and he walks up to the propeller, moves his finger around just a little bit and taps on it twice. And he says it’s fixed and the guy goes up and he, you know, kind of spins it, oh my gosh, this is great. You fixed it. We can get going. You know, this is a huge piece [00:39:00] of machinery. \u2028\nThis is a huge project we’re working on. This is a huge initiative. And the guy says, okay, I’ll send you an invoice. So he sends him an invoice for $40,000 and the guy was like, he calls him up, he’s like, man, $40,000. Are you kidding me? And he goes, oh, I’ll, I’ll send you an itemized invoice. And it was like, you know, um, uh, $10,000, you know, for my time, and then $30,000 knowing where to tap with the hammer. \u2028\nUh, you know, it’s that, it’s that whole idea of, I don’t know if that’s that’s valued as much, you know, as it was because there’s so many specialists. Everybody’s a specialist. So why would you value, um, someone with a, with a broad based knowledge of, of an industry as much as you used to?  \u2028\nCory Miller: Yeah, well if you, if you’re getting married and won a piano player for your wedding, you gotta take into account that person has been probably spending decades. \u2028\nYep. Learning the piano, learning the, the music. Practicing. Practicing to understand and back to the [00:40:00] summer music, exactly where they hit.  \u2028\nKimberly Lipari: I’m pretty sure there’s like a, a Reddit thread with like, all kinds of stories like that. Right? Where what do you mean you, you know, you only gonna, you wanna charge me $250? \u2028\nIt’s a one hour wedding, you know, well, classically trained, but okay.  \u2028\nCory Miller: Well, so far we talked about the value of the website growing in importance, and so glad to hear that what you’re seeing too, what we’re seeing. Um, we’ve talked about that role of the classic vendor changing, um, in a good way. Finding agencies like we have at Word at, uh, post status WordPress agencies, like Valet has been doing it for. \u2028\nGosh, how, how long have you been doing this, Valerie? I, I said Val and smash it together. Kimberly,  \u2028\nKimberly Lipari: Valerie, it’ll be my new screen name. Um, a about a little over 10 years. Yeah. It’s been, it’s been a long time.  \u2028\nCory Miller: No kidding. Years. You’ve seen a lot too. Yeah, so [00:41:00] finding that agency, it has the depth of experience, has the team that can execute, has that knowledge to be that back to the soccer, to be a player or multiple players on your field, so you get to focus on what you do best. \u2028\nI think that’s credible and, and that just, I think, for me is a perspective on our industry, particularly with WordPress. But on the internet, the. Increasing value of, um, both websites and agencies that can do that. Take that down for you. Anything else we missed that you wanna share or, or talk about?  \u2028\nKimberly Lipari: Yeah, we, uh, we soft launched a, a new, um, a new. \u2028\nRefresh of the site. Um, we had to readjust our plans based on this, this conversation actually that we’re having just kind of this change in shift in market, being able to provide more core competencies, um, that are highly skilled. Um, [00:42:00] and then we’ve kind of, we’re toying around with a new version of a smaller package. \u2028\nThat we’re calling Valet Express. Uh, that kind of gets you a lot of the core things that you need, um, covers that, you know, the, the gives you the basics of the end-to-end. To be able to at least see and look at things. You know, if you want help with them, then you can get help with them, if not, but, um, our, our standard plans have shifted and now include an advisor, um, for the larger ones, uh, to meet at least two times a year. \u2028\nSo we can kind of stay up to date, keep up with, you know, funding cycles and, you know, uh, group initiatives and, you know, be able to help plan and that kind of stuff. So, um, really excited because I mean, we, we act in an advisory capacity anytime we talk to someone, you know, make an email and an ask a question anytime they want. \u2028\nBut, um, you know, being present for those, for those meetings and changes and, and discussions is something that we really wanna. Make ourselves more available for, we’re always [00:43:00] available for it, but we’re never like, Hey, it’s time for your six month meeting. You know, we make it more important. Uh, Then it, it smooths, it smooths the process a lot, and I think that’s a big part of us trying to contribute, to help shift that idea of being, uh, invested. \u2028\nWe know that we love what we do, and I think that’s why we’re good at it is just because we like helping. We like learning. We’re not invested in selling anything in particular other than just being there, you know, and doing it. Right. We’re just nerds for. We’re trying to get it right and, and figure it out. \u2028\nMm-hmm. So, you know, that’s what makes us passionate. So, um, you know, we’ve, we’ve done a, a little bit of, uh, kind of adjusting. There’s still more to come, but that was kind of the first. The first big push. There’ll be lots of other little changes and things we’re gonna grow and add in. But, uh, you know, that’s, that’s been exciting. \u2028\nI’m so happy.  \u2028\nCory Miller: I’m so excited. That’s great. Well, somebody’s like, Hey, I need a nerd to help how all this fits in. Um, how do they get started and talk, get started talking to you all at Vale. What’s the next step?  \u2028\nKimberly Lipari: Oh, [00:44:00] we have a contact form on the website. We have a phone call scheduling on the website now, and you can just, [email protected] rhymes. \u2028\nSo it’s easy to remember, uh, and, you know, we’ll, we’ll talk to you, you know that any, every conversation has to be, um, started with an idea of what you wanna do, where you wanna go, and what your goals are. I mean, that’s, that makes for the most effective communication. Um, so yeah, that’s the best way. Just say, hey, and we’ll say, Hey, what you doing? \u2028\nWhat you wanna do? And we’ll go from there. \u2028\nCory Miller: I love it. I think that last part is key. Knowing what you want to do, where you want to go, and then coming to the website advisors vale to figure out how to get there. Absolutely key. Thank you. Kimberly Lepar of valet, CEO. Um, I appreciate your time sharing what you’re seeing in the market and how you all help connect in with, um, clients for this cool thing we call the Open Web and WordPress. \u2028\nKimberly Lipari: Yes. Love it. It’s a place to be.\n\n\n\n\n\n\t\t\tPost Tags:\t\t\n#Accessibility#Acquisition#Africa#Agency#Altis DXP#Automattic#B2B#Black Friday#Blocks#Bluehost#Brian Gardner#Carl Alexander#Chris Lema#CloudFlare#Cloudways#CMS#community#Content#contracts#Cory Miller#CSS#Cyber Monday#Dan Knauss#DDoS#Digital Ocean#Discussion#Diversity#Documentation#DXP#Email#Employment#Encryption#Enterprise#Ethics#Featured Image#Figma#Flywheel#Forbes#Freemius#Genesis#GitHub#GoDaddy#Gravity Forms#Gutenberg#Health#Hiring#Hosting#HTML#Human Made#Inclusion#Integrations#Interviews#JavaScript#Jesse Friedman#JSON#Kim Lipari#Kinsta#Liquid Web#Magento#maintenance#Marketing#Matt Medeiros#Membership#Migrate#Multisite#Nathan Ingram#New York Times#Nexcess#Open Source#Open Web#Outsourcing#Page Builder#Pagely#Pandemic#Partnerships#Performance#PHP#Plugins#Pressable#Pricing#Publishing#SaaS#Sandhills#Scale#SEO#Shopify#Square#Standards#Static#Themes#TikTok#Training#tutorials#UX#Valet#Webflow#WooCommerce#WordCamp#WordPress VIP#WordPress.com#WordPress.org#WP Cloud#WP Engine#Yoast \n\n\n\n\n\nPost navigation\nPrevious\nPreviousLaunching a WordPress Product in Public: Session 11NextContinue\nTech Roundup Week Ending April 28\n\n\n\n\n\nSimilar Posts \n\n\n\n\n\n\nFrontKit Beta is open for testing\nByJaph Thomson \nJune 27, 2015June 28, 2015 \n\n\n\nYou may remember from WordCamp Europe 2014, that Adrian Zumbrunnen gave an excellent talk on Rethinking content creation, introducing a new tool he’d been working on called FrontKit. This year he gave a short talk to update on progress, and announce that the beta is open for applications to test. I got to have a…\n\n\n\n\n\n\t\t\t\tRead More FrontKit Beta is open for testingContinue\n \n\n\n\n\n\n\n\n\n\nThe latest Gutenberg update is out.…\nByBrian Krogsgard \nSeptember 29, 2017September 30, 2017 \n\n\n\nThe latest Gutenberg update is out. In the changelog: block conflicts have been resolved, there is new support for custom fields in block attributes, and crash recovery has been addressed. Omar Reiss brought up Gutenberg while sharing his thoughts on the WordPress JS framework debate and how it will affect plugin developers. Omar suggests the best way developers…\n\n\n\n\n\n\t\t\t\tRead More The latest Gutenberg update is out.…Continue\n \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nPlanet | Tech | The Week in Review | WordPress News \n\nA Definitive Guide to WP-Config, the WordPress 6.1 Field Guide, and Twenty Twenty-Three\nByDaniel Schutzsmith \nOctober 14, 2022October 14, 2022 \n\n\n\nHere’s a glimpse of what’s going on in the world of design and development in the WordPress space this past week: A delicious developer’s advanced guide to WP-Config, the WordPress 6.1 Field Guide, and Twenty Twenty-Three looks amazing! Brian Gardner released a new FSE theme, Powder. Cool Tool of the Week: Lorem Picsum by David Marby and Nijiko Yonskai.\n\n\n\n\n\n\t\t\t\tRead More A Definitive Guide to WP-Config, the WordPress 6.1 Field Guide, and Twenty Twenty-ThreeContinue\n \n\n\n\n\n\n\n\n\n\n\n\nHosting \n\nHosting tips for developers\nByBrian Krogsgard \nApril 13, 2015 \n\n\n\nMark Jaquith shares some hosting tips for developers using Pantheon’s service. I wish I’d seen this before I used Pantheon for the first time. If you’re doing client work on Pantheon, Mark’s guide is outstanding. Also, it’s not a bad read for hosts looking to level up how they cater to developers either. I especially like…\n\n\n\n\n\n\t\t\t\tRead More Hosting tips for developersContinue\n \n\n\n\n\n\n\n\n\n\nWooSesh has published the full schedule…\nByDan Knauss \nOctober 4, 2018 \n\n\n\nWooSesh has published the full schedule for both days (October 18 and 19) of the event. This fully online conference should be of particular interest to WooCommerce store builders, developers, and anyone involved with eCommerce. If you can watch at least one session, you should because it’s also free.\n\n\n\n\n\n\t\t\t\tRead More WooSesh has published the full schedule…Continue\n \n\n\n\n\n\n\n\n\n\n\n\nDesign \n\nSome developers will appreciate Josh Pollock’s…\nByBrian Krogsgard \nJuly 8, 2016 \n\n\n\nSome developers will appreciate Josh Pollock’s article covering PHP design patterns and architectures. He also covers common patterns employed in WordPress.\n\n\n\n\n\n\t\t\t\tRead More Some developers will appreciate Josh Pollock’s…Continue\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment *Name *\nEmail *\nWebsite\n Save my name, email, and website in this browser for the next time I comment.\n \n\nΔ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\n\n\n\n\n\nPost Status is proudly supported by great partners\nPagelyGravity FormsElementorA2 HostingPressable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\nTwitter\nYouTube\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© Post Status, 2023 | Made with WordPress | Privacy Policy | Website Terms\n \n\n\n\n\n\n\n\n\n\n\nScroll to top\nScroll to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAboutExpand child menuExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand child menuExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand child menuExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand child menuExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand child menuExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu Close\n \n\n\n\n\nSearch for:\n\n\n\nSearch\n \n\n\n",
    "links": [
        "#main",
        "https://poststatus.com/",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner",
        "https://poststatus.com/login",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/",
        "https://poststatus.com/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/podcast/draft/",
        "https://corymiller.com",
        "https://corymiller.com",
        "https://poststatus.com/wordpress/business/",
        "https://poststatus.com/podcast/draft/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/wordpress/business/wp-products/",
        "https://twitter.com/kimberlylipari?lang=en",
        "https://twitter.com/corymiller303",
        "#h-transcript",
        "https://twitter.com/kimberlylipari?lang=en",
        "https://twitter.com/thewpvalet",
        "https://twitter.com/corymiller303",
        "https://poststat.us/a2-hosting",
        "https://valet.io/",
        "https://twitter.com/wpbuilds",
        "https://www.wpbeaverbuilder.com/",
        "https://pagely.com/",
        "https://wpengine.com/",
        "https://www.godaddy.com/en-ca",
        "https://getflywheel.com/",
        "https://mediatemple.net/",
        "https://kinsta.com/",
        "https://www.liquidweb.com/",
        "https://twitter.com/pippinsplugins?lang=en",
        "https://restrictcontentpro.com/",
        "https://affiliatewp.com/",
        "https://sandhillsdev.com/",
        "https://easydigitaldownloads.com/",
        "https://www.gravityforms.com/",
        "https://ithemes.com/",
        "https://www.liquidweb.com/",
        "https://twitter.com/twigpress?lang=en",
        "https://twitter.com/linds_halsey?lang=en",
        "https://twitter.com/nathaningram?lang=en",
        "https://twitter.com/rezzz",
        "https://twitter.com/matt_medeiros?lang=en",
        "https://hallwaychats.com/",
        "https://trello.com/",
        "https://slack.com/",
        "https://zoom.us/",
        "https://www.hubspot.com/",
        "https://keap.com/",
        "https://www.activecampaign.com/",
        "http://www.salesforce.com/",
        "http://www.agilecrm.com/",
        "https://twitter.com/kimberlylipari?lang=en",
        "https://twitter.com/thewpvalet",
        "https://twitter.com/corymiller303",
        "https://twitter.com/post_status",
        "https://twitter.com/lemonadecode",
        "https://twitter.com/post_status",
        "https://poststatus.com/category/post-status-podcasts/",
        "https://itunes.apple.com/us/podcast/post-status-draft-wordpress/id976403008",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5zaW1wbGVjYXN0LmNvbS8ySkU5c2M4UA",
        "https://www.youtube.com/c/PostStatus",
        "http://www.stitcher.com/podcast/krogsgard/post-status-draft-wordpress-podcast",
        "https://wordpress-post-status-draft-podcast.simplecast.com/",
        "https://feeds.simplecast.com/2JE9sc8P",
        "/cdn-cgi/l/email-protection",
        "https://poststatus.com/tag/accessibility/",
        "https://poststatus.com/tag/acquisition/",
        "https://poststatus.com/tag/africa/",
        "https://poststatus.com/tag/agency/",
        "https://poststatus.com/tag/altis-dxp/",
        "https://poststatus.com/tag/automattic/",
        "https://poststatus.com/tag/b2b/",
        "https://poststatus.com/tag/black-friday/",
        "https://poststatus.com/tag/blocks/",
        "https://poststatus.com/tag/bluehost/",
        "https://poststatus.com/tag/brian-gardner/",
        "https://poststatus.com/tag/carl-alexander/",
        "https://poststatus.com/tag/chris-lema/",
        "https://poststatus.com/tag/cloudflare/",
        "https://poststatus.com/tag/cloudways/",
        "https://poststatus.com/tag/cms/",
        "https://poststatus.com/tag/community/",
        "https://poststatus.com/tag/content/",
        "https://poststatus.com/tag/contracts/",
        "https://poststatus.com/tag/cory-miller/",
        "https://poststatus.com/tag/css/",
        "https://poststatus.com/tag/cyber-monday/",
        "https://poststatus.com/tag/dan-knauss/",
        "https://poststatus.com/tag/ddos/",
        "https://poststatus.com/tag/digital-ocean/",
        "https://poststatus.com/tag/discussion/",
        "https://poststatus.com/tag/diversity/",
        "https://poststatus.com/tag/documentation/",
        "https://poststatus.com/tag/dxp/",
        "https://poststatus.com/tag/email/",
        "https://poststatus.com/tag/employment/",
        "https://poststatus.com/tag/encryption/",
        "https://poststatus.com/tag/enterprise/",
        "https://poststatus.com/tag/ethics/",
        "https://poststatus.com/tag/featured-images/",
        "https://poststatus.com/tag/figma/",
        "https://poststatus.com/tag/flywheel/",
        "https://poststatus.com/tag/forbes/",
        "https://poststatus.com/tag/freemius/",
        "https://poststatus.com/tag/genesis/",
        "https://poststatus.com/tag/github/",
        "https://poststatus.com/tag/godaddy/",
        "https://poststatus.com/tag/gravity-forms/",
        "https://poststatus.com/tag/gutenberg/",
        "https://poststatus.com/tag/health/",
        "https://poststatus.com/tag/hiring/",
        "https://poststatus.com/tag/hosting/",
        "https://poststatus.com/tag/html/",
        "https://poststatus.com/tag/human-made/",
        "https://poststatus.com/tag/inclusion/",
        "https://poststatus.com/tag/integrations/",
        "https://poststatus.com/tag/interviews/",
        "https://poststatus.com/tag/javascript/",
        "https://poststatus.com/tag/jesse-friedman/",
        "https://poststatus.com/tag/json/",
        "https://poststatus.com/tag/kim-lipari/",
        "https://poststatus.com/tag/kinsta/",
        "https://poststatus.com/tag/liquid-web/",
        "https://poststatus.com/tag/magento/",
        "https://poststatus.com/tag/maintenance/",
        "https://poststatus.com/tag/marketing/",
        "https://poststatus.com/tag/matt-medeiros/",
        "https://poststatus.com/tag/membership/",
        "https://poststatus.com/tag/migrate/",
        "https://poststatus.com/tag/multisite/",
        "https://poststatus.com/tag/nathan-ingram/",
        "https://poststatus.com/tag/new-york-times/",
        "https://poststatus.com/tag/nexcess/",
        "https://poststatus.com/tag/open-source/",
        "https://poststatus.com/tag/open-web/",
        "https://poststatus.com/tag/outsourcing/",
        "https://poststatus.com/tag/page-builder/",
        "https://poststatus.com/tag/pagely/",
        "https://poststatus.com/tag/pandemic/",
        "https://poststatus.com/tag/partnerships/",
        "https://poststatus.com/tag/performance/",
        "https://poststatus.com/tag/php/",
        "https://poststatus.com/tag/plugins/",
        "https://poststatus.com/tag/pressable/",
        "https://poststatus.com/tag/pricing/",
        "https://poststatus.com/tag/publishing/",
        "https://poststatus.com/tag/saas/",
        "https://poststatus.com/tag/sandhills/",
        "https://poststatus.com/tag/scale/",
        "https://poststatus.com/tag/seo/",
        "https://poststatus.com/tag/shopify/",
        "https://poststatus.com/tag/square/",
        "https://poststatus.com/tag/standards/",
        "https://poststatus.com/tag/static/",
        "https://poststatus.com/tag/themes/",
        "https://poststatus.com/tag/tiktok/",
        "https://poststatus.com/tag/training/",
        "https://poststatus.com/tag/tutorials/",
        "https://poststatus.com/tag/ux/",
        "https://poststatus.com/tag/valet/",
        "https://poststatus.com/tag/webflow/",
        "https://poststatus.com/tag/woocommerce/",
        "https://poststatus.com/tag/wordcamp/",
        "https://poststatus.com/tag/wordpress-vip/",
        "https://poststatus.com/tag/wordpress-com/",
        "https://poststatus.com/tag/wordpress-org/",
        "https://poststatus.com/tag/wp-cloud/",
        "https://poststatus.com/tag/wp-engine/",
        "https://poststatus.com/tag/yoast/",
        "https://poststatus.com/launching-a-wordpress-product-in-public-session-11/",
        "https://poststatus.com/tech-roundup-week-ending-april-28/",
        "https://poststatus.com/frontkit-beta-is-open-for-testing/",
        "https://japh.com.au",
        "https://poststatus.com/frontkit-beta-is-open-for-testing/",
        "https://poststatus.com/the-latest-gutenberg-update-is-out/",
        "https://poststatus.com",
        "https://poststatus.com/the-latest-gutenberg-update-is-out/",
        "https://poststatus.com/a-definitive-guide-to-wp-config-the-wordpress-6-1-field-guide-and-twenty-twenty-three/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/wordpress/tech/",
        "https://poststatus.com/wordpress/week-in-review/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/a-definitive-guide-to-wp-config-the-wordpress-6-1-field-guide-and-twenty-twenty-three/",
        "https://poststatus.com/author/schutzsmith/",
        "https://poststatus.com/a-definitive-guide-to-wp-config-the-wordpress-6-1-field-guide-and-twenty-twenty-three/",
        "https://poststatus.com/wordpress/tech/hosting/",
        "https://poststatus.com/hosting-tips-for-developers/",
        "https://poststatus.com",
        "https://poststatus.com/hosting-tips-for-developers/",
        "https://poststatus.com/woosesh-has-published-the-full-schedule/",
        "http://dan.knauss.ca",
        "https://poststatus.com/woosesh-has-published-the-full-schedule/",
        "https://poststatus.com/wordpress/tech/design/",
        "https://poststatus.com/some-developers-will-appreciate-josh-pollocks/",
        "https://poststatus.com",
        "https://poststatus.com/some-developers-will-appreciate-josh-pollocks/",
        "/talking-with-valets-ceo-kimberly-lipari-about-the-changing-value-of-websites-to-organizations-post-status-draft/#respond",
        "https://akismet.com/privacy/",
        "https://poststat.us/pagely",
        "https://poststat.us/gravity-forms",
        "https://poststat.us/elementor",
        "https://poststat.us/a2-hosting",
        "https://poststat.us/pressable",
        "https://www.facebook.com/poststatusblog",
        "https://twitter.com/post_status",
        "https://www.youtube.com/c/PostStatus",
        "https://poststatus.com/privacy-policy",
        "https://poststatus.com/website-terms",
        "#wrapper",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner"
    ]
}