{
    "title": "Stanford transitions to 100 percent renewable electricity with second solar plant - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nMarch 24, 2022 Stanford transitions to 100 percent renewable electricity as second solar plant goes online Stanford completes the university’s transition to 100 percent renewable electricity as Solar Generating Station #2 begins commercial operation. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Chelcey Adami\n\nStanford’s second solar generating plant went online this month, completing the university’s years-long transition to 100 percent renewable electricity and marking a major milestone in its larger journey to reach net zero carbon emissions on campus.\n\nStanford Solar Generating Station #2 (SSGS2), Stanford’s portion of a larger solar and energy storage project called Slate, began commercial operation in mid-March. (Image credit: Goldman Sachs Renewable Energy)\n\nStanford Solar Generating Station #2 (SSGS2), Stanford’s portion of a larger solar and energy storage project called Slate, began commercial operation in mid-March. The 63-megawatt solar photovoltaic plant sits on approximately 420 acres in Central California, near Lemoore.\nThe station serves as the final component in the Stanford Energy System Innovations (SESI), a complete redesign and transition of Stanford University’s energy system from a 100 percent fossil fuel-based, combined heat and power plant to grid-sourced electricity and a more efficient electric heat recovery system.\n“As this new solar plant comes online, Stanford will achieve the important milestone of producing enough renewable electricity to exceed what the university consumes,” said President Marc Tessier-Lavigne. “But our work to achieve a more sustainable future is only beginning.\n“As we make our operations greener, we’re also committed to advancing global solutions through our mission of research and education,” he added. “Our new school focused on climate and sustainability, which opens its doors this fall, will serve as a focal point for these efforts.”\nSSGS2 includes a 200-megawatt battery energy storage system that helps create a better match between demand (such as nighttime use of electricity) and resource (electricity generated during the daytime). Excess energy generated from the plant will help sustainably support California’s electric grid, said Aurora Winslade, director of Stanford’s Office of Sustainability.\nRecurrent Energy, a wholly owned subsidiary of Canadian Solar, developed and operates the facility. Goldman Sachs Renewable Power purchased it from Recurrent, which now serves as project manager.\nStanford is an “offtaker,” or buyer, of the facility’s energy, along with Bay Area Rapid Transit, Silicon Valley Clean Energy, Central Coast Community Energy and the Power and Water Resources Pooling Authority.\nAmbitious decarbonization\nIn 2015, Stanford transitioned from powering the campus solely through natural gas to a more efficient system of using grid-sourced electricity and waste heat to heat and cool the campus – saving money, conserving water, eliminating greenhouse gases and paving the way for a clean energy future. To do so, the ground-breaking Central Energy Facility was brought online, and Stanford’s on-campus natural gas-fired cogeneration plant was decommissioned.\n\n\nCommitment to climate and sustainability challenges\nStanford University has a multifaceted commitment to addressing urgent climate and sustainability challenges:\n\nStanford was the first U.S. college or university to issue bonds carrying dual climate and sustainability designations for financing campus construction and renovation projects in 2021.\nThe university has an ambitious goal of zero waste by 2030, defined as 90 percent diversion of waste away from the landfill. Stanford has reduced total campus potable water use by 48 percent since water conservation programs began in 2021.\nStanford is one of only 11 universities to achieve the Sustainability Tracking, Assessment and Rating System (STARS) Platinum rating. Stanford is also among the top three universities in the energy category of the Association for the Advancement of Sustainability in Higher Education’s (AASHE) 2021 Sustainable Campus Index.\nStanford is the top-ranked university for diversity and affordability, according to AASHE’s 2021 Sustainable Campus Index. Steps taken include training for all staff in inclusion, diversity, equity, access and learning; a new environmental justice minor; an environmental justice working group; student internships; and a faculty cluster hire in climate science, sustainable development and environmental science.\n\n\n\nThe 54-megawatt Stanford Solar Generating Station #1 in Rosamond, California, came online in 2016.\nNow that SSGS2 is also online, Stanford can work toward its goal to power everything with clean electricity – from cooking operations in dining halls to burners in labs – on the main campus, the Redwood City campus and the Hopkins Marine Station in Pacific Grove.\nThe university’s sophisticated greenhouse gas reduction programs have resulted in nearly 80 percent reduction from peak levels in 2011.\n“Stanford is among the first universities in the world to do this specific combination of heat recovery, large-scale thermal storage, renewable electrification and optimization in the way that we are doing it,” Winslade said. “That makes us one of the most advanced universities in the world when it comes to operationalizing these kinds of ambitious decarbonization greenhouse gas reduction and climate action targets.”\nThis model is also a good economic investment, saving money over the long run, she added. The university forecasts a total net savings of about $520 million in energy savings, when compared to 2011 costs.\n“Both higher education institutions as well as other entities are looking for ways to procure clean energy,” Winslade said. “This demonstrates how it can be done at an affordable cost, to be able to procure renewable energy in a long-term partnership and contribute to the production of more clean energy into the grid.”\nLife on Earth\nThis decarbonization journey is part of how Stanford is addressing the urgency of climate and sustainability challenges and working toward creating a future where humans and nature thrive, said Lincoln Bleveans, executive director of sustainability and energy management, who spoke at the ribbon-cutting ceremony for SSGS2 on March 15.\n“We are focused on real-world change, both to make Stanford itself as sustainable as possible and to inspire other campuses, cities and businesses around the world with a proven, cost-effective decarbonization model,” he said. “We are a ‘living lab’ for sustainability solutions.”\nThere have been more than 5,000 tours of Stanford’s Central Energy facility as interested parties learn more about how to implement the technology; visitors have included tribal nation leaders, the U.S. military, dignitaries from other countries and leaders in higher education.\n“Through our research and operations, Stanford is working to address the most urgent issue of our times: sustaining life on Earth,” said Provost Persis Drell. “We have long-standing expertise in environmental studies and continue to increase our investments in sustainability research and education. We also strive to live our values by running our campus as cleanly and efficiently as possible.”\nBefore the addition of SSGS2, Stanford was already a top-ten purchaser of renewable energy in U.S. higher education.\nGoing forward, Stanford plans to complete its electrification of the remaining campus shuttle buses and campus vehicles; conversion of hospitals to hot water and electrification of hot water processes; and electrification of natural gas and steam appliances and heating.\nTo reach net-zero carbon emissions, every member of the Stanford community will ultimately need to participate as the university tackles Scope 3 emissions, which include things like air travel, commuting and the purchase of goods such as pens, paper and bags, Winslade said. The university aims to eliminate Scope 3 emissions by 2050.\nThis story was updated to correct a description of Stanford Solar Generating Station #1.\n\n\n\n\n\n\n\n\n\n\n\n\nStanford News\nInstitutional News\nSustainability\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D6645",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2022/03/Solar-Generating-Station1500X1000.jpg",
        "https://sustainable.stanford.edu/campus-action/stanford-energy-system-innovations-sesi",
        "https://news.stanford.edu/report/2021/12/14/transition-leadership-named-new-school/",
        "https://stars.aashe.org/",
        "https://www.aashe.org/wp-content/uploads/2021/11/SCI-Nov-2021.pdf",
        "https://earth.stanford.edu/dei/faculty-staff-resources#gs.uwkk5b",
        "https://earth.stanford.edu/news/earth-systems-program-announces-new-minor-environmental-justice#gs.uwhtri",
        "https://www.ejstanford.com/",
        "https://sustainabilityinitiative.stanford.edu/news/faculty-cluster-hires-launched-climate-science-sustainable-development-environmental-justice",
        "https://news.stanford.edu/2016/12/05/stanford-unveils-innovative-solar-generating-station/",
        "https://news.stanford.edu/2021/04/20/hard-quantify-emissions-next-frontier-stanford-sustainability-goals/",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/topic/institutional-news/",
        "https://news.stanford.edu/report/topic/sustainability/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D6645",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}