{
    "title": "Are screens causing a teen depression? Jean Twenge's new book shows the link : Shots - Health News : NPR",
    "body": "\n\n\n\n\nAccessibility links \nSkip to main content\nKeyboard shortcuts for audio player\n\n\n\n\n\n\n\n\n                    Open Navigation Menu\n                \n\n\n\n\n\n\n\n\n\nNPR Shop\n\n\n\n\n\n\n\n>\n                    Close Navigation Menu\n\n\n\n\nHome\n\n\n\nNews\nExpand/collapse submenu for News\n\n\nNational\nWorld\nPolitics\nBusiness\nHealth\nScience\nClimate\nRace\n\n\n\n\nCulture\nExpand/collapse submenu for Culture\n\n\nBooks\nMovies\nTelevision\nPop Culture\nFood\nArt & Design \nPerforming Arts\nLife Kit\n\n\n\n\nMusic\nExpand/collapse submenu for Music\n\n\n\n        Tiny Desk\n    \n\n\n        #NowPlaying\n    \n\n\n        All Songs Considered\n    \n\n\n        Music Features\n    \n\n\n        Live Sessions\n    \n\n\n\n\nPodcasts & Shows\nExpand/collapse submenu for Podcasts & Shows\n\n\nDaily\n\n\n\n\n                                    Morning Edition\n                                \n\n\n\n\n                                    Weekend Edition Saturday\n                                \n\n\n\n\n                                    Weekend Edition Sunday\n                                \n\n\n\n\n                                    All Things Considered\n                                \n\n\n\n\n                                    Fresh Air\n                                \n\n\n\n\n                                    Up First\n                                \n\n\nFeatured\n\n\n\n        Taking Cover\n    \n\n\n\n        Louder Than A Riot\n    \n\n\n\n        It's Been a Minute\n    \n\n\n\n        Life Kit\n    \n\n\nMore Podcasts & Shows\n\n\n\n\n\nSearch\n\n\n\n\n\nNPR Shop\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Tiny Desk\n    \n\n\n        #NowPlaying\n    \n\n\n        All Songs Considered\n    \n\n\n        Music Features\n    \n\n\n        Live Sessions\n    \n\n\n\n\n\n\n\nAbout NPR\nDiversity\nOrganization\nSupport\nCareers\nConnect\nPress\nEthics\n\n\n\n\n\nAre screens causing a teen depression? Jean Twenge's new book shows the link : Shots - Health News A striking decline in teen mental health has coincided with the rise of smartphones and social media. Is social media causing the mental health challenges? Finally, research can answer that question.\n\n\n\n\nShots\nHealth News From NPR\n\n\n\n\n\n\n\n\n\n\nYour Health\nTreatments & Tests\nHealth Inc.\nPolicy-ish\nPublic Health\n\n\n\n\nTwitter\n\n\n\n\n\n \n\nYour Health\n\n\n\nThe truth about teens, social media and the mental health crisis\n\n\n\n\n\n\n\n\n\n\nApril 25, 20239:28 AM ET\n\n \n                        Heard on             All Things Considered\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      Michaeleen Doucleff\n    \n\n\n\n\n\n\n\n\n\n\n\n\nThe truth about teens, social media and the mental health crisis\n\n\n\n\n\n\n\n                            \n                            Listen\n                        \n\n· \n8:18\n\n\n\n\n\n8:18\n\n\n\n\n\n\nToggle more options\n\n\nDownload\n\n\nEmbed\n\n\n\n\nEmbed\n\n\n\n<iframe src=\"https://www.npr.org/player/embed/1171773181/1172007364\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n\n\n\n\n\n\nTranscript\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnlarge this image\n\n\n\n\n\n\n                For years, the research picture on how social media affects teen mental health has been murky. That is changing as scientists find new tools to answer the question.\n                \n                    \n                    Olivier Douliery /AFP via Getty Images\n                    \n                \nhide caption\n\n\ntoggle caption\n\n\n        \n        Olivier Douliery /AFP via Getty Images\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n\nFor years, the research picture on how social media affects teen mental health has been murky. That is changing as scientists find new tools to answer the question.\n\n            \n            Olivier Douliery /AFP via Getty Images\n            \n        \n\n\n\nBack in 2017, psychologist Jean Twenge set off a firestorm in the field of psychology. Twenge studies generational trends at San Diego State University. When she looked at mental health metrics for teenagers around 2012, what she saw shocked her. \"In all my analyses of generational data — some reaching back to the 1930s — I had never seen anything like it,\" Twenge wrote in the Atlantic in 2017. Twenge warned of a mental health crisis on the horizon. Rates of depression, anxiety and loneliness were rising. And she had a hypothesis for the cause: smartphones and all the social media that comes along with them. \"Smartphones were used by the majority of Americans around 2012, and that's the same time loneliness increases. That's very suspicious,\" Twenge told NPR in 2017.  But many of her colleagues were skeptical. Some even accused her of inciting a panic with too little — and too weak — data to back her claims.  Now, six years later, Twenge is back. She has a new book out this week, called Generations, with much more data backing her hypothesis. At the same time, several high-quality studies have begun to answer critical questions, such as does social media cause teens to become depressed and is it a key contributor to a rise in depression? \n\n\nIn particular, studies from three different types of experiments, altogether, point in the same direction. \"Indeed, I think the picture is getting more and more consistent,\" says economist Alexey Makarin, at the Massachusetts Institute of Technology.  \n\n \nShots - Health News \nHow to help young people limit screen time — and feel better about how they look\n\n\n\n\n\n\nA seismic change in how teens spend their time In Generations, Twenge analyzes mental health trends for five age groups, from the Silent Generation, who were born between 1925 and 1945, to Gen Z, who were born between 1995 and 2012. She shows definitively that \"the way teens spend their time outside of school fundamentally changed in 2012,\" as Twenge writes in the book.  Take for instance, hanging out with friends, in person. Since 1976, the number of times per week teens go out with friends — and without their parents — held basically steady for nearly 30 years. In 2004, it slid a bit. Then in 2010, it nosedived. \"It was just like a Black Diamond ski slope straight down,\" Twenge tells NPR. \"So these really big changes occur.\" At the same time, around 2012, time on social media began to soar. In 2009, only about half of teens used social media every day, Twenge reports. In 2017, 85% used it daily. By 2022, 95% of teens said they use some social media, and about a third say they use it constantly, a poll from Pew Research Center found. \n\n\n\"Now, in the most recent data, 22% of 10th grade girls spend seven or more hours a day on social media,\" Twenge says, which means many teenage girls are doing little else than sleeping, going to school and engaging with social media.  Not surprisingly, all this screen time has cut into many kids' sleep time. Between 2010 and 2021, the percentage of 10th and 12th graders who slept seven or fewer hours each night rose from a third to nearly one-half. \"That's a big jump,\" Twenge says. \"Kids in that age group are supposed to sleep nine hours a night. So less than seven hours is a really serious problem.\" \n\n \nShots - Health News \nTeen girls and LGBTQ+ youth plagued by violence and trauma, survey says\n\n\n\n\n\n\nOn its own, sleep deprivation can cause mental health issues. \"Sleep is absolutely crucial for physical health and for mental health. Not getting enough sleep is a major risk factor for anxiety and depression and self-harm,\" she explains. Unfortunately, all of those mental health problems have continued to rise since Twenge first sounded the alarm six years ago. \"Nuclear bomb\" on teen social life \"Every indicator of mental health and psychological well-being has become more negative among teens and young adults since 2012,\" Twenge writes in Generations. \"The trends are stunning in their consistency, breadth and size.\" Across the board, since 2010, anxiety, depression and loneliness have all increased. \"And it's not just symptoms that rose, but also behaviors,\" she says, \"including emergency room visits for self-harm, for suicide attempts and completed suicides.\" The data goes up through 2019, so it doesn't include changes due to COVID-19. All these rapid changes coincide with what, Twenge says, may be the most rapid uptake in a new technology in human history: the incorporation of smartphones into our lives, which has allowed nearly nonstop engagement with social media apps. Apple introduced the first iPhones in 2007, and by 2012, about 50% of American adults owned a smartphone, the Pew Research Center found.  \n\n\nThe timing is hard to ignore, says data scientist Chris Said, who has a Ph.D. in psychology from Princeton University and has worked at Facebook and Twitter. \"Social media was like a nuclear bomb on teen social life,\" he says. \"I don't think there's anything in recent memory, or even distant history, that has changed the way teens socialize as much as social media.\" Murky picture becomes clearer on causes of teen depression But the timing doesn't tell you whether social media actually causes depression in teens.  In the past decade, scientists have published a whole slew of studies trying to answer this question, and those studies sparked intense debate among scientists and in the media. But, Said says, what many people don't realize is scientists weren't using — or didn't even have — the proper tools to answer the question. \"This is a very hard problem to study,\" he says. \"The data they were analyzing couldn't really solve the problem.\"  \n\n\nMental Health \nThe mental health of teen girls and LGBTQ+ teens has worsened since 2011\n\n\n\n\n\n\nSo the findings have been all over the place. They've been murky, noisy, inconclusive and confusing. \"When you use tools that can't fully answer the question, you're going to get weak answers,\" he says. \"So I think that's one reason why really strong evidence didn't show up in the data, at least early on.\" On top of it, psychology has a bad track record in this field, Said points out. For nearly a century, psychologists have repeatedly blamed new technologies for mental and physical health problems of children, even when they've had little — or shady — data to back up their claims.  For example, in the 1940s, psychologists worried that children were becoming addicted to radio crime dramas, psychologist Amy Orben at the University of Cambridge explains in her doctoral thesis. After that, they raised concerns about comic books, television and — eventually — video games. Thus, many researchers worried that social media may simply be the newest scapegoat for children's mental health issues. \n\n\nA handful of scientists, including MIT's Alexey Makarin, noticed this problem with the data, the tools and the field's past failures, and so they took the matter into their own hands. They went out and found better tools. Hundreds of thousands of more college students depressed Over the past few years, several high-quality studies have come that can directly test whether social media causes depression. Instead of being murky and mixed, they support each other and show clear effects of social media. \"The body of literature seems to suggest that indeed, social media has negative effects on mental health, especially on young adults' mental health,\" says Makarin, who led what many scientists say is the best study on the topic to date. In that study, Makarin and his team took advantage of a once-in-a-lifetime opportunity: the staggered introduction of Facebook across U.S. colleges from 2004 to 2006. Facebook rolled out into society first on college campuses, but not all campuses introduced Facebook at the same time.  For Makarin and his colleagues, this staggered rollout is experimental gold.   \"It allowed us to compare students' mental health between colleges where Facebook just arrived to colleges where Facebook had not yet arrived,\" he says. They could also measure how students' mental health shifted on a particular campus when people started to spend a bunch of their time on social media. Luckily, his team could track mental health at the time because college administrators were also conducting a national survey that asked students an array of questions about their mental health, including diagnoses, therapies and medications for depression, anxiety and eating disorders. \"These are not just people's feelings,\" Makarin says. \"These are actual conditions that people have to report.\" They had data on a large number of students. \"The data comes from more than 350,000 student responses across more than 300 colleges,\" Makarin says. \n\n\nThis type of study is called a quasi-experiment, and it allows scientists to estimate how much social media actually changes teens' mental health, or as Makarin says, \"We can get causal estimates of the impact of Facebook on mental health.\" So what happened? \"Almost immediately after Facebook arrives on campus, we see an uptick in mental health issues that students report,\" Makarin says. \"We especially find an impact on depression rates, anxiety disorders and other questions associated with depression in general.\" And the effect isn't small, he says. Across the population, the rollout of Facebook caused about 2% of college students to become clinically depressed. That may sound modest, but with more than 17 million college students in the U.S. at the time, that means Facebook caused more than 300,000 young adults to suffer from depression.  For an individual, on average, engaging with Facebook decreases their mental health by roughly 22% of the effect of losing one's job, as reported by a previous meta-analysis, Makarin and his team found. Facebook's rollout had a larger effect on women's mental health than on men's mental  health, the study showed. But the difference was small, Makarin says. He and his colleagues published their findings last November in the American Economic Review. \"I love that paper,\" says economist  Matthew Gentzkow at Stanford University, who was not involved in the research. \"It's probably the most convincing study I've seen. I think it shows a clear effect, and it's really credible. They did a good job of isolating the effect of Facebook, which isn't easy.\" Of course, the study has limitations, Gentzkow says. First off, it's Facebook, which teens are using less and less. And the version of Facebook is barebones. In 2006, the platform didn't have a \"like\" button\" or a \"newsfeed.\" This older version probably wasn't as \"potent\" as social media now, says data scientist Chris Said. Furthermore, students used the platform only on a computer because smartphones weren't available yet. And the study only examined mental health impacts over a six-month period. \n\n\nNevertheless, the findings in this study bolster other recent studies, including one that Gentzkow led.  Social media is \"like the ocean\" for kids Back in 2018, Gentzkow and his team recruited about 2,700 Facebook users ages 18 or over. They paid about half of them to deactivate their Facebook accounts for four weeks. Then Gentzkow and his team looked to see how a Facebook break shifted their mental health. They reported their findings in March 2020 in the American Economic Review. This type of study is called a randomized experiment, and it's thought of as the best way to estimate whether a variable in life causes a particular problem. But with social media, these randomized experiments have big limitations. For one, the experiments are short-term — here only four weeks. Also, people use social media in clusters, not as individuals. So having individuals quit Facebook won't capture the effect of having an entire social group quit together. Both of these limitations could underestimate the impact of social media on an individual and community.  Nevertheless, Gentzkow could see how deactivating Facebook made people, on average, feel better. \"Being off Facebook was positive across well-being outcomes,\" he says. \"You see higher happiness, life satisfaction, and also lower depression, lower anxiety, and maybe a little bit lower loneliness.\"  Gentzkow and his team measured participants' well-being by giving them a survey at the end of the experiment but also asking questions, via text message, through the experiment. \"For example, we sent people text messages that say, 'Right now, would you say you're feeling happy or not happy,'\" he explains. Again, as with Makarin's experiment, the effect was moderate. Gentzkow and his colleagues estimate that temporarily quitting Facebook improves a person's mental health by about 30% of the positive effect seen by going to therapy. \"You could view that meaning these effects are pretty big,\" he explains, \"or you could also see that as meaning that the effects of therapy are somewhat small. And I think both of those things are true to an extent.\" \n\n\nScientists still don't know to what extent social media is behind the rising mental health issues among teenagers and whether it is the primary cause. \"It seems to be the case — like it's a big factor,\" says MIT's Alexey Makarin, \"but that's still up for debate.\" Still, though, other specifics are beginning to crystallize. Scientists are narrowing in on what aspects of social media are most problematic. And they can see that social media won't hurt every teen — or hurt them by the same amount. The data suggests that the more hours a child devotes to social media, the higher their risk for mental health problems.  Finally, some adolescents are likely more vulnerable to social media, and children may be more vulnerable at particular ages. A study published in February 2022 looked to see how time spent on social media varies with life satisfaction during different times in a child's life (see the graphic).  \n Loading...  \n\n\nThe researchers also looked to see if a child's present use of social media predicted a decrease of life satisfaction one year later. That data suggests two windows of time when children are most sensitive to detrimental effects of social media, especially heavy use of it. For girls, one window occurs at ages 11 through 13. And for boys, one window occurs at ages 14 and 15. For both genders, there's a window of sensitivity around age 19 — or near the time teenagers enter college. Amy Orben and her team at the University of Cambridge reported the findings in Nature Communications. This type of evidence is known as a correlative. \"It's hard to draw conclusions from these studies,\" Gentzkow says, because many factors contribute to life satisfaction, such as environmental factors and family backgrounds. Plus, people may use social media because they're depressed (and so depression could be the cause, not the outcome of social media use).  \"Nevertheless, these correlative studies, together with the evidence from the causal experiments, paint a picture that suggests we should take social media seriously and be concerned,\" Gentzkow adds. \n\n\nPsychologist Orben once heard a metaphor that may help parents understand how to approach this new technology. Social media for children is a bit like the ocean, she says, noting that it can be an extremely dangerous place for children. Before parents let children swim in any open water, they make sure the child is well-prepared and equipped to handle problems that arise. They provide safety vests, swimming lessons, often in less dangerous waters, and even then parents provide a huge amount of supervision.  Alyson Hurt created the graphic. Jane Greenhalgh and Diane Webber edited the story. \n\n\n\nGen Z\nsmartphones\nmental health\nsocial media\n\n\n\n\n\nFacebook\nFlipboard\nEmail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShots\nHealth News From NPR\n\n\n\n\n\n\n\n\nRead & Listen\n\nHome\nNews\nCulture\nMusic\nPodcasts & Shows\n\n\n\nConnect\n\nNewsletters\nFacebook\nInstagram\nPress\nContact & Help\n\n\n\nAbout NPR\n\nOverview\nDiversity\nAccessibility\nEthics\nFinances\nPublic Editor\nCorrections\n\n\n\nGet Involved\n\nSupport Public Radio\nSponsor NPR\nNPR Careers\nNPR Shop\nNPR Events\nNPR Extra\n\n\n\n\n\nTerms of Use\nPrivacy\nYour Privacy Choices\nText Only\n\n\n\n\n\n\n\n\n\n\n \n\n\nSponsor MessageBecome an NPR sponsor\n\n\n\n\n\n\n\n\n",
    "links": [
        "#mainContent",
        "https://help.npr.org/contact/s/article?name=what-are-the-keyboard-shortcuts-for-using-the-npr-org-audio-player",
        "/",
        "https://shopnpr.org",
        "/",
        "/sections/news/",
        "/sections/national/",
        "/sections/world/",
        "/sections/politics/",
        "/sections/business/",
        "/sections/health/",
        "/sections/science/",
        "/sections/climate/",
        "/sections/codeswitch/",
        "/sections/culture/",
        "/books/",
        "/sections/movies/",
        "/sections/television/",
        "/sections/pop-culture/",
        "/sections/food/",
        "/sections/art-design/",
        "/sections/performing-arts/",
        "/lifekit/",
        "/music/",
        "https://www.npr.org/series/tiny-desk-concerts/",
        "https://www.npr.org/series/1002643619/now-playing",
        "https://www.npr.org/sections/allsongs/",
        "https://www.npr.org/sections/music-features",
        "https://www.npr.org/series/770565791/npr-music-live-sessions",
        "/podcasts-and-shows/",
        "/programs/morning-edition/",
        "/programs/weekend-edition-saturday/",
        "/programs/weekend-edition-sunday/",
        "/programs/all-things-considered/",
        "/programs/fresh-air/",
        "/podcasts/510318/up-first/",
        "https://www.npr.org/podcasts/510368/taking-cover",
        "https://www.npr.org/podcasts/510357/louder-than-a-riot",
        "https://www.npr.org/podcasts/510317/its-been-a-minute",
        "https://www.npr.org/podcasts/510338/all-guides",
        "/podcasts-and-shows/",
        "/search/",
        "https://shopnpr.org",
        "/music/",
        "https://www.npr.org/series/tiny-desk-concerts/",
        "https://www.npr.org/series/1002643619/now-playing",
        "https://www.npr.org/sections/allsongs/",
        "https://www.npr.org/sections/music-features",
        "https://www.npr.org/series/770565791/npr-music-live-sessions",
        "/about/",
        "/diversity/",
        "/organization/",
        "/support/",
        "/careers/",
        "/connect/",
        "/press/",
        "/ethics/",
        "https://www.npr.org/sections/health-shots/",
        "/sections/health/126567525/your-health",
        "/sections/health/133188451/treatments-tests",
        "/sections/health/133188447/health-inc",
        "/sections/health/133188445/policy-ish",
        "/sections/health/133188449/public-health",
        "https://twitter.com/nprhealth",
        "https://www.npr.org/sections/health-shots/126567525/your-health",
        "https://www.npr.org/programs/all-things-considered/2023/04/25/1172001624/all-things-considered-for-april-25-2023",
        "https://www.npr.org/people/348778932/michaeleen-doucleff",
        "https://www.npr.org/people/348778932/michaeleen-doucleff",
        "https://ondemand.npr.org/anon.npr-mp3/npr/atc/2023/04/20230425_atc_the_truth_about_teens_social_media_and_the_mental_health_crisis.mp3?d=498&size=7981811&e=1171773181&t=progseg&seg=11&sc=siteplayer&aw_0_1st.playerid=siteplayer",
        "https://ondemand.npr.org/anon.npr-mp3/npr/atc/2023/04/20230425_atc_the_truth_about_teens_social_media_and_the_mental_health_crisis.mp3?d=498&size=7981811&e=1171773181&t=progseg&seg=11&sc=siteplayer&aw_0_1st.playerid=siteplayer",
        "https://www.npr.org/transcripts/1171773181",
        "https://media.npr.org/assets/img/2023/04/24/gettyimages-1211994928-b2102e34cbd7f03b4e62a7fb52b0a156da9383ca-s1200.jpg",
        "https://www.theatlantic.com/magazine/archive/2017/09/has-the-smartphone-destroyed-a-generation/534198/",
        "https://www.simonandschuster.com/books/Generations/Jean-M-Twenge/9781982181611",
        "https://www.google.com/search?q=alexey+makarin+MIT&rlz=1C1CHBD_en&oq=alex&aqs=chrome.0.69i59l2j69i57j0i433i512j46i433i512j69i60l3.889j0j4&sourceid=chrome&ie=UTF-8",
        "https://www.npr.org/sections/health-shots/2023/02/26/1159099629/teens-social-media-body-image",
        "https://www.npr.org/sections/health-shots/",
        "https://www.npr.org/sections/health-shots/2023/02/26/1159099629/teens-social-media-body-image",
        "https://www.pewresearch.org/internet/2022/08/10/teens-social-media-and-technology-2022/",
        "https://www.npr.org/sections/health-shots/2023/02/13/1156663966/teen-girls-and-lgbtq-youth-plagued-by-violence-and-trauma-survey-says",
        "https://www.npr.org/sections/health-shots/",
        "https://www.npr.org/sections/health-shots/2023/02/13/1156663966/teen-girls-and-lgbtq-youth-plagued-by-violence-and-trauma-survey-says",
        "https://www.npr.org/sections/health-shots/2023/02/13/1156663966/teen-girls-and-lgbtq-youth-plagued-by-violence-and-trauma-survey-says",
        "https://www.pewresearch.org/internet/fact-sheet/mobile/",
        "https://chris-said.io/",
        "https://www.npr.org/sections/mental-health/",
        "https://www.npr.org/2023/02/13/1156610138/the-mental-health-of-teen-girls-and-lgbtq-teens-has-worsened-since-2011",
        "https://amyorben.com/",
        "https://amyorben.com/uploads/thesis/index.html#moral-panics",
        "https://www.aeaweb.org/articles?id=10.1257/aer.20211218",
        "https://www.matthewgentzkow.com/",
        "https://www.aeaweb.org/articles?id=10.1257/aer.20190658",
        "https://www.nature.com/articles/s41467-022-29296-3",
        "https://www.npr.org/tags/698359344/gen-z",
        "https://www.npr.org/tags/144972132/smartphones",
        "https://www.npr.org/tags/127779829/mental-health",
        "https://www.npr.org/tags/125099514/social-media",
        "https://www.npr.org/sections/health-shots/",
        "/",
        "/sections/news/",
        "/sections/culture/",
        "/music/",
        "/podcasts-and-shows",
        "/newsletters/",
        "https://www.facebook.com/NPR/",
        "https://www.instagram.com/npr/",
        "/press/",
        "https://help.npr.org/contact/s/",
        "/about/",
        "/diversity/",
        "/about-npr/1136563345/accessibility",
        "/ethics/",
        "/about-npr/178660742/public-radio-finances",
        "/sections/publiceditor/",
        "/corrections/",
        "/support/",
        "/about-npr/186948703/corporate-sponsorship",
        "/careers/",
        "https://shopnpr.org/",
        "https://www.nprpresents.org",
        "/sections/npr-extra/",
        "/about-npr/179876898/terms-of-use",
        "/about-npr/179878450/privacy-policy",
        "/about-npr/179878450/privacy-policy#yourchoices",
        "https://text.npr.org/",
        "/about-npr/186948703/corporate-sponsorship"
    ]
}