{
    "title": "Clery Act Compliance | Compliance",
    "body": "\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\nChief Compliance Office\n\n\n\n\n\nUCR Home\n\n\n\n\n\n\n\ndepartments & programs\n\n\nAudit\n\n\nOffice of Title IX, Equal Opportunity & Affirmative Action\n\n\nInvestigations & Complaint Resolution\n\n\nUC Ethics & Compliance Program\n\n\nClery Act Compliance\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUC Riverside\n\n\n\n\n Compliance \n\n\n\nIntegrity and Accountability\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nHome\n\n\nComplaint Resolution & Investigations\n\n\nPolicies\n\n\nDelegations\n\n\nConflicts of Interest\n\n\nPrivacy Program\n\n\nData and Reports\n\n\nTitle IX/EOAA\n\n\n\n\n\n\n\nUCR Home\n\n\n\n\n\n\n\ndepartments & programs\n\n\nAudit\n\n\nOffice of Title IX, Equal Opportunity & Affirmative Action\n\n\nInvestigations & Complaint Resolution\n\n\nUC Ethics & Compliance Program\n\n\nClery Act Compliance\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreadcrumb\n\n\n\n\n\n\n\n\n \n\nClery Act Compliance\n\n\n\n\n\n\n\n\nClery Act Compliance\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOverview\nThe Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act of 1998, commonly referred to as the “Clery Act,” is a federal law that requires each university receiving federal financial aid to annually compile and report specific crime and fire statistics for the university campus and to provide other safety and crime information to members of the campus community.  The Clery Act also requires universities to:\n\nHave emergency response programs, including evacuation procedures for students. \nNotify the community of emergencies and issue warnings of threats.\nMaintain a daily crime log and a fire log.\nHave policies and procedures relating to sexual assault, dating and domestic violence, and stalking. \n\nThe Office of the President has online resources about the Clery Act including operational requirements and crime reporting. \n\nFor questions or comments about the accessibility of this webpage, please contact Clery Coordinator at clery@ucr.edu. \n\n\n\n\n\n\n\n\n\nClery Resources\n\n \n\n\n\n\n\n\n            Annual Security and Fire Safety Report    \n\nThe Clery Act requires universities to collect and publish information about safety and security-related policies and programs, as well as information about certain crimes reported on campus (or other Clery Act geography) and fire safety.  The latest Annual Security and Fire Safety Report is available for review. \n\n2022 Annual Security & Fire Safety Report (new)\n2021 Annual Security & Fire Safety Report, Revised June 2022\n2021 Annual Security & Fire Safety Report \n2020 Annual Security & Fire Safety Report \n\n\n\n\n\n\n\n\n            Campus Security Authorities (CSAs)    \n\n“Campus security authority” or CSA, is a Clery-specific term that encompasses four groups of individuals and organizations associated with an institution. In addition to the UC Police Department, the following are Campus Security Authorities:\n\nIndividuals with Campus Security Responsibility- for example, parking information kiosk operators, parking enforcement staff, bicycle patrol staff, campus safety escort staff, and campus security staff for events held at campus theaters and spectator athletic events held in campus facilities.\nOfficials with Significant Responsibility for Student and Campus Activities- campus officials who manage or otherwise oversee student and campus activities, for example, staff responsible for campus student housing, a student center, or student extra-curricular activities; a director of athletics or a team coach; faculty advisors to student groups; staff responsible for student discipline, and campus judicial staff.\nOther Designated Individuals-any individual or organization identified in the Annual Security and Fire Safety Report or other campus policies as an individual or organization to which students and employees should report criminal offenses. The Title IX Officers is an example of this type of CSA.\n\nIdentification of CSAs\nIndividuals who have been identified as CSAs will be notified of their role through an annual notification and assignment of the \"Clery Act Training for Campus Security Authorities\" online training module. The Clery Act Coordinator is responsible for ensuring that CSAs are aware of their responsibilities and submit periodic statistics on any crimes that have been reported to them.\nReporting\nReports should be made immediately, or as soon as possible, by contacting either UCRPD or the Clery Act Coordinator. Prompt and accurate reporting is encouraged in order for the University to comply with Timely Warning regulations. For active threats, concerns, or emergencies, please contact UCPD by dialing 911. To report non-emergency Clery Act crimes directly to the Clery Act Coordinator, please submit a CSA Reporting Form. \nReporting Form\nTraining\nAs of August 2018, the new system-wide Clery Act Training was made available through UC Learning Center (LMS) by the UC Office of Ethics, Compliance, and Audit Services (ECAS). It is the policy of the University to train CSAs in their responsibilities. The Clery Act Coordinator is responsible for ensuring that all CSAs are assigned this training. \n \n\n\n\n\n            Clery Act Geography    \n\nThe Clery Act requires colleges and universities to disclose crime statistics based on specific geographic parameters. Statistics must be disclosed for the following areas (Department of Education, 2016):\n\nOn-campus, 34 CFR 668.46(a):\n\n\t\nAny building or property owned or controlled by an institution within the same reasonably contiguous geographic area and used by the institution in direct support of, or in a manner related to, the institution’s educational purposes, including residence halls; and\nAny building or property that is within or reasonably contiguous to paragraph (1) of this definition, that is owned by the institution but controlled by another person, is frequently used by students, and supports institutional purposes (such as a food or other retail vendor).\n\n\nOn-campus Student Housing, 34 CFR 668.41(a):\n\t\nAny student housing facility that is owned or controlled by the institution, or is located on property that is owned or controlled by the institution, and is within the reasonably contiguous geographic area that makes up the campus is considered an on-campus student housing facility.\n\n\nPublic Property, 34 CFR 668.46(a):\n\t\nAll public property, including thoroughfares, streets, sidewalks, and parking facilities, that is within the campus, or immediately adjacent to and accessible from the campus.\n\n\nNon-campus, 34 CFR 668.46(a):\n\t\nAny building or property owned or controlled by a student organization that is officially recognized by the institution; or Any building or property owned or controlled by an institution that is used in direct support of, or in relation to, the institution’s educational purposes, is frequently used by students, and is not within the same reasonably contiguous geographic area of the institution.\n\n\n\nFor specific information regarding UC Riverside Clery Act Geography, please contact the Clery Act Compliance Coordinator.\n\n\n\n\n            Clery Act Crimes    \n\nThe Clery Act requires institutions to include four general categories of crimes statistics: Criminal Offenses, Hate Crimes, VAWA Offenses, and Arrests and Referrals for Disciplinary Action. Definitions were taken from the Handbook for Campus Safety and Security Reporting (Department of Education, 2016). Please note that these definitions are not identical to definitions used in California law or definitions used in UCR policies.\nCriminal Offenses\n\nCriminal Homicide\n\nMurder and Non-Negligent Manslaughter: the willful (non-negligent) killing of one human being by another.\nManslaughter by Negligence: the killing of another person through gross negligence.\n\n\nSexual Assault (Sex Offenses): Any sexual act directed against another person, without consent of the victim, including instances where the victim is incapable of giving consent.\n\t\nRape: the penetration, no matter how slight, of the vagina or anus, with any body part or object, or oral penetration by a sex organ of another person, without the consent of the victim. This offense includes the rape of both males and females.\nFondling: the touching of the private body parts of another person for the purpose of sexual gratification, without the consent of the victim, including instances where the victim is incapable of giving consent because of his/her age or because of his/her temporary or permanent mental incapacity.\nIncest: sexual intercourse between persons who are related to each other within the degrees wherein marriage is prohibited by law.\nStatutory Rape: sexual intercourse with a person who is under the statutory age of consent.\n\n\nRobbery: the taking or attempting to take anything from value of the care, custody or control of a person or persons by force or threat of force or violence and/or by putting the victim in fear.\nAggravated Assault: an unlawful attack by one person upon another for the purpose of inflicting severe or aggravated bodily injury. This type of assault usually is accompanied by the use of a weapon or by means likely to produce death or great bodily harm.\nBurglary: the unlawful entry of a structure to commit a felony or a theft. An incident must meet three conditions to be classified as a Burglary:\n\t\nThere must be evidence of unlawful entry (trespass). This means that the person did not have the right to be in the structure at the time the incident occurred.\nThe unlawful entry must occur within a structure, which is defined as having four walls, a roof, and a door.\nThe structure was unlawfully entered to commit a felony or a theft.\n\n\nMotor Vehicle Theft: the theft or attempted theft of a motor vehicle.\nArson: any willful or malicious burning or attempt to burn, with or without intent to defraud, a dwelling house, public building, motor vehicle or aircraft, personal property of another, etc.\n\nHate Crimes\nA hate crime is a criminal offense that manifests evidence that the victim was intentionally selected because of the perpetrator’s bias against the victim. Bias is a preformed negative opinion or attitude toward a group of persons based on their race, gender/gender identity, religion, disability, sexual orientation or ethnicity/national origin.\nHate crimes include all the Clery Act crimes defined in the Criminal Offenses section, if there is evidence that a victim was chosen based on a category of bias. The following additional crimes are also hate crimes, again if there is evidence that a victim was chosen based on a perpetrator’s bias:\n\nLarceny-Theft: the unlawful taking, carrying, leading, or riding away of property from the possession or constructive possession of another. (Larceny and theft mean the same thing in the Uniform Crime Reporting)\n\n\t\nConstructive possession is the condition in which a person does not have physical custody or possession, but is in a position to exercise dominion or control over a thing.\n\n\nSimple Assault: an unlawful physical attack by one person upon another where neither the offender displays a weapon, nor the victim suffers obvious severe or aggravated bodily injury involving apparent broken bones, loss of teeth, possible internal injury, severe laceration, or loss of consciousness.\nIntimidation: to unlawfully place another person in reasonable fear of bodily harm through the use of threatening words and/or other conduct, but without displaying a weapon or subjecting the victim to actual physical attack.\nDestruction/Damage/Vandalism of Property: to willfully or maliciously destroy, damage, deface, or otherwise injure real or personal property without the consent of the owner or the person having custody or control of it.\n\nBias Categories\n\nRace: a preformed negative attitude toward a group of persons who possess common physical characteristics, e.g., color of skin, eyes, and/or hair; facial features, etc., genetically transmitted by descent and heredity which distinguish them as a distinct division of humankind.\nReligion: a preformed negative opinion or attitude toward a group of persons who share the same religious beliefs regarding the origin and purpose of the universe and the existence or nonexistence of a supreme being.\nSexual Orientation: a preformed negative opinion or attitude toward a group of persons based on their actual or perceived sexual orientation.\nGender: a preformed negative opinion or attitude toward a person or group of persons based on their actual or perceived gender, e.g., male or female.\nGender Identity: a preformed negative opinion or attitude toward a person or group of persons based on their actual or perceived gender identity, e.g., bias against transgender or gender non-conforming individuals.\nEthnicity: a preformed negative opinion or attitude toward a group of people whose members identify with each other, through a common heritage, often consisting of a common language, common culture (often including a shared religion) and/or ideology that stresses common ancestry.\nNational Origin: a preformed negative opinion or attitude toward a group of people based on their actual or perceived country of birth.\nDisability: a preformed negative opinion or attitude toward a group of persons based on their physical or mental impairments/challenges, whether such disability is temporary or permanent, congenital or acquired by heredity, accident, injury, advanced age or illness.\n\n \n\n\nViolence Against Women Act (VAWA) Crimes\n\nDating Violence: violence committed by a person who is or has been in a social relationship of a romantic or intimate nature with the victim. The existence of such a relationship shall be determined based on the reporting party’s statement and with consideration of the length of the relationship, the type of relationship, and the frequency of interaction between the persons involved in the relationship. Dating violence includes, but is not limited to:\n\n\t\nSexual or physical abuse or the threat of such abuse.\nDating violence does not include acts covered under the definition of domestic violence.\n\n\nDomestic Violence: a felony or misdemeanor crime of violence committed by:\n\t\na current or former spouse or intimate partner of the victim;\na person with whom the victim shares a child in common;\na person who is cohabitating with, or has cohabitated with, the victim as a spouse or intimate partner;\na person similarly situated to a spouse of the victim under the domestic or family violence laws of the jurisdiction in which the crime of violence occurred;\nany other person against an adult or youth victim who is protected from that person’s acts under the domestic or family violence laws of the jurisdiction in which the crime of violence occurred.\n\n\nStalking: engaging in a course of conduct directed at a specific person that would cause a reasonable person to:\n\t\nfear for the person’s safety or the safety of others; or\nsuffer substantial emotional distress.\n\n\n\nFor the purpose of this definition, course of conduct means two or more acts, including, but not limited to, acts in which the stalker directly, indirectly, or through third parties, by any action, method, device, or means, follows, monitors, observes, surveils, threatens, or communicates to or about a person, or interferes with a person’s property.\nArrests and Referrals for Disciplinary Action\nInstitutions must also report statistics for violations of the law that occur on Clery Act geography and result in arrests or persons being referred for disciplinary action. These do not include violations of UCR policies that may have resulted in persons being referred for disciplinary action if there was no violation of the law (i.e. a student of legal drinking age violates a “dry campus” policy).\n\nArrest: persons processed by arrest, citation, or summons.\nReferred for Disciplinary Action: the referral of any person to any official who initiates a disciplinary action of which a record is established and which may result in the imposition of a sanction.\n\nThe three categories for which we report statistics regarding arrests and referrals for disciplinary action include:\n\nWeapons (Carrying, Possessing, Etc.): the violation of laws or ordinances prohibiting the manufacture, sale, purchase, transportation, possession, concealment, or use of firearms, cutting instruments, explosives, incendiary devices or other deadly weapons. This classification encompasses weapons offenses that are regulatory in nature.\nDrug Abuse Violations: the violation of laws prohibiting the production, distribution and/or use of certain controlled substances and the equipment or devices utilized in their preparation and/or use. The unlawful cultivation, manufacture, distribution, sale, purchase, use, possession, transportation or importation of any controlled drug or narcotic substance. Arrests for violations of state and local laws, specifically those relating to the unlawful possession, sale, use, growing, manufacturing and making of narcotic drugs.\nLiquor Law Violations: the violation of state or local laws or ordinances prohibiting the manufacture, sale, purchase, transportation, possession or use of alcoholic beverages, not including driving under the influence and drunkenness.\n\n \n\n\n\n\n            Clery Act Policies    \n\n\nUC Clery Act Policy - Campus Safety and Security Reporting\nUCR's Timely Warning Notice Policy & Procedures \n\n\n\n\n\n\n            Clery Act Coordinator    \n\n\n\nUC Riverside's Clery Act Coordinator is Olga Snopok, clery@ucr.edu, (951) 827-6223.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nUniversity of California, Riverside\n\n900 University Ave.\n            Riverside, CA 92521\nTel: (951) 827-1012\n\n\nUCR Library\nCampus Status\nCampus Store\nCareer Opportunities\nDiversity\nMaps and Directions\nVisit UCR\n\n\n\n\n\nChief Compliance Office\n\n             365 Skye Hall\n            900 University Ave.             Riverside, CA 92521             \n tel: (951) 827-6223 \n\n\n\n\n\nRelated Links\n\n\nTitle IX at UCR\n\nUC Office of Ethics, Compliance and Audit Services\n\nWhistleblower Hotline (Systemwide)\n\n\n\n\n\n\n\nNewsletter\nSign up for our monthly newsletter.\n\nE-mail address:\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy and Accessibility\nTerms and Conditions\n© 2023 Regents of the University of California\n\n\n\n\n\n\n\n\n\n\n×\n\n\n\n\n\n\nLet us help you with your search\n\n\nEnter your Search Criteria.\n\n\n\nSearch\n\n\nCancel\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://compliance.ucr.edu",
        "https://www.ucr.edu",
        "",
        "http://audit.ucr.edu/",
        "/office-title-ix-equal-opportunity-affirmative-action",
        "/investigations-complaint-resolution",
        "/ethics-compliance-program",
        "/clery-act-compliance",
        "/",
        "/",
        "/",
        "/investigations-complaint-resolution",
        "/policies",
        "/delegations-authority",
        "/conflicts-interest",
        "/privacy-program",
        "/data-and-reports",
        "https://compliance.ucr.edu/office-title-ix-equal-opportunity-affirmative-action",
        "https://www.ucr.edu",
        "",
        "http://audit.ucr.edu/",
        "/office-title-ix-equal-opportunity-affirmative-action",
        "/investigations-complaint-resolution",
        "/ethics-compliance-program",
        "/clery-act-compliance",
        "/",
        "https://www.ucop.edu/ethics-compliance-audit-services/compliance/clery-act/index.html",
        "mailto:clery@ucr.edu",
        "#annual_security_and_fire_safety_report",
        "https://live-ucr-compliance.pantheonsite.io/document/2022-annual-security-fire-safety-report",
        "https://live-ucr-compliance.pantheonsite.io/document/2022-annual-security-fire-safety-report",
        "/document/2021-annual-security-fire-safety-report-revised-june-2022",
        "/document/2021-annual-security-fire-safety-report",
        "/document/2020-annual-security-fire-safety-report",
        "#campus_security_authorities_csas",
        "https://police.ucr.edu/",
        "mailto: clery@ucr.edu",
        "mailto:clery@ucr.edu",
        "/document/csa-reporting-form-fillable",
        "https://ucrlearning.ucr.edu/",
        "#clery_act_geography",
        "mailto: clery@ucr.edu",
        "#clery_act_crimes",
        "#clery_act_policies",
        "https://policy.ucop.edu/doc/1100669/Clery",
        "/document/timely-warning-policy",
        "#clery_act_coordinator",
        "mailto:clery@ucr.edu",
        "https://library.ucr.edu/",
        "https://campusstatus.ucr.edu/",
        "https://ucr.bncollege.com/shop/ucr/home",
        "https://jobs.ucr.edu",
        "https://diversity.ucr.edu/",
        "https://campusmap.ucr.edu/",
        "https://www.ucr.edu/about/visitors",
        "https://campusmap.ucr.edu",
        "http://titleix.ucr.edu",
        "https://www.ucop.edu/ethics-compliance-audit-services/index.html",
        "https://secure.ethicspoint.com/domain/media/en/gui/23531/index.html",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}