{
    "title": "watershedcsuc | Watershed Review | Page 2",
    "body": "\n\n\n\n\n\n\n\nWatershed Review\nEst. 2012\n\n\n\n\nMenu\n\nSkip to content\n\nHomeAbout This Blog\nHistory\nSubmit\n\n\n\n\n\n\n\t\t\t\t\tAuthor Archives: watershedcsuc \n\n\n\nWriter’s Voice Spotlight: Michelle Tea \n\n\nMichelle Tea, author of the newly minted Against Memoir: Complaints, Confessions & Criticisms (Feminist Press, 2018), excels in bringing together her transgressive worldview with the kind of wit and humor that help readers inconspicuously tackle tough subjects like financial struggle, self care, and what it means to truly be an adult—and you’d be surprised what that includes, because adulthood isn’t always about living in a nice clean home and having your entire life in order; sometimes it’s being 40 and living with a bunch of 20-year-olds with a penchant for partying. Michelle got her start like many of us: writing and hoping for the best, even when sometimes the “best” takes us down a path we didn’t prepare for. Tea doesn’t hold back in her work as she navigates what being a person trying to stay true to themselves means.\nIn the 90’s, Michelle found herself overwhelmingly surrounded by the testosterone and misogyny found in the literary community. Instead of retreating, she decided to take the initiative, grab the literary community by the balls, and create her own open mic with friend Sini Anderson. This new program, called Sister Spit, strove to create a place for the queer literary community to gather and share their spoken word. Tea’s inspiration to start the group started with questioning:\n“Where are all the other queer female writers?…They’re not coming cause they don’t feel welcome and it makes sense that they don’t feel welcome. You had to really fight for a space there” (Michelle Tea, Electric Literature).\nAlthough Sister Spit was originally geared towards cis women in the queer community, the fluidity of gender and the social acceptance emerging in the past years have pushed Sister Spit to widen their audience and participant demographics to engage people from all walks of life, so long as they vibe with their original message of “feminism, queerness, humor and provocation.”\nIn 2003, Michelle created Radar Productions to give the queer community of San Francisco  access to free and affordable literary arts programs that they weren’t finding in the male-saturated literary community. This nonprofit organization still hosts a traveling Sister Spit tour every year, featuring authors like MariNaomi, Wo Chan, Jay Dodd, and Virgie Tovar. In addition to her work with Radar Productions and Sister Spit, Michelle Tea is the curator for Amethyst Editions, a Feminist Press Imprint, and continues to strive to unapologetically share her art and create an inclusive environment for the queer literary community.\nMichelle Tea’s new, razor-sharp essay collection, Against Memoir: Complaints, Confessions & Criticisms, reflects on the cultural artifacts that have challenged and calibrated her against the world. She writes on “Art and Music,” “Love and Queerness,” and her usual spectrum, “Writing and Life.” In her writing, Michelle is someone we all can easily relate to. From pondering her personal struggles, to demonstrating what life means to her, Tea’s life stories allow us to truly understand how our own unique situations are what define us. Her fearless reflection on times of previous struggle has allowed her to see her growth and acceptance, which is something we all can take from. Tea has a knack for slaying her inner demons and conveying her stories to the audience in the most comical way possible. Her overall style makes people think that we can still find light even in the darkest of situations. \nAgainst Memoir rebels against the traditional autobiographical text we have seen in Tea’s previous works. In this essay collection, she interweaves her thoughts and experiences with film, books, and important figures to move past a singular narrative into a collective one about our time. Some of the pieces within the collection have been published from previous speeches, readings, and talks, including one from 2016 at Butte College. Within her work, she keeps her readers entranced with her powerful yet quirky assertions all while offering herself as a model for activism. In her essay, “The City to a Young Girl,” she says, “I guess that’s my issue with writing as activism: how hard it is for it to change the actual systems that oppress and limit and kill.” Through her writing we see a queer woman who fights for the freedom of those who are chained by the stigma of social and political views. \nOther works by Michelle Tea include Valencia—which has received the Lambda Literary Award for Best Lesbian Fiction, and was adapted into a movie in 2013—and the young adult fantasy trilogy Mermaid In Chelsea Creek, among many others. \nPlease join us for an exciting evening with Michelle Tea this Monday, October 8th at 7:30 in PAC 134 for a reading from Against Memoir, a Q&A, and book signing. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nWritten by Emily Ribeiro and Jazmin Gomez\n \n\n \n\nOctober 6, 2018watershedcsuc\nLeave a comment\n\n\n\n\nWR Editor Blog: Marta Shaffer \n\n“Not Fucking Fixed in Place”: A Eulogy for My Dad\n\n\nOf course, this is not a real eulogy. My dad did pass away, three weeks ago from when I first started writing this. And I was prepared to write his eulogy, had even asked a friend for examples of eulogies she had written to use as a basis, because I had never written one before. My sister and I had agreed we would deliver it together, every other paragraph, but I would craft the words.\nBut I never wrote the eulogy for his funeral, and the reason is this: my dad was an independent thinker until the end. Take, for example, the only thing of his I took home to California with me from Minnesota. My mom said it was the last purchase he made: a coffee mug that has a list of English words and phrases that, grammatically, are often confused. “You’re” and “Your,” “They’re” “Their” and “There,” etc. For each word or phrase, the coffee mug provides an explanation of its proper use—but each explanation incorporates the expletive fuck. \n“You’re = You Fucking Are. Your = Shows Fucking Possession.”\n“Could’ve = Could Fucking Have. Could Of = You’re a Fucking Idiot.”\nI took the coffee mug because my dad, like lots of fathers, had sayings he would use over and over again. The world is just a bunch of assholes and idiots, was one of his favorites. Don’t take any wooden nickels, another expression of his general distrust in humanity. But a lot of them were also grammar-related, because my dad, like his dad, had a deep love of English, and he took any accidental misuse of it not only as an assault against language as an institution, but also as some kind of personal insult. Thus, as a child, if I finished my dinner and announced, I’m done! my dad would clear my plate and reply, Cakes are ‘done,’ people are ‘finished.’ A lesson in superlatives was squeezed into a rhyme that I hope to someday cross-stitch onto a pillow: Good better best, never let it rest—until your good is better, and your better is best. If I ever used a word incorrectly, my dad would let me know immediately, and tell me to Go look it up in your Funk & Wagnall’s. And if in a fit of teenage rage I ever said, YOU’RE the one that’s being unfair! he surely would have replied, who’s.\nThat coffee mug is sarcastic, hilarious, smart and irreverent, just like my dad. And it’s completely fitting that it’s the last purchase he ever made. This is the man whose last email to the family from his deathbed was not to express remorse or love or final wishes—but to complain about Trump. trump thinks Jackson would have prevented the civil war, per a CNN report tonight. Don’t know trump’s point on that. going off the deep end, he is. And the entire reason why I never delivered his eulogy was because he never had a funeral—he expressly told my mother and my aunt that he did not want one.\nHalf of the reason he never had a funeral was because he had his body donated to science, which I find incredibly cool. The other half is because around the age of sixty-three, my dad stopped believing in God. After growing up the son of an Episcopalian reverend, as an altar boy in an Episcopalian church, and living his adulthood as the brother of an Episcopalian reverend—believing in the Bible and practicing the golden rule his entire life—my dad decided in his twilight years that it was bogus. I talked to him pretty extensively about it, because where most people would seek comfort in religion at his age, my dad rejected any promise of an afterlife, because it stopped making sense to him.   After years of struggles, he no longer saw any evidence that Jesus was looking out for him, and rather than dig his heels into the dirt and insist that Episcopalism was going to save him someday, he simply changed his mind.\nI saw his flexibility of heart at another very poignant moment between the two of us. He was so proud when, as a grad student at Chico State, I was hired to teach freshman composition, a class where first-year students are taught how to write academic papers. He assumed his progeny was going to make sure that teenagers in California would know that cakes are ‘done,’ people are ‘finished.’ And in a heartbreaking conversation, I had to explain to my dad that grammar is no longer taught to first-year college students.\nThen how do they learn to WRITE? he asked incredulously.\nI described how we are taught to edit their papers for organization and clarity, how forming an argument and supporting it with facts is top priority. But if we see grammar that is not prescriptive, we are not supposed to alter it unless it’s unclear writing.\n“Prescriptive”? he asked.\n“Proper English,” I said. For example, a student growing up in a household where both English and Spanish are spoken likely uses a form of English that old-school grammarians wouldn’t consider “correct,” but as instructors we honor whatever language they use, as long as their ideas are clear.\nAnd you agree with this?\nI didn’t at first, but now I do. My dad sighed. It took a few more conversations, but in the end, he actually came around. He was able to accept that his ideas of language—concepts that to him were literally more holy than religion—were changing, and he was willing to change with them.\nThis is what I mean when I say that my dad was an independent thinker until the end. I hope, if I have learned anything from him, it’s how to be a cork in the stream, to bend and not break, to be elastic in my ideas forever, and to keep a sense of humor through it all. Because there is a vital difference between losing, and being loose.  Or, as his coffee cup will remind us:\n“Lose = Cease to Fucking Keep. Loose = Not Fucking Fixed in Place.”\n \nWritten by Marta Shaffer (with unwavering help from Jenna Roebuck)\n\n\n \n\nJanuary 22, 2018watershedcsuc\nLeave a comment\n\n\n\n\n2017 Pushcart Prize Nominations \n\n\n\nWatershed Review is pleased to announce our nominations for the 2017 Pushcart Prize  Anthology. Thank you to our contributors for the honor of featuring their work in the Spring and (upcoming) Fall 2017 issues!\n\nSpring 2017 Issue:\n“Einstein’s Streetcar,” by Stan Sanvel Rubin (poetry)\n“Tuning Your American Dream” by Ken Poyner (nonfiction)\n“Blogging for Success in Motherhood & Life,” by MaryRose Lovgren (fiction)\nFall 2015 Issue (forthcoming):\n“Forest // Trees,” by John Sibley Williams (poetry)\n“Under Construction” Anya Vostrova (nonfiction)\n“Useless Prey” Jennifer Popa (fiction)\n \n(Artwork by Roger Salucci)\n \n\n\n\n\n\nDecember 1, 2017watershedcsuc\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Rob Davidson \n\n\nOur next author for Writer’s Voice is our very own Rob Davidson, professor of creative writing and American literature at Chico State. Rob will be reading from his newest publication Spectators: Flash Fictions (Five Oaks Press, 2017). Kirkus Reviews has praised Spectators as “A small but mighty collection of textual snapshots… Flash fiction at its best that’s definitely worth a look.” Indeed, the collection of micro wonders has been nominated for Pulitzer Prize.\nRob talks about his writing process for Spectators in The Story Prize. The collection was inspired by photography and visual art of Stephani Schaefer, Sara G. Umemoto, and Tom Patton. He started off with ekphrastic exercises, simply literary responses to artistic production before trimming each piece down. This process, as I recalled Rob saying at his first reading at Arabica Café downtown Chico, allowed him to realize what was essential. By compacting each piece to less than a page, truly, each word is important and every line shines.\nThis work moves from the lyrical to the narrative and to the meta, reminding us that, just like memories, we may not remember moments in their entirety. We remember only certain instances or details. Rob expertly draws out those kinds of details to ground us in familiarity, something different, and gifts us with something we had not quite noticed before. After all, “We are spectators…We exist both to observe and be observed.”\nDavidson’s previous story collections are The Farther Shore (Bear Star, 2012) and Field Observations (Missouri, 2001). He is also the author of a monograph, The Master and the Dean: The Literary Criticism of Henry James and William Dean Howells (Missouri, 2005). His fiction, essays and interviews have appeared in Zyzzyva, Hayden’s Ferry Review, Indiana Review, New Delta Review, South Dakota Review, and elsewhere. Davidson’s honors include a Fulbright U.S. Senior Scholar award to lecture in Taiwan (2015-2016), the Camber Press fiction award, judged by Ron Carlson, and an AWP Intro Journals Project Award in fiction.\nPlease join us for an exciting evening with Rob Davidson, this Thursday at 7:30 pm Colusa 100B. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nWritten by Jer Xiong\n\n\nOctober 16, 2017watershedcsuc CSUC, fiction, rob davidson, spectators, Writer's Voice\nLeave a comment\n\n\n\n\n2017 Best of the Net Nominations \n\nWatershed Review is pleased to nominate the following poetry and prose for the 2017 Best of the Net anthology. Good luck to all of our contributors!\nPoetry: \nArfah Daud, “Dried Fruit” (Spring 2017): http://www.csuchico.edu/watershed/2017-spring/poetry/daud-arfah.shtml\nNate Pritts, “No Dissonant Sound” (Spring 2017): http://www.csuchico.edu/watershed/2017-spring/poetry/pritts-nate.shtml\nDavid Moody, “Mythology” (Spring 2017): http://www.csuchico.edu/watershed/2017-spring/poetry/moody-david.shtml\nStan Sanvel Rubin, “Einstein’s Streetcar” (Spring 2017): http://www.csuchico.edu/watershed/2017-spring/poetry/rubin-stan-sanvel.shtml\nPaulette Beete, “Freddy Gray Breaks Free” (Fall 2016): http://www.csuchico.edu/watershed/2016-fall/poetry/beete-paulette.shtml\nCrystal Boson, “what it is to be a white man” (Fall 2016): http://www.csuchico.edu/watershed/2016-fall/poetry/boson-crystal.shtml\nFiction:\nJosh Patrick Sheridan, “Zeal” (Spring 2017): http://www.csuchico.edu/watershed/2017-spring/fiction/sheridan-josh-patrick.shtml\nKen Poyner, “The Disappearance” (Fall 2016): http://www.csuchico.edu/watershed/2016-fall/fiction/poyner-ken.shtml\nNonfiction: \nLita Kurth, “Are We Not Ladies?” (Spring 2017): http://www.csuchico.edu/watershed/2017-spring/nonfiction/kurth-lita.shtml\nJason Arment, “The Oaths We Keep” (Fall 2016): http://www.csuchico.edu/watershed/2016-fall/nonfiction/arment-jason.shtml\n \n\n\nSeptember 28, 2017watershedcsuc Best of the Net, CSUC, fiction, nonfiction, poetry, Watershed Review\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Naomi J. Williams \n\n\nCSU, Chico’s Writer’s Voice reading series is pleased to welcome fiction writer Naomi J. Williams on Thursday, April 6th.\nWe are proud to host a reading of Williams’ debut novel, Landfalls. A captivating integration of fiction and history, Landfalls tells the story of the star-crossed expeditions of the French ships Boussole and Astrolabe in 1785. Told through the perspectives of sailors, native peoples, family members, and many others, the ships’ journeys give an imagined voice to a little known history.\nA native of Japan, Naomi Williams spoke no English until she was six years old. Her writing has been featured in Zoetrope: All-Story, A Public Space, One Story, The Southern Review, The Gettysburg Review and even earned her a Pushcart Prize. Williams holds a MA in creative writing from UC Davis, where she now teaches. As well, she serves as co-director of the literary series Stories on Stage Davis. Landfalls has been long-listed for the Center for Fiction First Novel Prize and the National Book Critics Circle’s John Leonard Award.\nWhen asked what inspired Landfalls, Williams tells interviewers that the idea came from an old map of the Lapérouse expedition given to her by her husband. This stirred her idea for a multi-narrative collection of stories that would build the expedition from “voices we don’t usually hear.” Williams writes extensively of the map and how it inspired her on her blog.\nWilliams’ debut work has been praised for her research and historical accuracy. She challenged herself to veer from the historical narrative as little a possible and found creative inspiration in the historical accounts. It is no doubt she is a lover of history and it shows through her profound retelling of the Lapérouse expedition.\nReading Landfalls will reopen your eyes to history and leave you wondering how your favorite historical figures, and the people around them, felt at crucial points in the past, or pondering what inspired them to do what they did. Williams’ own exploratory instinct links her and her historical characters in Landfalls. Her wonder-filled story may awaken your own investigative impulse and guide your future reading experience. Williams is currently hard at work on several writing projects, including a novel based on the early 20th-century Japanese poet Yosano Akiko.\nPlease join us for an exciting evening with Naomi J. Williams, Thursday at 7:30 pm in the Zingg Recital Hall (ARTS 150). Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nBy Kennedi Turner\nRead an Excerpt and Interview \nRead a New York Times Book Review\n\n\nApril 5, 2017watershedcsuc\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Robert Krut \n\n\nI recently had the pleasure of reading Robert Krut’s poetry for the first time. The experience was both enlightening and inspiring. Krut’s writing conveys feelings that are familiar and yet somehow indiscernible. Images speak, melting into emotions that cannot be articulated, kindling the smolder of latent imagination.\nJust one of the many themes present in Krut’s poetry I found particularly fascinating was the supernatural elements, and I found myself spellbound by his use of imagery. There were moments of surprise in Krut’s poetry in which I had to stop and ask myself “Did this seemingly regular imagery really just take that turn?”\nHere are five of my favorites:\n“Gargoyle” and “You are a Jellyfish, Ghost,” (Packingtown Review)\n“Hold Me, the Walls are Falling,” (Vinyl Poetry, with an accompanying video)\n“Heart Holds Lake,” (A Dozen Nothing)\n“Phantasmagoria at Six AM,” (Night Block)\nIn preparation for his upcoming visit, I was lucky enough to ask Robert Krut about his writing process and creative life:\nWhat kind of creative patterns, routines, or rituals do you have?\nI just try to write whenever a phrase or image jumps out at me—sometimes that happens at a time when I can type it right out, sometimes it is written into a bedside notebook, sometimes it means recording cryptic words into my phone. Then, later I can pull them all together for the actual writing. In terms of routine, that changes up periodically—for a while I will only write at the crack of dawn, which will prove to be very productive. Then, I’ll mix it up and write at the end of the day, when my inhibitions are down a bit. The key, as everyone will say, is to try to write every day whether it is crafting a full-blown draft or even just a few lines.\nI will say the most productive I am is when I have a schedule to stick to—and why I don’t manage to always stick to it is a great mystery of either a busy life or laziness—but when I do, I write a lot more. Wake up, write for a while before coffee in the morning. That helps. When I’ve given myself a strict regimen, I always wind up with workable material in the long run.\nThis year you were A Dozen Nothing’s selected poet for March. One of the poems published in that issue was Bomb the Subtext. What about this poem is special to you or led you to write it?\nI had been working on a long, long—ridiculously long—poem, designed to be something of an epic piece (in my mind) of interlocking sections with a driving narrative. But the farther I got into it, even mapping out the trajectory of a plot and setting details, it felt less like poetry to me and more like something else. And not something I thought was heading in a particularly interesting direction—it had started with a burst of excitement, but by the end point, it felt stale. So I scrapped the whole plan, and then just tried writing a few poems that would be moments in what had been my initially exciting world for the piece. About four short poems made it out of that process—“Bomb the Subtext” was one of them. My hope is that those remaining poems evoke the larger “story” or “themes” or whatever else it might be called better than where the longer piece was headed.\nIn terms of what makes it special, I don’t know if there’s anything special about the poem itself, but I am glad that it appeared in A Dozen Nothing, which is such a great new journal. Pete Miller and Jeff Sirkin—both incredible poets themselves—are really onto something there, and I was thrilled to be a part of it.\nWhat was your biggest mistake as a writer?\nWhen I was younger (not to jump the gun on your next question), it was thinking that I had to pick one particular style or approach and stick with it, which can shut you off to trying new things. I write like this, and not like that, or (worse), this is the way it should be done, etc. That lets you get boring very quickly.\nThese days, if I’m not reading as much as a I want—as much as I should—I feel that mistake in both my daily life and, of course, my writing.\nIf you could go back in time, what would you tell your younger writer self?\nTalk half as much, and listen twice as much.\nWhat is a measure of success for a poet?\nI’m not sure how to define success, really, but personally I feel (temporary) satisfaction when I’ve been editing and revising a draft of a poem for a while and then get to the point where I feel safe enough to walk away from it. As I just wrote that sentence, I was reminded of one of your Chico State alumni, in fact—Raymond Carver—who wrote about a similar feeling in his piece “On Writing.” I read that essay religiously when I was younger, and it clearly stuck. There is always a little blink of time after letting the poem set in place that feels rewarding, and then you get back to work.\n______________________________\nRobert Krut is the author of This is the Ocean (Bona Fide Books, 2013),which received the Melissa Lanitis Gregory Poetry Award, as well as The Spider Sermons (BlazeVox, 2009). His work has appeared widely in print and online, in journals like Cimarron Review, Blackbird, Smartish Pace, and more. In 2007, H_NGM_N released his chapbook Theory of the Walking Big Bang; subsequently, he began serving on the press/journal’s Editorial Board. He teaches at the University of California, Santa Barbara, and lives in Los Angeles.\nPlease join us for an exciting evening with Robert Krut, Tuesday, November 29th at 7:30 pm in Colusa 100A. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nWritten by James Howard\n \n\n\nNovember 26, 2016watershedcsuc\nLeave a comment\n\n\n\n\nVisiting Author Spotlight: Michelle Tea \n\n\nMichelle Tea’s memoir How to Grow Up exposes a vein of humor that can be found in life, even in the zany and unsettling conditions offered to those who live at the intersection of unfamiliar and unfortunate. The memoir consists of a collection of essays, with topics ranging from alcoholism, poverty, fashion, queer culture in the 90s, and sex. As is mentioned in Kazim Ali’s essay “Genre-Queer: Notes Against Generic Binaries,” people are looking to break down the expectations that might be imposed on a body of work just as they would be on a person. Tea adds her own color to this discussion with her genre-bending novel Black Wave, blending elements of a memoir into a fictional universe, and with the novel-turned-film, Valencia, which became a collaborative effort with 21 different directors whose unique vision led to a sold-out premiere at the Castro Theater in San Francisco.\nIn the first chapter of How to Grow Up, Tea identifies herself with a persimmon tree due to its unsynchronized flare of life:“As all the other trees lose their leaves and begin their winter dying, the persimmon flares up brighter than any of them have ever been, bearing fruit, even. That was me. I wasn’t on the same timetable as the other trees in the garden, but I was alive, coming into a certain prime, even.”\nTea associates this image of the persimmon’s belated blooming with a positive note that is sustained throughout the memoir. Although she often approaches her past self with humility and insight, she never apologizes for being different and even dedicates a chapter to “Young Michelle.” In this chapter, she simultaneously ridicules and adores Young Michelle (velvet body suit and all), but never placed her in a box. This strain of self-love, almost edging on maternal, resonated with me and came off as deeply unique. Having been raised working class in Chelsea, Massachusetts, she is able to contextualize her actions in a way that brings her readers together, despite the sometimes obscure events in her life, such as living in a house where none of the roommates cleaned. Ever. Seeing that I am the type of person who saves old toothbrushes in order to scrub the grout lines along the tile floor, I was horrified.\nThis image of the persimmon tree is subtly repeated when her sobriety acts as a conduit for moving in with partying twenty-year-olds and again when her “biological time clock” begins tolling with the desire to experience pregnancy. These situations play at readers’ expectations of recovery and of their own understanding of when milestones should occur.\nMichelle Tea is a memoirist, poet, editor, founder of the online publication Mutha magazine and the non-profit organization RADAR Productions, and a literary citizen, having dedicated a portion of her career to creating opportunities for queer writers, such as Sister Spit. She has also written for multiple blogs and magazine, including xojane, where she documented her experiences with pregnancy. A particular favorite of mine was called, “Getting Pregnant With Michelle: I had a Baby.”\nButte College, Butte College’s Diversity Committee and the 1078 Literary Committee are proud to welcome Michelle Tea to the 1078 Gallery (820 Broadway) on October 11th, 7:30 pm.\nWritten by Samantha Smith\n\n\nOctober 10, 2016watershedcsuc 1078 gallery, Butte College, diversity, michelle tea\nLeave a comment\n\n\n\n\nWriter’s Voice Spotlight: Martha Collins \n\n\nIn her introduction to Writing White, Martha Collins states, “I think we go a long way toward understanding why white poets don’t address racial issues more often when we acknowledge that it’s almost impossible for poets of color not to write from a racialized experience.”\nBorn in Omaha, Nebraska, Collins grew up with a keen understanding of censorship with her writing. In an interview with Michael Simms for Coal Hill Review in 2012, Collins stated that she “learned that I’m usually onto something when I hear the censor’s voice.” It is Collins’ ability to push past the mental censorship that was developed deep within her from parents and teachers, critics and society that has made her so successful as a writer who understands what it means to “write white.”\nMy first taste of Martha Collins came subtly, in the form of a book called Blue Front, a book of poems that took me by surprise. What unfolded in front of me was not “just a book of poems” but a fantastic artistic move in which Collins uses poetry to tell a story unlike any I have ever read. Collins brings us into a scene that is both horrific and raw and adds to it a reality that we often try not to talk about. She does not balk in the face of censorship, but instead, looks it right in the eye and says what she means to say and does so eloquently and passionately.\nWhat Collins does is, as Chico State Creative Writing professor Jeanne Clark states, “engages questions of race in utterly harrowing, necessary and compelling ways.” A great example of her ability to “engage questions of race” can be seen in her book-length poem Blue Front (Graywolf, 2006) where Collins uses white space, historiography, fragmentation and interpretation to describe a lynching her father witnessed when he was only 5 years old. Her father was known for selling fruit in front of the Blue Front Restaurant in Cairo, Illinois, the town in which the lynching took place. The poems create a feeling of frenzy, chaos, hurriedness, and violence. It is done both simply and stunningly, pushing the limits of poetry by using evidence of postcard descriptions, the legal history of the event, and even Collins’ own speculation of what happened.\nCollins’ ability to push censorship and art comes together in her work in a cohesive and deliberate form. In her poem “White Papers” she gives a stunning account of the issue of race with simple but raw statements like, “Because my father said yes/ but not in our lifetimes” and “Because among the crayons/ there was one called Flesh.” Her use of anaphora brings to light the arguments that have taken place for generations. Her use of language recreates the ways in which we have talked about race in the past and even what we may still talk about it in the future.\nWith three Pushcart Prizes, the Alice Fay Di Castagnola Award, a Lannan residency grant, the Laurence Goldstein Poetry Prize and many fellowships, it is hard to deny Collins dedication to her craft and importance as an American poet. Her most recent book, Admit one: An American Scrapbook (Pittsburgh, 2016) has been praised by Writer’s Chronicle for poetry that is stated to be “poised at the juncture between the lyric and ethics.” Her other works include Day Unto Day (Milkweed, 2014) and White Papers (Pitt Poetry Series, 2012). After attending Stanford University for her B.A. and then the University of Iowa for her Ph.D., Collins taught at the University of Massachusetts Boston where she founded the Creative Writing Program and for ten years was Pauline Delaney Professor of Creative Writing at Oberlin College, and is also editor-at-large for FIELD magazine.\nPlease join us for an exciting evening with Martha Collins, Tuesday at 7:30 pm in Colusa 100B. Thanks to contributions made by the Department of English and the College of Humanities and Fine Arts, Writer’s Voice readings are free and open to the public.\nWritten by Kyleen Bromley\n\n\nSeptember 30, 2016watershedcsuc\nLeave a comment\n\n\n\n\n2016 Best of the Net Nominations \n\n\nWatershed Review is pleased to announce our nominations for the 2016 Best of the Net anthology. Thank you to our contributors for the honor of featuring their work in the the Fall 2015 and Spring 2016 issues!\nPoetry:\nNathan Slinker “In the Play, We Are Blossoms That Close Each Night” (Spring 2016): http://www.csuchico.edu/watershed/2016-spring/poetry/slinker-nathan.shtml\nNicole Stellon O’Donnell “A Reply to the Obtrusive Narrator” (Spring 2016): http://www.csuchico.edu/watershed/2016-spring/poetry/stellon-odonnell-nicole.shtml\nJeff Burt “In Honor of Big-Bellied Men” (Fall 2015): http://www.csuchico.edu/watershed/2015-fall/poetry/burt-jeff.shtml\nRikki Santer “Andy Warhol’s Buffet of Thoughts at the Kahiki Supper Club; Columbus, Ohio” (Fall 2015): http://www.csuchico.edu/watershed/2015-fall/poetry/santer-rikki.shtml\nClint Smith “Ode to the Only Black Kid in the Class” (Fall 2015): http://www.csuchico.edu/watershed/2015-fall/poetry/smith-clint.shtml\nJessi Lewis “I’m sorry, Bunny” (Fall 2015): http://www.csuchico.edu/watershed/2015-fall/poetry/lewis-jessi.shtml\nFiction:\nRebecca Boyd “Miss November” (Spring 2016): http://www.csuchico.edu/watershed/2016-spring/fiction/boyd-rebecca.shtml\nAnn Stewart McBee “Little Cities” (Fall 2015): http://www.csuchico.edu/watershed/2015-fall/fiction/mcbee-annstewart.shtml\nNonfiction:\nThomas Hallock “Coyote and the Kid” (Spring 2016): http://www.csuchico.edu/watershed/2016-spring/nonfiction/hallock-thomas.shtml\nKristin Rajan “Eight Candles in September” (Fall 2015): http://www.csuchico.edu/watershed/2015-fall/nonfiction/rajan-kristin.shtml\nGood luck to our contributors!\n \nPhotograph by Sheri Wright, “No Way Home”\n \n\n\nSeptember 28, 2016watershedcsuc Best of the Net, CSUC, Watershed Review\nLeave a comment\n\n\n\nPost navigation\n← Older posts\nNewer posts →\n\n\n\n\n\nBlogroll\n\nDiscuss\nGet Inspired\nGet Polling\nGet Support\nLearn WordPress.com\nTheme Showcase\nWordPress Planet\nWordPress.com News\n\n\nTopics\n\nIntern Spotlight\n\nUncategorized\n\n\nUpcoming Events No upcoming events\nArchives\n\nMay 2022\nMarch 2022\nMay 2020\nOctober 2019\nMay 2019\nApril 2019\nOctober 2018\nJanuary 2018\nDecember 2017\nOctober 2017\nSeptember 2017\nApril 2017\nNovember 2016\nOctober 2016\nSeptember 2016\nDecember 2015\nOctober 2015\nSeptember 2015\nApril 2015\nMarch 2015\nFebruary 2015\nNovember 2014\nOctober 2014\nSeptember 2014\nApril 2014\nFebruary 2014\nNovember 2013\nOctober 2013\nAugust 2013\nApril 2013\nMarch 2013\nFebruary 2013\nJanuary 2013\n\n \n\nFollow me on TwitterMy Tweets \n\n\n\n\nBlog at WordPress.com.\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\tPrivacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. \nTo find out more, including how to control cookies, see here:\n\t\t\t\t\n\t\t\tCookie Policy\t\t\n\n\n \n\n\n\nFollow\n\n\nFollowing\n\n\n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\nJoin 44 other followers\n\n\n\n\n\n\n\n \n\n\t\t\t\t\t\t\t\t\t\t\t\tSign me up\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tAlready have a WordPress.com account? Log in now. \n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tWatershed Review\t\t\t\n\n\n\n Customize\n\n\n\n\nFollow\n\n\nFollowing\n\n\nSign up\nLog in\n\n\n\t\t\t\t\t\t\t\t\t\t\tReport this content\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tView site in Reader\t\t\t\t\t\t\t\t\t\t\n\n\nManage subscriptions\n\nCollapse this bar\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n\n",
    "links": [
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/",
        "#content",
        "https://watershedcsuc.wordpress.com/",
        "https://watershedcsuc.wordpress.com/about/",
        "https://watershedcsuc.wordpress.com/history/",
        "https://watershedcsuc.wordpress.com/submit/",
        "https://watershedcsuc.wordpress.com/2018/10/06/writers-voice-spotlight-michelle-tea/",
        "http://www.radarproductions.org/sister-spit/",
        "http://www.radarproductions.org/about/",
        "https://marinaomi.com/",
        "https://twitter.com/wochanofficial?lang=en",
        "https://www.jayydodd.net/",
        "https://www.virgietovar.com/",
        "https://www.goodreads.com/author/show/16059.Michelle_Tea",
        "https://watershedcsuc.wordpress.com/2018/10/06/writers-voice-spotlight-michelle-tea/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2018/10/06/writers-voice-spotlight-michelle-tea/#respond",
        "https://watershedcsuc.wordpress.com/2018/01/22/wr-editor-blog-marta-shaffer/",
        "https://watershedcsuc.wordpress.com/2018/01/22/wr-editor-blog-marta-shaffer/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2018/01/22/wr-editor-blog-marta-shaffer/#respond",
        "https://watershedcsuc.wordpress.com/2017/12/01/2017-pushcart-prize-nominations/",
        "http://www.csuchico.edu/watershed/2017-spring/",
        "http://www.csuchico.edu/watershed/2017-spring/poetry/rubin-stan-sanvel.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/nonfiction/poyner-ken.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/fiction/lovgren-maryrose.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/art/salucci-roger.shtml",
        "https://watershedcsuc.wordpress.com/2017/12/01/2017-pushcart-prize-nominations/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2017/12/01/2017-pushcart-prize-nominations/#respond",
        "https://watershedcsuc.wordpress.com/2017/10/16/writers-voice-spotlight-rob-davidson/",
        "https://www.kirkusreviews.com/book-reviews/rob-davidson/spectators/",
        "http://www.chicoer.com/arts-and-entertainment/20170722/biblio-file-chico-state-professors-work-nominated-for-pulitzer-prize",
        "http://thestoryprize.blogspot.com/2017/09/rob-davidson-finds-inspiration-in-images.html",
        "https://watershedcsuc.wordpress.com/2017/10/16/writers-voice-spotlight-rob-davidson/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/fiction/",
        "https://watershedcsuc.wordpress.com/tag/rob-davidson/",
        "https://watershedcsuc.wordpress.com/tag/spectators/",
        "https://watershedcsuc.wordpress.com/tag/writers-voice/",
        "https://watershedcsuc.wordpress.com/2017/10/16/writers-voice-spotlight-rob-davidson/#respond",
        "https://watershedcsuc.wordpress.com/2017/09/28/2017-best-of-the-net-nominations/",
        "http://www.csuchico.edu/watershed/2017-spring/poetry/daud-arfah.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/poetry/pritts-nate.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/poetry/moody-david.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/poetry/rubin-stan-sanvel.shtml",
        "http://www.csuchico.edu/watershed/2016-fall/poetry/beete-paulette.shtml",
        "http://www.csuchico.edu/watershed/2016-fall/poetry/boson-crystal.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/fiction/sheridan-josh-patrick.shtml",
        "http://www.csuchico.edu/watershed/2016-fall/fiction/poyner-ken.shtml",
        "http://www.csuchico.edu/watershed/2017-spring/nonfiction/kurth-lita.shtml",
        "http://www.csuchico.edu/watershed/2016-fall/nonfiction/arment-jason.shtml",
        "https://watershedcsuc.wordpress.com/2017/09/28/2017-best-of-the-net-nominations/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/best-of-the-net/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/fiction/",
        "https://watershedcsuc.wordpress.com/tag/nonfiction/",
        "https://watershedcsuc.wordpress.com/tag/poetry/",
        "https://watershedcsuc.wordpress.com/tag/watershed-review/",
        "https://watershedcsuc.wordpress.com/2017/09/28/2017-best-of-the-net-nominations/#respond",
        "https://watershedcsuc.wordpress.com/2017/04/05/writers-voice-spotlight-naomi-j-williams/",
        "https://naomijwilliams.com/",
        "http://www.powells.com/book/landfalls-a-novel-9780374183158",
        "http://storiesonstagedavis.com/",
        "https://naomijwilliams.com/2015/06/04/a-mapsellers-mistake-or-how-i-came-to-write-my-book/",
        "https://www.one-story.com/index.php?page=stories&story_id=131",
        "https://www.nytimes.com/2015/08/30/books/review/landfalls-by-naomi-j-williams.html?_r=0",
        "https://watershedcsuc.wordpress.com/2017/04/05/writers-voice-spotlight-naomi-j-williams/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2017/04/05/writers-voice-spotlight-naomi-j-williams/#respond",
        "https://watershedcsuc.wordpress.com/2016/11/26/writers-voice-spotlight-robert-krut/",
        "http://www.packingtownreview.com/issues/7/robertkrut/gargoyle.html#.WDjnAuErK-6",
        "http://www.packingtownreview.com/issues/7/robertkrut/youareajellyfishghost.html#.WDjnHuErK-6",
        "http://vinylpoetryandprose.com/volume-2/page-28/",
        "https://adozennothing.com/2016/03/01/robert-krut-march-2016/",
        "http://www.nightblockmag.com/e2krut",
        "https://watershedcsuc.wordpress.com/2016/11/26/writers-voice-spotlight-robert-krut/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2016/11/26/writers-voice-spotlight-robert-krut/#respond",
        "https://watershedcsuc.wordpress.com/2016/10/10/visiting-author-spotlight-michelle-tea/",
        "http://www.michelletea.com/",
        "http://muthamagazine.com/",
        "http://www.radarproductions.org/",
        "https://www.fantasticfiction.com/t/michelle-tea/sister-spit.htm",
        "http://www.xojane.com/family/pregnancy-with-michelle-tea-hormones-porn-and-a-tad-scary-c-section",
        "https://watershedcsuc.wordpress.com/2016/10/10/visiting-author-spotlight-michelle-tea/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/1078-gallery/",
        "https://watershedcsuc.wordpress.com/tag/butte-college/",
        "https://watershedcsuc.wordpress.com/tag/diversity/",
        "https://watershedcsuc.wordpress.com/tag/michelle-tea/",
        "https://watershedcsuc.wordpress.com/2016/10/10/visiting-author-spotlight-michelle-tea/#respond",
        "https://watershedcsuc.wordpress.com/2016/09/30/writers-voice-spotlight-martha-collins/",
        "http://marthacollinspoet.com/",
        "http://www.coalhillreview.com/",
        "http://www.nytimes.com/2006/09/24/books/review/Goodyear.t.html?_r=0",
        "https://www.poetryfoundation.org/poems-and-poets/poems/detail/57811",
        "https://www.amazon.com/Admit-One-American-Scrapbook-Poetry/dp/0822964058",
        "https://www.awpwriter.org/magazine_media/writers_chronicle_overview",
        "https://www.amazon.com/Day-Unto-Collins-Martha-Paperback/dp/B00YTJRXZI/ref=sr_1_2?s=books&ie=UTF8&qid=1475178668&sr=1-2&keywords=Day+Unto+Day+collins",
        "https://www.amazon.com/White-Papers-Poetry-Martha-Collins/dp/0822961849",
        "http://www.oberlin.edu/ocpress/field.html",
        "https://watershedcsuc.wordpress.com/2016/09/30/writers-voice-spotlight-martha-collins/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/2016/09/30/writers-voice-spotlight-martha-collins/#respond",
        "https://watershedcsuc.wordpress.com/2016/09/28/2016-best-of-the-net-nominations/",
        "http://www.csuchico.edu/watershed",
        "http://www.csuchico.edu/watershed/2016-spring/poetry/slinker-nathan.shtml",
        "http://www.csuchico.edu/watershed/2016-spring/poetry/stellon-odonnell-nicole.shtml",
        "http://www.csuchico.edu/watershed/2015-fall/poetry/burt-jeff.shtml",
        "http://www.csuchico.edu/watershed/2015-fall/poetry/santer-rikki.shtml",
        "http://www.csuchico.edu/watershed/2015-fall/poetry/smith-clint.shtml",
        "http://www.csuchico.edu/watershed/2015-fall/poetry/lewis-jessi.shtml",
        "http://www.csuchico.edu/watershed/2016-spring/fiction/boyd-rebecca.shtml",
        "http://www.csuchico.edu/watershed/2015-fall/fiction/mcbee-annstewart.shtml",
        "http://www.csuchico.edu/watershed/2016-spring/nonfiction/hallock-thomas.shtml",
        "http://www.csuchico.edu/watershed/2015-fall/nonfiction/rajan-kristin.shtml",
        "https://watershedcsuc.wordpress.com/2016/09/28/2016-best-of-the-net-nominations/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "https://watershedcsuc.wordpress.com/tag/best-of-the-net/",
        "https://watershedcsuc.wordpress.com/tag/csuc/",
        "https://watershedcsuc.wordpress.com/tag/watershed-review/",
        "https://watershedcsuc.wordpress.com/2016/09/28/2016-best-of-the-net-nominations/#respond",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/page/3/",
        "https://watershedcsuc.wordpress.com/author/watershedcsuc/",
        "http://en.forums.wordpress.com/",
        "http://www.plinky.com/",
        "http://polldaddy.com/",
        "http://en.support.wordpress.com/",
        "http://learn.wordpress.com/",
        "http://theme.wordpress.com/",
        "http://planet.wordpress.org/",
        "http://en.blog.wordpress.com/",
        "https://watershedcsuc.wordpress.com/category/intern-spotlight/",
        "https://watershedcsuc.wordpress.com/category/uncategorized/",
        "https://watershedcsuc.wordpress.com/2022/05/",
        "https://watershedcsuc.wordpress.com/2022/03/",
        "https://watershedcsuc.wordpress.com/2020/05/",
        "https://watershedcsuc.wordpress.com/2019/10/",
        "https://watershedcsuc.wordpress.com/2019/05/",
        "https://watershedcsuc.wordpress.com/2019/04/",
        "https://watershedcsuc.wordpress.com/2018/10/",
        "https://watershedcsuc.wordpress.com/2018/01/",
        "https://watershedcsuc.wordpress.com/2017/12/",
        "https://watershedcsuc.wordpress.com/2017/10/",
        "https://watershedcsuc.wordpress.com/2017/09/",
        "https://watershedcsuc.wordpress.com/2017/04/",
        "https://watershedcsuc.wordpress.com/2016/11/",
        "https://watershedcsuc.wordpress.com/2016/10/",
        "https://watershedcsuc.wordpress.com/2016/09/",
        "https://watershedcsuc.wordpress.com/2015/12/",
        "https://watershedcsuc.wordpress.com/2015/10/",
        "https://watershedcsuc.wordpress.com/2015/09/",
        "https://watershedcsuc.wordpress.com/2015/04/",
        "https://watershedcsuc.wordpress.com/2015/03/",
        "https://watershedcsuc.wordpress.com/2015/02/",
        "https://watershedcsuc.wordpress.com/2014/11/",
        "https://watershedcsuc.wordpress.com/2014/10/",
        "https://watershedcsuc.wordpress.com/2014/09/",
        "https://watershedcsuc.wordpress.com/2014/04/",
        "https://watershedcsuc.wordpress.com/2014/02/",
        "https://watershedcsuc.wordpress.com/2013/11/",
        "https://watershedcsuc.wordpress.com/2013/10/",
        "https://watershedcsuc.wordpress.com/2013/08/",
        "https://watershedcsuc.wordpress.com/2013/04/",
        "https://watershedcsuc.wordpress.com/2013/03/",
        "https://watershedcsuc.wordpress.com/2013/02/",
        "https://watershedcsuc.wordpress.com/2013/01/",
        "https://twitter.com/466661251926335488",
        "https://wordpress.com/?ref=footer_blog",
        "https://automattic.com/cookies/",
        "",
        "",
        "https://watershedcsuc.wordpress.com",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2018%2F10%2F06%2Fwriters-voice-spotlight-michelle-tea%2F&signup_flow=account",
        "https://watershedcsuc.wordpress.com",
        "https://watershedcsuc.wordpress.com/wp-admin/customize.php?url=https%3A%2F%2Fwatershedcsuc.wordpress.com%2Fauthor%2Fwatershedcsuc%2Fpage%2F2%2F",
        "",
        "",
        "https://wordpress.com/start/",
        "https://wordpress.com/log-in?redirect_to=https%3A%2F%2Fwatershedcsuc.wordpress.com%2F2018%2F10%2F06%2Fwriters-voice-spotlight-michelle-tea%2F&signup_flow=account",
        "http://en.wordpress.com/abuse/?report_url=https://watershedcsuc.wordpress.com",
        "https://wordpress.com/read/feeds/7518230",
        "https://subscribe.wordpress.com/",
        "",
        "#",
        "#"
    ]
}