{
    "title": "New WP Speakers Website Helps Event Organizers Find Speakers – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nMay 1, 2023\nSarah Gooding\nNew WP Speakers Website Helps Event Organizers Find Speakers\n\nMichelle Frechette, Director of Community Engagement at StellarWP, has launched a new independent project called WP Speakers that helps event organizers find available speakers for WordPress meetups, WordCamps, podcasts, and other events. The site offers a database of speakers that is free to join and free to search.\nWhen speakers sign up, they include a bio, headshot, location, languages they speak, topics, expertise, and contact information. They can also specify if they identify being from an underrepresented group. In the short amount of time the site has been live, WP Speakers has added 149 registered speakers who are ready and willing to share their WordPress knowledge at both virtual and in-person events.\n\n“As a meetup organizer for my local WordPress meetup, I’m constantly searching for speakers to present,” Frechette said. “On one hand the pandemic made it harder to keep coming up with fresh meetup content, but on the other hand, it allowed me to connect to speakers globally as all of our meetings were moved online. But even with all of the speakers in the world now able to present, it was still hard to think of topics and then source speakers. As well-connected as I am in WordPress, I couldn’t even imagine how much more difficult it might be for someone who didn’t know a lot of speakers personally. So WP Speakers was born.”\nFrechette has a knack for bringing people together and helping them find their place in WordPress. In addition to her open source contributions, she maintains WPCareerPages.com, a site that connects job seekers with WordPress companies, and publishes a weekly tweet thread with available positions.\nFrechette is supporting her efforts on the project through sponsorship funds, which allow her to keep the resource free.\n“It’s important to me that the ability to belong on the site as well as be able to search for speakers always remains free,” she said. “That way no one is denied from being able to participate. A resource like this should be available to all.”\nFrechette plans to continue adding to the speaker resource page and an event organizer resource page is next on the roadmap. Anyone who wants to be listed on the site can fill out the “Join As a Speaker” form and new profiles will be approved in 1-3 business days.\nCategory: NewsShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n0\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Notify me of follow-up comments by email. Notify me of new posts by email. \n\n Join the discussion via emailGet only replies to your comment, the best of the rest, as well as a daily recap of all comments on this post. No more than a few emails daily, which you can reply to/unsubscribe from directly from your inbox.Δ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nYou may also like\nWordPress Accessibility Day 2022 Opens Call for Speakers and SponsorsJuly 22, 2022WordCamp Tokyo 2016 Calls for Speakers, Adds New English TrackApril 28, 2016WP Tech Event Will No Longer Be a WordCampAugust 27, 2014\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://wpspeakers.com/",
        "http://wpcareerpages.com/",
        "https://wpspeakers.com/join-as-a-speaker/",
        "https://wptavern.com/category/news",
        "https://wptavern.com/new-wp-speakers-website-helps-event-organizers-find-speakers?share=twitter",
        "https://wptavern.com/new-wp-speakers-website-helps-event-organizers-find-speakers?share=mastodon",
        "https://wptavern.com/new-wp-speakers-website-helps-event-organizers-find-speakers?share=facebook",
        "https://wptavern.com/new-wp-speakers-website-helps-event-organizers-find-speakers?share=telegram",
        "https://wptavern.com/new-wp-speakers-website-helps-event-organizers-find-speakers?share=jetpack-whatsapp",
        "https://wptavern.com/new-wp-speakers-website-helps-event-organizers-find-speakers?share=pocket",
        "https://wptavern.com/new-wp-speakers-website-helps-event-organizers-find-speakers?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20New%20WP%20Speakers%20Website%20Helps%20Event%20Organizers%20Find%20Speakers&body=https%3A%2F%2Fwptavern.com%2Fnew-wp-speakers-website-helps-event-organizers-find-speakers&share=email",
        "/new-wp-speakers-website-helps-event-organizers-find-speakers#respond",
        "https://akismet.com/privacy/",
        "https://wptavern.com/wordpress-accessibility-day-2022-opens-call-for-speakers-and-sponsors",
        "https://wptavern.com/wordpress-accessibility-day-2022-opens-call-for-speakers-and-sponsors",
        "https://wptavern.com/wordcamp-tokyo-2016-calls-for-speakers-adds-new-english-track",
        "https://wptavern.com/wordcamp-tokyo-2016-calls-for-speakers-adds-new-english-track",
        "https://wptavern.com/wp-tech-event-will-no-longer-be-a-wordcamp",
        "https://wptavern.com/wp-tech-event-will-no-longer-be-a-wordcamp",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge",
        "#",
        "#"
    ]
}