{
    "title": "Give and Go program finds new purpose for tons of unwanted items - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 27, 2023 Give and Go program finds new purpose for tons of unwanted items The Give & Go program run by Stanford’s Residential & Dining Enterprises has helped to divert nearly 500 tons of material from landfills. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Rebecca Beyer\n\nThirty-five bales of hay. A smattering of silverware. Cast-off business attire. A guitar.\n\nR&DE Sustainability Waste Specialist Haley Todd with a Recycle for Change Bin. (Image credit: Keith Uyeda)\n\nThese are just a few of the many unwanted items Stanford University sustainability waste specialist Haley Todd has recovered on campus as part of Residential & Dining Enterprises’ (R&DE) efforts to reduce, reuse, recycle, or compost materials that might otherwise end up in a trash bin.\nPart of Todd’s job is to oversee Give & Go, a year-round donation program. Sustainability is a core value in R&DE and the organization has been supporting reuse for more than two decades (and recycling for many more). The Give & Go program, formalized in 2013, expanded those efforts significantly. In 10 years, Give & Go, known among students for the images of alpacas that accompany its branding (“Alpaca my stuff …”), has diverted 456 tons of waste from landfills, including through innovative partnerships with local community organizations and the First-Generation and/or Low-Income (FLI) Student Success Center on campus. Give & Go is just one part of R&DE’s sustainability program, which in turn is part of Stanford’s broader mission to achieve zero waste by 2030. (Stanford has placed first in the National Wildlife Federation’s Campus Race to Zero competition in the per-capita recycling category for two years in a row.)\nThe Office of Sustainability’s Julie Muir, manager of Stanford’s zero waste program, says Give & Go is a huge part of sustainability efforts on campus.\n“The hierarchy in waste management is waste reduction, then reuse, which is what Give & Go is all about,” Muir says. “The amount of material they donate is truly amazing.”\nThe flagship of the Give & Go program is Stanford’s move-out period in June when more than 7,000 students leave campus within a week’s time. Todd coordinates with Goodwill Industries, which provides several trailers around campus, but also sends her team – mostly interns and volunteers – to monitor dumpsters and recover any materials that can be recycled or redistributed.\nBut the Give & Go program is available to students throughout the year. Fourteen stations that support Recycle for Change, a nonprofit that donates or sells used clothes, shoes, and other goods, are located around campus. And Todd and her team regularly survey trash enclosures for potential treasures and coordinate with anyone who has items they don’t want to go to waste.\nIn addition to Goodwill and Recycle for Change, Give & Go partners with several community organizations, including the Bay Area Furniture Bank, the Mattress Recycling Council (which took 17 tons of mattresses from campus last year), several food banks, and a group that provides toiletries to farm workers.\nOne of Give & Go’s main on-campus partners is the student-run First-Generation and/or Low-Income Partnership (FLIP). Each fall, FLIP, Give & Go, and Students for Sustainable Stanford host a FLI Drive featuring recovered items that students may arrive on campus in need of, such as bikes, mini-fridges, microwaves, and other items. In October 2022, 530 FLI students took home Give & Go items in a single day. Todd also holds mini-FLI drives whenever she collects a critical mass of material.\nIn addition, Give & Go works with Roble Reuse, which keeps assorted business attire that students can borrow for interviews.\nTodd loves her matchmaking role, which facilitates the circular economy. The bales of hay – left over from a Halloween party – could have been composted, but instead, Todd gave them to the gardeners at R&DE’s Oak Road and Lane B BeWell community gardens.\nInspiring students is part of R&DE’s sustainability mission. Each year, the office takes on several Sustainability Interns, who work on new ways to reduce waste on campus. Past interns designed Give & Go’s alpaca branding campaign; more recently, an intern started a food swap box in a dormitory laundry room. Samantha Bunke, a third-year chemical engineering PhD student studying plastic waste management in the Tarpeh Lab, has been working for nearly two years on a longer-term project, which is to create a zero-waste education facility on campus. The center would include on-site composting, a facility to audit waste streams more easily and regularly (to make sure materials end up in the right place), research opportunities for faculty and students – like Bunke – who are studying waste, and community education components.\nBunke started as an R&DE intern and is now a Living Lab Fellow with the Office of Sustainability. For her project, Bunke regularly meets with faculty, students, and staff to discuss the future zero-waste center. But, even with that commitment and her research responsibilities, she still finds time to dumpster dive with Todd and the Give & Go team.\n“Working in a lab, everything is more abstract,” she explains. “You can’t really see it. [With Give & Go], I am literally getting up on the dumpsters, reaching in, and pulling stuff out. It’s so much fun.”\nMuir says every effort counts in the fight to reduce waste.\n“There is no one-size-fits-all” solution, she says. “We don’t need an all-or-nothing solution. We need several solutions that take us down a journey that gets us to that end result.”\n\n\n\n\n\n\n\n\n\n\n\n\nAlpaca Your Stuff\nResidential And Dining Enterprises\nStanford News\nThe Circular Economy\nSustainability\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D12103",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/04/RDE-Sustainability-Waste-Specialist-Haley-Todd-with-a-Recycle-for-Change-Bin-scaled-1.jpg",
        "https://rde.stanford.edu/",
        "https://rde.stanford.edu/studenthousing/give-go-donation-program",
        "https://fli.stanford.edu/",
        "https://rde.stanford.edu/sustainability-residential-dining-enterprises",
        "https://sustainable.stanford.edu/operations/waste",
        "https://news.stanford.edu/report/2022/07/11/stanfords-award-winning-zero-waste-efforts/?utm_source=Stanford+ALL&utm_campaign=acf9b31e7f-int_COPY_02&utm_medium=email&utm_term=0_c042b4aad7-acf9b31e7f-55492261",
        "https://rde.stanford.edu/studenthousing/give-go-donation-program",
        "https://roblesustainability.stanford.edu/initiatives/roble-reuse",
        "https://rde.stanford.edu/dining/bewell-community-gardens",
        "https://rde.stanford.edu/sustainability-interns",
        "https://rde.stanford.edu/sustainability-interns",
        "https://rde.stanford.edu/sustainability-interns",
        "https://woods.stanford.edu/people/samantha-bunke",
        "https://www.tarpehlab.com/",
        "https://sustainable.stanford.edu/take-action/fellowships",
        "https://news.stanford.edu/report/content-partner/university-communications/alpaca-your-stuff/",
        "https://news.stanford.edu/report/content-partner/residential-and-dining-enterprises/",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/content-partner/university-communications/the-circular-economy/",
        "https://news.stanford.edu/report/topic/sustainability/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D12103",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}