{
    "title": "UCR Jobs - Position Details ",
    "body": "\n\n\n\n\n\nSkip Navigation\n\n\nHome Page\n\n\n\n\n\n\n\n\nLogin \nRegister \n\n\n\n\n\n\n\nHR Employment\n\n\n\n\n\n\n\n\n\nHome\nBrowse Jobs\nHow to Apply\nMy Account\nHelp\nAbout\n\n\n\n\n\n\n\n\n\n\nPosition Details\n\n\n\nView All Details\n \n          Back To Current Job Opportunities\n    \n\nApply\n\n\n\nCook, Dining Services    \n\n\n\n\n Job Number\n Full/Part Time \n Schedule   \n Salary\n\n\n\n\n 28783022 \n Full Time    \n Varies    \n     $39,651 -     $50,300    \n\n\n\n\nPosition Information\n \nUC Riverside's Dining and Hospitality Services is recruiting for multiple, full-time Cooks. The Cook is responsible for providing team leadership, training and support in production and/or service of one or more food products for a specific station or multiple stations or units from a specified menu. Adheres to all food handling and sanitation guidelines. Follows established timelines for food production as required by customer flow. Interacts with team members and guests in a high volume dining setting. Incumbents typically train and or lead one or more Assistant Cooks, Sr. Food Service Workers or Students in proper food preparation, service and sanitation.**As a condition of employment, you will be required to comply with the University of California SARS-CoV-2 (COVID-19) Vaccination Program Policy. All Covered Individuals under the policy must provide proof of Full Vaccination or submit a request for Exception (based on Medical Exemption, Disability, and/or Religious Objection) or Deferral (based on pregnancy) no later than the applicable deadline. For new University of California employees, the applicable deadline is ten weeks after their first date of employment.**\t\n    \n    \n Education  \n\n Education Requirements \n\n\n Degree \n Requirement \n\n\n\n Culinary School Certificate or degree. \n Preferred \n\n\n\n\n Licenses \n\n\n License \n Requirement \n\n\n\n Valid Drivers License \n Required  \n\n\n\n\n Conditions \n\n\n Condition \n Requirement \n\n\n\n Ability to successfully complete the Dining Food Safety Course (internal to UCR) with a passing score within 30 days of the appointment. \n Required  \n\n\n\n\n Experience  \n\n\n\n Experience \n Requirement\n\n\n\n  3   years recent experience in food preparation and general maintenance of a kitchen area; or an equivalent combination of Culinary Arts Coursework and experience.  \n Required  \n\n\n     Recent experience working in a high volume restaurant or food service operation and proven ability to perform effectively under conditions of fluctuating workload.  \n Required  \n\n\n     Experience in operating equipment commonly found in a large production kitchen or retail kitchen and experience in performing the basic principles of food preparation and handling, including standardized recipes, batch cooking, and proper temperatures for storage and service.  \n Required  \n\n\n     Recent demonstrated experience in leading the process of team based meal production.  \n Preferred  \n\n\n     Demonstrated recent experience within a customer service oriented environment responding to and meeting/exceeding the needs of the customer.  \n Preferred  \n\n\n     Recent demonstrated experience in large volume food preparation, customer service and food safety.  \n Preferred  \n\n\n     Experience working in dining services within the college and university environment.  \n Preferred  \n\n\n\n\n\n Special Conditions  \n\n\n\n Special Condition \n Requirement \n\n\n\n Overtime \n Required  \n\n\n Shift Work (hours outside standard Mon-Fri 8AM-5PM work hours) \n Required  \n\n\n Must successfully complete a pre-employment, post-offer physical and background check through the DOJ and FBI prior to appointment start date. \n Required  \n\n\n Must wear University issued uniform and ID badge. \n Required  \n\n\n\n\n\n Minimum Requirements \nKnowledge and experience in performing various standard cooking methods including but not limited to braising, broiling, grilling, stir-frying, blanching, steaming, sauteing, frying, baking, proofing and glazing.Demonstrated skill in cutting, slicing and measuring dry and liquid food ingredients in units of measurement, such as cup, pint, ounce, quart and pound and demonstrated skill in reading instructions and understanding common food preparation measurements and terms.Demonstrated skill in performing basic arithmetic calculations, such as adding and subtracting whole numbers, decimals and fractions, as is necessary to perform the job responsibilities.Injury Illness Prevention Program Guidelines: Work in a safe and responsible manner while not putting self or others at risk. Comply with applicable policies and procedures and regulations, using personal safety gear, observing warning signs, learning about potential hazards, and reporting unsafe conditions. Must be able to exert well-paced mobility of up to four hours in length and stand continuously throughout an eight hour shift on uncarpeted surfaces. Must be able to move 20 pounds frequently and 50 pounds occasionally following proper safety guidelines. Must be able to stand, walk, climb, stoop, push, pull, reach, and crouch for extended periods of time, as required to complete job assignments. Ability to work in temperature extremes, continuous noise, and physical risks found in food service environments.Demonstrated skill in communicating effectively and professionally using tact and diplomacy, skill to write legibly and record information as necessary to perform job responsibilities.Knowledge of general rules of and procedures for sanitation and safety as it applies to food preparation areas, kitchens and storage areas.Proven ability to read, speak and understand English sufficient to determine and carry out job duties and communicate effectively with supervisors, co-workers, and customers. \n Preferred Qualifications  \nComputer skills sufficient to use Excel, Word, Access, and web-based programs to prepare or input data into reports.Demonstrated commitment to providing excellent customer service. \nAdditional Information \nIn the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel.UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.  UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings.  UC Riverside is the top university in the United States for social mobility. - U.S. News 2020  UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color.  Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019  Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings  UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine.   The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law. For information about our generous employee benefits package, visit: Employee Benefits Overview \nJob Description Details\n\n View complete Job Description for this position  \n\n\n\n\n\n\n\n\n\n\nMore Information\n\n\n\nGeneral Campus Information\n\nUniversity of California, Riverside\n\n900 University Ave.\n\nRiverside, CA 92521\n\n\n                                Tel: (951) 827-1012\n\n\n\nCareer Opportunities\n                            • UCR Libraries\n\nCampus Status\n                            • Maps and Directions\n\n\n\nDepartment Information\n\nHuman Resources\n1160 University Ave.\nRiverside, CA 92521\n                                    \nFax: (951) 827-6493\n                                    E-mail: jobshelp@ucr.edu\n\n\n\nRelated Links\n\nHuman Resources Home\nDiversity\nAbout UCR\n\n\n\n\n\n\n\n\nCampuswide Navigation\n\n\nHome\n\n\nAbout UCR\n\n\nAcademics\n\n\nAdmissions\n\n\nAthletics\n\n\nHappenings\n\n\nResearch\n\n\nCampus Resources\n\n\nGiving to UCR\n\n\n\nFooter\n\n\n\nPrivacy Policy\n\n\nTerms and Conditions\n\n\n                            © 2010 Regents of the University of California\n                        \n\n                            Last modified: 2010-Apr-22\n                        \n\n\n\n\n \n",
    "links": [
        "#main",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_login&module=jobs",
        "!Controller?action=jobs_webui.show_page&page=jobs_register&module=jobs",
        "#",
        "http://jobs.ucr.edu",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&public=true&module=jobs",
        "https://jobs.ucr.edu/how-apply",
        "!Controller?action=jobs_webui.show_page&page=jobs_account_overview&module=jobs",
        "https://jobs.ucr.edu/help",
        "http://jobs.universityofcalifornia.edu/",
        "#",
        "!Controller?action=jobs_webui.show_page&page=jobs_browser&module=jobs",
        "!Controller?action=jobs_webui.forward_link&link=jobs_webui.apply_job&requisition_id=28783022&module=jobs",
        "https://ucnet.universityofcalifornia.edu/compensation-and-benefits",
        "!Controller?action=jobs_template&page=CT_job_description&requisition_id=28783022",
        "http://www.ucr.edu/employment.html",
        "httsp://library.ucr.edu/",
        "http://campusstatus.ucr.edu/",
        "http://www.ucr.edu/about/directions.html",
        "http://campusmap.ucr.edu/campusMap.php?loc=PRSNL",
        "mailto:jobshelp@ucr.edu?subject=Web Site Inquiry",
        "http://hr.ucr.edu",
        "http://diversity.ucr.edu",
        "http://www.ucr.edu/about",
        "http://www.ucr.edu/",
        "http://www.ucr.edu/about/",
        "http://www.ucr.edu/academics/",
        "http://www.ucr.edu/admissions/",
        "http://www.ucr.edu/athletics/",
        "http://www.ucr.edu/happenings/",
        "http://www.ucr.edu/research/",
        "http://www.ucr.edu/resources/",
        "http://www.ucr.edu/giving/",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}