{
    "title": "\n\tCashCourse | Your Real-Life Money Guide\n",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttention CashCourse Administrators: Starting January 1st, institutions must have a HEFWA membership to access CashCourse. Student and instructor accounts must be linked to active HEFWA institutions to continue access after that date. For questions - contact HEFWA. \n\n\n\nclose\n\n\n\n\n\n\n\n\nSkip to main content\n\n\n\n\nLog In\n\n\nWe teach financial skills that make sense in the real world.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudents\nCashCourse is your guide to making informed financial choices. register for a free account to find your assignments and other financial tools and start taking charge of your money.\n\n\n\n\n\n\n\n\n\n\nSchool Administrators\nIf your school is already enrolled in CashCourse, log in with the username and password your Administrator provided you, or click here for more information on how to get started.\n\n\n\n\n\n\n\n\n\n\n\nOther Learners\nIf you aren’t affiliated with a college or university, you can still register for CashCourse. Create a free account and get access to all of CashCourse’s great resources.\n\n\n\n\n\n\n\nAlready registered? Log In here.\n\n\n\n\n\n\n\n\n\n\n\n\nCashCourse Provides:\n\n\nOnline financial education courses through instructor assignments or self-study \nCustomizable financial tools such as worksheets, a Budget Wizard, quizzes and calculators\nA personal dashboard to track your progress\nArticles and resources on topics that students can relate to\nA guide to real-life money questions \n\nWe’re here to help students take control of their financial futures. \nLearn more   |   Register now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n\nSee What CashCourse Can Offer You\nTake a video tour of the CashCourse website to learn about our free tools and resources for college students.\n\nwatch the video \n\n\n\n\n\n\n\n\n\n\n\n\nWe teach financial skills that make sense in the real world. And with the knowledge to handle new financial decisions and challenges, students have more freedom to focus on achieving their goals.\nFaculty and staff: Interested in using CashCourse at your school? Learn more to enroll.\nLearn more about CashCourse\n\n\n\n\n\n\n\n\n\n\n\n\nLog In\n\n\n\n\n\n\n\n\n\n\n\nEmail Address\n\n\n\nPassword\n\n\n\nForgot Password\nLog In\n\n\nUpdate Password\n\nNew Password\n\n\n\nConfirm New Password\n\n\n\nYour password must be at least 7 characters long.\nContinue.\n\n\n\n\n\n\nNot registered?\n Create a free account here.\n\n\n\n\n\n\n\n\n\n\nStudent and Other Learner Registration for\n\n(School faculty or administration click here)\n\n\n\nFirst Name*\n\n\n\nLast Name*\n\n\n\nEmail Address*\n\nYour Email address will be used as your username to log into the site.\n\n\nPassword*\n\nPassword must be 7 to 14 characters and have three of four of the following four types of characters: lowercase, uppercase, numbers, special characters such as [email protected]#$%^&*( ){ }[ ].\n\n\nConfirm Password*\n\n\n\n\nState*\n\nSelect One\nAlabama\nAlaska\nAmerican Samoa\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nDistrict of Columbia\nFederated States of Micronesia\nFlorida\nGeorgia\nGuam\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMarshall Islands\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMinor Outlying Islands\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nNorthern Mariana Islands\nOhio\nOklahoma\nOregon\nPalau\nPennsylvania\nPuerto Rico\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirgin Islands\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\n\nIf you are enrolled in a school, select your school's state.\nIf you are not, please select your home state.\n\n\nSchool*\n\n\nSelect your school for access to your assignments. If you are not affiliated with any school, select \"None\".\n\n\n\n\n\n\n \nPRIVACY POLICY AND TERMS OF USE  FOR CASHCOURSE WEBSITE\nPRIVACY POLICY\nThis policy sets forth how we handle information we learn about you from your visit to our website (the “Site”). Please be assured that we are committed to fair information practices and the protection of privacy. The Site is intended for use by students of a particular school or educational institution (the “School”) and the faculty and administration of that School and some information may be shared among and accessed by users of the Site as set forth below.\n1. TYPES OF INFORMATION COLLECTED\na. Traffic Data Collected. We may automatically track and collect information when you visit our Site, including your: (a) IP address; (b) domain server; (c) type of computer; (d) date and time; and (e) type of Web browser and operating system used (collectively \"Traffic Data\"). Traffic Data is anonymous information that does not personally identify you but is helpful for analysis purposes or for improving your experience on the site. We may use \"cookies\" or other similar software or code on this Site.  You may set your browser to block all cookies, including cookies associated with our Site, or to indicate when a cookie is being set by us. However, please note that the Site may not function properly if your cookies are disabled.\nb. Personal Information Collected. In order for you to access and use the Site or to order materials or information that we may offer through the Site, we may require you to provide us with information that personally identifies you (\"Personal Information\"). Personal Information may include data such as your name, mailing address, e-mail address, telephone number, school ID number, username, access password, birth date and other contact information. Your email address may be required in order to login to the Site.  We may collect and retain any Personal Information that you provide to us. If you send us any email or other communication, we may retain those communications in order to respond to you, to evaluate or improve the services, or for other purposes. It is your responsibility to update or correct your Personal Information whenever necessary. To update, correct, or request removal of your personal information, contact us at the address below.\nc. Test Results.  In addition to the Personal Information described above, we may collect and retain information you provide or that is generated as a result of your use of the Site and the features of the Site, such as test results, scores, completion markers and other information (collectively “Test Results”).  This information may be associated with your user information, name, email address and other Personal Information, and your Test Results and Personal Information may be made available to your School’s faculty and administrators as set forth below.\nd. Not for Children. The Site is not intended for use by children under the age of 13.  Children under the age of 13 are not permitted to access or use areas of the site that require the disclosure of Personal Information. If we discover or are advised that a person who has disclosed Personal Information through the site is under the age of 13, we will delete all Personal Information provided by that person.\n2. USES OF INFORMATION COLLECTED\nWe may use Personal Information and Test Results:\n(a) to send you information or materials about our organization or to contact you when necessary;\n(b) to send you or provide you access to information and materials offered through the site;\n(c) to authorize and monitor the access to and use of the site;\n(d) for research, development and analysis in connection with the maintenance, protection and improvement of our services, materials and information;\n(e) for purposes of maintaining and improving the site, the function of the site and access to the site;\n(f) to enforce the Site Terms of Use and/or separate agreements (if applicable) with you;\n(g) to prevent fraud and other prohibited or illegal activities;\n(h) to protect the security or integrity of the website, or our organization, or our products or services; or\n(i) otherwise, as disclosed to you at the point of collection or in this Privacy Policy.\nThe faculty and administrators of your School may also access and use your Personal Information and Test Results for any of the foregoing purposes and also for purposes of academic, educational, or teaching uses and for purposes of Site administration.  \nWe will not use Personal Information or Test Results collected through the site to send you unsolicited promotional materials unless you request the information through the Site or \"opt in\" when an opportunity to do so is presented.\nWe may use Traffic Data and aggregated non-personal information and share such data and information with third parties.\n Except for the collection and use of Personal Information and Test Results described above, we do not  use Personal Information to track your use of this Site or track your use of other third party websites or online services , or permit third parties to do so. \n3. USER CHOICE REGARDING COLLECTION, USE AND DISTRIBUTION OF PERSONAL INFORMATION\nYou may choose not to provide us with any Personal Information or Test Results. In such an event, you may not be able to access and use portions of the Site.\n4. CONFIDENTIALITY OF PERSONAL INFORMATION\nExcept as otherwise provided in this Privacy Policy, we will use reasonable efforts to keep your Personal Information and Test Results private and will not share this information  with persons other you’re your School’s faculty and administrative users , unless we have your consent or we have a good faith belief that access, use, preservation or disclosure is necessary to: (a) comply with a court order or satisfy any applicable law, regulation, legal process or enforceable government request; (b) protect our rights or property;  (c) enforce our Terms of Use, including investigations into possible violations thereof; (d) detect, prevent or otherwise address fraud, security, legal or technical issues;  or (e) protect against harm or injury to us, our property, users or the public as required or permitted by law.\nWe may provide Personal Information to affiliated organizations or third parties if necessary to provide you with information, materials or services you have requested, provided that such organizations, persons or entities agree to keep such information private in accordance with this policy.\nWe may allow School faculty and administrative users to access and use Personal Information and Test Results as provided in this Privacy Policy. Disclosure of such information by School faculty and administrative users is controlled by the policies and procedures of the School.\n5. OTHER LIMITS TO YOUR PRIVACY\nThis Site may contain links to other websites. We are not responsible for the privacy practices or the content of such sites. We may also make forums, message boards, and news groups available to you. Please understand that any information disclosed in these areas may become public information. We have no control over its use and you should exercise caution when deciding to disclose your personal information.\n6. UPDATES AND CHANGES TO PRIVACY POLICY\nWe reserve the right, at any time and without notice, to add to, change, update, or modify this Privacy Policy, simply by posting such addition, change, update, or modification on this site. Any such addition, change, update, or modification will be effective immediately upon posting on the site. The effective date of this version of the privacy policy is November 13, 2013.\n7.  REVIEW, REVISION OR DELETION OF YOUR PERSONAL INFORMATION\n If you wish to review your Personal Information that has been collected and maintained by HEFWA, or wish to request changes to or deletion of such Personal Information, contact us as provided below.  \n8. CONTACT\nIf you have any questions or concerns regarding this Policy or our treatment of Personal Information, please feel free to contact the us at [email protected]\n \nTERMS OF USE\n \nThe CashCourse  website (the “Site”) is operated by the Higher Education Financial Wellness Alliance, (“HEFWA”, “We” or “Us”). Please carefully read these Terms of Use. By using the Site, you acknowledge and agree that you have read and agree to be bound by these Terms of Use (the “Agreement”). This Agreement is made between HEFWA and You as an individual (“You”). If you do not agree to be bound by this Agreement, please exit the Site now and refrain from using any materials or content that you may have downloaded from the Site. HEFWA reserves the right to revise these Terms of Use at any time without notice to you. By using the Site, you agree to be bound by any such revisions and should, therefore, review the Terms of Use to determine the then current Terms of Use to which you are bound. The most current version of the Terms of Use can be reviewed by clicking on the \"Terms of Use\" hypertext link located at the bottom of the home page on this Site.\n \n1. USE OF THE SITE. This Site is not intended for use by children under the age of 13.  You may access and use the Site solely for lawful purposes and only in accordance with the terms of this Agreement. Access to certain portions of the Site or use of certain content may require that you agree to the terms of an additional agreement. Any such additional agreement is in addition to this Agreement and, in the event of a conflict between the terms of this Agreement and the additional agreement, the terms of the additional agreement will control.  HEFWA reserves the right at any time and in its sole discretion to modify, suspend, or discontinue the Site (or any portion thereof) with or without notice.\n \n2. REGISTRATION. This Site may include a process by which You may apply to become a registered user (a “Registered User”) of the Site in order to access nonpublic areas of the Site. If the Site has such a registration process, Your access to the Site will be limited until You apply for and are approved as a Registered User of the Site. Your approval as a Registered User is at the sole discretion of HEFWA. In connection with Your application to become a Registered User, You may be asked to submit certain information about yourself (“Registration Information”). If Your application to become a Registered User is approved, You will be asked to create a password-protected account to access certain nonpublic areas of the Site (an “Account”). You agree to keep your Account information and password confidential. You agree to notify HEFWA immediately of any actual or suspected unauthorized use of your Account. You are solely responsible for all activities that occur through Your Account. HEFWA will not be responsible for any loss to You caused by your failure to comply with these obligations. You represent and warrant that: (a) all Registration Information You have provide is true, accurate, current, and complete; and (b) You will maintain and promptly update the Registration Information to keep it true, accurate, current, and complete. As part of the registration process, you may be assigned or permitted to create a user ID for use in identifying your Account (a “User ID”). You may not: (i) select or use a User ID of another person with the intent to impersonate that person; (ii) use a User ID in which another person has rights without such person’s authorization; or (iii) use a User ID that HEFWA, in its sole discretion, deems offensive. Failure to comply with the foregoing shall constitute a breach of this Agreement, which may result in immediate termination of your Account.\n \n3. TERM AND TERMINATION. This Agreement will be effective on the date You first use the Site and will continue until terminated. HEFWA may terminate this Agreement immediately, for any reason or no reason, with or without notice to You. You may terminate this Agreement upon written notice to HEFWA, such termination effective 10 business days following acknowledgment of receipt of such notice by HEFWA. HEFWA may also suspend your use of the Site and direct You to cease using the Site with or without notice to You and with or without cause. Upon any termination of this Agreement, all rights granted to You under this Agreement will cease; if You are a Registered User, your Account will be closed, and You must promptly discontinue all access to any part of the Site and the use of any Content downloaded or otherwise obtained from the Site. Sections 3, 4, 5, 6, 9, 10, 13 and 14 of these Terms of Use will survive termination or expiration of this Agreement for any reason.\n4. CONTENT. The text, files, images, graphics, illustrations, information, data, audio, video, photographs and other content (collectively, “Content”) available on or offered through the Site (such Content, collectively, “Site Content”) are protected by intellectual property rights, including, as applicable and without limitation, copyrights, trademarks, patents, and other proprietary and intellectual property rights (“Intellectual Property Rights”). Unless otherwise noted on the Site, as between You and HEFWA, its partners, affiliates, and licensors (“Affiliates”), all Site Content is owned by HEFWA and its Affiliates.\nUnless otherwise specifically stated in connection with particular Site Content, or in an additional agreement between HEFWA and You, the following terms and conditions apply to your use of Site Content.  \na. You may print a copy of any Site Content solely for your own personal, non-commercial use.\nb. You must use the Site Content in conformance with all terms and conditions displayed on the Site.\nc. You may use any Site Content only for instructional and educational purposes as part of programs sponsored by HEFWA, or for such other express purpose as may be expressly indicated on the Site Content itself.\nd. You may use the Site Content only in the form provided on or through the Site and may not modify, amend, or combine any Site Content with other material to form any new Content.\ne. You may not use any Site Content for any commercial purpose or charge a fee or other consideration in exchange for the Site Content.\nf. You may not utilize the Site Content to sell, advertise, endorse, or otherwise promote any other service, product, or party.\ng. All use of the Site Content must be accompanied by an acknowledgment that the Site Content is owned by HEFWA.\nh. You must otherwise abide by all Intellectual Property Rights, notices, information, or restrictions contained on or in any Site Content.\ni. You obtain no ownership rights in or to the Site or Site Content through this Agreement, and no other rights to utilize the Site Content other than as expressly set forth in this Agreement.\nYour access to and use of any Site Content is also subject to any other license or other agreement separate from this Agreement that You may have entered into (or may enter into) with HEFWA relating to that Site Content (each such license or other agreement, a “Content Agreement”). Except as expressly set forth in this Agreement or any Content Agreement, You are granted no licenses or rights, whether by implication, estoppel, or otherwise, in or to the Site or Site Content, or any Intellectual Property Rights therein or related thereto, and You may not modify, reproduce, perform, display, create derivative works from, republish, post, transmit, participate in the transfer or sale of, distribute, or in any way exploit any portion of the Site or Site Content without the prior written permission of HEFWA. If you would like to use the Site Content in a manner that is not expressly set forth in this Agreement or any other Content Agreement, please send your request to HEFWA by emailing HEFWA at [email protected]\n5. MARKS. Unless otherwise labeled, all trademarks, service marks, logos, banners, and page headers displayed on this Site (collectively, the \"Marks\") are the property of HEFWA and its Affiliates. Except as expressly set forth in this Agreement, You may not display, link to, or otherwise use the Marks without the prior written permission of HEFWA.\n6. POSTINGS AND USER CONTENT. The Site may include forums, bulletin boards, chat rooms, or other opportunities through which You may provide or upload Content to the Site (such Content, “Provided Content”). You agree not to upload or provide any Provided Content that is: (1) libelous, defamatory, obscene, abusive, pornographic, threatening, or an invasion of privacy; (2) an infringement of the Intellectual Property Rights of any third party; (3) illegal in any way or that advocates illegal activity; (4) an advertisement or solicitation of funds, goods, or services. You hereby represent and warrant to HEFWA and its Affiliates that You own all right, title, and interest in and to any Provided Content that You provide or upload to the Site, or that You have sufficient rights, whether by implication, estoppel, or otherwise, to grant HEFWA the rights discussed in this Section 6. You will indemnify, defend, and hold harmless HEFWA and its Affiliates from any and all third-party claims, losses, liabilities, damages, fees, expenses, and costs (including attorneys’ fees and court costs) that result from a breach or alleged breach of any representation or warranty set forth in Section 6. By providing or uploading any Provided Content to the Site, You grant HEFWA a nonexclusive, royalty-free, perpetual, irrevocable, and fully sublicensable right to use, copy, store, reproduce, modify, display, adapt, publish, translate, create derivative works from, distribute, and display such Provided Content throughout the world in any form, media, software, or technology of any kind now known or hereafter developed. In addition, you waive all moral rights in the Provided Content or warrant that all moral rights applicable to such content have been waived. You also grant HEFWA the right to use Your name in connection with the reproduction or distribution of such material.\n7. CLAIMS OF INFRINGEMENT. Just as HEFWA requires users of the Site to respect the copyrights and other intellectual property rights of HEFWA, its Affiliates, and third parties, HEFWA respects the copyrights and other intellectual property rights of users of the Site and other third parties. If You believe in good faith that Your copyrighted work has been reproduced on the Site without authorization in a way that constitutes copyright infringement.\nPlease provide the following information to HEFWA’s Copyright Infringement Agent:\n(1) the identity of the infringed work, and of the allegedly infringing work;\n(2) Your name, address, daytime phone number, and E-mail address, if available;\n(3) a statement that You have a good-faith belief that the use of the copyrighted work is not authorized by the owner, his or her agent, or the law;\n(4) a statement of the accuracy of the notice and, under penalty of perjury, that You are authorized to act on behalf of the owner; and\n(5) Your electronic or physical signature.\n8. REPRESENTATIONS AND WARRANTIES. You hereby represent, warrant, and covenant for the benefit of HEFWA and its Affiliates that: (1) You have the legal right and authority to enter into this Agreement, (2) You have the legal right and authority to perform Your obligations under this Agreement and to grant the rights and licenses described in this Agreement and in any applicable additional agreement You enter into in connection with the Site or Content; (3) all information You provide to HEFWA in connection with this Agreement and Your access to the Site and use of the Site or Content is correct and current.\n9. DISCLAIMER AND LIMITATION OF LIABILITY.\n9.1 Disclaimer. THE SITE IS PROVIDED BY HEFWA \"AS IS\" AND “AS AVAILABLE” WITH NO WARRANTIES WHATSOEVER. NEITHER HEFWA NOR ITS AFFILIATES REPRESENT OR ENDORSE THE ACCURACY OR RELIABILITY OF ANY ADVICE, OPINION, STATEMENT, OR OTHER INFORMATION OR MATERIALS DISPLAYED, DOWNLOADED FROM, OR DISTRIBUTED THROUGH THE SITE. YOU AGREE THAT YOUR ACCESS TO THE SITE IS AT YOUR OWN RISK AND THAT YOU ARE SOLELY RESPONSIBLE FOR ANY LIABILITY OR DAMAGE YOU INCUR THROUGH ACCESS TO THE SITE OR SUCH INFORMATION OR MATERIALS. EXCEPT WHERE THE LAWS AND REGULATIONS OF A PARTICULAR JURISDICTION CONCERNING WARRANTIES CANNOT BE WAIVED OR EXCLUDED BY AGREEMENT, HEFWA EXPRESSLY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS OR IMPLIED, REGARDING THE SITE AND SUCH INFORMATION, INCLUDING, WITHOUT LIMITATION, ALL WARRANTIES OF TITLE, NONINFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE. YOU RECOGNIZE THAT THE CURRENT STATE OF TECHNOLOGY DOES NOT ALLOW FOR ERROR-FREE ACCESS TO THE SITE AND INTERRUPTIONS, CRASHES, AND DOWNTIME BEYOND HEFWA’S CONTROL MAY OCCUR FROM TIME TO TIME.\n9.2 Limitation. IN NO EVENT WILL HEFWA BE LIABLE FOR ANY DIRECT, CONSEQUENTIAL, SPECIAL, INDIRECT, EXEMPLARY, OR PUNITIVE DAMAGES, WHETHER IN CONTRACT, TORT, OR ANY OTHER LEGAL THEORY, IN CONNECTION WITH YOUR ACCESS TO THE SITE OR USE OF ANY INFORMATION OR MATERIALS DISPLAYED, DOWNLOADED FROM, OR DISTRIBUTED THROUGH THE SITE, EVEN IF HEFWA HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES AND NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY LIMITED REMEDY. HEFWA’s total aggregate liability for any damages arising out of or related to this Agreement or the Site will not exceed $250.\n10. INDEMNIFICATION. You will indemnify, defend, and hold harmless HEFWA and its Affiliates, employees, agents, contractors, assigns, licensees, and successors in interest (“Indemnified Parties”) from any and all claims, losses, liabilities, damages, fees, expenses, and costs (including attorneys' fees, court costs, damage awards, and settlement amounts) that result from any claim or allegation against any Indemnified Party arising from Your accessing or use of the Site or Your breach of any term of this Agreement. HEFWA will provide You with notice of any such claim or allegation, and HEFWA will have the right to participate in the defense of any such claim at its expense.\n11. PRIVACY POLICY. The privacy policy set forth above (the “Privacy Policy”) which is incorporated in this Agreement by reference. By accepting this Agreement, You expressly consent to the use and disclosure of your personally identifiable and other information as described in the Privacy Policy.\n12. LINKED SITES. The Site may contain links to third-party sites that are not under the control of HEFWA, and HEFWA is not responsible for any content on any third-party site. If you access a third-party site from the Site, then you do so at your own risk. HEFWA provides links only as a convenience, and the inclusion of the link does not imply that HEFWA endorses or accepts any responsibility for the content on those third-party sites. HEFWA welcomes links to the Site. You may establish a link to this Site, provided that the link does not state or imply any sponsorship or endorsement of You or Your site by HEFWA or any group or individual affiliated with HEFWA. You may not use any Content or Marks appearing on the Site in establishing the link. You may not frame or otherwise incorporate into another site the Content or other materials on the Site without prior written consent from HEFWA.\n13. NOTICES. Except as expressly stated otherwise, any notices to HEFWA required or allowed under this Agreement will be given to HEFWA by postal mail to the address for HEFWA listed on the Site. If applicable law requires that HEFWA accepts E-mail notices (but not otherwise), then You may send HEFWA an E-mail notice by emailing HEFWA at [email protected] With respect to HEFWAs notices to You, HEFWA may provide notice of amendments by posting them on the Site and You agree to check for changes. In addition, or in lieu thereof, HEFWA may give notice by sending E-mail to the E-mail address You provide during registration for the Site, or by courier or postal mail if Your address is known to HEFWA. Notice shall be deemed given 24 hours after it is posted or an E-mail is sent, unless (as to E-mail) the sending party is notified that the E-mail address is invalid, or 3 business days after sending in the event of use of courier or postal mail.\n14. GENERAL TERMS.\n14.1 Third-Party Beneficiaries. HEFWA’s Affiliates are intended third-party beneficiaries under this Agreement with the right to enforce the provisions that directly concern Content to which they have rights.\n14.2 Nonassignment. You may not assign or transfer any of Your rights hereunder, and any attempt to do so will be null and void.\n14.3 Severability. If for any reason any provision of this Agreement shall be held invalid or unenforceable in whole or in part in any jurisdiction, such provision shall, as to such jurisdiction, be ineffective to the extent of such invalidity or unenforceability, without in any manner affecting the validity or enforceability thereof in any other jurisdiction or the remaining provisions hereof in any jurisdiction.\n14.5 Jurisdiction and Venue. This Agreement will be governed by the laws of the State of Colorado, without giving effect to any conflict of laws principles. The parties specifically exclude from application to the Agreement the United Nations Convention on Contracts for the International Sale of Goods and the Uniform Computer Information Transactions Act. You hereby irrevocably and unconditionally consent to the jurisdiction and venue in the state and federal courts sitting in Denver, Colorado. In any such dispute, the prevailing party will be entitled to recover its reasonable attorneys’ fees and expenses from the other party. \n\n\n\n\n\nI accept and agree to the terms of the Privacy Policy and Terms of Use.\n\n\n\n\n\nCAPTCHA\nCAPTCHA\n\n\n\n\nRegister\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTo learn more about HEFWA, visit www.hefwa.org\n\n\n\n\n\n\n\n\n\nStay in touch with CashCourse\nFacebook Twitter \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n Copyright ©\n2023 Higher Education Financial Wellness Alliance. All rights reserved.\n504 N Fess Ave. • Bloomington, IN 47405 • 812.855.9159 \n\nPrivacy Policy |\nTerms of Use |\nSite Map |\nContact Us |\nAccessibility Statement |\nRequest Accommodation |\nDownload Adobe Reader\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSuccess!\nYou've successfully updated your email address. Please click here to login by using your new email address.\n\nOK\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://hefwa.org/membership/join-the-alliance.html",
        "/cdn-cgi/l/email-protection#224143514a414d57505147624a474455430c4d50451d515740484741561f6a676475630710126f474f404750514a4b52",
        "javascript:void(0);",
        "#main",
        "#",
        "#",
        "/login-page.aspx",
        "/get-started-as-a-cashcourse-administrator.aspx",
        "#",
        "/login-page",
        "/info",
        "/registration.aspx",
        "https://www.youtube.com/watch?v=WUg2cwbRFlI",
        "//cashcourse.org/info",
        "javascript:WebForm_DoPostBackWithOptions(new WebForm_PostBackOptions(\"dnn$dnnLOGIN$ForgotPassword\", \"\", true, \"password\", \"\", false, true))",
        "#",
        "#",
        "/registration.aspx",
        "/get-started-as-a-cashcourse-administrator.aspx",
        "/cdn-cgi/l/email-protection",
        "/cdn-cgi/l/email-protection",
        "/cdn-cgi/l/email-protection",
        "/cdn-cgi/l/email-protection",
        "javascript:WebForm_DoPostBackWithOptions(new WebForm_PostBackOptions(\"dnn$dnnSTUDENTREGISTER$registrationButton\", \"\", true, \"register\", \"\", false, true))",
        "http://www.hefwa.org",
        "https://www.facebook.com/cashcourse.org",
        "https://twitter.com/the_hefwa",
        "https://www.linkedin.com/company/hefwa",
        "https://hefwa.org/",
        "/privacy-policy",
        "/cashcourse-terms",
        "/user-site-map",
        "/contact-us",
        "/about-CashCourse/Accessibility-Statement",
        "/request-accommodation.aspx",
        "https://acrobat.adobe.com/us/en/acrobat/pdf-reader.html",
        "/login-page"
    ]
}