{
    "title": "Home | NorCal Teach Up",
    "body": "\n\n\n\n\n\n\n\n\n\ntop of pageTeacher Credentialing Partnership ProjectNorCal Teach Up \nHistorically, education was reserved for the wealthy and privileged to ensure power stayed with the elite. However, times have changed and change has been created by people from all walks of life. The thread weaving the change-makers together? \nEDUCATIONThe NorCal Teach Up pilot project supports the planning activities to create distance-learning opportunities at the community colleges through teacher credentialing programs in our partnership area. This program specifically addresses the needs of rural communities by offering clearly defined pathways for completion for teachers currently holding a Short-Term Staff Permit (STSP) or a Provisional Internship Permit (PIP). Collectively, we serve and partner with over 130 TK-12 Districts and 14 County Offices of Education in the following counties: Butte, Colusa, Glen, Humboldt, Lake, Lassen, Modoc, Placer, Plumas, Shasta, Sutter, Tehama, Trinity, Yolo, and Yuba. Education is the most powerful weapon which\nyou can use to change the world.\n- Nelson Mandela“As we observe children, we see the vitality of their spirit, the maximum effort put forth in all they do, the intuition, attention and focus they bring to all life’s events, and the sheer joy they experience in living.” —The Child, Society and the World \n(Unpublished Speeches and Writing) Maria MontessoriNorCal Teach Up ProgramsGet Started\n\n\n\n\n\nGet Started\n\n\n\n\n\nGet Started\n\n\n\n\n\nOnline & Hybrid ClassesStudent ResourcesStudent StipendsBasic Needs SupportWifi & Local Study SpacesCredentialing Exam SupportAbout UsProject Purpose​\nThe NorCal Teach Up pilot project supports the planning activities to create distance-learning opportunities at the community colleges through teacher credentialing programs in our partnership area. This program specifically addresses the needs of rural communities by offering clearly defined pathways for completion for teachers currently holding a Short-Term Staff Permit (STSP) or a Provisional Internship Permit (PIP). Collectively, we serve and partner with over 130 TK-12 Districts and 14 County Offices of Education in the following counties: Butte, Colusa, Glen, Humboldt, Lake, Lassen, Modoc, Placer, Plumas, Shasta, Sutter, Tehama, Trinity, Yolo, and Yuba. Tonya Mack Dr. Nathan HerzogLearn More\n\n\n\n\n\nLearn More\n\n\n\n\n\nCynthia LennersLearn More\n\n\n\n\n\n Director, NorCal Teach Up \nTeacher Credential Partnership Project\nYuba Community College District​\nDean, School of Education\nWilliam Jessup University​\nAssociate Dean for College of\nCommunication & Education\nCalifornia State University, Chico​\nDeputy Superintendent\nLake County Office of EducationDr. Deborah SummersAdvisory CommitteeDr. Sonja Lolland, Vice-Chancellor, Education and Planning, YCCD \nKuldeep Kaur, Vice-Chancellor, Administrative Services, YCCD \nDevin Crosby, Chief Technology Officer, YCCD \nJason Musselman, Director, YCCD \nJamie Buckner-Bridges, Coordinator for Teach Lake County, LCOE \nCynthia Lenners, Deputy Superintendent, Education Services, LCOE \nElisha Cooley, Credentials Specialist, LCOE\nDeni Dillsaver, Program Assistant, Teach Lake County, LCOE \nDr. Deborah Summers, Associate Dean, Chico State University \nDr. Rebecca Justeson, Director, School of Education, Chico State University \nAmanda Taylor, Credential Advisor, Chico State University \nCheryl Ordorica, Recruiter, Chico State University \nDr. Nathan Hertzog, Dean, School of Education, William Jessup University \nAmy Schutter, Director of Grant Development, Shasta Community College \nTerri Hutton, Chair, Education, Child and Family Studies, Butte College \nDenice Burbach, ECE Program Coordinator, Yuba CollegeSign up for our Email List!Stay up-to-date with the latest newsEnter your email hereSign UpThanks for submitting!AcknowledgementsThis project is funded by SB577 Public postsecondary education: California Community College Teacher Credentialing Partnership Pilot Program.  With acknowledgment and sincere appreciation to the efforts of those who worked tirelessly on behalf of our students, teachers, and community.\n \nLead Author\n\n\nSenator Dodd \n\nCo-Authors\n\n\nSenator Anderson\n\n\nSenator Hill\n\n\nSenator McGuire\n\n\nSenator Wilks \n\n\nAssembly Member Aguiar-Curry\n\n\nAssembly Member Gallagher\n\n\nAssembly Member Grayson\n\n\nAssembly Member Steinorth\n\nContact Us Tonya Mack\nDirector, NorCal Teach Up  \nPreferred Pronouns: she/her\n​\nYuba Community College District\nEMAIL: tmack@yccd.eduStrategic Visionaries Marquita Grenot-Scheyer, Ph.D.\nAssistant Vice Chancellor\nEducator Preparation and Public School Programs\nCalifornia State University (CSU) \nOffice of the ChancellorDr. Douglas Houston\nEmeritus Chancellor\nYuba Community College DistrictQuestions, Comments, or Fan MailSubmitThanks for submitting!© 2021 NorCal Teach Up Teacher Credentialing Partnership Programbottom of page\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.norcalteachup.com",
        "https://www.csuchico.edu/soe/credential/index.shtml",
        "https://www.csuchico.edu/soe/credential/index.shtml",
        "https://jessup.edu",
        "https://jessup.edu/academics/schools-institutes/school-of-education/",
        "http://lakecoe.org/tlc",
        "http://lakecoe.org/tlc",
        "https://jessup.edu/about/faculty/nathan-herzog-ph-d/",
        "https://www.csuchico.edu/cme/about/college-staff.shtml",
        "http://lakecoe.org",
        "mailto:tmack@yccd.edu",
        "https://www.facebook.com/norcalteachup",
        "https://www.youtube.com/user/Wix",
        "https://www.instagram.com/norcalteachup"
    ]
}