{
    "title": "Chico Facts – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\n\t\t\t        Chico State\n\t\t\t    MenuShow search box.AboutAcademicsCost & AidAdmissionsStudent LifeAthleticsAlumniGiveApplyVisitRequest InfoCSU, ChicoAboutCurrent page:  Chico Facts\n                        \n    \t\tChico Facts\n    \tQuick FactsStudentsTen Largest MajorsBachelor's Degrees GrantedFaculty & Staff StatsAcademic ProgramsTuition FeesPhilanthropic SupportCSU, Chico's HistoryFacilitiesChico Geographical FactsChico CommunityQuick FactsCalifornia State University, Chico (popularly called \"Chico State\")Founded: 1887President: Gayle HutchinsonStudent/Faculty ratio: 24 to 1Average Undergraduate Class Size: 28Campus Acreage: Main campus 132 acres; University Farm 800 acres; Ecological Reserves 4,043 acresTotal General Fund Budget: $243 millionLocation: 90 miles north of Sacramento; 174 miles northeast of San FranciscoService Counties: Butte, Colusa, Glenn, Lassen, Modoc, Plumas, Shasta, Siskiyou, Sutter, Tehama, Trinity, YubaSchool Mascot: WildcatSchool Colors: Red and whiteAlumni: 177,383Back to topStudents(Fall 2022)Full-Time Equivalent students 12,869 (FTE: total number of course hours enrolled in during a particular semester, divided by 15 for undergraduates; divided by 12 for graduate students)Total Number of Students 13,840Freshmen: 2,824 (20.4%) Sophomores: 1,754 (12.7%) Juniors: 3,415 (24.7%) Seniors: 4,892 (35.3%) Postbaccalaureate Students: 955 (6.9%)Age CSU, Chico Average (undergraduate and graduate): 22   Undergraduate Average: 22EthnicityAmerican Indian/Alaskan Native: 0.4%  Asian: 5.6%  Black/African American: 2.5%  Hispanic/Latino: 36.8%  Native Hawaiian/Pacific Islander: 0.2%  White: 43.3%  Two or More Races/Ethnicities: 5.3%  Declined to State: 3.5%Gender Female: 55%  Male: 44.8% Nonbinary: 0.2%View additional student diversity demographics.Student Profile Our students come from 46 nations, 30 states, and 1 U.S. territory.97% of the total student population comes from California: 26.5% from Chico State's service area; 10.3% from the Sacramento Area; 22.3% from the San Francisco Bay Area; 20.9% from the Los Angeles area; and 17% from the rest of California. The remaining 3% are out-of-state or international students.All students are members of the Associated Students of CSU, Chico, a multimillion-dollar corporation managed by students. The AS is responsible for the student government, the Chico State Wildcat Store, the Wildcat Recreation Center(opens in new window), Adventure Outings, the student union (Bell Memorial Union), and many other programs for students, including Community Action Volunteers in Education (CAVE), Child Development Lab (campus daycare), Community Legal Information Clinic (CLIC), Gender & Sexuality Equity Coalition (GSEC), and the Sustainability program.Some student publications include The Orion student newspaper, The Chico Historian academic journal, and Watershed Review literary magazine.Freshman ProfileAverage High School GPA: 3.58 (admits) / 3.41 (enrolled)Back to topTen Largest MajorsBased on current number of students officially declaring majors.Business Administration 1,809Psychology 1,041Pre-Nursing 725Liberal Studies 518Computer Science 453Criminal Justice 439Sociology 409Construction Management 405Animal Science 400Computer Animation and Game Development 384Back to topBachelor's Degrees GrantedTen majors with the most bachelor's degrees granted. Based on the actual number of degrees granted during the 2021–22 academic year.Business Administration 657Psychology 353Liberal Studies 188Sociology 157Criminal Justice 141Exercise Physiology 119Social Work 112Communication Studies 110Biology 99Construction Management 107Back to topFaculty & Staff Stats(Fall 2021)Instructional Faculty 915* Full-time Faculty: 56.4% Part-time Faculty: 43.6%Staff 1,031**Coaches, librarians, and others who have faculty status but primarily engage in noninstructional functions are counted as staff rather than instructional faculty.Ethnicity - Instructional FacultyAmerican Indian/Alaska Native: 0.6%  Asian: 8%  Black/African American: 2.4%  Hispanic/Latino: 3.9% White: 75% Two or More Ethnicities: 2.2% Not Specified: 8%Ethnicity - StaffAmerican Indian/Alaska Native: 0.6%  Asian: 5.2%  Black/African American: 1.9%  Hispanic/Latino: 14.1%  Native Hawaiian/Other Pacific Island: 0.3%  White: 67.1% Two or More Ethnicities: 3.2%  Not Specified: 7.6%Gender - Instructional Faculty Female: 53%  Male: 47%Gender - Staff Female: 57%  Male: 43%View additional employee diversity demographics.Back to topAcademic ProgramsCSU, Chico has 7 colleges, 5 schools, and 22 centers and institutes:College of AgricultureCollege of Natural SciencesSchool of NursingCollege of Behavioral and Social SciencesSchool of Social WorkCollege of BusinessCollege of Communication and EducationSchool of CommunicationSchool of EducationCollege of Engineering, Computer Science, and Construction ManagementCollege of Humanities and Fine ArtsSchool of the ArtsFall 2022Bachelor of Arts Programs: 35Bachelor of Science Programs: 34BA and BS Options (within the Major): 77Master of Arts Programs: 12Master of Science Programs: 11MA and MS Options (within the Major): 23Minors: 111Certificate Programs: 28Professional Education Credential Programs: 12Other Programs Offered:\nBachelor of Fine Arts: 3Master of Business Administration: 1Master of Fine Arts: 1Master of Public Administration: 1Master of Social Work: 1Master of Teaching: 1Pre-Professional Programs in dental hygiene, dentistry, forensic science, forestry, law, medicine, optometry, pharmacy, physical therapy, theology, and veterinary medicineThe Honors Program offers special opportunities for motivated undergraduate students with high grade point averages. These opportunities range from specially designed courses in general education (Honors in General Education Program) and in selected majors (Honors in the Major Program) to many honors societies that students can join.Chico State is accredited by the Western Association of Colleges and Schools, as well as a number of professional associations covering all seven colleges.Explore All ProgramsCenters and InstitutesBig Chico Creek ReserveCalifornia Mechatronics Center California Pavement Preservation CenterCenter for Bilingual/Multicultural Studies Center for Economic DevelopmentCenter for Enterprise Systems and Informatics Research (CESR)Center for Entrepreneurship Center for Excellence in Finance Center for Healthy Communities (CHC) Center for Mathematics and Science Education (CMSE)Center for Regenerative Agriculture and Resilient Systems (CRARS)Center for Water and the Environment (CWE) Chico State Herbarium Education for the Future Gateway Science Museum Geographical Information CenterJanet Turner Print MuseumNortheast Information Center (NEIC) Passages Adult Resource CenterRural Northern California Clinical Simulation Center (Sim Center) Valene L. Smith Museum of AnthropologyBack to topTuition Fees*(Spring 2023)Undergraduate:0–6 units: $2,782 total per semester 6.1+ units: $3,988 total per semesterGraduate:0–6 units: $3,199 total per semester 6.1+ units: $4,705 total per semesterCredential:0–6 units: $3,049 total per semester 6.1+ units: $4,447 total per semester(Nonresident tuition: $396 per unit, in addition to fees)*All CSU tuition fees should be regarded as estimates that are subject to change upon approval by the Board of Trustees.Estimated Costs and FinancesResidence Hall ratesBack to topPhilanthropic Support(2021–22)Donor Gifts and Pledges: $17,856,085Total Individual Donors: 7,977Total Endowment: $81.7 millionBack to topCSU, Chico's HistoryThe Mechoopda Maidu Indians were the original inhabitants of the area issued as the Rancho Arroyo Chico land grant to William Dickey in 1845. General John Bidwell, pioneer, statesman, and founder of Chico, subsequently bought the grant. In 1887, Bidwell donated eight acres of cherry orchard, and construction began on Chico State Normal School. The campus opened in 1889 with 90 students and five faculty members. The first class of teachers graduated in June 1891. Chico State Normal School became Chico State Teachers College in 1921. The legislature converted its teachers colleges to state colleges in 1935, and Chico State Teachers College became Chico State College. In 1972, the college became California State University, Chico.Back to topFacilitiesArt Galleries and Museums: The Turner Print Museum features a collection of over 3,000 fine art prints spanning six centuries, while the  Jacki Headley University Art Gallery(opens in new window) presents contemporary exhibitions featuring regional, national, and international artists. Student-centered galleries include the B-SO Space and the Master of Fine Arts Galleries. The  Valene L. Smith Museum of Anthropology offers student-curated exhibits, lecture series, and summer camps, and the Gateway Science Museum creates educational programs to teach school children about the world around them.Athletics: There are 13 Division II men's and women's athletic teams, with an all-weather track, putting green, jogging trails, two gyms, a soccer stadium, softball fields, Nettleton Stadium (for baseball), tennis courts, basketball courts, weight room, and other facilities.Housing: The University provides 2,260 living spaces in six on-campus residence halls and one off-campus apartment complex (University Village). See Housing website for housing options and costs.Laboratories: Agriculture, Anthropology, Archeology, Art, Biology, Bio-Psychology, Chemistry, Child Development, Computer Science, Consumer Science, Counseling Psychology, Dietetics/Food Nutrition, Engineering, Exercise Physiology, Foreign Language, Kinesiology, Geosciences, Manufacturing, Physics, Physical Anthropology, Psychology, and Agriculture and Biology greenhouses are among the many labs on campus. In addition, there are many student computing facilities (three university open-access labs, including a 24-hour lab; 40+ department labs; and seven residence hall labs).Meriam Library: The University's library is a four-story building housing close to a million print volumes with complete Wi-Fi coverage on all floors. It also contains computer labs, private study rooms, and high-tech collaborative learning spaces. Through the Library ReSEARCH Station, users can access more than 100 electronic databases leading to full-text articles in over 41,000 journals and get help with their research online using Ask A Librarian(opens in new window). Special Collections houses the northeastern California collection of books, photographs, and manuscripts as well as the University Archives and the Rare Book Collection.Performing Arts and Public Events: The University has three theatres, one auditorium, two gyms, and three athletic stadiums, attracting more than 150,000 people from the region to attend activities on campus each year. The School of the Arts presents an active calendar of student performances and art events of all kinds, including the North State Symphony; the annual spring musical; and galleries showcasing work of students, faculty, and invited artists. The Humanities Center hosts an eclectic calendar of speakers and faculty symposia. Chico Performances presents a variety of professional touring artists in music, dance, and theatre. It also hosts the President's Lecture Series, which has included Mikhail Gorbachev, Desmond Tutu, Jane Goodall, and Shimon Peres.Preserves: Chico State Enterprises manages several land preserves for the primary purposes of protection, enhancement, research, and education. These include the 3,950-acre  Big Chico Creek Ecological Reserve, the 300-acre  Butte Creek Ecological Preserve, and the 80-acre Eagle Lake Field Station.University Farm: The 800-acre Paul L. Byrne University Farm offers lab experience in beef, swine, sheep, goat, and organic dairy production; meat lab; ag mechanics; orchard management, crops, soils, and sustainable agriculture.Back to topChico Geographical FactsChico is 90 miles north of Sacramento.Chico is 174 miles northeast of San Francisco.Chico is 8 miles from the Sacramento River.Chico is 2 miles from the foothills of the Sierra Nevada.Bidwell Park has a total of 3,670 acres, making it one of the largest municipal parks in the United States.Chico is 230 feet above sea level.Chico has an average of 249 clear days in a typical year.Average annual rainfall is 28 inches.Population of Butte County(opens in new window) (2021 estimate) is 208,309.Population density of Butte County is approximately 129 persons per square mile, compared to 254 for the state of California.Back to topChico CommunityCity of Chico(opens in new window) Government : City Council and City ManagerDate of City Incorporation: January 8, 1872Chico City Population (2021 estimate): 102,338General: Chico is a consummate college town, with an abundance of cultural and recreational resources in combination with a small-town feel. The city has strived to maintain its strong sense of community, while simultaneously establishing itself as a dynamic regional center for business, education, recreation, and culture.Over the years, Chico has garnered recognition among the “Best Places in America” by Forbes magazine, the “Best Places to Retire” by U.S. News & World Report. Its dedication to the environment has landed acknowledgment as the “Best Green Places to Live” by Country Home Magazine, and active lifestyle heralded by TIME magazine's \"Top 10 Cities in the Nation Where People Exercise the Most,\" Outdoor's \"Best Towns,\" and  Bicycle's  “America's Best Bike Town.\"Visit Chico(opens in new window) for a firsthand look at the unique Chico experience. For a look at the major achievements of faculty, students, and alumni, check out our Chico State Today.We acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.MenuChico State HomeAboutAcademicsAdmissionsCost & AidStudent LifeAcademic DepartmentsAthleticsAlumniParentsChico FactsGiveResourcesQuicklinksCampus CalendarCampus SafetyJob OpportunitiesAccessibility Resource CenterAnnual Security Report (PDF)\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "../index.shtml",
        "javascript:void(0)",
        "#task-nav",
        "index.shtml",
        "../academics/index.shtml",
        "../cost.shtml",
        "https://www.csuchico.edu/admissions/index.shtml",
        "../student-life.shtml",
        "https://chicowildcats.com",
        "https://www.csuchico.edu/alumni/index.shtml",
        "https://www.csuchico.edu/give/index.shtml",
        "https://www.csuchico.edu/admissions/apply/index.shtml",
        "https://www.csuchico.edu/admissions/visit/index.shtml",
        "https://www.csuchico.edu/admissions/request-information.shtml",
        "https://www.csuchico.edu",
        "index.shtml",
        "#quick-facts",
        "#students",
        "#largest-majors",
        "#degrees-granted",
        "#faculty-staff",
        "#academic-programs",
        "#tuition-fees",
        "#phil-support",
        "#history",
        "#facilities",
        "#geo-facts",
        "#community",
        "https://www.csuchico.edu/pres/about-the-president.shtml",
        "#top",
        "https://wildcats-bi-ext.csuchico.edu/t/InstitutionalResearch/views/EmployeeStudentDiversity/EmployeeandStudentDiversityataGlance?iframeSizedToWindow=true&:embed=y&:showAppBanner=false&:display_count=no&:showVizHome=no",
        "https://as.csuchico.edu",
        "https://as.csuchico.edu/index.php/government-affairs/",
        "https://www.bkstr.com/chicostatewildcatstore/home",
        "https://as.csuchico.edu/index.php/wildcat-recreation-center-wrec/",
        "https://as.csuchico.edu/index.php/adventure-outings/",
        "https://as.csuchico.edu/index.php/volunteer-opportunities-cave/",
        "https://www.csuchico.edu/chld/lab/index.shtml",
        "https://as.csuchico.edu/index.php/legal-assistance-clic/about-legal-assistance-clic/",
        "https://www.csuchico.edu/mcgs/gsec/index.shtml",
        "https://as.csuchico.edu/index.php/sustainability/",
        "http://www.theorion.com/",
        "https://www.csuchico.edu/hist/students/historian.shtml",
        "https://watershedcsuc.wordpress.com/",
        "#top",
        "https://www.csuchico.edu/cob/index.shtml",
        "https://www.csuchico.edu/psy/index.shtml",
        "https://www.csuchico.edu/nurs/index.shtml",
        "https://www.csuchico.edu/lbst/index.shtml",
        "https://www.csuchico.edu/ecc/about/program-portfolio/bs-csci/index.shtml",
        "https://www.csuchico.edu/pols/academics/undergrad/criminal-justice.shtml",
        "https://www.csuchico.edu/soci/index.shtml",
        "https://www.csuchico.edu/cm/index.shtml",
        "https://www.csuchico.edu/ag/degrees-options/animal-science/index.shtml",
        "https://www.csuchico.edu/cagd/index.shtml",
        "#top",
        "https://www.csuchico.edu/cob/index.shtml",
        "https://www.csuchico.edu/psy/index.shtml",
        "https://www.csuchico.edu/lbst/index.shtml",
        "https://www.csuchico.edu/soci/index.shtml",
        "https://www.csuchico.edu/pols/academics/undergrad/criminal-justice.shtml",
        "https://www.csuchico.edu/kine/academic-programs/bs-exercise-physiology/index.shtml",
        "https://www.csuchico.edu/swrk/index.shtml",
        "https://www.csuchico.edu/cmst/index.shtml",
        "https://www.csuchico.edu/biol/",
        "https://www.csuchico.edu/cm/index.shtml",
        "#top",
        "https://wildcats-bi-ext.csuchico.edu/t/InstitutionalResearch/views/EmployeeDiversity/EmployeeGenderataGlance?iframeSizedToWindow=true&:embed=y&:showAppBanner=false&:display_count=no&:showVizHome=no",
        "#top",
        "https://www.csuchico.edu/ag/index.shtml",
        "https://www.csuchico.edu/nsci/index.shtml",
        "https://www.csuchico.edu/nurs/index.shtml",
        "https://www.csuchico.edu/bss/index.shtml",
        "https://www.csuchico.edu/swrk/index.shtml",
        "https://www.csuchico.edu/cob/index.shtml",
        "https://www.csuchico.edu/cme/index.shtml",
        "http://www.ecst.csuchico.edu/",
        "https://www.csuchico.edu/hfa/index.shtml",
        "https://www.csuchico.edu/soa/index.shtml",
        "https://www.csuchico.edu/honors/index.shtml",
        "https://catalog.csuchico.edu/explore-programs/",
        "https://www.csuchico.edu/bccer/index.shtml",
        "http://www.mechatronicscenter.com/",
        "https://www.csuchico.edu/cp2c/index.shtml",
        "https://www.csuchico.edu/cbms/index.shtml",
        "https://www.nspdc.csuchico.edu/#/ced",
        "https://www.csuchico.edu/cob/programs/centers/cesir.shtml",
        "https://www.csuchico.edu/cob/programs/centers/center-for-entrepreneurship/index.shtml",
        "https://www.csuchico.edu/cob/programs/centers/cef/index.shtml",
        "https://www.csuchico.edu/chc/index.shtml",
        "https://www.csuchico.edu/ag/about/agribusiness-institute.shtml",
        "https://www.csuchico.edu/cmse/index.shtml",
        "https://www.csuchico.edu/regenerativeagriculture/index.shtml",
        "https://www.csuchico.edu/cwe/index.shtml",
        "https://www.csuchico.edu/herbarium/index.shtml",
        "https://edforthefuture.com/",
        "https://www.csuchico.edu/gateway/index.shtml",
        "https://www.nspdc.csuchico.edu/#/gic/aboutthegic",
        "https://www.csuchico.edu/turner/index.shtml",
        "https://www.csuchico.edu/neic/index.shtml",
        "https://www.csuchico.edu/ag/about/agribusiness-institute.shtml",
        "http://www.passagescenter.org/",
        "https://www.ruralsimcenter.org/",
        "https://www.csuchico.edu/anthmuseum/index.shtml",
        "#top",
        "https://www.csuchico.edu/fa/cost/index.shtml",
        "https://www.csuchico.edu/housing/cost/nextaycost.shtml",
        "#top",
        "#top",
        "#top",
        "https://www.csuchico.edu/turner/index.shtml",
        "https://www.facebook.com/HeadleyGalleryCSUChico/",
        "https://www.csuchico.edu/art/spaces/galleries/b-so.shtml",
        "https://www.csuchico.edu/art/spaces/galleries/a..shtml",
        "https://www.csuchico.edu/anthmuseum/index.shtml",
        "https://www.csuchico.edu/gateway/index.shtml",
        "https://chicowildcats.com/",
        "https://www.csuchico.edu/housing/index.shtml",
        "https://www.csuchico.edu/housing/index.shtml",
        "https://www.csuchico.edu/itss/labs/index.shtml",
        "https://library.csuchico.edu",
        "https://library.csuchico.edu",
        "https://library.csuchico.edu/ask-a-librarian",
        "http://www.northstatesymphony.org/",
        "https://www.csuchico.edu/humanitiescenter/index.shtml",
        "https://www.csuchico.edu/upe/performance/",
        "https://www.csuchico.edu/bccer/index.shtml",
        "https://www.csuchico.edu/bcep/index.shtml",
        "https://www.csuchico.edu/ag/university-farm/index.shtml",
        "#top",
        "https://www.buttecounty.net/",
        "#top",
        "http://www.chico.ca.us/",
        "https://www.csuchico.edu/admissions/visit/index.shtml",
        "https://today.csuchico.edu/category/excellence/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "http://instagram.com/chicostate",
        "https://www.linkedin.com/edu/school?id=17823",
        "https://www.flickr.com/photos/chicostate",
        "https://www.youtube.com/user/ChicoStateChannel",
        "https://www.csuchico.edu",
        "index.shtml",
        "../academics/index.shtml",
        "https://www.csuchico.edu/admissions/index.shtml",
        "../cost.shtml",
        "../student-life.shtml",
        "../academics/academic-departments.shtml",
        "https://chicowildcats.com/",
        "https://www.csuchico.edu/alumni/index.shtml",
        "https://www.csuchico.edu/parents/index.shtml",
        "chico-facts.shtml",
        "https://www.csuchico.edu/giving/index.shtml",
        "../audience-resources.shtml",
        "https://www.csuchico.edu/calendar/index.shtml",
        "https://www.csuchico.edu/campus-safety/index.shtml",
        "../employment.shtml",
        "https://www.csuchico.edu/arc/index.shtml",
        "https://www.csuchico.edu/clery/_assets/documents/annual-security-report.pdf",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}