{
    "title": "High schoolers get university-level education in particle physics | Inside UCR",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\nUniversity of California, Riverside\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUC Riverside\n\n\n\n\n Inside UCR \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nHome\n\n\nStories\n\n\nResearch Blog\n\n\n\n\nAwards & Honors\n\n\nAnnouncements\n\n\nScotMemos\n\n\nEvents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreadcrumb\n\n\n\n\n\n\n\n\n \n\nStories\n\n\nMarch 21st, 2023\n\n\nHigh schoolers get university-level education in particle physics\n\n\n\n\n\n\n\n\n\n\nFollow US:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHigh schoolers get university-level education in particle physics\nThe students compared their experiment results with those obtained by European students \n\nMarch 21, 2023\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAuthor:\nIqbal Pittalwala\n\n\n\n\n  March 21, 2023\n\n\n\n\n\n\n\n\n\n\n\n\nFifteen students from Ramona High School and 12 from Hemet High School got to learn some of the latest findings in particle physics when they visited UC Riverside on Monday and Tuesday this week.  \n\n \n\nJ. William Gary gave an overview of the fundamental constituents of matter.\n\nThe International Particle Physics Masterclass the students attended is an annual program of the European Particle Physics Outreach Group. The students attended lectures on particle physics given by faculty and students in UCR's Department of Physics and Astronomy, which hosts the masterclass on campus. They also analyzed data from ATLAS, a detector at the Large Hadron Collider, or LHC, the world’s highest energy particle collider, located at the CERN laboratory on the border of Switzerland and France.\nThe LHC collides a proton beam with another proton beam, using the kinetic energy of the beams to create particles, such as the Higgs boson and W and Z bosons, through Einstein’s famous relation E = mc2. W and Z bosons are responsible for the weak force, one of four fundamental forces that govern the present universe. The Higgs boson explains how elementary particles, such as the W and Z bosons, obtain their mass. The high school students spent Monday afternoon looking at ATLAS data to search for Z and Higgs bosons.\nEarlier in the day, John William Gary, a professor of physics and astronomy, gave an overview of physicists’ current understanding of the fundamental constituents of matter. He explained that a hadron is a particle comprised of quarks, such as protons or neutrons found in the nucleus of an atom. Gary also discussed dark matter with the students and explained that, although it dominates matter in the universe, physicists still do not know what it is. The Standard Model of particle physics, our current theory of fundamental particles and forces, is unable to explain dark matter, he said.\n\n \n\nAs part of the masterclass, Owen Long gave a lecture on detectors to the local high school students.\n\nOwen Long, the chair of the Department of Physics and Astronomy, talked about detectors for particle and nuclear physics. Some particles are stable, but most are not, he said. Unstable particles decay into stable ones, with only stable and long-lived particles leaving clear signals in a detector such as ATLAS. He explained that detectors are not perfect and are only as good as the physicist “reading” them. The technology developed for particle physics detectors has found applications in medicine, he said, with positron emission tomography and beam radiation therapy for cancer being two well-known examples.\nGraduate student Sean Preins gave a talk on the Standard Model. The model predicts the existence of the Higgs boson as well as how it is produced and decays, which the LHC can test. Preins explained that if the Standard Model is a complete theory, the Higgs boson, discovered at the LHC in 2012, will have been the last particle to be discovered. If there is something beyond the Standard Model, such as supersymmetry, there could be many more particles to be discovered, he said. Physics undergraduate students Peter Carney and Luis Garabito gave talks on their work for the Electron Ion Collider, whose aim is to understand the inner workings of the proton.\n\n \n\nGraduate student Sean Preins discussed the Standard Model, which explains how the basic building blocks of matter interact.\n\nJohn-Henry Cottrell, who has been teaching physics to juniors and seniors at Hemet High School for 14 years, also attended the lectures and hands-on exercises on Monday. He said his students must first attend a three-month club at the high school, where they have weekly discussions on particle physics to build a strong background for attending the masterclass. Cottrell believes the masterclass gives his students exposure to the UCR Department of Physics and Astronomy and an opportunity to interact with professors. His goals are to get the students to appreciate what high energy physics can accomplish and have them consider UCR for their undergraduate education.\nOn Tuesday, the high school students took part in a videoconference with CERN and high schools in Germany, Italy, and the Czech Republic, and compared their results from their Monday experiments.\nThe masterclass has been held each year at UCR since 2008. No masterclass was held on campus in 2020, 2021, and 2022 because of the COVID-19 pandemic.\nThe Department of Physics and Astronomy has 41 faculty members, 200 undergraduate students, and 122 graduate students. More than 80% of its undergraduates participate in research.\n\n \n\nThe visiting high school students got to tour two labs in the Department of Physics and Astronomy. (UCR/Sean Preins)\n\n\n \n\nStudents from Ramona High School and Hemet High School participated in this year's masterclass. (UCR/Stan Lim)\n\n\n \n\nSeniors Alan Sampel, 17, left, and Jakob Ross, 17, from Ramona High School work together as they attend a masterclass exercise in particle physics. (UCR/Stan Lim)\n\nHeader image: John William Gary, second from right, leads an exercise as part of the masterclass. (UCR/Stan Lim)\n\nShare this Story\nTags\n\nmasterclass\nDepartment of Physics and Astronomy\nCollege of Natural and Agricultural Sciences\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelated Stories\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommunity chat exposes pandemic-related health disparities\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFirst group of community college students accepted into UC Riverside California Medicine Scholars Program\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTreatment needs of unhoused Hawaiians requires more attention, study says\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUCR receives $1.5 million to support carbon capture technology research\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nUniversity of California, Riverside\n\n900 University Ave.\n            Riverside, CA 92521\nTel: (951) 827-1012\n\n\nUCR Library\nCampus Status\nCampus Store\nCareer Opportunities\nDiversity\nMaps and Directions\nVisit UCR\n\n\n\n\n\nUniversity of California, Riverside\n\n             900 University Ave.\n            Riverside, CA 92521                         \n tel: (951) 827-0000                        email: webmaster@ucr.edu \n\n\n Find Us\n\n\n\n\n\n\n\n\nFollow Us:\n           \n\n\n\n\n\n\n\n\nRelated Links\n\n\nUCR News\n\nResearch Blog\n\nInside UCR Archive\n\nHuman Resources\n\nUC Path Portal\n\nStaff Assembly\n\nUC Newsroom\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy and Accessibility\nTerms and Conditions\n© 2023 Regents of the University of California\n\n\n\n\n\n\n\n\n\n\nSearch\n×\n\n\n\n\n\n\nLet us help you with your search\n\n\nEnter your Search Criteria.\n\n\n\nSearch All UCR\n\n\nSearch This Site\n\n\nCancel\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://www.ucr.edu",
        "/",
        "/",
        "/",
        "/stories",
        "/tag/research-blog",
        "/awards",
        "/announcements",
        "/scotmemos",
        "https://events.ucr.edu/",
        "/",
        "/stories",
        "/stories/2023/03/21",
        "http://www.facebook.com/UCRiverside",
        "http://twitter.com/UCRiverside",
        "http://www.youtube.com/UCRiverside",
        "https://www.instagram.com/ucriversideofficial",
        "https://www.linkedin.com/school/university-of-california-riverside/",
        "https://www.physics.ucr.edu/",
        "https://home.cern/science/experiments/atlas",
        "https://home.cern/science/accelerators/large-hadron-collider",
        "https://www.home.cern/",
        "https://profiles.ucr.edu/app/home/profile/billg",
        "https://profiles.ucr.edu/app/home/profile/owenl",
        "https://profiles.ucr.edu/app/home/profile/sprei001",
        "https://home.cern/science/physics/standard-model",
        "https://insideucr.ucr.edu/stories/2023/01/31/physics-students-gain-hands-experience-building-prototype-detector",
        "https://www.hemethigh.com/apps/pages/index.jsp?uREC_ID=1322225&type=u",
        "/tag/masterclass",
        "/tag/department-physics-and-astronomy",
        "/tag/college-natural-and-agricultural-sciences",
        "/stories/2023/04/17/community-chat-exposes-pandemic-related-health-disparities",
        "/stories/2023/03/24/first-group-community-college-students-accepted-uc-riverside-california-medicine",
        "/stories/2023/03/13/treatment-needs-unhoused-hawaiians-requires-more-attention-study-says",
        "/stories/2023/03/07/ucr-receives-15-million-support-carbon-capture-technology-research",
        "https://library.ucr.edu/",
        "https://campusstatus.ucr.edu/",
        "https://ucr.bncollege.com/shop/ucr/home",
        "https://jobs.ucr.edu",
        "https://diversity.ucr.edu/",
        "https://campusmap.ucr.edu/",
        "https://www.ucr.edu/about/visitors",
        "https://campusmap.ucr.edu",
        "mailto:webmaster@ucr.edu",
        "https://campusmap.ucr.edu",
        "https://www.facebook.com/UCRiverside",
        "https://twitter.com/UCRiverside",
        "https://www.youtube.com/UCRiverside",
        "https://www.instagram.com/ucriversideofficial",
        "https://www.linkedin.com/school/university-of-california-riverside/mycompany/",
        "https://www.tiktok.com/@ucriverside?",
        "https://news.ucr.edu",
        "https://insideucr.ucr.edu/tag/research-blog",
        "https://ucrtoday.ucr.edu/category/inside-ucr",
        "https://hr.ucr.edu",
        "https://ucpath.universityofcalifornia.edu/",
        "https://staffassembly.ucr.edu/",
        "https://www.universityofcalifornia.edu/news/",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}