{
    "title": "Coral Connections Lead Student-Researcher Toward His Dream - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nCoral Connections Lead Student-Researcher Toward His Dream\n\nAshley Gebb\nMay 18, 2022\n\n\n\n\nPhotos courtesy of Jaime Lopez \n\n\n\nIt was the early days of the pandemic. Campus had closed, shelter-in-place orders were in effect, and Jaime Lopez’s graduate advisor was out on maternity leave, leaving the hundreds of sea anemones in her lab in jeopardy.\nHe immediately set up a care schedule with another graduate student, and for the next several months, the two met every few days to clean the tanks, monitor temperatures, hatch and conduct feedings of brine shrimp, and ensure the anemones were “nice and happy.”\nFor Lopez—whose entire drive to earn his master’s degree at Chico State was to work in biological sciences professor Cawa Tran’s lab—protecting the small sea anemones was a way he could help further their research in understanding coral symbiosis and bleaching, and by that, preserve the future for our coral, reefs, and oceans.\n“I think of coral as one part of the planet’s lungs. Rainforests are the other. And if one goes, our planet is going to suffer to breathe,” he said.\nLopez, who will graduate with a master’s in biological sciences this week, shares a love for the ocean that traces back to his childhood, growing up with family trips to the beach in Los Angeles. Rather than play in the sand and surf, he often found himself exploring the tidepools—searching for signs of life, interesting species, and how they changed at various depths.\nShortly after starting college, he met several professors at CSU Dominguez Hills who were passionate about behavioral and community ecology and understanding the impacts of climate change on marine organisms. That same passion his advisors showed soon became Lopez’s. And those connections led to numerous research opportunities, including a trip to Australia, a semester at Catalina Island, and his first true marine biology class where the students spent countless hours underwater.\n“I fell in love with it. Being able to get in the water for the first time, actually learning how to swim, gave me a sense of calmness and a whole new world,” he said. “I knew being down there was where I wanted to be. It was never boring because it was always a new experience.”\nHowever, despite his obvious passion and growing expertise, one of his advisors cautioned him away from marine biology as a career, emphasizing how challenging the field can be and how hard it is on family life. Crestfallen, Lopez tried to change direction but a conversation with another mentor changed his mind.\n“She told me, ‘You don’t let others dictate your career path. You take control of it and make it what you will,’” he said. “I realized my path toward marine biology will be totally different from my advisor’s. That got me back on track.”\nFor the next few years, he tried relentlessly to get into graduate school, but faced rejection after rejection. He kept studying on his own, and it was suggested that he reach out to Tran at Chico State because of his interest in symbiosis.\nThe interest letter he first drafted still resonates with Tran today. Lopez had carefully explained his research interest in coral-algal symbiosis, outlined how it overlaps with Tran’s research program and his long-term career goals, and shared some of the most intriguing research questions that piqued his curiosity.\n“To me, this spoke volumes, as he had shown me how he thought about science and why he found those questions important. Instead of simply being assigned a thesis project by me, he insisted that he build his from the ground up,” Tran said. “Intelligent and diligent, he dared to take big risks and challenges to venture into realms of research and methods previously unfamiliar to him.”\nAfter successfully defending his thesis, Jaime Lopez is already working as a California Sea Grant Fellow, a prestigious program that will allow him to explore policy as it relates to research and successful advocacy for ocean ecosystems.\nBy fall 2019, he was working in the Tran Lab, often putting in upwards of 50 hours a week conducting research, collaborating with other students, and demonstrating great patience and persistence in troubleshooting experiments.\n“Moreover, he treats everyone, including myself, with the greatest kindness, and selflessly gives his time to others to help them,” Tran said. “Jaime is one of the humblest people I have ever known, with a huge heart in caring for others.”\nWithout a doubt, she said, Lopez is the hardest-working student she has ever mentored or taught. His personal experience and academic path inspire Tran and his peers.\n“What resonated with me when I first met him was that we both shared similar paths—first-generation, child of immigrants, raised in underserved neighborhoods in Southern California, and having to endure major challenges to get to where we are today,” she said.\nLopez often tells his fellow students to acknowledge their fear of failing and to use it as a moment to learn.\n“Coming into grad school, I was so nervous. I didn’t want to mess up. It was such a one-shot thing,” he said. “But now, I don’t care if I fail. I am going to use that opportunity to learn something. You never know what is going to happen, and as long as you have a reason of why you are doing it, you are learning in the end.”\nAfter Lopez successfully defended his thesis, which was on nitrogen-fixation potential in bacteria associated with sea anemones, Biological Sciences Department Chair Chris Ivey lauded his talents and described him as a “remarkable scholar.”\n“He has had an outsize influence on our program and our department, through his leadership of other students, his strong research skills, and his exemplary persistence through obstacles,” Ivey said. “Jaime’s quiet strength has been an inspiration for many of us, and we feel that he embodies the strengths of Chico State and the unique kind of education that we offer on this campus.”\nPreparing to graduate this week, as the first person in his family to earn a master’s degree, Lopez is deeply proud.\n“Graduating gives me the satisfaction of telling my family, this is not only for me—it’s me paying them back for the sacrifices they have made to help me get where I am now,” he said.\nLopez is already working as a California Sea Grant Fellow, the next step toward his dream of working for the National Oceanic and Atmospheric Administration as a research biologist. The one-year program provides an opportunity to work in a government agency studying marine resources and in the policy decisions affecting those resources.\nHe hopes this experience will lay the groundwork for a career where he spends his days studying corals and coastal habitats, working to protect them from the impacts of climate change, and making a difference within the field of marine biology.\nTran has no doubt he will.\n“What he has done in his academic path so far will dare us to challenge the limitations of our own dreams, and what he will continue to do in the sciences will dare to leave his mark in creating a sustainable environment for future generations,” she said.\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tAshley Gebb\t\t\n\n\n\t\tA proud alumna, Ashley Gebb (Journalism, '08) is the executive director of University Communications. She leads its exceptional communications team, manages the Chico State brand, and directs marketing and storytelling.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/ashley-gebb/",
        "https://today.csuchico.edu/outstanding-grad-jaime-lopez/?share=facebook",
        "https://today.csuchico.edu/outstanding-grad-jaime-lopez/?share=twitter",
        "https://today.csuchico.edu/outstanding-grad-jaime-lopez/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Coral%20Connections%20Lead%20Student-Researcher%20Toward%20His%20Dream&body=https%3A%2F%2Ftoday.csuchico.edu%2Foutstanding-grad-jaime-lopez%2F&share=email",
        "https://today.csuchico.edu/outstanding-grad-jaime-lopez/#print",
        "#",
        "https://today.csuchico.edu/author/ashley-gebb/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}