{
    "title": "CSU Learn – Training Management  – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        Training Management \n\t\t\t    \n                            TM Menu\n                        Show search box.Training at CSU, ChicoView Your Assigned LearningTraining Area CoordinatorsCSU Learn StatusEventsTraining at CSU, ChicoView Your Assigned Learning(opens in new window)Training Area CoordinatorsCSU Learn StatusEventsNeed Help?Check the knowledge base(opens in new window)Contact training@csuchico.eduCSU LearnLinkedIn LearningTRAININGCurrent page:  CSU Learn\n                                        \n    \t\tCSU Learn\n    \tOn February 4th, 2019, the California State University system migrated from our current learning management system, SkillPort, to a new system, CSU Learn(opens in new window).What is CSU Learn?Why CSU Learn?Go-Live Date and MilestonesFrequently Asked QuestionsProject InformationContent ManagementMore InformationCampus ContactWhat is CSU Learn?CSU Learn(opens in new window) is a learning management system (LMS) provided by Skillsoft/SumTotal. The LMS allows the CSU to assign, track, and leverage content ranging from mandatory professional development to compliance.Why CSU Learn?The CSU's current enterprise training contract was reaching the end of its term. As per CSU requirement, a new RFP was conducted and placed out to bid. CSU Learning & Development established an RFP committee with 27 participants from various campus areas, and the campus stakeholders indicated that the CSU's needs had outgrown the current training solution.CSU Learn will provide a system that meets the CSU's growing needs, including flexibility for training assignment criteria, support for employees with multiple roles, extensive reporting and analytics, and a more dynamic user experience. SkillSoft's client base and success stories reached familiar partners such as the University of California system (UC) and other highly regulated industries including pharmaceuticals and airlines.Go-Live Date and MilestonesCSU Learn will be our new employee training system after February 4th, 2019. To prepare for the implementation, training in DTS was frozen on Dec 31st,2018. We are currently working on importing all content and training history into the new CSU Learn system.Your patience is appreciated as we partner with the Chancellor’s Office to roll out this system in stages: Compliance Content available at Go Live:SHPSTitle IX for SupsTitle IX for Non-SupConflicts of InterestData SecurityHIPAACleryMandated ReporterProcurement Card Industry (PCI)Red FlagsDefensive DrivingInjury Illness Prevention Program (IIPP)Laboratory SafetyFebruaryAuto-assignment of training to employees based on historical completion records. You may receive emails from CSU Learn letting you know that you have been assigned online compliance training.Additional compliance training assignments will be created throughout the month.MarchInstructor-Led Training (ILT) will be added to the training calendar to track enrollment.Frequently Asked QuestionsI have training that is due. Where should I take it?The last date to complete training in DTS was December 31st,2018. We are currently working on building all new training activities in CSU Learn. Once we are ready we will notify you and you will be able to complete your training in the new CSU Learn system.What will happen to my training history?Any completed training records will carry over into CSU Learn. Please note that will not include any incomplete training that was in progress in DTS.Can I keep a copy of my training records?Your complete training history was exported from DTS and will be available in CSU Learn under Training Transcript. I am a manager. How will this affect my team?CSU Learn will have improved notification and reporting systems, so it should be easier for you to keep track of who needs training and when.I run in-person trainings. How will this affect me?CSU Learn will continue to support in-person training. You may benefit from improved support for mixed content such as online modules, paper handouts, and completion certificates.Project InformationThe CSU Learn migration project includes stakeholders from several teams at Chico State:Enterprise Training Collab (ETC)Information Technology (IT)Distributed Learning Technologies (DLT)Professional Development (PDEV)Environmental Health and Safety (EHS)Creative Media and Technology (CMT)Facilities Management Services (FMS)Technology and Learning Program (TLP)Office of Accessible Technology (OATS)The project is centrally headed by the CSU Chancellor's Office, in partnership with all 23 CSU campuses.There are five major elements included in the migration project:Data (person data, training history, etc.)Content (online, instructor-led, ad hoc, media and documents)Compliance (assignment rules and regulatory requirements)Development (personal and professional)Reporting and analyticsContent ManagementWith our migration to CSU Learn, we are hoping to improve efficiency by assigning responsibilities to teams which are most familiar with specific tasks:Subject Matter Expert (SME)Describes training goals, requirements, and initial preparation of materials.Instructional DesignAssist the SME with course design, creation and review of content.AccessibilityAssist the SME with review of content with an eye for accessibility.Technical AdminManages the system, provides technical support for other teams and end-users.These additional teams will empower subject matter experts to save time and effort so that they can focus on the important work of training and development.More InformationCSU Learn Vendor Community Site(opens in new window) (technical documentation for the system powering CSU Learn)CSU Project SharePoint Site(opens in new window) (project info)CSU Learn Service Interruption Log Campus ContactIf you have additional questions about CSU Learn or the implementation plan, you can contact us training@csuchico.edu To submit new learning activities to the CSU Learn system and training calendar please submit a ticket through the IT Service Catalog.\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "../index.shtml",
        "javascript:void(0)",
        "../index.shtml",
        "https://csu.sumtotal.host/core/dash/Learning_Assigned/initial",
        "../coordinators.shtml",
        "https://www.csuchico.edu/training/logs/index.shtml",
        "../events/index.shtml",
        "../index.shtml",
        "https://csu.sumtotal.host/core/dash/Learning_Assigned/initial",
        "../coordinators.shtml",
        "https://www.csuchico.edu/training/logs/index.shtml",
        "../events/index.shtml",
        "https://support.csuchico.edu/TDClient/KB/?CategoryID=12843",
        "mailto:training@csuchico.edu",
        "https://ds.calstate.edu/?svc=sumtotal",
        "https://www.linkedin.com/checkpoint/enterprise/login/57692737?application=learning",
        "../index.shtml",
        "https://ds.calstate.edu/?svc=sumtotal",
        "https://ds.calstate.edu/?svc=sumtotal",
        "#what",
        "#why",
        "#live",
        "#faq",
        "#info",
        "#management",
        "#more",
        "#contact",
        "https://csu.sumtotal.host/",
        "https://learningedge.skillsoft.com/sumtotal/home",
        "https://csyou.calstate.edu/groups/lms/SitePages/Home.aspx",
        "../logs/index.shtml",
        "mailto:training@csuchico.edu",
        "https://support.csuchico.edu/TDClient/Requests/ServiceCatalog?CategoryID=3126",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}