{
    "title": "New ‘Opportunity Atlas’ tracks economic mobility by neighborhood | Brown University",
    "body": "\n\n\n\n\n\n\nSkip to Main Content\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \nNews from Brown\n\n\n\n\n\n\nSite Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTopics\n\nSocial Sciences\n\n\n\nDate\n\n                  October 1, 2018\n                  2018-10-01\n\n\n\nMedia Contact\n\n                    \nNews Staff\n [email protected]\n\n  401-863-2476\n\n\n\n\n\n\n\n\n\nAll News\n\n\n\nShare\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\nLinkedin\n\n\n\n\n\n\nEmail\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew ‘Opportunity Atlas’ tracks economic mobility by neighborhood\nWorking with researchers from Harvard and the U.S. Census Bureau, Brown economics professor John Friedman created a tool that traces the roots of social and economic outcomes to childhood neighborhoods.\n\n\n\n\n\n\n\n\n\nThe Opportunity Atlas is a free interactive tool that allows users to find data on children’s outcomes in adulthood for every Census tract in the United States.PROVIDENCE, R.I. [Brown University] —Prospects for social and economic mobility among American adults are intimately linked to the neighborhoods in which they grew up, social scientists have long understood.\nNow, new research and an accompanying interactive tool are illustrating in great detail precisely how those neighborhoods shape lives. The data is also making clear how growing up in one neighborhood compared to the next can make a vast difference in outcomes.\nBrown University economist John Friedman — working with Raj Chetty and Nathaniel Hendren of Harvard and Maggie Jones and Sonya Porter of the U.S. Census Bureau — created the Opportunity Atlas, an interactive, map-based tool that can trace the root of outcomes, such as poverty and incarceration, back to the neighborhoods in which children grew up.\nOn Monday, Oct. 1, Friedman, Chetty and Hendren also launched a new research and policy institute, Opportunity Insights, to translate their findings into policy solutions that can improve the lives of Americans in communities across the country.\nPrevious work by the team showed that children’s chances of earning more than their parents did has declined from 90 percent to 50 percent in the last half century. The institute’s mission, the researchers said, is to use data to document the decline of the American Dream, propose solutions to revive it and empower families to rise out of poverty to achieve better life outcomes.\nThrough the Opportunity Atlas and Opportunity Insights, John Friedman and his colleagues aim to both document the decline of the American Dream and find policy solutions to revive it.“Our approach is to partner with policymakers and others in communities nationwide, harnessing the power of big data to find local solutions for local problems,” Friedman said. “Low rates of upward mobility in the United States are an incredibly challenging problem — but we can make progress by understanding exactly how opportunity is lacking in each specific setting and then tailoring the policy solution appropriately.”\nTo create the Opportunity Atlas, Friedman and colleagues studied anonymized data on 20 million Americans who are in their 30s today, measuring economic opportunity at the neighborhood level and identifying factors that impact average earnings, incarceration rates and other outcomes by their parental income level, race and gender.\nThe researchers began with a question: “Which neighborhoods in America offer children the best chances of climbing the income ladder?” Their work revealed six main findings about how neighborhoods shape the trajectories of those who grow up there:\nFinding 1: Children’s outcomes in adulthood vary sharply across neighborhoods that are just a mile or two apart\nThat finding holds true even if children’s families have comparable incomes. In the Watts neighborhood in central Los Angeles, 44 percent of low-income black men were incarcerated on April 1, 2010, the day of the 2010 Census. By contrast, just 6.2 percent of black men who grew up in families with similar incomes in central Compton, 2.3 miles away, were incarcerated on that day.\nFinding 2: Places that have good outcomes for one racial group do not always have good outcomes for others\nTo use the Watts example, Hispanic men who grew up in Watts have an incarceration rate of just 4 percent, compared to 44 percent for black men. Gender can also affect outcomes. Low-income black women who grow up in Watts earn three times as much, as adults, as low-income black men from that neighborhood. The researchers assert that policies addressing neighborhood issues should target specific subgroups rather than use a “one size fits all” approach.\nFinding 3: Moving to a better neighborhood earlier in childhood can increase a child’s income by several thousand dollars\nChildren of low-income families who moved at the time of their birth from the Central District of Seattle, a low-upward-mobility area, to Shoreline, a high-upward-mobility area that is 10 miles north, earned $9,000 more per year at age 35 than those who moved in their 20s, according to the study.\nFinding 4: Traditional indicators of local economic success such as job growth do not always translate into greater upward mobility\nCities like Atlanta and Charlotte that have high rates of job and wage growth also have among the lowest rates of upward mobility for children who grow up there, the researchers found. Those cities achieve high economic growth by attracting high-skilled outsiders to move there and fill high-paying jobs. Children are more likely to be upwardly mobile, the researchers wrote, if they grow up around people who have jobs.\nFinding 5: Historical data on children’s outcomes are a useful predictor of children’s prospects for upward mobility today\nPlaces that have produced good outcomes in the past typically tend to produce good outcomes a decade later, though the researchers caution that estimates should be combined with additional analyses and knowledge of areas that have changed substantially.\nFinding 6: The new data uncover “opportunity bargains” — affordable neighborhoods that produce good outcomes for children\nIn other words, not all higher-opportunity neighborhoods have higher costs of living. According to the authors, the availability of low-rent, high-opportunity neighborhoods suggests that affordable housing policies could be redesigned to produce larger gains for children without increasing government expenditure. More broadly, they wrote, the existence of opportunity bargain areas shows that creating pathways to opportunity need not require reproducing conditions in highly affluent, expensive neighborhoods.\nGoing forward, Friedman and his colleagues hope researchers use the Opportunity Atlas to better target programs that aim to improve economic opportunities for disadvantaged children. They suggest that the distribution of housing vouchers to higher-opportunity areas, placement of preschool programs or eligibility for local programs or tax credits could be informed by these data.\nThe full set of data, configurable by Census track, is freely available on the Opportunity Atlas website.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n\n\nProvidence\nRI\n02912\n\n\n\n\n\n\n\n\n401-863-1000\n\n\n\n\n\n\nQuick Navigation\n\n\n\n\nVisit Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Map\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA to Z\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter Navigation\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEvents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Safety\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccessibility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers at Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe campaign for building on distinction\n\nGive To Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSocial Navigation\n\n\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\n\n\nInstagram\n\n\n\n\n\n\n\n\nLinkedIn\n\n\n\n\n\n\n\n\nSnapchat\n\n\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\n\n\nYouTube\n\n\n\n\n\n\n\n\nSocial Media Directory\n\n\n\n\n© Brown University \n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \n\n\nFor You\n\n\n\n\n\n\n\nCurrent Students\n\n\nFaculty\n\n\nStaff\n\n\nParents & Families\n\n\nAlumni\n\n\nFriends & Neighbors\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\nMobile Site Navigation\n\n\n\n\nMobile Site Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\nTopics\n\n\n\n\n\nArts and Humanities\n\n\n\n\nEnvironment\n\n\n\n\nHealth and Medicine\n\n\n\n\nNews and Events\n\n\n\n\nScience and Technology\n\n\n\n\nSocial Sciences\n\n\n\n\nStudent Life\n\n\n\n\nUniversity Initiatives\n\n\n\n\n\n\n\n\nMobile Secondary Navigation Navigation\n\n\n\n\nCOVID-19 Info\n\n\n\n\nAbout\n\n\n\n\nEvents\n\n\n\n\nFor You\n\n\n\n\nGive to Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAll of Brown.edu\n\n\n\n\n\n\nPeople\n\n\n\n\n\n\nNews\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\nSearch people\n\n\n\n\n\n\n\nAdvanced Search\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Search\n\n\n\n\n\n\n\n\n\n\n\nNew ‘Opportunity Atlas’ tracks economic mobility by neighborhood\n\n\n\n\n\nOpen details for New ‘Opportunity Atlas’ tracks economic mobility by neighborhood\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark this Page\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page_main_content",
        "/",
        "/news",
        "/news/featured-events",
        "/news/for-journalists",
        "#flyout_search",
        "#menu",
        "/news/social-sciences",
        "/cdn-cgi/l/email-protection#b1dcd4d5d8d0eec3d4ddd0c5d8dedfc2f1d3c3dec6df9fd4d5c4",
        "tel:4018632476",
        "/news/all",
        "#",
        "#",
        "#",
        "#",
        "https://opportunityinsights.org/paper/the-opportunity-atlas/",
        "https://www.opportunityatlas.org/",
        "https://opportunityinsights.org/",
        "https://opportunityinsights.org/",
        "https://opportunityinsights.org/",
        "https://www.opportunityatlas.org/",
        "https://www.google.com/maps/dir/?api=1&destination=Brown%20University%2075%20Waterman%20St.%20Providence%20RI%2002912",
        "tel:4018631000",
        "https://www.brown.edu/about/visit",
        "https://www.brown.edu/Facilities/Facilities_Management/maps/#building/",
        "https://www.brown.edu/a-z",
        "https://www.brown.edu/about/contact-us",
        "https://www.brown.edu/news",
        "https://events.brown.edu/",
        "https://dps.brown.edu/",
        "https://www.brown.edu/website-accessibility",
        "https://www.brown.edu/careers",
        "http://alumni-friends.brown.edu/giving/",
        "https://www.facebook.com/BrownUniversity",
        "https://instagram.com/brownu",
        "https://www.linkedin.com/edu/school?id=19348",
        "https://www.snapchat.com/add/brown-u",
        "https://twitter.com/BrownUniversity",
        "https://www.youtube.com/brownuniversity",
        "https://www.brown.edu/social/",
        "/",
        "/current-students",
        "/faculty",
        "/staff",
        "/families",
        "https://alumni-friends.brown.edu/",
        "/friends-neighbors",
        "#flyout_search",
        "#menu",
        "/news/featured-events",
        "/news/for-journalists",
        "/taxonomy/term/146",
        "/taxonomy/term/311",
        "/taxonomy/term/161",
        "/taxonomy/term/301",
        "/taxonomy/term/306",
        "/taxonomy/term/316",
        "/taxonomy/term/521",
        "/taxonomy/term/526",
        "https://healthy.brown.edu/",
        "/about",
        "https://events.brown.edu",
        "",
        "https://alumni-friends.brown.edu/giving",
        "https://directory.brown.edu/",
        "#header",
        "https://www.brown.edu/news/2018-10-01/opportunity"
    ]
}