{
    "title": "About the University - California State University Fullerton - Acalog ACMS™",
    "body": "\n\n\nSkip to Content\n\n\n\n\n\n\n\n\n\n\n\n\n\n California State University, Fullerton\n\n\n\n\n\n\n\n\n\n\n\n\nCourse Descriptions\n\n\nDegree Programs\n\n\nGeneral Education\n\n\nUndergraduate Admissions\n\n\nGraduate Admissions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    This site is maintained by   Academic Programs.\n\n\n                    To report problems or comments with this site, please contact   catalog@fullerton.edu.   Privacy Policy.\n                    © California State University, Fullerton. All Rights Reserved.\n                \n\n                    CSUF is committed to ensuring equal accessibility to our users.\n                    Let us know about any accessibility problems you encounter using this website.\n                \n\n\n\n\n                Additional Resources\n            \n\n\n                    Saftey & Security\n                \n\n\nEmergency Information\n\n\nUniversity Police\n\n\nAnnual Security Report (Clery)\n\n\n\n\n\n                    CSUF Information\n                \n\n\nContacts & Addresses\n\n\nCampus A-Z Index\n\n\nCampus Map\n\n\nCSU - Office of the Chancellor\n\n\n\n\n\n                    Accessibility & Equity\n                \n\n\nTitle IX\n\n\nWeb Accessibilty - ATI\n\n\nReport an ATI Issue\n\n\nAdobe Reader\n\n\nMicrosoft Viewers\n\n\n\n\n\n\n\n\n\n   \n\tCalifornia State University Fullerton\n\n\n\n   \n\n\n\n\n \n\n \n\t\t\t\tApr 29, 2023\t\t\t\n\n \n\n\n\n\n2022-2023 University Catalog \n\n\n\n\n\n\n\nSelect a Catalog\n 2023-2024 University Catalog\n2022-2023 University Catalog [ARCHIVED CATALOG]\n2021-2022 University Catalog [ARCHIVED CATALOG]\n2020-2021 University Catalog [ARCHIVED CATALOG]\n2019-2020 University Catalog [ARCHIVED CATALOG]\n2018-2019 University Catalog [ARCHIVED CATALOG]\n2017-2018 University Catalog [ARCHIVED CATALOG]\n2016-2017 University Catalog [ARCHIVED CATALOG]\n2015-2016 University Catalog [ARCHIVED CATALOG]\n2013-2015 University Catalog [ARCHIVED CATALOG]\n2021-2022 Faculty Handbook [ARCHIVED CATALOG]\n2018-2019 Faculty Handbook [ARCHIVED CATALOG]\n2022-2023 Faculty Handbook\n\n\n\n  \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGlobal Search\n\n\n\n\n\n\n\n\nCatalog Search \n\nChoose Search Location\n\n\n\nSelect an option\nCourses\nPrograms\nColleges/Departments\nOther Content\nEntire Catalog\n\n\n\n\n\n\n\nSearch Keyword Field\n\n\n\n\nWhole Word/Phrase\n\n\n\n\n\t\t\t\t\tAdvanced Search\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCatalog Navigation\n\n\n\n\n  Catalog Home\n  President’s Message \n  Academic Calendar \n  The California State University \n  About the University \n  Administration \n \n  College of the Arts \n  College of Business and Economics \n  College of Communications \n  College of Education \n  College of Engineering and Computer Science \n  College of Health and Human Development \n  College of Humanities and Social Sciences \n  College of Natural Sciences and Mathematics \n \n  Degree Programs \n  Course Descriptions \n \n  University Requirements and Regulations \n  Graduate Regulations \n  Admissions \n  Academic Advising \n  Registration \n  Academic Departments and Programs \n  Special Academic Programs \n  Academic Affairs Support \n  Student Affairs Support \n  Information Technology \n \n  Faculty and Administration \n  Emeriti \n \n  Archived Catalogs \n\n\n\n\n\n\n\n\n\n\n\n\n   My Portfolio\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHELP\n2022-2023 University Catalog [ARCHIVED CATALOG] \n\t\t\t\t\t\t\t  About the University\t\t\t\t\t\t\t  \nPrint-Friendly Page (opens a new window)\n\n\nFacebook this Page (opens a new window)\n\n\n\n\nTweet this Page (opens a new window)\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nGovernance\nStrategic Plan\nMeaning of Degree\nUniversitywide Student Learning Goals\nAccreditations and Associations\nAcademic Freedom and Responsibility\nHistory of the University\nEnvironment of the University\n\n\n\n\nThe Campus and Its Buildings\nStudents of the University\nThe Faculty\nOutstanding Professor Award\nCSU Fullerton Auxiliary Services Corp.\nCal State Fullerton Alumni Association\nSupport Groups\n\n\n\n\n\n\nGovernance\nGovernance on the campus at California State University, Fullerton is the responsibility of the president and administrative staff. Working closely with the president are a number of faculty, student affairs and student groups that initiate, review and/or recommend for approval various university programs, policies and procedures. Although the president is vested with the final authority for all university activities, maximum faculty and staff participation in campus decision-making and governance has become traditional. Students also are actively involved, with student representatives included on almost all university, college and departmental committees and policymaking bodies.\nStrategic Plan\nIntroduction\nDeveloped collaboratively by the Titan Family, California State University, Fullerton’s strategic plan presents a thoughtful yet ambitious road map for addressing our most compelling opportunities and enhancing our most successful endeavors. The plan is wholly in support of our educational mission, reaffirms our position as a first-choice institution, celebrates our far-reaching impact as a university of significance, and further empowers all Titans — faculty, staff, students and alumni — to Reach Higher. With this plan, we collectively commit ourselves to its goals and objectives, all in pursuit of our fundamental mission.\nMission\nCalifornia State University, Fullerton enriches the lives of students and inspires them to thrive in a global environment. We cultivate lifelong habits of scholarly inquiry, critical and creative thinking, dynamic inclusivity and social responsibility. Rooted in the strength of our diversity and immersive experiences, we embolden Titans to become intellectual, community, and economic leaders who shape the future.\nValues\nStudent success: We educate confident, innovative, and culturally competent Titans who continuously adapt to meet and exceed new workforce demands, social justice challenges, and community service opportunities.\nScholarly and creative activities: We cultivate and promote the collaborative exchange of ideas through rigorous academic and creative activities.\nDiversity, equity and inclusion: We commit to our rich diversity by increasing culturally proficient and equity-minded practices across all campus communities.\nCivic engagement: We encourage free expression, both as a right and a responsibility, and aim to inspire all Titans to be informed, active, and engaged citizens.\nCollegial governance: We embrace inclusivity, consultation, collaboration, and transparency to bring all Titans into the deliberative process that shapes our communities, challenges our beliefs, and addresses the needs of a diverse global society.\nIntegrity: We act from a foundation of ethical principles and through the cultivation of strong character.\nService to the region: We provide a place and space for the region’s current and future leaders to grow and develop in ways that inspire them to better serve our communities.\nMeaning of Degree\nA California State University, Fullerton degree marks the culmination of an enriching multidisciplinary education where students benefit from experiential learning and vibrant co-curricular experiences in a culturally diverse environment. With disciplinary knowledge and critical skills, Titan graduates are well-positioned to emerge as effective and ethical leaders, and productive members in their local communities and the global society.\nUniversitywide Student Learning Goals\nThrough campuswide collaboration, CSUF developed a set of Universitywide Learning Goals in May 2014 that were reformed into separate Undergraduate Student Learning Goals (UPS 300.003) and Graduate Student Learning Goals (UPS 300.041) in 2017.\nUndergraduate Student Learning Goals\nAs a result of engaging with the curriculum and co-curricular activities at California State University, Fullerton, CSUF graduates will:\n\nDemonstrate intellectual literacy through the acquisition of knowledge and development of competence in disciplinary perspectives and interdisciplinary points of view.\nThink critically, using analytical, qualitative and quantitative reasoning, to apply previously learned concepts to new situations, complex challenges and everyday problems.\nCommunicate clearly, effectively and persuasively, both orally and in writing.\nWork effectively as a team member or leader to achieve a broad variety of goals.\nEvaluate the significance of how differing perspectives and trends affect their communities.\nRecognize their roles in an interdependent global community.\n\nGraduate Student Learning Goals\nAs appropriate to the discipline and the degree program, graduate students should be able to demonstrate:\n\nKnowledge, skills and professional dispositions, including higher order competence in disciplinary perspectives and interdisciplinary points of view;\nThe ability to access, analyze, synthesize and evaluate complex information from multiple sources and in new situations and settings;\nAdvanced communication skills;\nThe ability to work independently and in collaboration with others as artists, practitioners, researchers and/or scholars;\nThe ability to apply appropriate methods and technologies to address problems that affect their communities;\nSocial responsibility within diverse communities and in an interdependent global community.\n\nGeneral Education Learning Goals\nLed by the Senate G.E. Committee, incorporating feedback from diverse campus constituents, CSUF developed a set of General Education: Programmatic Student Learning Goals and Learning Outcomes (UPS 411.203) in spring 2015.\n\nDemonstrate and apply their understanding of fundamental concepts, methods and theories in natural sciences and mathematics, arts and humanities, and social sciences.\nSeek and acquire relevant information and apply analytical, qualitative and quantitative reasoning to previously learned concepts, new situations, complex challenges and everyday problems.\nDevelop ideas and communicate them competently and ethically, verbally or nonverbally, both orally and in writing, in a variety of contexts.\nDevelop skills to collaborate effectively and ethically as leaders and team members.\nDevelop self-awareness, knowledge, intercultural skills and critical reflection to participate ethically and effectively in local communities and global contexts.\n\nAccreditations and Associations\nfullerton.edu/accreditation\nCalifornia State University, Fullerton is accredited by the Western Association of Schools and Colleges (WASC) Senior College and University Commission (WSCUC).\nQuestions about accreditation may be addressed to:\nWASC Senior College and University Commission\n1001 Marina Village Parkway, Suite 402\nAlameda, CA 94501\nPhone: 510-748-9001\nFax: 510-748-9797\nInternet: wscuc.org\nIn addition to institutional accreditation, many academic programs at CSUF are accredited by discipline-specific accreditation agencies and associations. A list of these programs is provided on the university accreditation website at fullerton.edu/accreditation/discipline.\nSee the CSU Notice to Students RE: Professional Licensure and Certification for more information on professional licensure and certification.\nAcademic Freedom and Responsibility\nThe Academic Senate of California State University, Fullerton endorses the American Association of University Professors 2009 Statement of Professional Ethics (University Policy Statement 230.000).\nHistory of the University\nIn 1957, Cal State Fullerton became the 12th State College in California to be authorized by the Legislature. The following year a site was designated in northeast Fullerton. It was purchased in 1959, when Dr. William B. Langsdorf was appointed as founding president, the first staff was selected and plans for opening the new college were made. Orange County State College started classes for 452 full- and/or part-time students in September 1959, using leased quarters for its administrative offices on the Fullerton Union High School campus and for its classrooms at Fullerton’s Sunny Hills High School. In the fall of 1960, the college opened classes on its own campus, occupying 12 temporary buildings. The name changed to Orange State College in July 1962, to California State College at Fullerton in July 1964, to California State College, Fullerton, in July 1968 and to California State University, Fullerton, in June 1972. The first permanent building, the six-story Letters and Science Building (now known as McCarthy Hall), was occupied in 1963.\nToday, there is dramatic evidence of additional, rapid growth. A number of new buildings have been completed, and enrollment has climbed to more than 40,000. Since 1963, the curriculum has expanded to include lower-division coursework, graduate programs — including two doctorates — as well as numerous credential and certificate programs.\nThe Donahoe Higher Education Act of 1960 established the California State Colleges as a system under an independent Board of Trustees, redefined the functions of the State Colleges, and related them to both the community colleges and the University of California system.\nCal State Fullerton’s presidents and their years of service are:\n\nDr. William B. Langsdorf, 1957-1971\nDr. L. Donald Shields, 1971-1980\nDr. Miles D. McCarthy (acting), 1981\nDr. Jewel Plummer Cobb, 1981-1989\nDr. Milton A. Gordon, 1990-2012\nDr. Willie J. Hagan (interim), 2012\nDr. Mildred García, 2012-2017\nFramroze Virjee, J.D., 2017-present\n\nEnvironment of the University\nFullerton, a city of approximately 140,000 inhabitants, is located in north Orange County, about 30 miles southeast of Central Los Angeles. It is part of the Southern California population center and within easy freeway access of all the diverse natural and cultural attractions of this region.\nOrange County, with an area of 798.3 square miles, is 47th in size of California’s 58 counties, but it is the fourth-largest county in population (more than 3.1 million) and the sixth-most populous in the nation. Orange County has more than doubled its population over the last four decades, and it will continue to grow in the decades to come.\nToday, there co-exists an interesting mixture of the old and new lifestyles in Orange County. Underneath the soil, archaeologists and bulldozers uncover traces of the hunting and gathering Native American bands who flourished at least as early as 4,000 years ago in what was a benign and bountiful region. More visible traces remain of the Spanish and Mexican periods and cultures: Mission San Juan Capistrano, which began the agricultural tradition in Orange County, and subsequent adobes from the great land grants and ranches that followed. Additionally, both customs and many of the family names persist from this period and so does some ranching. The architecture and other evidences of the subsequent pioneer period are still quite visible: farmsteads, old buildings from the new towns that were established in the late 1800s, mining operations, and traces of early resort and other types of promotional activities. For about 100 years, farming was the main economic activity with products such as grapes, walnuts, vegetables and oranges replacing the older wheat and cattle ranches. Today, agriculture still is very important. Orange County ranks high among California’s counties in mineral production with its oil, natural gas, sand, gravel and clay mining and processing activities.\nThe extensive development of the 42 miles of beaches in Orange County and the development of such attractions as the Disneyland Resort, Knott’s Berry Farm, Laguna Festival of Arts and Pageant of the Masters, Honda Center, Angel Stadium, Anaheim Convention Center, and Orange County Performing Arts Center continue to make tourism an increasingly important activity.\nOrange County thrives in a Mediterranean-type climate, with rainfall averaging 14 inches per year, and generally mild days (either freezing or 100-degree temperatures are uncommon) with frequent morning fog during the summer. Both downtown Los Angeles and the Pacific Ocean can be reached by car in half an hour, and mountain and desert recreation areas are as close as an hour’s drive from the campus.\nThe Campus and Its Buildings\nOnce part of a vast orange grove, Cal State Fullerton’s attractively landscaped main campus now consists of approximately 241 acres bounded on the south by Nutwood Ave., on the west by State College Blvd., on the north by Yorba Linda Blvd. and on the east by the Orange Freeway (57).\nThe portion of Orange County immediately surrounding the campus is predominantly suburban; it includes housing tracts, apartment complexes, shopping centers and industrial parks.\nOther educational institutions are part of the immediate environment. The Southern California College of Optometry opened in the spring of 1973 and later became part of Marshall B. Ketchum University. The campus is just north of Cal State Fullerton.\nTo Cal State Fullerton’s immediate south is Hope International University, a liberal arts school with a Bible emphasis, where students started classes in the fall of 1973. Western State University College of Law occupied its new campus to the immediate west of Cal State Fullerton in January 1975.\nThe Cal State Fullerton campus itself has an efficient urban layout of facilities, developed to serve a predominantly commuting public. The university’s modern buildings were planned so that no student needs more than 10 minutes to go from one class to another. The campus is surrounded with xeriscape landscaping and drought-resistant groundcover, and parking areas.\nThe first permanent building, the Letters and Science Building, was occupied in 1963. This imposing structure, master-planned to serve ultimately as a facility for undergraduate and graduate science instruction and research, was used to house other programs until they could warrant new facilities of their own. It is now called Miles D. McCarthy Hall.\nSince 1963, growth has been rapid. The Performing Arts Center was completed in 1964, the Physical Education Building in 1965, the Library Building in 1966, the Commons in 1967, the Humanities-Social Sciences Building and Visual Arts Center in 1969, William B. Langsdorf Hall and the Engineering Building in 1971, the Student Health Center in 1974, the Education-Classroom Building and University Center in 1976, an addition to the Visual Arts Center in 1979, the Jewel Plummer Cobb Residence Halls and the Charles L. and Rachael E. Ruby Gerontology Center in 1988, and the Fullerton Marriott and the Computer Science Building in 1989. The Ruby Gerontology Center was the first building on campus financed solely by contributed funds; the Fullerton Marriott, a full-service hotel, resulted from a joint venture involving the Marriott Corp., the university and the city of Fullerton.\nAn expansion of the Titan Student Union (formerly known as the University Center) and the Titan Sports Complex, featuring the multipurpose 10,000-seat Titan Stadium, baseball pavilion, track and tennis courts, were completed in 1992. The Titan Student Union houses a 1,200-seat pavilion, small theater, food court, pub, bowling alley and conference rooms. The five-story University Hall, with classrooms, faculty offices, and student and academic support services, was occupied in 1993, followed by the two-story Science Laboratory Center in 1994. The Science Laboratory Center was renamed and dedicated as Dan Black Hall in fall 2006, and University Hall was renamed Milton A. Gordon Hall in 2019. A four-story addition to the university library was completed in 1996, and the entire complex was dedicated as the Paulina June and George Pollak Library in 1998.\nThe 10-story College Park building on Nutwood Ave. provides additional classrooms and office space for university staff and faculty members.\nA 71,000-square-foot expansion of the Kinesiology and Health Science Building (formerly the Physical Education Building) was completed in 2003. The addition includes the Wellness Center for Successful Aging, practice gymnasium, seminar rooms, faculty offices and a 125-seat lecture hall. A 109,000-square-foot Performing Arts Center opened in January 2006 and was named the Joseph A.W. Clayes III Performing Arts Center in September 2008. The complex features venues that include an 800-seat concert hall, 250-seat thrust-stage theater and a 150-seat black box theater. Four parking structures - completed in 2004, 2006, 2010 and 2020 - provide on-campus parking for about 7,000 vehicles. The overall number of parking spaces on campus is nearly 13,000.\nSteven G. Mihaylo Hall, home of the College of Business and Economics, opened in fall 2008. The five-story, 195,000-square-foot facility provides a state-of-the art learning environment, including technologically advanced classrooms and lecture halls, computer labs, and the college’s renowned centers and institutes. Also completed in 2008 was the Student Recreation Center. The two-story, 95,000-square-foot facility features a rock-climbing wall, multicourt gymnasium, one of the largest cardio/weight rooms on a West Coast campus, an outdoor leisure and lap pool, multimedia cardio room and indoor track.\nCal State Fullerton’s on-campus student-resident housing more than doubled to now accommodate 1,900 residents with the completion of a new $143-million residence hall complex in summer 2011. The complex includes the 585-seat Gastronome dining facility, recreational and study facilities on each floor, smart classrooms, a convenience store, laundry and mail facilities, and faculty-in-residence apartments. Other new additions to campus in 2010-11 included a new home for University Police, as well as a new and expanded Children’s Center. The new $8.7-million facility, built for the Associated Students Inc. program, offers a program accredited by the National Association for the Education for Young Children.\nThe three-story addition at the southeast corner of the Titan Student Union adds 26,000 square feet and provides gathering space to accommodate the growing student body. The transparent architecture includes a grand staircase that opens up to the lower level. Construction was completed in October 2016.\nThe former Western State University College of Law complex was purchased by CSUF Auxiliary Services Corp. in 2012. Expanding the campus by 3.6 acres and approximately 86,500 square feet of space at the corner of Dorothy Lane and State College Blvd., university staff and administrators began moving into Titan Hall in late 2016.\nIn the northeast corner of the campus is the Fullerton Arboretum, which was dedicated in the fall of 1979 in a joint venture with the city of Fullerton. The 26-acre botanical garden is a living museum of rare plants from around the world. The ecologically arranged botanical collection depicts habitats from the desert to the tropics, and offers a tranquil retreat from urban life. In spring 2006, the university welcomed the opening of the Fullerton Arboretum Visitor Center and the Orange County Agricultural and Nikkei Heritage Museum, the campus’s first “green” building. The Fullerton Arboretum also is home to Heritage House, a restored 19th-century dwelling that serves as a cultural museum for north Orange County.\nCal State Fullerton is one of the most energy-efficient campuses anywhere, and has been since the early 1990s. The university has been honored multiple times by the University of California/California State University Energy Efficiency Partnership Program, including “Best Overall Sustainable Design” awards for the Student Recreation Center and the Fullerton Arboretum Visitor Center and Orange County Agricultural and Nikkei Heritage Museum. The awards recognize reduced use of natural resources during construction and ongoing energy conservation efforts throughout the life of new buildings and major renovations. Water savings, sustainable site development, energy efficiency, materials selection and indoor environmental quality are among the key elements considered in the design, construction and operation of green buildings. The Student Recreation Center achieved a Gold rating from the Leadership in Energy and Environmental Design Green Building Rating System, which is the nationally accepted benchmark. Mihaylo Hall, the Children’s Center and the University Police building operate at a LEED Silver level. Most notably, the Student Housing complex achieved a rare Platinum LEED rating.\nThe ample freeway and surface street accommodations that approach the main entrance to the university’s campus also provide comparatively easy access to the great and diverse learning resources available in Southern California: many other colleges and universities; museums, libraries and art galleries; zoos; and the wide variety of economic, governmental, social and cultural activities and experiences that may be found in this dynamic and complex region of California and the United States.\nInformation concerning the instructional, laboratory and other physical facilities that relate to the academic program may be obtained from the Office of Facilities Planning and Management.\nStudents of the University\nMuch of the distinctive character and learning atmosphere of any campus comes from the nature and vitality of its students. Diversity, the synthesis of academic study with work and family interests, and strong records of participation and achievement are hallmarks of the student body at Cal State Fullerton.\nThe university is primarily a community-based institution, with three on-campus residence facilities and close to half of CSUF’s students living in Orange County. Seventy-two percent of all students take 12 or more hours of coursework each semester. Of the fall 2021 new freshmen, 94.1 percent came from California public high schools, 4.6 percent from California private high schools, and 1.3 percent came from other states or countries. Of the fall 2021 new graduate students, 60.8 percent came from Cal State University campuses, 24.1 percent from other California colleges and universities, and another 15.1 percent from other states or countries.\nTotal students enrolled in fall 2021 included 10.5 percent first-time freshmen, 15.2 percent other lower division, 61.4 percent upper-division, and 12.9 percent graduate students. About 59 percent of all students were women. The median age of all students was 22; undergraduate students had a median age of 22, while graduate students had a median age of 28. Course offerings during the day and at night provide students with flexibility in their schedules. Most students choose to attend during the daytime.\nVirtually all upper-division and graduate students had declared a major field of study. About 8.2 percent of lower-division students were in the process of exploring different fields prior to declaring a major. During the 2020-21 college year, 9,750 undergraduate students received their baccalaureate degrees, 1,577 graduate students received their master’s degrees and 67 graduates received their Ed.D. or DNP degrees.\nThe Faculty\nCentral to the effectiveness of any institution of higher learning is the quality and dedication of its individual faculty members to teaching and scholarship.\nIn the fall of 2020, there were 863 tenured and tenure-track faculty members and 1,179 lecturers. Almost all of the full-time faculty had some previous college or university teaching experience before coming to Cal State Fullerton. Faculty members also participate in a wide variety of scholarship and creative activities. Ninety-two percent of the tenured and tenure-track faculty have earned their doctoral degrees.\nCriteria for selection to the faculty include mastery of knowledge in an academic specialty, demonstrated skill and experience in teaching, and continuing interest in scholarly study and research. Retention and promotion criteria also include service to the university and community.\nInformation concerning the faculty may be obtained from Human Resources, Diversity and Inclusion or Faculty Affairs and Records.\nOutstanding Professor Award\nBelow are the names of all professors who have received the CSUF Outstanding Professor Award. Those with an asterisk were also honored with the Statewide Outstanding Professor Award, an honor which was conferred annually on two-system faculty members by the Trustees of the California State University until 1995.\n\n\n\nYear\nName\nSubject\n\n\n1963-64\nDonald Stanley Tull\nMarketing\n\n\n1964-65\nMiles Duffield McCarthy*\nBiology\n\n\n1965-66\nGiles Tyler Brown\nHistory\n\n\n1966-67\nGustave Bording Mathieu\nFrench/German\n\n\n1967-68\nNorman Townsend- Zellner\nEconomics\n\n\n1968-69\nJohn Brown Mason\nPolitical Science\n\n\n1969-70\nNo award given\n \n\n\n1970-71\nLoh Seng Tsai\nPsychology\n\n\n1971-72\nRichard C. Gilbert\nMathematics\n\n\n1972-73\nHerbert C. Rutemiller\nQuantitative Methods\n\n\n1973-74\nFred M. Johnson\nPhysics\n\n\n1974-75\nWillis E. McNelly*\nEnglish\n\n\n1975-76\nDonald E. Lagerberg\nArt\n\n\n1976-77\nSidney Klein\nEconomics\n\n\n1977-78\nCharles G. Bell\nPolitical Science\n\n\n1978-79\nBruce H. Weber\nChemistry\n\n\n1979-80\nMichael H. Horn\nZoology\n\n\n1980-81\nDonald A. Sears\nEnglish and Linguistics\n\n\n1981-82\nJoyce E. Pickersgill\nEconomics\n\n\n1982-83\nCarl C. Wamser\nChemistry\n\n\n1983-84\nCorinne S. Wood\nAnthropology\n\n\n1984-85\nMaria C. Linder\nChemistry\n\n\n1985-86\nCharles C. Lambert\nZoology\n\n\n1986-87\nGlenn M. Nagel\nChemistry\n\n\n1987-88\nHarris S. Shultz*\nMathematics\n\n\n1988-89\nWarren A. Beck\nHistory\n\n\n1989-90\nRoger Nanes\nPhysics\n\n\n1990-91\nGerald F. Corey\nHuman Services/Counseling\n\n\n1991-92\nMichael H. Birnbaum\nPsychology\n\n\n1992-93\nDavid L. Pagni*\nMathematics\n\n\n1993-94\nKeith O. Boyum\nPolitical Science\n\n\n1994-95\nCarol P. Barnes\nElementary and Bilingual Education\n\n\n1995-96\nMario Martelli\nMathematics\n\n\n1996-97\nFrank G. Cummings III\nArt\n\n\n1997-98\nJohn A. Olmsted\nChemistry\n\n\n1998-99\nGeorge A. Marcoulides\nManagement Science/Information Systems\n\n\n1999-00\nJane V. Hall\nEconomics\n\n\n2000-01\nHallie Yopp Slowik\nElementary, Bilingual and Reading Education\n\n\n2001-02\nAlbert W. Flores\nPhilosophy\n\n\n2002-03\nSteven N. Murray\nBiological Science\n\n\n2003-04\nRichard L. Wiseman\nHuman Communication Studies\n\n\n2004-05\nNancy L. Segal\nPsychology\n\n\n2005-06\nZvi Drezner\nInformation Systems and Decision Sciences\n\n\n2006-07\nChandrasekhar Putcha\nCivil and Environmental Engineering\n\n\n2007-08\nStella Ting-Toomey\nHuman Communications Studies\n\n\n2008-09\nMohinder Grewel\nElectrical Engineering\n\n\n2009-10\nMarcelo Tolmasky\nBiological Science\n\n\n2010-11\nMartin V. Bonsangue\nMathematics\n\n\n2011-12\nJohn A. Bock\nAnthropology\n\n\n2012-13\nSora Park Tanjasiri\nHealth Science\n\n\n2013-14\nNo award given\n \n\n\n2014-15\nScott Annin\nMathematics\n\n\n2015-16\nRobert Istad\nMusic\n\n\n2016-17\nBinod Tiwari\nCivil and Environmental Engineering\n\n\n2017-18\nNo award given\n \n\n\n2018-19\nMatt Englar-Carlson\nCounseling\n\n\n2019-20\nKiran George\nComputer Engineering\n\n\n2020-21\nWilliam J. Hoese\nBiological Science\n\n\n\nCSU Fullerton Auxiliary Services Corp.\nThe CSU Fullerton Auxiliary Services Corp. was established and incorporated as a not-for-profit corporation in October 1959 to provide essential student, faculty and staff services that cannot be provided from state appropriations. It supplements university programs and activities by assisting the university in fulfilling its mission.\nASC develops and administers research and educational grants and contracts; conducts retail operations, including bookstore, food service and vending on campus; and administers various educationally related functions and programs, such as Grand Central Art Center and University Gables, and the purchase of the College Park, Titan Hall and ASC buildings.\nASC’s overall policies are administered by a board of directors composed of members of the university faculty, administration and students, as well as prominent community leaders.\nBoard of Directors\nChair, Robert Hall*\nVice Chair, Theresa Harvey*\nSecretary, Rosalina Davis*\nTed Bremner*\nGia Ly*\nTeresa Saldivar*\nASC Executive Director\nCSUF President\nProvost, Academic Affairs\nVice President, Administration and Finance\nVice President, Human Resources, Diversity and Inclusion\nVice President, Information Technology\nVice President, Student Affairs\nVice President, University Advancement\nAcademic Administrator nominated by the Council of Deans\nAcademic Senate Chair plus three faculty appointees\nASI President plus two student appointees\n*Community Member\nFor a list of officers and board of directors, go to fullerton.edu/asc/_corpgov/board.php. \nCal State Fullerton Alumni Association\nThe Cal State Fullerton Alumni Association is a not-for-profit auxiliary organization of the university that represents the university’s more than 300,000 alumni. The Alumni Association inspires alumni and supporters to advance and connect the Titan community and provides ways for current students and alumni to be involved with campus initiatives and activities.\nThe Association supports student success and university pride through engaging alumni in volunteer opportunities, educational, professional, and social activities. While the Association provides communication and programming for all alumni, it is maintained through a dues-paying program. Alumni Association members receive exclusive benefits and services, including lifetime access to online career center resources, book borrowing privileges at all 23 CSU campus libraries, access to the Titan Recreation Center, invitations to members-only events, discounts to the Titan bookstore, discounted insurance, exclusive travel programs open to members only and more. The most important benefit of being a member of the CSUF Alumni Association, however, is the opportunity to be part of an active and engaged Titan network.\nThe George G. Golleher Alumni House is the focal point of alumni activity on campus where alumni, students, faculty and staff engage in a variety of activities — everything from Grad BBQ, Founding Titans luncheon, retreats, receptions and workshops.\nSpecial programming is offered to students to connect them with alumni through the Student Alumni Ambassadors program and special student discounts are available to selected alumni events. For more information, contact 657-278-2586 or visit alumni.fullerton.edu.\nSupport Groups\nCal State Fullerton welcomes and encourages the development and activities of volunteer organizations committed to enriching university life. The expertise and efforts of dedicated volunteers enhance the university’s academic excellence. Further information about volunteer opportunities may be obtained from the Office of the Vice President for University Advancement, College Park 850, at 657-278-5287.\nArt Alliance\nThe Art Alliance is a volunteer organization that encourages excellence in the visual arts. Organized in 1967, the alliance assists in financing gallery exhibitions, participates in the acquisition of campus art works and annually awards scholarships — made possible by its annual dues and other fundraising efforts. Art Alliance hosts special exhibit tours, receptions, and trips to museums and artists’ studios for its members.\nCollege Advisory Councils\nMany academic departments and colleges are supported by advisory councils, which are composed of community and campus leaders and alumni who are committed to sharing their expertise and providing support to individual colleges within the university.\nOsher Lifelong Learning Institute\nFor more than three decades, Cal State Fullerton’s learning in retirement program has offered individuals who are retired, semi-retired or approaching retirement age an opportunity to enjoy experiential learning in classes for an active, healthy life. The Osher Lifelong Learning Institute at California State University, Fullerton is a nationally recognized, self-supported organization offering a wide range of programs that are created and directed by its many talented members. This organization was founded as Continuing Learning Experience in 1979.\nFor an annual membership fee, OLLI-CSUF members enjoy the university setting and many student privileges. Programs include self-directed study groups, educational lectures, discussion groups, computer education, arts workshops, physical activities, special events, social activities and travel opportunities. Select classes, including Transitions in Retirement Essentials, are open to the public.\nOLLI-CSUF committees respond to requests of the membership in determining offerings each semester. While members learn from each other, they also learn from community leaders, university professors and other leading authorities. To learn more about OLLI, visit olli.fullerton.edu. \nEmeriti\nThe Emeriti of California State University, Fullerton is a formal association of all persons awarded emeritus status by the president of CSUF. The emeriti, as an association, exists to promote California State University, Fullerton; to enhance the continuing professionalism of the emeriti; to provide for the fellowship of the members; and awards two student scholarships each year. Through affiliation with the systemwide CSU emeriti organization, California State University Emeritus and Retired Faculty Association, emeriti concerns are presented to all branches of the government and the Chancellor’s Office. To learn more about the Emeriti Association, visit fullerton.edu/emeriti/.\nFriends of the Fullerton Arboretum\nFriends of the Fullerton Arboretum supports the 26-acre botanical garden located on the northeast corner of campus. They are a non-profit support group committed to implementing the mission of the Arboretum. The Friends support the mission of the Fullerton Arboretum through volunteer service, philanthropy and community engagement. Learn more about the Fullerton Arboretum at fullertonarboretum.org. \nMAMM Alliance for the Performing Arts\nThe MAMM Alliance is a volunteer group that supports excellence in performing arts programming in the School of Music and the Theatre and Dance Department. Originally organized in 2001 as a foundation in honor of the late philanthropist Marcy Arroues Mulville, the alliance joined Cal State Fullerton in 2006.\nThe alliance’s mission and purpose includes support for productions, guest artist performances, master classes and artist residencies. Its annual dues and fundraising efforts support this mission.\nMusic Associates\nMusic Associates is a volunteer group that supports excellence in the School of Music through funding of student scholarships and performance awards.\nSince 1968, Music Associates has raised funds through membership dues, private donations and annual fundraising events – Carol Candlelight and Music and Magic. The organization also holds a Concerto/Aria Competition annually.\nPatrons of the Library\nSince 1965, the Patrons of the Pollak Library have assisted the library by providing funding for purchases beyond the California state budget allocation. Among the first of the university’s voluntary community support groups, the Patrons are convinced the library is the heart of the university and have been consistent in seeking to help the library better serve students, faculty and the community.\nThe Patrons have facilitated many major contributions to enhance the library’s holdings and Special Collections, in recognition of which the Special Collections are named “The Patrons of the Library Special Collections.” The Patrons also operate a book sale center in conjunction with the Emeriti of California State University, Fullerton. The activity of the Patrons is coordinated by a volunteer board of governors elected from its membership of emeriti, current faculty and community members.\nMembership contributions to the Patrons of the Library support the purchase of books and other materials for the library. The funds also contribute to the development of the Special Collections and sponsor library talks, exhibitions and activities, including field trips to libraries and other cultural venues, lectures by authors and local journalists, and a monthly book discussion group. To learn more about the Patrons, visit library.fullerton.edu/patrons/.\nTitan Athletics Council\nCal State Fullerton Athletics continues to reach new heights in the classroom and on the playing field due in large part to the strong support from alumni, parents and fans. The Titan Athletics Council was formed to enhance the experiences of student-athletes and increase private support for the Division I Athletic Program. Sport-specific events and booster clubs have been established to provide unique experiences for supporters to interact with Titan student-athletes. Every gift helps to build a lasting foundation for excellence in Cal State Fullerton Athletics. For more information on how to get involved, make a gift or learn more about Titan Athletics, visit fullertontitans.com or call 657-278-7034.\n\n\n\n Back to Top | Print-Friendly Page (opens a new window)\n\n\nFacebook this Page (opens a new window)\n\n\n\n\nTweet this Page (opens a new window)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   \n\nAll catalogs © 2023 California State University Fullerton. Powered by the Acalog™ Academic Catalog Management System™ (ACMS™).\n\n\n\n\n",
    "links": [
        "#select_catalog",
        "https://www.fullerton.edu/",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9878",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9876",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9803",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9813",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9810",
        "https://www.fullerton.edu/academicprograms",
        "mailto:catalog@fullerton.edu",
        "https://www.fullerton.edu/it/iso/policy/OnlinePrivacy.php",
        "https://emergency.fullerton.edu/",
        "https://police.fullerton.edu/",
        "https://police.fullerton.edu/jeanneclery",
        "https://www.fullerton.edu/contact.aspx",
        "https://www.fullerton.edu/a-z.aspx",
        "https://www.fullerton.edu/campusmap",
        "https://www2.calstate.edu/",
        "https://www.fullerton.edu/titleix/",
        "https://www.fullerton.edu/ATI",
        "https://www.fullerton.edu/ati/reportati/",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/office.aspx",
        "/search_advanced.php?catoid=75",
        "/index.php?catoid=75",
        "/content.php?catoid=75&navoid=9864",
        "/content.php?catoid=75&navoid=9793",
        "/content.php?catoid=75&navoid=9794",
        "/content.php?catoid=75&navoid=9796",
        "/content.php?catoid=75&navoid=9797",
        "/content.php?catoid=75&navoid=9868",
        "/content.php?catoid=75&navoid=9875",
        "/content.php?catoid=75&navoid=9869",
        "/content.php?catoid=75&navoid=9870",
        "/content.php?catoid=75&navoid=9871",
        "/content.php?catoid=75&navoid=9872",
        "/content.php?catoid=75&navoid=9873",
        "/content.php?catoid=75&navoid=9874",
        "/content.php?catoid=75&navoid=9876",
        "/content.php?catoid=75&navoid=9878",
        "/content.php?catoid=75&navoid=9866",
        "/content.php?catoid=75&navoid=9811",
        "/content.php?catoid=75&navoid=9813",
        "/content.php?catoid=75&navoid=9808",
        "/content.php?catoid=75&navoid=9867",
        "/content.php?catoid=75&navoid=9877",
        "/content.php?catoid=75&navoid=9882",
        "/content.php?catoid=75&navoid=9879",
        "/content.php?catoid=75&navoid=9880",
        "/content.php?catoid=75&navoid=9890",
        "/content.php?catoid=75&navoid=9795",
        "/content.php?catoid=75&navoid=9798",
        "http://www.fullerton.edu/catalog/archive",
        "/portfolio_nopop.php?catoid=75",
        "help.php?catoid=75",
        "/content.php?catoid=75&navoid=9796&print",
        "http://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9796&t=I am looking at the About the University page at California State University Fullerton",
        "http://twitter.com/intent/tweet?u=u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9796&t=Check out this page at California State University Fullerton",
        "javascript:void(0)",
        "#governance",
        "#mission-and-goals",
        "#meaning-of-degree",
        "#universitywide-student-learning-goals",
        "#accreditations-and-associations",
        "#academic-freedom-and-responsibility",
        "#history-of-the-university",
        "#environment-of-the-university",
        "#the-campus-and-its-buildings",
        "#students-of-the-university",
        "#the-faculty",
        "#outstanding-professor-award",
        "#csu-fullerton-auxiliary-services-corp",
        "#cal-state-fullerton-alumni-association",
        "#support-groups",
        "http://www.fullerton.edu/senate/publications_policies_resolutions/ups/UPS%20300/UPS%20300.003.pdf",
        "http://www.fullerton.edu/senate/publications_policies_resolutions/ups/UPS%20300/UPS%20300.041.pdf",
        "http://www.fullerton.edu/senate/publications_policies_resolutions/ups/UPS%20400/UPS%20411.203.pdf",
        "http://fullerton.edu/accreditation",
        "http://www.wscuc.org",
        "http://fullerton.edu/accreditation/discipline",
        "https://www2.calstate.edu/csu-system/about-the-csu/accreditation",
        "http://www.fullerton.edu/senate/publications_policies_resolutions/ups/UPS%20200/UPS%20230.000.pdf",
        "http://fullerton.edu/asc/_corpgov/board.php",
        "http://alumni.fullerton.edu",
        "http://olli.fullerton.edu",
        "http://fullerton.edu/emeriti/",
        "http://fullertonarboretum.org",
        "http://library.fullerton.edu/patrons/",
        "http://fullertontitans.com",
        "javascript:void(0);",
        "/content.php?catoid=75&navoid=9796&print",
        "http://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9796&t=I am looking at the About the University page at California State University Fullerton",
        "http://twitter.com/intent/tweet?u=u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9796&t=Check out this page at California State University Fullerton",
        "javascript:void(0)",
        "/misc/catalog_list.php?catoid=75",
        "http://www.digarc.com"
    ]
}