{
    "title": "Centers and Institutes - Research and Innovation",
    "body": "\n Skip to main content \n\n\nUniversity of Southern California\n\n\nResearch and Innovation\n\n\n\nPrimary Menu\n\nMenuAn icon that consists of three parallel horizontal lines suggestive of a list.\n\nNews\nEvents\nResearch and Scholarship\nResearch Administration\nFunding\nTraining\nAbout\nMore…Show More Menu \nSearchAn icon of a magnifying glass.\n\n\n\n\n\n\n\n\nSearch for:\n\n\n\nCloseAn icon of a letter X.\n\n\n\n\n\n\n\n\n\nCenters and Institutes \n\n\n\n\nCenters and Institutes\n\n\n\nThe University of Southern California is home to research centers and institutes spanning a wide array of disciplines and specialties within and across campus. These centers and institutes are the locus of research for collaborative groups of investigators pushing the frontiers of knowledge forward. USC’s richly interdisciplinary research ecosystem includes numerous cross-school research projects, programs, and institutes. Learn about the procedures for Establishing and Governing Cross-School Research Institutes and Centers.\nResearch and Innovation (R&I) also supports teams of faculty who aim to establish or foster a community of scholars at USC organized around interdisciplinary societally-relevant research topics through the Collaborative Research Planning Award.\n\n\n\n\nCenters and Institutes\nTo add or update a center or institute below, please fill out our Research Centers & Institutes Form.\n\n\n\n\n\n\n\n\n\n\n\n\nFeatured ImageTitleDescriptionURLCategoryFocus Area\n\n\n\nAirbus Institute for Engineering Research\nAirbus Institute for Engineering Research (AIER), made up of the USC Viterbi School of Engineering, Korea Aerospace University (KAU) and Inha University in Incheon, as well as global corporations Airbus and Korean Air, has embarked on three ambitious, collaborative aerospace research projects that could benefit commercial aviation worldwide.\n\n\n\n\n\n\nviterbischool.usc.edu/aier\n\nCenters and InstitutesEngineering and Technology \n\nAirPollBrain Group\nThe AirPollBrain (APB) Group aims to promote the optimal neurodevelopment in humans and healthy brain aging by better understanding environmental effects of urban air pollution and gene-environment interactions. The APB group developed from a core of USC’s leadership in urban environmental health research in the Los Angeles Basin, with collaborating institutions. Taking a multi-disciplinary research, APB addresses effects of environmental pollution on the brain across the lifespan.\n\n\n\n\n\n\ngero.usc.edu/airpollbrain-group\n\nCenters and InstitutesLife Sciences, Sustainability \n\nAlfred E. Mann Institute for Biomedical Engineering\nAMI-USC’s mission is to help bridge the gap between biomedical innovation and the creation of commercially successful medical products to improve and save lives. USC was selected because it is one of a small number of premier research institutions on which the nation depends for a steady stream of new knowledge, art, and technology.\n\n\n\n\n\n\nami.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nAlzheimer Disease Research Center\nThe Alzheimer Disease Research Center at USC is supported by the National Institutes of Health to conduct research on memory problems and aging. Studies include observational studies that follow participants over time while examining changes that may occur with age, and therapy studies such as exercise training, medications and vaccines. Goals are to understand the biological changes that may precede worsening memory and to assess whether new treatments including drugs may be helpful in preventing memory or improving memory loss.\n\n\n\n\n\n\nadrc.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nAlzheimer's Therapeutic Research Institute\nThe mission of the Alzheimer’s Therapeutic Research Institute’s (ATRI) is to rigorously test methods for early detection of and treatments for Alzheimer’s disease (AD).  Led by Paul Aisen, MD,  ATRI is comprised by a  growing set of teams of highly skilled researchers  with expertise in biostatistics, psychology, informatics, bench science, molecular neuroimaging, neuroscience and more.\n\n\n\n\n\n\nkeck.usc.edu/atri\n\nCenters and InstitutesMedicine and Health \n\nAmerican Language Institute\nSince 1959, the American Language Institute (ALI) has been providing English language instruction, assessment, and resources to support the academic and professional success of non-native speakers of English pursuing degrees at USC. The ALI offers English language courses for those students who want to improve their English as well as those who are required to take classes as a result of taking the International Student English (ISE) Exam. The ALI is also responsible for testing and providing English language instruction for the university’s international teaching assistants.\n\n\n\n\n\n\nali.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nAnnenberg Center for Collaborative Communication\nThe Annenberg Center for Collaborative Communication (ANNCCC) enables scholars to think and work across institutional, geographic and disciplinary divides. Jointly established by the USC Annenberg School for Communication and Journalism and the University of Pennsylvania’s Annenberg School for Communication, the center’s faculty and doctoral students seek to address emerging global issues broadly across the field of communication and media.\n\n\n\n\n\n\nannenberg.usc.edu/research/annccc\n\nCenters and InstitutesCommunication and Information Sciences \n\nAnnenberg Inclusion Initiative\nAnnenberg Inclusion Initiative (AII) is a leading think tank dedicated to addressing issues of inequality in entertainment in order to define areas within the industry where diversity is needed.\n\n\n\n\n\n\nannenberg.usc.edu/aii\n\nCenters and InstitutesCommunication and Information Sciences \n\nAnnenberg Innovation Lab\nThe Annenberg Innovation Lab (AnnLab) is a curious, creative and committed Think & Do Tank helping media and technology to work for humans -- not against us. Their collaborative practice is imaginative, rigorous and impact-oriented, and revolves around diverse scholars and practitioners working together to address complex problems and opportunities at the dynamic intersections of media, technology, culture and society.\n\n\n\n\n\n\nannenberglab.com\n\nCenters and InstitutesSocial and Behavioral Sciences, Sustainability \n\nAnnenberg Networks Network\nANN supports a variety of efforts designed to develop social network theory, undertakes empirical research projects to test network theories, and sponsors advanced workshops focused on network theory development as well as a seminar series featuring distinguished network scholars from around the world.\n\n\n\n\n\n\nuscann.tumblr.com\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nAnnenberg Research Network on International Communication\nARNIC studies the emergence of communication innovation, examines the attendant transformation of government policies and communication patterns, and analyzes the social and economic consequences.\n\n\n\n\n\n\narnicusc.org\n\nCenters and InstitutesCommunication and Information Sciences \n\nArchaeology Research Center\nArchaeology deepens our understanding of peoples and societies across space and time, in all parts of the world, while expanding our knowledge of issues relevant in contemporary society. Archaeologists interpret material culture and action from our shared human past using a range of tools and approaches whether the discovery occurs with trowel in hand, or through laboratory analysis, artifact study, remote sensing or by documenting heritage.\n\n\n\n\n\n\ndornsife.usc.edu/arclab\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nArchitecture + Advocacy\nArchitecture” and “advocacy'' might not seem like they go together. But for our team, these two words are inseparable; they speak to the social responsibility of architects, the power of a community to design their own spaces, and our origins as an organization.\n\n\n\n\n\n\n\n\n\narchitectureandadvocacy.org/en/mission\n\nCenters and InstitutesArts and Humanities, Social and Behavioral Sciences \n\nArid Climate and Water Research Center\nAWARE seeks to address the severe deficiencies in characterizing, monitoring, and understanding of water scarcity in arid climates. We aim to develop and design new technologies and analytical tools to help characterize and mitigate water scarcity, desertification, and arid climatic variability.\n\n\n\n\n\n\nsites.usc.edu/watercenter\n\nCenters and InstitutesEngineering and Technology, Sustainability \n\nArtificial Intelligence for Social Good\nIn USC Viterbi, over 50 faculty work on numerous areas within the field of AI, with an over-arching theme of AI for Social Good. Many groups and centers are studying AI for health, energy, sustainability, and privacy and security, and developing novel machine learning, machine vision, robotics, and natural language understanding methods.\n\n\n\n\n\n\nai.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences, Social and Behavioral Sciences, Sustainability \n\nBedrosian Center on Governance\nBedrosian Center is an applied research center at the USC Sol Price School of Public Policy, serving public, academic, and practitioner communities. Democracy is a process of governance. Politics is collaborative decision making. Democracy is community building. They share research and lead conversations exploring democratic ideals.\n\n\n\n\n\n\nbedrosian.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nBice Clinical Research Center\nThe USC Division of Biokinesiology and Physical Therapy is committed to the advancement of evidence-based practice in rehabilitation. To continue to develop their capability in this area, in 2010 the Division established the Bice Clinical Research Center, a specially designed facility for testing human research subjects and patients.\n\n\n\n\n\n\nsites.usc.edu/bice\n\nCenters and InstitutesMedicine and Health \n\nBiomedical Simulations Resource\nBMSR is dedicated to the advancement of the state-of-the-art in biomedical systems modeling and simulation through Core and Collaborative Research projects, as well as the dissemination of this knowledge and related software through Service, Training and Dissemination activities.\n\n\n\n\n\n\nbmsr.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nBiomimicry for Synthesis of Smart Textiles\nInnovate next-generation smart textiles that can chemically, optically and electrically respond to various environmental stimuli. Wearable wireless sensors that can be used to detect heart rate, dehydration, metabolites. Performance enhancement fabrics that can harness energy (heat, vibrations, sound) and more!\n\n\n\n\n\n\nsites.usc.edu/smarttextiles\n\nCenters and InstitutesEngineering and Technology, Sustainability \n\nBrain and Creativity Institute\nFresh insights from biology and from the functioning of the human brain provide new opportunities for uncovering the basis for a large array of mental functions — from feeling, consciousness, and decision-making to the creativity expressed in the arts, sciences and technology. The design of the Brain and Creativity Institute (BCI) reflects its mission. It sits next to the modern laboratories of the Dornsife Neuroimaging Center (DNI), which are dedicated to the scientific investigation of mind and brain, and to one of the oldest instruments dedicated to the exploration of the human mind: a classical auditorium devoted to music and theater performances, literary readings, and scientific presentations.\n\n\n\n\n\n\ndornsife.usc.edu/bci\n\nCenters and InstitutesArts and Humanities, Social and Behavioral Sciences \n\nBridge Institute\nOver the past century, the sciences, engineering and medicine have become progressively more specialized, each diverging into an array of sub-disciplines. Building upon the university’s Michelson Center for Convergent Bioscience Initiative, the Bridge Institute unites eminent professors across the entire university.\n\n\n\n\n\n\ndornsife.usc.edu/bridge-institute\n\nCenters and InstitutesEngineering and Technology \n\nBrittingham Social Enterprise Lab\nThe Brittingham Social Enterprise Lab (BSEL) is a Center of Excellence at the USC Marshall School of Business that equips students, faculty and staff with the business skills and resources to develop market-based solutions to the wicked problems of the 21st century. Through education, community building, research and professional development, the Lab serves as the hub for social entrepreneurial efforts at the university and beyond.\n\n\n\n\n\n\nmarshall.usc.edu/brittingham-social-enterprise-lab\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nBroad Center for Regenerative Medicine and Stem Cell Research at USC\n\n\n\nThe Eli and Edythe Broad Center for Regenerative Medicine and Stem Cell Research at USC hosts world-class scientists as well as shared facilities in imaging, therapeutic screening, flow cytometry and genome modification. Investigators are exploring the normal mechanisms that build, maintain and repair body systems to develop knowledge-based approaches for regenerative medicine. Scientists are researching kidney, liver, neural, blood, cardiovascular, skeletal and skin disease models. The center serves as a hub for USC Stem Cell, which connects researchers in stem cell biology and regenerative medicine across USC.\n\n\n\n\n\n\nstemcell.keck.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCalifornia Rights Meds Collaborative\nThe California Right Meds Collaborative was launched in September 2019 by USC School of Pharmacy and is consortium of health plans, pharmacies, academic and professional organizations in the Southern California region working to deliver high-impact Comprehensive Medication Management (CMM) services through a sustainable, value-based payment model.\n\n\n\n\n\n\ncalrightmeds.org\n\nCenters and InstitutesMedicine and Health \n\nCasden Institute\nThe USC Casden Institute for the Study of the Jewish Role in American Life has been bringing new insight to bear upon the important role played by Jewish people in American Culture, particularly in the West. The extraordinary contributions Jews are making in transforming the West Coast has warranted the establishment of a program that allows the fullest, strongest expression of the modern Jewish experience to shine through. \n\n\n\n\n\n\ndornsife.usc.edu/casden-institute\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Advanced Genocide Research\nThe research arm of the USC Shoah Foundation, the Center for Advanced Genocide Research is dedicated to advancing innovative interdisciplinary research on the Holocaust, genocide and mass violence; promoting use of the Visual History Archive testimonies in academic research and teaching; and transforming the way we understand the origins, dynamics and consequences of mass violence, as well as the conditions and dimensions of resistance.\n\n\n\n\n\n\ndornsife.usc.edu/cagr\n\nCenters and InstitutesArts and Humanities, Social and Behavioral Sciences \n\nCenter for Advanced Manufacturing\nThe Center for Advanced Manufacturing (CAM) is an interdisciplinary center in the USC Viterbi School of Engineering. CAM features latest computer controlled machining, polymer processing, additive manufacturing capabilities; wide variety of automation, robotics, and measurement technologies; access to software for creating digital models and visualizing them using augmented and virtual reality technologies.\n\n\n\n\n\n\ncam.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCenter for Affective Neuroscience, Development, Learning and Education (CANDLE)\nThe USC Center for Affective Neuroscience, Development, Learning and Education (CANDLE) brings educational innovation and developmental affective neuroscience into partnership, and uses what is learned to guide the transformation of schools, policy, and the student and teacher experience for a healthier and more equitable society.\n\n\n\n\n\n\ncandle.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Applied Mathematical Sciences\nThe Center for Applied Mathematical Sciences is an organized research unit based in the Department of Mathematics at USC. The purpose of CAMS is to foster research and graduate education in Mathematics in a broad sense and in an interdisciplinary mode. One goal of the center's participants is to facilitate and encourage the development of applicable mathematics and its utilization in problems in engineering and the sciences.\n\n\n\n\n\n\ndornsife.usc.edu/cams\n\nCenters and InstitutesPhysical Sciences \n\nCenter for Applied Network Analysis\nThe Center for Applied Network Analysis (CANA) hosts a twice monthly, two-hour lab meeting in which students, postdoctoral candidates and faculty present work in progress. CANA meetings cover a diverse set of topics centered around conducting research using the social network approach. CANA also organizes workshops on technology and techniques for conducting analysis.\n\n\n\n\n\n\ncana.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for Artificial Intelligence in Society\nThe primary goal of the USC Center for AI in Society is to develop, test, iterate, and demonstrate how AI can be used to tackle the most difficult societal problems. They believe that this can best be achieved by a genuine partnership between computer science, operations research, social work, and community organizations. USC CAIS is a joint venture between the USC Suzanne Dworak-Peck School of Social Work and the USC Viterbi School of Engineering.\n\n\n\n\n\n\ncais.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences, Social and Behavioral Sciences \n\nCenter for Autonomy and Artificial Intelligence\nThe USC AAI (Double AI) Center aims to develop fundamental foundations of Intelligent Autonomy by leveraging and enriching the latest developments in Artificial Intelligence for autonomous systems. Applications abound from autonomous robotics and mobility systems to autonomous operation in large scale infrastructure systems. The Center aims to conduct cutting edge research in close collaboration with industrial partners. Deep engagement with industrial partners will provide insight on critical research needs of industry. The Center aims to collectively envision a high impact research agenda to further intelligent autonomy technologies on shared and critical needs with its industrial partners.\n\n\n\n\n\n\naai.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Body Computing\nWith a mission to modernize health care through technology to make it more personal, affordable and accessible for all, the USC Center for Body Computing was founded in 2006 as one of the nation’s first academically-based digital health research and innovation centers. By leveraging digital technology to provide personal and continuous care, the USC CBC conducts clinical research to establish safety and efficacy of these emerging technologies.\n\n\n\n\n\n\nuscbodycomputing.org\n\nCenters and InstitutesMedicine and Health \n\nCenter for Brain Repair and Rehabilitation\nLocated at USC’s Health Sciences Campus in Los Angeles, Calif., the Phillips-Fisher Center is the first of its kind in the world. The Center has brought together world-class basic science researchers in collaboration with cutting-edge physical therapists to better understand the effects of medical treatment and physical therapy on brain plasticity and repair in patients with neuro-degenerative disorders during comprehensive clinical trials.\n\n\n\n\n\n\nsites.usc.edu/phillips-fisher\n\nCenters and InstitutesMedicine and Health \n\nCenter for City Design\nThe Center for City Design advances radical alternatives to exclusionary policies and extractive practices that shape our cities today. Through the lens of spatial and social justice, the Center catalyzes critical research, creative work, and strategic collaborations to address precarious living and working conditions in cities everywhere.\n\n\n\n\n\n\ncitydesign.uscarch.com\n\nCenters and InstitutesEngineering and Technology, Social and Behavioral Sciences, Sustainability \n\nCenter for Climate Journalism and Communication\nWe empower journalists and other communicators to tell stories about climate change\n\n\n\n\n\n\nclimatecenter.usc.edu\n\nCenters and InstitutesSustainability \n\nCenter for Computational Modeling of Cancer\nThe Center for Computational Modeling of Cancer bridges researchers from various disciplines with clinicians and patients. This includes engineers, computer scientists, mathematicians, physicists, and cancer biologists.\n\n\n\n\n\n\nmodelingcancer.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCenter for Craniofacial Molecular Biology\nThe Herman Ostrow School of Dentistry of USC’s Center for Craniofacial Molecular Biology is a unique facility that unites world-class researchers in a variety of disciplines centered around structures of the craniofacial region. Since its inception in 1991, CCMB has been home to several major discoveries and has attracted top researchers from around the world.\n\n\n\n\n\n\nccmb.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for Cyber-Physical Systems and the Internet of Things\nCCI is a new center at the USC Viterbi School of Engineering, bringing together more than 35 faculty in Engineering with expertise spanning many disciplines such as networks, machine learning, data management, optimization, software and systems engineering, transportation, manufacturing, robotics, and cyber-security and 8 faculty at other Schools at USC.\n\n\n\n\n\n\ncci.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Dark Energy Biosphere Investigations\nThe Center for Dark Energy Biosphere Investigations (C-DEBI) is a $47.6M National Science Foundation-funded Science and Technology Center started in 2010 with the mission to explore life beneath the seafloor and make transformative discoveries that advance science, benefit society, and inspire people of all ages and origins.\n\n\n\n\n\n\ndarkenergybiosphere.org\n\nCenters and InstitutesLife Sciences \n\nCenter for Digital Aging\nUSC Leonard Davis and its Center for Digital Aging aim to harness the power of social media and new technologies to help older adults, caregivers, and related businesses and services as well as empower older adults to use technology and understand its benefits and risks.\n\n\n\n\n\n\ngero.usc.edu/cda\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Dispute Resolution\nLed by award-winning faculty experts, the Center for Dispute Resolution at USC Gould School of Law offers thorough preparation in arbitration, mediation and negotiation through its distinct degree and certificate programs. Students in the program learn to negotiate many types of settlements both inside and outside of the courtroom while gaining skills relevant to any area of legal or business practice.\n\n\n\n\n\n\ngould.usc.edu/faculty/centers/dispute-resolution\n\nCenters and InstitutesCommunication and Information Sciences, Social and Behavioral Sciences \n\nCenter for Diversity and Democracy\n The CDD works with faculty members, Ph.D. students, undergraduate students, and community partners to enhance, explore and develop strong connections between efforts of university-community civic engagement and the diversity of university faculty and students. In short, they are committed to making stronger a diverse set of voices at the university, while enabling a wide variety of community members and organizations to engage the university as equal partners towards equity and social justice.\n\n\n\n\n\n\ndornsife.usc.edu/cdd\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Drug Discovery and Development\nThe USC Center for Drug Discovery and Development assembles a diverse group of scientists from throughout the university with expertise in all aspects of the design and synthesis of potential pharmacological breakthroughs. The Center benefits from a team of pharmacologists, toxicologists, and pharmaceutical and regulatory scientists skilled at expediting evaluation of a wide range of therapeutics to bring new innovations more quickly to patients who need them, while assuring safety and effectiveness.\n\n\n\n\n\n\nmichelson.usc.edu/usc-center-drug-discovery-development/\n\nCenters and InstitutesMedicine and Health \n\nCenter for Economic and Social Research\nThe Center for Economic and Social Research (CESR) is dedicated to discovering how people around the globe live, think, interact, age, invest, and make important, life-changing decisions. Their in-depth research and analysis are deepening the understanding of human behavior in a wide range of economic and social contexts. Their ultimate goal: to improve social welfare by informing and influencing decision-making in the public and private sectors. Along the way, we are leading a creative revolution in how scientists conduct social science and economic research through the use of innovative technology. Tomorrow is here, today.\n\n\n\n\n\n\ncesr.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Economic Development \nThe USC Center for Economic Development (CED) serves as a leader in facilitating sustainable economic development opportunities throughout Southern and Central California. An applied research center of the USC Price School of Public Policy, CED partners with community-based organizations, public agencies and private entities to enhance their functional capacity by tapping the energy, enthusiasm and talent of the school’s faculty, staff and students.\n\n\n\n\n\n\nced.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Education, Identity and Social Justice\nThe Center for Education, Identity and Social Justice has a compelling interest in eradicating all forms of discrimination based on the intersection of an individual’s identities, including religion, gender, sexual orientation, race, ethnicity and disability. Using rigorous research and legal analysis, we empower educators to utilize laws and policies in order to identify and extricate bias and unequal distributions of power within educational institutions.\n\n\n\n\n\n\nsocialjustice.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Effective Organizations\nSince its founding in 1979, the Center for Effective Organizations (CEO) has conducted cutting-edge research on a broad range of organizational effectiveness issues. The leading university-based action-research center, CEO, has conducted research that influences how organizations are managed while also making important contributions to academic research and theory from its inception. The Center for Effective Organization's pioneering research in the areas of organizational design and effectiveness has earned it an international reputation for research that bridges the gap between academic theory and management practice.\n\n\n\n\n\n\nmarshall.usc.edu/center-effective-organizations\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Empowered Learning and Development with Technology\nCELDTech is committed to conducting methodologically rigorous research on the digital media experiences of youth and adults in urban communities. Also central to their mission is the design of digital tools that transform teaching and learning in P-20 classrooms and beyond.\n\n\n\n\n\n\nempoweredtech.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Engagement-Driven Global Education\nCenter EDGE (Center for Engagement-Driven Global Education) fuels interdisciplinary partnerships to bring relevant, sustainable innovation to scale in the crucial area of educational engagement – the activities and techniques used to improve teaching and learning outcomes.\n\n\n\n\n\n\nedge.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Enrollment Research, Policy and Practice\nEstablished in 2007 at the University of Southern California, the Center for Enrollment Research, Policy and Practice became a part of the USC Rossier School of Education in 2010. Rooted in the belief that the educational attainment goals of the nation will be more fully realized as college admission, student financial aid, and degree completion processes become better informed, more expertly practiced, and more equitable, the USC CERPP is committed to fostering equity and expertise in educational access, admissions and outcomes.\n\n\n\n\n\n\ncerpp.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Feminist Research\nCFR works in partnership with Gender and Sexuality Studies to create research opportunities for the study of race, gender, sexuality, coloniality, and feminism. Their seminars, workshops, conferences, and informal gatherings bring together scholars, students, artists, musicians, filmmakers, and members of the greater Los Angeles community who share interests and concerns about the operations of systemic oppression, managed depletion, and modalities of enclosure that structure, imbricate, and materialize bodies, neighborhoods, societies, and worlds.\n\n\n\n\n\n\ndornsife.usc.edu/cfr\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Genetic Epidemiology\nThe Center for Genetic Epidemiology studies the genetic factors that contribute to disease, with a major focus on diverse populations that have different risks of developing disease. The center also concentrates on the establishment of population-based resources and the development and application of genomic methods for understanding the genetic basis of disease.\n\n\n\n\n\n\nkeck.usc.edu/genetic-epidemiology-center\n\nCenters and InstitutesMedicine and Health \n\nCenter for Global Aging\nThe aims of the Center on Global Aging are to increase understanding through research of how aging can vary around the world because of: the social and economic context; changes in health; and policies and programs to support aging persons. Topics on interest include physiological aging, health, well-being, caregiving, labor force participation, migration, use of services, family interaction and social integration.\n\n\n\n\n\n\ngero.usc.edu/cga\n\nCenters and InstitutesLife Sciences \n\nCenter for Global Innovation\nThe USC Marshall Center for Global Innovation is the leading center in the world for research on global innovation. Innovation itself is a key driver of the welfare of consumers, the success of firms, and the wealth of nations. The Center creates and disseminates cutting edge research on how innovation helps firms compete, grow, and succeed in today's global environment.\n\n\n\n\n\n\nmarshall.usc.edu/center-global-innovation\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Health Equity in the Americas\nThe purpose of the Center for Health Equity in the Americas (CenHealth) is to conduct and promote student/faculty national and international research and collaborations on solutions to health disparities throughout the Americas (North America, South America, Central America and the Caribbean); that will contribute to closing gaps in vulnerable populations in achieving health equity.\n\n\n\n\n\n\nhealthequityamericas.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for Health Financing, Policy, and Management\nEstablished in 1996 and located within the USC Sol Price School of Public Policy, the Center for Health Financing, Policy and Management aims to advance community, organizational and health system innovation and effectiveness, both domestically and internationally, through leading-edge applied healthcare research, analysis, and knowledge dissemination. The Center’s mission focuses on expanding society’s knowledge to improve healthcare, health system performance and effective management of health service delivery.\n\n\n\n\n\n\nimprovinghealth.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Health Journalism\nThe Center for Health Journalism partners with newsrooms across America and helps journalists and community storytellers innovate, investigate and illuminate health challenges in their communities, serving as a catalyst for change.\n\n\n\n\n\n\ncenterforhealthjournalism.org\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Homelessness, Housing, and Health Equity Research\nThe Center for Homelessness, Housing, and Health Equity Research (H3E) at the USC Suzanne Dworak-Peck School of Social Work conducts research to promote the discovery and dissemination of evidence-based solutions to reduce homelessness and health disparities. H3E research has been funded by the National Institutes of Health including the National Institute of Mental Health, the National Institutes on Drug Abuse, and the National Institute on Aging. H3E also partners with the Los Angeles Homeless Services Authority (LAHSA) to conduct the Greater Los Angeles Homeless Count annually, which is the largest unsheltered homeless count in the United States.  \n\n\n\n\n\n\nh3e.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Human Applied Reasoning and the Internet of Things\nEstablished in 2016, CHARIOT is a collaboration between USC Rossier School of Education and USC Viterbi School of Engineering to revolutionize personal learning by combining cutting-edge cognitive science and education research with emerging technologies from the Internet of Things (IoT).\n\n\n\n\n\n\nchariot.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Image Acquisition\nThe Center for Image Acquisition (CIA) combines two of the world's most advanced MRI scanners with dedicated supercomputing systems, cutting-edge analysis techniques, and industry-leading expertise to image, map and model the structure and function of the living human brain with unprecedented detail. As a part of the USC Mark and Mary Stevens Neuroimaging & Informatics Institute (INI), and located on the campus of the Keck School of Medicine of USC, the CIA provides high-resolution high-field imaging capabilities for both neuroscientific research and clinical applications. The CIA houses specialized tools and equipment enabling a variety of measurements and techniques to be employed for interdisciplinary research and clinical investigation.\n\n\n\n\n\n\ncia.ini.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for ImmunoEngineering\nThe Center for ImmunoEngineering (CIE) at USC is a research center homed at USC Viterbi School of Engineering with its vision to unlock the full potential of immunoengineering by integrating engineering principles into immunology and immunotherapy research.\n\n\n\n\n\n\nimmunoengineering.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCenter for Inclusive Democracy\nThe Center for Inclusive Democracy (CID) at the USC Sol Price School of Public Policy is a leading nonpartisan research center focused on elections, voting behaviors, and electoral and political participation. Founded by political sociologist Dr. Mindy Romero, CID has been a driving force for more than a decade on dozens of national and multi-state research initiatives that harness big data to effect change. Its studies have been widely used to inform public policy at all levels of government, as well as empower local communities seeking to eliminate disparities in social and economic well-being of the electorate.\n\n\n\n\n\n\ncid.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Innovation and Research on Veterans & Military Families\nThe mission of the Center for Innovation and Research on Veterans & Military Families (CIR) at the USC Suzanne Dworak-Peck School of Social Work is to enhance the visibility and impact of research, education and outreach to inform decision-makers on policy issues affecting veterans and their families. Among those issues is a focus on rapidly increasing the number of clinical social workers and behavioral health providers trained to treat the challenges service members, veterans and their families face, as well as mental health research that can be directly and quickly translated into clinical practice.\n\n\n\n\n\n\ncir.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Integrated Electronic and Biological Organisms\nEngineer biological-electronic hybrid systems at the sub-cellular scale that enable closed-loop, multi-modal control of individual cells within complex tissues.\n\n\n\n\n\n\nsites.usc.edu/cieborg\n\nCenters and InstitutesEngineering and Technology \n\nCenter for Integrative Connectomics\nThe Center for Integrative Connectomics, home of the Mouse Connectome Project (MCP), seeks to develop a multimodal, multiscale connectome and cell-type map of the mammalian brain using advanced tracing, imaging and computational methods. The center’s multidisciplinary team develops neuroanatomic and neuroinformatic approaches in order to understand connectivity patterns in both health and disease.\n\n\n\n\n\n\ncic.ini.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for Intelligent Environments\nThe mission of Center for Intelligent Environments (CENTIENTS) is to facilitate a broad, far-reaching conversation and research about how to design, introduce, and oversee user-centered solutions in ways that make environments not only more supportive of organizational goals but also safer, healthier, more humane, and capable of producing joy and well-being in the humans that use them.\n\n\n\n\n\n\nintelligentenvironments.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCenter for Interactive Smart Oilfield Technologies\nThe Center for Interactive Smart Oilfield Technologies (CiSoft) is a joint University of Southern California and Chevron Center of Excellence for Research and Academic Training. Established in December 2003, CiSoft includes participation of research scientists from the Viterbi School of Engineering and Chevron.\n\n\n\n\n\n\ncisoft.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCenter for International Studies\nThe Center for International Studies (CIS) was established in 1986 to promote advanced research and critical debate of theoretical and policy issues in world affairs. The Center supports the research of faculty and students; hosts scholars from the United States and abroad; organizes public seminars, workshops and conferences; promotes collaborative research projects; and contributes to public understanding of international affairs.\n\n\n\n\n\n\ndornsife.usc.edu/cis\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Investment Studies\nFounded in 2002, the USC Marshall School Center for Investment Studies (CIS) is establishing itself as a premier global academic institution specializing in financial analysis and valuation. The Center assists the Marshall School in producing graduates equipped with the necessary financial analytical skills required for succeeding in global commerce. Learn more about our Acadamic Programs. The Center also aims to support faculty research in developing a better understanding of how financial markets work. The Center anticipates serving as a central platform for leading investment scholarship and stimulating dialogue between academia and the professional investment community.  \n\n\n\n\n\n\nmarshall.usc.edu/center-investment-studies\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Languages and Cultures\nThe mission of the Center is to promote language learning on USC campus. \n\n\n\n\n\n\ndornsife.usc.edu/center-for-languages-and-cultures\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Law and Philosophy\nDevoted to advancing interdisciplinary scholarship in legal, moral and political philosophy, the center is a partner in the peer-reviewed, online Journal of Ethics & Social Philosophy. A joint project of USC Gould and the USC Dornsife College of Letters, Arts and Sciences, the center also holds conferences, workshops and other activities that enhance the study of law and philosophy.\n\n\n\n\n\n\nlawphilosophy.usc.edu\n\nCenters and InstitutesArts and Humanities \n\nCenter for Law and Social Science\nThe Center for Law and Social Science (CLASS) is an umbrella organization dedicated to a core intellectual mission of the Gould School of Law-investigating the relationship between law and the social sciences, spanning the fields of economics, political science, psychology, sociology and more. The Center seeks to expand our understanding of how law and legal institutions work and to develop sound policies to achieve goals such as a fair social order and a productive economy. The Center is designed to boost and coordinate the wide variety of scholarly work and events devoted to this line of inquiry.\n\n\n\n\n\n\ngould.usc.edu/centers/class\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Law, History and Culture \nThe University of Southern California's Center for Law, History and Culture is devoted to encouraging the study of law as an historical and cultural institution. CLHC brings together faculty members from the College of Letters, Arts, and Sciences and faculty from the Law School, sponsoring a wide range of scholarly and cultural activities, including faculty workshops, book talks, seminars, and conferences, as well as programs designed to support students and emerging scholars.\n\n\n\n\n\n\ngould.usc.edu/clhc/\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Leadership by Women of Color\nThe USC Dornsife Center for Leadership by Women of Color (CLWOC) was created to meet a need: research about how women of color leaders transform the very definition of leadership! CLWOC is elevating the study of how women of color leaders transform what we mean by leadership using analytical frameworks designed by, for, and with women of color leaders themselves. They seek to better understand the frameworks that meet the moment in leadership studies today. It is no longer just about the faces but about the processes leaders use to expand and redefine leadership.\n\n\n\n\n\n\ndornsife.usc.edu/clwoc\n\nCenters and InstitutesArts and Humanities \n\nCenter for LGBTQ+ Health Equity\nThe Center for LGBTQ+ Health Equity (CLHE) was created to lead scientific inquiry into the physical, emotional and social health of LGBTQ+ youth, adults and families, and guide best practices for achieving health equity for this population. The work of the Center is guided by scholars, community leaders and nationally recognized experts in the field of LGBTQ+ health, who are committed to advancing research, collaboration, training and outreach activities that facilitate dialogue, broaden awareness and promote social change. Learn more about our team members.\n\n\n\n\n\n\ndworakpeck.usc.edu/research/centers-affiliations/center-for-lgbtq-health-equity\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Lifespan Health\nThe Center for Lifespan Health works to create multiple institutional resources to advance lifespan health research, along with various existing nonprofit partners including the Milken Institute Center for the Future of Aging, the American Federation for Aging Research (AFAR), and the Buck Institute for Research on Aging. The Center facilitates new and innovative convergent approaches to the study of lifespan health by building the platform for bringing these units together.\n\n\n\n\n\n\nlifespanhealth.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for Neuronal LongevityUSC Ginsburg Institute for Biomedical TherapeuticsCenter for Neuronal Longevity\nDirector, Mark S. Humayun MD, PhD, devoted his career to developing treatments for eye diseases, after having watched his grandmother lose her vision to diabetes. But discovering cures for vision loss is no easy feat, as visual processing involves both the complex machinery of the eye, and approximately 30% of the cerebral cortex of the brain. Through the development of vision restoration treatments, a strong foundation has been built upon which USC Dr. Allen and Charlotte Ginsburg Institute for Biomedical Therapeutics (IBT) can expand, allowing the creation of a new generation of therapies that target debilitating neurosensory diseases.\n\n\n\n\n\n\nibt.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for Occupation and Lifestyle Redesign\nThe Center for Occupation and Lifestyle Redesign is the world’s first center dedicated to the study of how everyday activities, or “occupations,” shape human health and well-being. Here, faculty and students: Analyze the evolution of human occupation from the Arts and Crafts era to today. Examine how occupational changes affect individuals physically, psychologically and spiritually. Synthesize research, education and clinical practice to discover what constitutes an optimal balance of work, rest and leisure. Customize intervention programs to help individuals achieve optimal living.\n\n\n\n\n\n\nchan.usc.edu/about-us/center\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Peptide and Protein Engineering\nThe USC Center for Peptide and Protein Engineering (CPPE) aims to put USC in a position of undisputed leadership in peptide and protein science by creating functional peptides and proteins as imaging agents, diagnostics and therapies.\n\n\n\n\n\n\ncppe.usc.edu\n\nCenters and InstitutesEngineering and Technology, Life Sciences \n\nCenter for Public Relations\nThe USC Center for Public Relations (CPR) is truly at the center of the fast-growing PR industry — connecting businesses, agencies, academics, and students. Our mission is to advance both the study and practice of public relations through research, education, and innovation.\n\n\n\n\n\n\nannenberg.usc.edu/research/center-public-relations\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Quantitative Drug and Disease Modeling\nThe Center for Quantitative Drug and Disease Modeling at the Department of Clinical Pharmacy at the USC Mann School of Pharmacy was founded in 2018, with the purpose of developing a collaborative, cutting-edge academic enterprise focused on state-of-the-art quantitative medicine.\n\n\n\n\n\n\npharmacyschool.usc.edu/cqddm\n\nCenters and InstitutesMedicine and Health \n\nCenter for Quantum Information Science and Technology\nThe mission of the USC Center for Quantum Information Science & Technology (CQIST) is to advance fundamental experimental and theoretical knowledge in relevant areas of Engineering and Physical Science. CQIST is a truly interdisciplinary Center, spanning the USC College of Letters, Arts & Science, and the USC Viterbi School of Engineering. Their faculty members represent wide-ranging expertise in theoretical, experimental, and technological aspects of quantum information processing.\n\n\n\n\n\n\ncqist.usc.edu\n\nCenters and InstitutesPhysical Sciences \n\nCenter for Religion and Civic Culture\nThe USC Center for Religion and Civic Culture advances the understanding of religion and society, and supports faith and community leaders in becoming full partners in the work of social change. We conduct empirical research on religious, cultural and social change in the US and globally. CRCC also hosts various institutes that help leaders realize their potential and transform their organization so that they can have a more effective and sustained impact on community health and wellbeing, including the American Muslim Civic Leadership Institute and the Cecil Murray Center for Community Engagement.\n\n\n\n\n\n\ncrcc.usc.edu\n\nCenters and InstitutesArts and Humanities, Social and Behavioral Sciences \n\nCenter for Research On Crime\nThe current program of research aims to apply principles of social identity and social categorization theories to the pernicious problem of street gang affiliation among urban youth in the United States and Central America. A series of studies testing factors that may inadvertently promote gang association as well as factors that may help discourage gang association are underway. A spin-off from this effort includes the development of an assessment designed to identify youth at risk for joining street gangs that can be used to target prevention services toward youth most in need. \n\n\n\n\n\n\ndornsife.usc.edu/labs/center-for-research-on-crime\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Risk and Economic Analysis of Threats and Emergencies\nAs the Department of Homeland Security’s first University Center of Excellence, CREATE serves our nation through creation of advanced models and tools for the evaluation of the risks, costs and consequences of threats to human livelihood and through assessment of strategies to mitigate risks and respond to emergencies.  CREATE's approach is integrated, holistic and impartial, providing independent assessment of hazards, both malevolent and unintentional, including terrorism, accidents, and naturally occurring events.\n\n\n\n\n\n\ncreate.usc.edu\n\nCenters and InstitutesEngineering and Technology, Social and Behavioral Sciences, Sustainability \n\nCenter for Smart Omni-Functional Textiles\nThe Center for Smart Omni-Functional Textiles (SOFT) aims to innovate next-generation smart textiles that can chemically, optically, and electrically respond to various environmental stimuli. These types of smart textiles can be used for a variety of applications including wearable sensors that can be used to detect bodily functions, performance enhancement fabrics that can harness energy such as heat or vibrations or sound, clothing that can repel water when it rains but attract water in dry climates, and light-sensitive fabrics that can regulate temperature to allow for less energy use in buildings.\n\n\n\n\n\n\nviterbischool.usc.edu/viterbi-internal-center-incubator\n\nCenters and InstitutesEngineering and Technology, Sustainability \n\nCenter for Sustainability Solutions\nThe Center for Sustainability Solutions develops policy, technological, and behavioral solutions to the most pressing sustainability problems of the Southern California region and the world.  It brings together scholars and stakeholders from sustainability organizations around the world to collaborate on basic and applied research aimed at making a real-world impact.\n\n\n\n\n\n\nsustainabilitysolutions.usc.edu\n\nCenters and InstitutesEngineering and Technology, Social and Behavioral Sciences, Sustainability \n\nCenter for Sustainable Cities\nCSC conducts multi-disciplinary research, education and community engagement on the sustainability challenges of metropolitan areas. The Center seeks to develop and propose policies and strategies that make our cities and metropolitan areas more sustainable, just, and economically vibrant. The Center’s faculty and student researchers focus on the spatial structure of cities – where housing, jobs, and public services locate — and how cities can be designed to achieve sustainability goals. \n\n\n\n\n\n\nmetrans.org/csc\n\nCenters and InstitutesSocial and Behavioral Sciences, Sustainability \n\nCenter for Systems and Control\nThe Center for Systems and Control at the University of Southern California (CSC@USC) brings together students, postdocs, visitors, and faculty from across different departments within the Viterbi School of Engineering. The overall goal of the center is to increase the strength and visibility of the systems and control program by continuing the long tradition and legacy going back to Richard Bellman and Leonard Silverman.\n\n\n\n\n\n\ncsc.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCenter for Systems and Software Engineering\nCenter for Systems and Software Engineering studies the relationship between systems, software, and users.\n\n\n\n\n\n\ncsse.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCenter for Technology and Mental Health\nMental health is a major societal challenge. Engineering technologies have the potential to improve diagnosis, intervention, and treatment of mental illness. In the Viterbi School of Engineering, a growing number of faculty are exploring research relevant to mental health.\n\n\n\n\n\n\nsites.usc.edu/ctmh\n\nCenters and InstitutesEngineering and Technology \n\nCenter for the Changing Family\nThe Center for the Changing Family is an interdisciplinary group of USC faculty who study family systems, close relationships, and mental and physical health across the lifespan. As a diverse group of scholars spanning multiple fields, the Center for the Changing Family defines \"family\" broadly. \n\n\n\n\n\n\ndornsife.usc.edu/labs/usc-ccf\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for the Digital Future\nThe Center for the Digital Future draws on proprietary data, gathered during more than a decade of studying digital technologies and user behavior, to explore current business realities and predict developments that are critical to the success of global companies and NGOs. Through its relationship with the market research and strategy firm Bovitz Inc., the Center offers a suite of services that integrate data and insights.  The capabilities of Bovitz’s team are merged with the Center’s resources and expertise to produce digital strategies that are unique in the marketplace.\n\n\n\n\n\n\ndigitalcenter.org\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for the Political Future\nThe Center for the Political Future (CPF) combines rigorous intellectual inquiry, teaching, and practical politics to advance civil dialogue and research that transcends partisan divisions and finds solutions to pressing national and global challenges. Their events, programs, scholarships, and internships inspire and train students for careers in public service and lifetimes of civic engagement.\n\n\n\n\n\n\ndornsife-center-for-political-future.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for the Study of Immigrant Integration\nThe mission of the Center for the Study of Immigrant Integration (CSII) is to promote forward-looking narratives that support the integration of diverse immigrant and U.S.-born communities, lift up the intersection of racial justice and immigrant rights, and strengthen the base for intersectoral collaborations.\n\n\n\n\n\n\ndornsife.usc.edu/csii\n\nCenters and InstitutesArts and Humanities \n\nCenter for Third Space Thinking\nThe Center has developed a new, communications-driven methodology to frame and solve problems that helps organizations become more successful in today’s complex world. The Center offers a variety of custom leadership development, student education, and community engagement programs.\n\n\n\n\n\n\nuscthirdspace.com\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter for Translational Research on Environmental Health\nCenter for Translational Research on Environmental Health aims to apply novel team-science approaches to address today’s key pressing environmental  health issues and understand the risk factors that continue to drive obesity, type 2 diabetes, metabolic disease and cancer through translational research design. \n\n\n\n\n\n\nuscrten.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCenter for Transnational Law and Business\nThe Center for Transnational Law and Business (CTLB) promotes world-class policy analysis, research and educational opportunities in international business, law and policy. The center serves USC, the broader community of Southern California, the nation and the world.\n\n\n\n\n\n\ngould.usc.edu/centers/ctlb\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for Urban Education\nSince its founding in 1999, the USC Rossier Center for Urban Education (CUE) has worked to bring equity-mindedness to institutions of higher education through socially conscious research, tools and learning institutes. CUE empowers practitioners to act as agents of change, enabling them to be critically race conscious as they respond to changing demographics in our educational systems.\n\n\n\n\n\n\ncue.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter for USC-Taiwan Translational Research\nThe Center for USC-Taiwan Translational Research focuses on promising new work in the fight against cancer. USC Trustee Daniel M. Tsai made a gift to the USC Mann School of Pharmacy to establish the USC Daniel Tsai Fund for Translational Research which supports center activities.\n\n\n\n\n\n\npharmacyschool.usc.edu/translational-research/\n\nCenters and InstitutesMedicine and Health \n\nCenter of Excellence in NanoBiophysics\nThe Center of Excellence in NanoBiophysics supports faculty and students across the university in the study of molecular nano-assembly, structures and functions. Housed in the Dornsife College, the Center is used by research programs in structural biology, nanotechnology, anomedicine, molecular biology, biochemistry, and materials sciences.\n\n\n\n\n\n\ndornsife.usc.edu/nanobiophysicscore\n\nCenters and InstitutesPhysical Sciences \n\nCenter on Biodemography and Population Health\nThe USC/UCLA Center on Biodemography and Population Health (CBPH) is one of 14 centers in the Demography and Economics of Aging Centers Program sponsored by the National Institute on Aging (NIA). The primary purpose of the CBPH is to provide a synergistic research environment for the integration and translation of research findings from a variety of disciplines to understand population health. This integration of biological, epidemiologic and medical risk information which characterizes Center research is fundamental to understanding and projecting demographic trends and differences in population health.\n\n\n\n\n\n\ngero.usc.edu/cbph\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter on Communication Leadership & Policy\nCCLP provides hands-on learning opportunities for students and professionals, building the next generation of communication leaders. CCLP also conducts academic research and organizes programs for scholars, policymakers and industry leaders to develop ways in which communication leadership, policy, technology and mobile innovation can contribute to a more informed electorate and a better world.\n\n\n\n\n\n\ncommunicationleadership.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nCenter on Education Policy, Equity and Governance\nEstablished in 2017, Center on Education Policy, Equity and Governance is a re-envisioning of the Center on Educational Governance (CEG). The CEPEG mission is to conduct rigorous, practice-relevant research that advances educational equity for California K-12 students–with an emphasis on greater Los Angeles– and to create partnerships that ensure education policies, practices, and governance structures are guided by evidence and careful analysis.\n\n\n\n\n\n\ncepeg.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter on Elder Mistreatment\nThe USC Center on Elder Mistreatment brings together the existing and wide-ranging elder mistreatment expertise at USC—in medicine, gerontology, health services, psychology, and policy—as well as encourage new partnerships in biology, genetics, biodemography, economics, law, neuroscience, allied health, biostatistics, and social work. Through novel collaborations and approaches and the National Center on Elder Abuse and the Los Angeles County Elder Abuse Forensic Center, the Center addresses one of the most horrendous and growing problems affecting our society.\n\n\n\n\n\n\neldermistreatment.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter on Philanthropy and Public Policy\nThe Center on Philanthropy and Public Policy promotes more effective philanthropy and strengthens the nonprofit sector through research that informs philanthropic decision-making and public policy to advance community problem solving. From its studies on new philanthropists and California foundations to its analysis of foundation strategies for public policy engagement, The Center on Philanthropy and Public Policy conducts research that is powerful, rigorous, relevant, and accessible to a wide range of constituencies.\n\n\n\n\n\n\ncppp.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter on Public Diplomacy\nThe USC Center on Public Diplomacy (CPD) was established in 2003 as a partnership between the Annenberg School for Communication and Journalism and the School of International Relations at the University of Southern California. It is a research, analysis and professional education organization dedicated to furthering the study and practice of global public engagement and cultural relations.\n\n\n\n\n\n\nuscpublicdiplomacy.org\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCenter on Science, Technology and the Public Life\nThe USC Dornsife Center on Science, Technology and Public Life (STPL) generates a unique conversation among humanists, social scientists, and natural scientists about the social and political implications of new developments in science and technology. Through public programming, research, and training, STPL fosters sustained reflection on the possibilities and limits of technological innovation.\n\n\n\n\n\n\ndornsife.usc.edu/stpl\n\nCenters and InstitutesArts and Humanities, Engineering and Technology \n\nChange Making Media Lab\nThe mission of The Change Making Media Lab (CMML) is to foster positive social and environmental change by producing strategic high-impact cinema, television, multi-media visual imagery to inspire individuals, organizations, and communities into action. CMML also promotes research on effective media techniques and helping engaged community members leverage the power of the cinematic arts to achieve health, sustainability, and social justice.  \n\n\n\n\n\n\ncmml-usc.org\n\nCenters and InstitutesCommunication and Information Sciences, Sustainability \n\nCharlotta Bass Journalism and Justice Lab\nBlack activists from Washington, Oregon and California have used media to craft human rights campaigns that often set the agenda for the rest of the nation, for nearly 175 years. From the days of the Gold Rush — through today’s Black Lives Matter movement — Black social justice journalism has galvanized change. Still, there has been no central clearinghouse to learn about these contributions. The Charlotta Bass Journalism & Justice Lab addresses this educational gap, by saving, studying and sharing Black media from the West Coast. We aggregate primary source documents, oral histories and citizen journalism from the mid-1800s until today. We provide a place to study Black media, so future scholars can appraise its power. Additionally, we host lively events for the public — and link media organizations to Annenberg students who aspire to tell powerful Black stories.\n\n\n\n\n\n\nwww.thecharlottabasslab.com\n\nCenters and InstitutesArts and Humanities, Social and Behavioral Sciences \n\nChildren’s Data Network\nThe Children’s Data Network is a data and research collaborative focused on the linkage and analysis of administrative records. In partnership with public agencies, philanthropic funders, and community stakeholders, we seek to generate knowledge and advance evidence-rich policies that will improve the health, safety, and well-being of our children.\n\n\n\n\n\n\nwww.datanetwork.org\n\nCenters and InstitutesMedicine and Health \n\nCivic Paths\nCivic Paths explores continuities between online participatory culture and civic engagement through outreach, creative work, research, and academic inquiry. With low entry barriers, participatory culture-based communities often encourage online participation and expression even as they promote expression, awareness, mentorship, and skill training. Premised on a dynamic understanding of citizenship, we analyze how participatory culture interactions encourage young people to create, discuss and organize to engage with specific civic issues and events.\n\n\n\n\n\n\ncivicpaths.uscannenberg.org\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nConvergent Science Institute in Cancer\nUSC Michelson Center CSI-Cancer is aimed at integrating patient, model system, and high-content single cell data to translate clinically observed correlations into a mechanistic understanding of the physical and biological underpinnings of cancer dynamics. The organizing framework of the physical dynamics of cancer at the lab will focus on the spatial distributions and temporal evolution of the disease at the cellular, human, and population scale.\n\n\n\n\n\n\nkuhn.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCore Center of Excellence in Nano Imaging\nThe mission of the Core Center of Excellence in Nano Imaging (CNI) is to promote and advance the science and application of research tools for imaging, visualization, and analysis of nano- through meso-scale features and structures, both man-made and natural, including biological structures.\n\n\n\n\n\n\ncni.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nCOVID-19 Pandemic Research Center\nThe COVID-19 Pandemic Research Center, based in the Keck School of Medicine’s Department of Preventive Medicine, aims to understand and mitigate the impact of COVID-19 on community health locally and globally, with a focus on health inequities related to age, gender, occupation, race and socioeconomic status. The center has more than 60 members with expertise in a range of disciplines from epidemiology, laboratory and data sciences to survey research and health behavior.\n\n\n\n\n\n\ncprc.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nCreative Media & Behavioral Health Center\nThe vision of CM&BHC builds on USC's existing academic strengths and unique reputation within the creative and technology industries to serve as an incubator for innovation in the use of entertainment applications at the intersection of behavioral science, medicine, and public health. It is the mission of CM&BHC to increase public awareness of critical issues in mental health and behavioral science and to provide hands-on creativity-based educational opportunities for health researchers and practitioners. To achieve this mission, CM&BHC pursues and develops innovative clinical, research, and commercial applications with multidisciplinary teams of faculty, students, staff, and partner organizations from academia, industry, government, and healthcare. CM&BHC relies on sponsorship from individual, foundation, federal and international organizations to support infrastructure, research, and production.\n\n\n\n\n\n\ncmbhc.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nCritical Media Project\nCritical Media Project (CMP) is a free media literacy web resource for educators and students (ages 8-21) that enhances young people’s critical thinking and empathy, and builds on their capacities to advocate for change around questions of identity. CMP has a two-fold mission: to raise critical awareness and provide the tools to decode media representations of race, ethnicity, gender, sexuality, socio-economic class, religion, age, and disability, and develop an understanding as to how these identities intersect; to encourage and offer guidance for students to tell their own stories, create their own representations, and uphold their status as active and engaged participants in civic society.\n\n\n\n\n\n\ncriticalmediaproject.org/mission-statement\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nDepartment of Animal Resources\nThe Department of Animal Resources (DAR) is the university-wide department that provides animal procurement, daily animal care, animal health care, and scientific support for USC programs using animals in research and teaching. The Executive Director of DAR serves as the Attending Veterinarian for USC and reports directly to the Vice President of Research, who serves as the Institutional Official (IO) for animal subjects.\n\n\n\n\n\n\ndar.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nDiabetes & Obesity Research Institute\nThe Diabetes & Obesity Research Institute (DORI) is a multi-disciplinary collaborative of investigators at the University of Southern California seeking to link basic, clinical, and public health research to advance the understanding of obesity and its relationship to diabetes.\n\n\n\n\n\n\nusc-dori.org\n\nCenters and InstitutesMedicine and Health \n\nDoE Computational Synthesis of Materials Software\nMAGICS center develops computational materials science software. Materials simulations using our software are validated using ultrafast x-ray-laser and ultrafast electron diffraction experiments at Stanford. Simulation and experimental data from the MAGICS center are also distributed through the Materials Project at Berkeley Lab.\n\n\n\n\n\n\nmagics.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nDoT National Center for Metropolitan Transportation Research (METRANS)\nMETRANS is located in Southern California, which is home to nearly 2/3 of the state's population and the most congested metropolitan area in the US. The region is a center for international trade: the Los Angeles/ Long Beach port complex is the largest container port in the US (trade in 2011 was $382 billion); and LAX is the 7th largest air freight center in the US. As a center of both international trade and immigration, the Los Angeles region is home to both extreme wealth and extreme poverty, and has one of the largest transit-dependent populations in the country. METRANS is committed to addressing the transportation challenges of regions such as Los Angeles.\n\n\n\n\n\n\nwww.metrans.org\n\nCenters and InstitutesSustainability \n\nEarly Modern Studies Institute\nThe USC-Huntington Early Modern Studies Institute (EMSI) supports advanced research and scholarship on human societies between 1450 and 1850. The Institute’s range is global. Unlike existing centers that focus on particular regions, the Institute aims to advance knowledge of the diverse societies in and around the Atlantic and Pacific basins.\n\n\n\n\n\n\ndornsife.usc.edu/emsi\n\nCenters and InstitutesArts and Humanities \n\nEast Asian Studies Center\nIn 1975, the USC Dornsife College of Letters, Arts and Sciences established the East Asian Studies Center (EASC) in order to provide dedicated leadership, coordination and support for the growing interdisciplinary education, research activity, and community outreach concerning East Asia. In addition to being an academic department, EASC has been recognized as one of the nation’s leading centers for the development of East Asian area studies with over 110 USC faculty in 39 departments and schools affiliated with EASC today.\n\n\n\n\n\n\ndornsife.usc.edu/eascenter\n\nCenters and InstitutesArts and Humanities \n\nEdward R. Roybal Institute\nThe USC Edward R. Roybal Institute on Aging embraces a holistic, interdisciplinary approach to research that furthers the understanding of the aging process. The scientific work of the USC Roybal Institute’s faculty is widely cited in the field and the media, and this research supports the development of timely community interventions that improve the lives of vulnerable aging adults and their families. The USC Roybal Institute advances research, policy, and practice to improve the lives of older adults and their families from diverse communities locally, regionally and globally.\n\n\n\n\n\n\nroybal.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nEllison Institute for Transformative Medicine\nThe Lawrence J. Ellison Institute for Transformative Medicine of USC draws collaborators from across conventional health and wellness fields, as well as from a broad range of other disciplines such as physics, biology, math and engineering to study cancer and potential ways to prevent, detect and treat the disease. The Institute complements and integrates cancer research being conducted by faculty physicians and scientists across the world.\n\n\n\n\n\n\neitm.org\n\nCenters and InstitutesMedicine and Health \n\nEmergent Cities Research Group\nThe USC Emergent Cities Research Group has been exploring what research into evolving cities and urbanism could look like with the input and expertise of faculty from the Roski School of Art & Design, the School of Cinematic Arts, and the School of Architecture the Price School of Public Policy, the Annenberg School for Communication and Journalism, and Dornsife College.\n\n\n\n\n\n\nemergentcities.usc.edu\n\nCenters and InstitutesArts and Humanities \n\nEnergy Institute\nThe USC Energy Institute (USCEI) was launched in 2008 to create a university-based framework to support and expand opportunities in energy-related research, education, and public policy development.\n\n\n\n\n\n\nenergyinstitute.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nEntertainment Technology Center\nThe Entertainment Technology Center at the University of Southern California (ETC@USC) is a think tank and research center that brings together senior executives, innovators, thought leaders, and catalysts from the media, entertainment, consumer electronics, technology, and services industries along with the academic resources of the University of Southern California to explore and to act upon topics and issues related to the creation, distribution, and consumption of entertainment content.\n\n\n\n\n\n\netcenter.org\n\nCenters and InstitutesCommunication and Information Sciences \n\nEquity Research Institute\nThe USC Dornsife Equity Research Institute (ERI) produces data-driven analysis and rigorous research, leads convenings, engages strategic collaborations, and models effective, sustainable, racially-just research center. ERI provides data and analysis to power social change. ERI believes that long-term change is made when historically marginalized communities are empowered, can put forth proposals, and hold decision-makers accountable. And, when communities come together across race, space, and place, movements for change build and have an impact on greater scales of governance. \n\n\n\n\n\n\ndornsife.usc.edu/eri\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nFall Prevention Center of Excellence\nThe Fall Prevention Center of Excellence (FPCE), based at the University of Southern California Leonard Davis School of Gerontology, is dedicated to promoting aging in place and independent living for persons of all ages and abilities. It offers research, training, and technical assistance opportunities for professionals who wish to respond to the increasing demand for home modification services and address fall prevention in the home environment. FPCE also serves as an information clearinghouse on home modification to equip professionals and consumers with a comprehensive inventory of resources such as a National Directory of Home Modification and Repair Resources.\n\n\n\n\n\n\nhomemods.org\n\nCenters and InstitutesLife Sciences \n\nFamily Caregiver Support Center\nSince 1989, the USC Family Caregiver Support Center (FCSC) at USC Leonard Davis School of Gerontology (home of the LA Caregiver Resource Center) has placed a high priority on providing support across the continuum of caregiving, including diagnosis, prognosis, services that help maintain the care recipient’s independence and abilities, helping caregivers care for themselves, and manage their own well-being. Supportive services include information, assessment, individual consultations, respite, education, and training.\n\n\n\n\n\n\nfcsc.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nFoundation for Cross-Connection Control and Hydraulic Research\nOver the years, the FCCCHR has developed a set of standards for backflow prevention assemblies and a number of products and services designed to help water utilities, health agencies, plumbing inspectors, private contractors, engineers and the general public in their cross-connection control efforts. In the following pages you will find information on the various products, services and training courses offered by the Foundation.\n\n\n\n\n\n\nfccchr.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nFree Radical Institute\nThe Free Radical Institute aims to tackle the “big questions” in free radical biology & medicine (FRBM) including such major translational issues as the role(s) of free radicals in: cancer, neurodegeneration, heart disease, stroke, liver disease, rheumatoid arthritis, aging, muscle degeneration, drug design and discovery. nutrition, public health. We seek to build teams of: physician scientists, biochemists/molecular biologists, engineers, gerontologists, pharmacists, dentists, nutritionists, public health experts.\n\n\n\n\n\n\ngero.usc.edu/usc-free-radical-institute\n\nCenters and InstitutesMedicine and Health \n\nGame Innovation Lab\nThe Game Innovation Lab is the premier center for experimental game design research at USC. Founded in 2004, the lab is directed by Professor Tracy Fullerton, and the international success of games that have emerged from the lab, including Cloud, flOw, Darfur is Dying, The Cat and the Coup and The Night Journey, have made it a hub for indie and experimental games culture in Los Angeles. The mission of the lab is to pursue experimental design of games in cultural realms including art, science, politics and learning.\n\n\n\n\n\n\ngameinnovationlab.com\n\nCenters and InstitutesArts and Humanities, Communication and Information Sciences \n\nGehr Family Center For Health Systems Science And Innovation\nThe USC Gehr Family Center for Health Systems Science aims to accelerate the adoption of high-value and equitable health care for the Los Angeles community and nationwide, through science, advocacy and education. The center’s mission is to help collaborating health systems deliver better, more efficient care and to learn about the science of health care delivery in the process.\n\n\n\n\n\n\ngehrcenter.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nGill Foundation Composites Center\nEstablished in 1995 and endowed with a generous gift from M.C. Gill in 2002, the mission of the Center is to address problems associated with the manufacture and behavior of composites and composite structures. The scope includes the training of graduate and undergraduate students from chemical, mechanical and materials engineering through sponsored research projects. Personnel within the Center provide a range of expertise that includes postdoctoral associates and research professors with specialized skills in mechanics, polymer science, and manufacturing technology. Center personnel work closely with industrial sponsors.\n\n\n\n\n\n\ncomposites.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nGlobal Branding Center\nThe Global Branding Center at the University of Southern California's Marshall School of Business assists practitioners with managing global brands in the B2C and B2B markets. The GBC provides managers with thought leadership in how to build, strengthen and leverage brand admiration. The GBC offers practitioners its innovative management framework called the brand admiration management system. It describes the entire process of building, strengthening and leveraging brand admiration with the outcome of sustainable and efficient profit and growth. \n\n\n\n\n\n\nmarshall.usc.edu/global-branding-center\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nGlobal Supply Chain Institute\nCapitalizing upon its global network, industry experience and renowned faculty, USC Marshall is poised to become one of the top thought leaders in the realm of global supply chain management. As an industry leader in cultivating top business talent, the Randall R. Kendrick Global Supply Chain Institute will lead the effort to streamline efficiency and supply chain in our increasingly global economy. The state of the art resource institute works with country-specific supply chain gateways to keep their member community updated with news, trends and critical changes in the industry.\n\n\n\n\n\n\nmarshall.usc.edu/randall-r-kendrick-global-supply-chain-institute\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nHastings Center For Pulmonary Research\nThe USC Hastings Center for Pulmonary Research (HCPR) is making strides to combat lung disease through scientific investigations into the biology of lung injury, repair and regeneration. As part of its mission, HCPR seeks to expand and enhance pulmonary research through the creation of interdisciplinary research programs, enhanced training and career development, and targeted faculty recruitments.\n\n\n\n\n\n\nhastingscenter.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nHealth Equity and Media Lab\nLed by Dr. Robin Stevens, Health Equity and Media Collab (formerly HEMLab) started its journey at the University of Pennsylvania School of Nursing. We are now an interdisciplinary team housed in the University of Southern California Annenberg School for Communication and Journalism.\n\n\nWe tap into the vast wealth of data that social media provide to glean insights into lived experiences and health behaviors. The lessons we learn from users' posts, shares, and networks are reflected in the interventions we design and implement.\n\n\n\n\n\n\nhealthequitymedia.org\n\nCenters and InstitutesMedicine and Health \n\nHealthcare and Medical Engineering Center\nThe overarching vision of the HealME Center is the innovation of new technologies and engineering solutions for critical healthcare problems. Whereas the centuries old paradigm in medicine involves a reliance on pharmaceutical or surgical interventions, new advances will be driven by the convergence of engineering and medicine, particularly in the development of medical devices and information processing/data analytics.\n\n\n\n\n\n\nsites.usc.edu/healme\n\nCenters and InstitutesEngineering and Technology \n\nHomelessness Policy Research Institute\nEstablished with support from the Conrad N. Hilton Foundation and the Home For Good Funders Collaborative, the Homelessness Policy Research Institute (HPRI) is a collaborative of over one hundred researchers, policymakers, service providers, and experts with lived experience of homelessness that accelerate equitable and culturally informed solutions to homelessness in Los Angeles County by advancing knowledge and fostering transformational partnerships between research, policy and practice.\n\n\n\n\n\n\nsocialinnovation.usc.edu/homelessness-policy-research-institute\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nHuntington-USC Institute on California and the West\nThe Huntington-USC Institute on California and the West (ICW) is a center for scholarly investigation of the history and culture of California and the American West. Through sponsorship of innovative scholarship and research, ICW draws on the resources of the University of Southern California and The Huntington Library to build an innovative and unique collaboration between a research university and a research library.\n\n\n\n\n\n\ndornsife.usc.edu/icw\n\nCenters and InstitutesArts and Humanities \n\nImaging Genetics Center\nThe Imaging Genetics Center (IGC) uses advanced “big data” methods to study over 20 major diseases of the brain — from Alzheimer’s disease and Parkinson’s disease to disorders of brain development, psychiatric illnesses, and neurogenetic disorders. They co-founded a worldwide consortium of over 900 scientists from 40 countries to study the brain, called the ENIGMA Consortium; they have published the largest neuroimaging studies of 10 major brain disorders, including schizophrenia, bipolar disorder, major depressive disorder, PTSD, and substance use disorders, revealing characteristic profiles of brain abnormalities in each disorder, and investigating factors that affect them.\n\n\n\n\n\n\nigc.ini.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nIMAX Immersive Media Lab\nThe objective of this lab is to carry out research in the area of immersive media, a new and emerging field of studies that considers the profound effects of the expansion and intensification of media formats and presentation.\n\n\n\n\n\n\ncinema.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nImmersive Media Lab\nThe Immersive Media Lab is a mixed-reality incubator enabling students from all divisions of School of Cinematic Arts to create interactive and cinematic mixed-reality content with mentorship from industry leaders.\n\n\n\n\n\n\ncinema.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nInformation Sciences Institute\nISI is a world leader in research and development of advanced information processing, computer and communications technologies. Our work ranges from theoretical basic research, such as core engineering and computer science discovery, to applied research and development, such as design and modeling of innovative prototypes and devices.\n\n\n\n\n\n\nisi.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nInitiative and Referendum Institute\nThe Initiative and Referendum Institute at the University of Southern California is a non-partisan educational organization dedicated to the study of the initiative and referendum, the two most important processes of direct democracy. The Initiative and Referendum Institute collects and distributes information on the initiative and referendum process. And sponsors studies of various aspects of direct democracy, including its effect on public policy, citizen participation, and its reflection of trends in American thought and culture.  The Institute produces a state-by-state guide to the initiative and referendum process, and works to educate and update the public on how the process is being utilized across the country, particularly at the state level. \n\n\n\n\n\n\niandrinstitute.org\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nInitiative on Digital Competition\nThe continued and rapid growth of E-commerce has generated questions about the consequences for society, business, and the global economy. The USC Marshall Initiative on Digital Competition, starting in January 2021, aims to discover insights on these questions through a collaboration of industry practitioners and academics from business disciplines as well as non-business disciplines (e.g. computer science, economics, law, communications); and disseminate these insights to a broad set of audiences that includes academics, business leaders, and the public.\n\n\n\n\n\n\nmarshall.usc.edu/institutes-and-centers/initiative-on-digital-competition\n\nCenters and InstitutesEngineering and Technology \n\nInstitute for Advanced Catholic Studies\nThe Institute for Advanced Catholic Studies at USC is a global hub for scholarship that fosters Catholic thought, imagination and experience. The IACS vision is to ensure that the rich and evolving tradition of Catholic thinking will thrive among future generations through the research and teaching of scholars and intellectuals. The IACS mission is to strengthen Catholic thought and imagination and their ability to contribute to the important questions of the day.\n\n\n\n\n\n\ndornsife.usc.edu/iacs\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nInstitute for Biomedical Therapeutics\nWorking at the interface of medicine and engineering, USC Ginsburg IBT’s vision is to transform bioengineered neural interfaces into treatments for patients for whom there is currently no foreseeable cure. Using an interdisciplinary approach, our mission is to further our basic understanding of debilitating neurosensory disorders, ultimately leading to the development of novel diagnostic and treatment options.\n\n\n\n\n\n\nibt.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nInstitute for British and Irish Studies\nThe Institute for British and Irish Studies is a resource for faculty, graduate students, and undergraduates from across the USC campus.  It is part of a growing community of area resources in British and Irish Studies. IBIS sponsors IBIS links, the web’s premier clearinghouse for electronic resources in British and Irish Studies. \n\n\n\n\n\n\ndornsife.usc.edu/ibis\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nInstitute for Creative Technologies\nAt the University of Southern California Institute for Creative Technologies (ICT), leaders in the artificial intelligence, graphics, virtual reality and narrative communities are working to advance immersive techniques and technologies to solve problems facing service members, students and society.\n\n\n\n\n\n\nict.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nInstitute for Diversity and Empowerment at Annenberg\nThe new Institute for Diversity and Empowerment at Annenberg (IDEA) furthers the USC Annenberg legacy of diversity and empowerment studies by framing an impressive cohort of acclaimed scholars, leading research, compelling courses, and impactful programs that allow students to examine the vast complexities of diversity, identity, and culture – across both the School of Communication and the School of Journalism.\n\n\n\n\n\n\nannenberg.usc.edu/research/idea\n\nCenters and InstitutesCommunication and Information Sciences \n\nInstitute for Health Promotion & Disease Prevention Research\nEstablished in 1980, the University of Southern California Institute for Health Promotion & Disease Prevention Research (IPR) is dedicated to the advancement of interdisciplinary research and education to improve the health and well-being of society. Overall, the USC-IPR is a thriving, dynamic institute that has made significant strides toward promoting health and preventing disease in the population, and expects to continue advancing the field in future years.\n\n\n\n\n\n\nipr.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nInstitute for Multimedia Literacy\nFounded in 1998 by the University of Southern California’s Dean of the School of Cinematic Arts Elizabeth Daley in conversation with filmmaker George Lucas, the Institute for Multimedia Literacy is dedicated to developing educational programs and conducting research on the changing nature of literacy in a networked culture.\n\n\n\n\n\n\nmap.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nInstitute for Theatre & Social Change\nThe Institute for Theatre & Social Change (ITSC) at the USC School of Dramatic Arts provides a research and development forum for expressive and interactive dramatic art practices, relative to education, therapy, and social justice, that disrupt oppression and engages communities in meaningful dialogue for social change. The interdisciplinary collaboration of dramatic arts, fine arts, and media offers a powerful creative weapon for artists, academics, healers, activists, and community organizers to ignite critical cultural dialogue.\n\n\n\n\n\n\nitsc.usc.edu\n\nCenters and InstitutesArts and Humanities \n\nInstitute of Armenian Studies\nThe USC Institute of Armenian Studies advances research and collaboration that examines the social, cultural, educational, and political challenges facing Armenia, Karabakh, and the Armenian communities in the Diaspora. To study and re-define the complex issues that make up the diverse contemporary Armenian experience, the Institute conducts research, advances public service, and generates networks among global Armenian communities.\n\n\n\n\n\n\narmenian.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nInstitute of Sports, Media, and Society \nHoused in the USC Annenberg School for Communication and Journalism, the Annenberg Institute of Sports, Media, and Society (AISMS) promotes academic programs, international research initiatives and professional engagement in the competitive world of sports and media.\n\n\n\n\n\n\naisms.uscannenberg.org\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nInstitute of Translational Genomics\nThe institute strives to make healthcare smarter, based on a vision that future advances in personalized medicine will build from, benefit, and ultimately serve an incredibly diverse set of individuals. We believe that advancing precision medicine to affect a diverse set of populations requires diversity in leadership. Our members and scientists span diverse backgrounds and experience, and collectively we are committed to integrating these together to improve lives by combining the best genome science with the best clinical care. Members come from both within the Department of Translational Genomics, as well as other departments and affiliates.\n\n\n\n\n\n\nitg.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nInstitute on Inequalities in Global Health\nAt the USC Institute on Inequalities in Global Health (USC IIGH), leaders work across disciplines to address the disparities, inequalities and broad determinants of health that impact our world. University-wide and driven by excellence in research, education and action, the institute aims to address those issues that are too complex to have a natural home with any single researcher, department or school.\n\n\n\n\n\n\nglobalhealth.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nIntegrated Media Systems Center\nThe Integrated Media Systems Center (IMSC) blends the unique resources available across the University of Southern California and Los Angeles to create a world-class, multidisciplinary hub for exploration and discovery. We engage a diverse faculty with expertise in fundamental research areas critical to every aspect of data science and are closely connected to the domain experts applying these tools through our affiliated schools and organizations.\n\n\n\n\n\n\nimsc.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nInternational Center for Regulatory Science\nThe D.K. Kim International Center for Regulatory Science is an educational and research institution that provides cross training for individuals with a scientific background to become adept in business and knowledgeable in regulatory science to meet the growing need for professionals with the knowledge and expertise to navigate the complex international regulatory landscape.\n\n\n\n\n\n\nregulatory.usc.edu/international-center\n\nCenters and InstitutesMedicine and Health \n\nInternational Museum Institute \nThe USC Dana and David Dornsife College of Letter, Arts & Sciences International Museum Institute (IMI) is dedicated to the study of museums and their changing roles in society. IMI fulfills its mission by bringing together scholars, students and museum professionals from around the globe to address the most pressing museological matters of the day. USC partners with UNAM (MUAC) on IMI activities.\n\n\n\n\n\n\nfisher.usc.edu/imi\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nIRIS Computer Vision Lab\nIRIS computer vision lab is a unit of USC’s School of Engineering. It was founded in 1986 and has been a major center of government- and industry-sponsored research in computer vision and machine learning.\n\n\n\n\n\n\nsites.usc.edu/iris-cvlab\n\nCenters and InstitutesCommunication and Information Sciences \n\nJane Goodall Research Center\nThe University of Southern California’s Research Center was established in 1991, at the time of the appointment of Dr. Jane Goodall as Distinguished Emeritus Professor of Anthropology and Occupational Science.Since then, JGRC personnel have been engaged in a variety of activities connected to understanding the behavior of great apes and evolutionary approaches to explaining the human condition.  The core faculty of the center are appointed in either the Department of Anthropology, the Department of Biological Sciences, or both. The Center consists of two general research areas: archival and field research.\n\n\n\n\n\n\ndornsife.usc.edu/labs/janegoodall\n\nCenters and InstitutesLife Sciences, Social and Behavioral Sciences \n\nJohn C. Hench Division of Animation + Digital Arts\nResearch at the John C. Hench Division of Animation & Digital Arts incorporates practice in organic and digital media ranging from works of metaphysical expression and perceptual experience, to the exploration of dreams and narrative storytelling, visualizing science, and documentary animation.\n\n\n\n\n\n\nanimation.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nKidney Research Center\nThe USC/UKRO Kidney Research Center (KRC) was named in Sept. 2012 with a gift pledge of $3.5 million from the University Kidney Research Organization (UKRO), a Los Angeles based philanthropic group. Remodeling of the top two stories of the Mudd Memorial Research Building occurred in 2015 through support from the Keck School of Medicine, thereby creating the 5,000+ sq. ft of research and office space comprising the KRC, which opened in September, 2015. The onboarding of the new KRC Director, Kenneth R. Hallows, MD, PhD, who is an internationally recognized nephrology physician-scientist, brought the center into operation. Since then, we have assembled a growing team of dedicated researchers, physician scientists, and administrative staff.\n\n\n\n\n\n\nkeck.usc.edu/usc-ukro-kidney-research-center\n\nCenters and InstitutesMedicine and Health \n\nKorean Studies Institute\nThe vision of the USC Dornsife Korean Studies Institute (KSI) is to become the most influential academic institution educating the world about US-Korea and US-Asia relations. Established in 2005 with the goal of explaining Korea to the world through research and teaching, KSI has rapidly grown into a leading center for Korean Studies in the world. With over 50 graduate and undergraduate affiliates, five Korean Studies faculty, and dozens of Korea-related courses, KSI is an active center for scholarship and learning at USC and beyond.\n\n\n\n\n\n\ndornsife.usc.edu/ksi\n\nCenters and InstitutesArts and Humanities \n\nLevan Institute for the Humanities\nThe Levan Institute for the Humanities serves as a hub for the humanities and humanistic social sciences at the University of Southern California, connecting faculty, postdoctoral fellows, and students across disciplines, departments, programs and institutes.\n\n\n\n\n\n\ndornsife.usc.edu/levan-institute\n\nCenters and InstitutesArts and Humanities \n\nLloyd Greif Center for Entrepreneurial Studies\nThe Lloyd Greif Center for Entrepreneurial Studies is among the nation’s leaders in entrepreneurship education and research. Its faculty – a diverse mix of academics and entrepreneur practitioners – together offer undergraduate and graduate programs designed to help students acquire the tools, develop the skills, and cultivate the mindset central to organizing, launching, and managing successful new ventures.\n\n\n\n\n\n\nmarshall.usc.edu/lloyd-greif-center-entrepreneurial-studies\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nLoker Hydrocarbon Research Institute\nThe Loker Institute has pioneered new methods to study hydrocarbon chemistry processes and their mechanisms. Research is also aimed at more efficient utilization of fossil fuel resources including recycling of carbon dioxide (a greenhouse gas) to useful materials. Studies are also directed towards developing new synthetic methodologies for bond making and bond breaking processes. Polymeric materials derived from simple hydrocarbon precursors are the basis for new materials with exceptional electrical, optical, and magnetic properties.\n\n\n\n\n\n\ndornsife.usc.edu/loker-hydrocarbon-research-institute\n\nCenters and InstitutesPhysical Sciences, Sustainability \n\nLongevity Institute\nBecause of the unique tradition of aging research, the broad longevity-related research, and the quality of the faculty, departments and schools involved at USC, the Longevity Institute represents one of the leading institutes for translational research on aging and age-related diseases.\n\n\n\n\n\n\ngero.usc.edu/longevity-institute\n\nCenters and InstitutesLife Sciences \n\nLos Angeles Institute for the Humanities\nThe Los Angeles Institute for the Humanities was founded in 1998 to create an intellectual center for our city by bringing together academics and writers, musicians and dancers, curators and critics, journalists and poets. The Institute’s broad purpose is to stimulate a cross-disciplinary exchange of ideas.\n\n\n\n\n\n\ndornsife.usc.edu/laih\n\nCenters and InstitutesArts and Humanities \n\nLusk Center for Real Estate\nThe USC Lusk Center for Real Estate seeks to advance real estate knowledge, inform business practice, and address timely issues that affect the real estate industry, the urban economy, and public policy. The Lusk Center produces relevant real estate research, supports educational programs, and convenes professional forums that bring together academics, students, business executives, and community leaders.\n\n\n\n\n\n\nlusk.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nM.C. Gill Composites Center\nThe mission of the Center is to address problems associated with the manufacture and behavior of composites and composite structures. The scope includes the training of graduate and undergraduate students from chemical, mechanical and materials engineering through sponsored research projects. Personnel within the Center provide a range of expertise that includes postdoctoral associates and research professors with specialized skills in mechanics, polymer science, and manufacturing technology.\n\n\n\n\n\n\ncomposites.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nMachine and Process Intelligence Center\nThe Machine and Process Intelligence (MPI) Center focuses on fundamental development of the next generation intelligent manufacturing and processing technologies at the levels of machine intelligence, process intelligence, systems intelligence, and decision-making intelligence. Material processing and manufacturing industries are entering a new era of revolutionary technologies such as Internet of Things (IoT), big data analytics, machine learning, cloud computing, and cyber-physical systems (CPS). The mission of this center is to merge machine learning, data science, and physical process knowledge for intelligent operations, control, and diagnostics technologies. \n\n\n\n\n\n\nviterbischool.usc.edu/viterbi-internal-center-incubator\n\nCenters and InstitutesCommunication and Information Sciences \n\nMachine Learning Center\nThe USC Machine Learning Center, MaSCle for short, is a research lab dedicated to solving some of the world’s most significant problems via machine learning. MaSCle utilizes an interdisciplinary approach, with faculty from several schools across USC including the Viterbi School of Engineering, the Marshall School of Business, and the Dana and David Dornsife School of Letters, Arts, and Sciences.\n\n\n\n\n\n\nmascle.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nMark and Mary Stevens Neuroimaging and Informatics Institute\nThe USC Mark and Mary Stevens Neuroimaging and Informatics Institute (INI) applies innovative imaging and information technologies to the study of the brain. Their interdisciplinary team investigates brain structure, function and disease, using techniques such as mathematics, genomic analysis and ultra-high-field MRI scanning. INI's four centers, the Laboratory of Neuro Imaging (LONI), the Imaging Genetics Center (IGC), the Center for Image Acquisition (CIA), and the Center for Integrative Connectomics (CIC), address discovery needs across the spectrum of neuroscience.\n\n\n\n\n\n\nini.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nMaterials Genome Innovation for Computational Software Center\nMAGICS center develops computational materials science software. Materials simulations using our software are validated using ultrafast x-ray-laser and ultrafast electron diffraction experiments at Stanford. Simulation and experimental data from the MAGICS center are also distributed through the Materials Project at Berkeley Lab.\n\n\n\n\n\n\nmagics.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nMaternal And Developmental Risks from Environmental and Social Stressors Center for Environmental Health Disparities\nThe MADRES Center for Environmental Health Disparities was established in 2015 to investigate the cumulative effects of chemical pollutants and psychosocial, behavioral, and built environment risk factors, during and after pregnancy, on maternal and infant health outcomes. The MADRES Center facilitates research efforts to identify opportunities for policy, clinical, and programmatic interventions to increase environmental and health equity for Los Angeles communities disproportionately impacted by obesity and environmental chemical pollutants.\n\n\n\n\n\n\nmadres.usc.edu\n\nCenters and InstitutesMedicine and Health, Sustainability \n\nMax Kade Institute for Austrian-German-Swiss Studies\nThe USC Max Kade Institute is a research center devoted to German and European studies.  Located several blocks north of the USC campus, the institute hosts lectures, conferences, and performances for students, faculty and the general public. The Institute programs cover German and European studies broadly defined, but its main areas of emphasis include: exile studies, Cold War studies; German history, film, and aesthetics; and contemporary German and European affairs.\n\n\n\n\n\n\ndornsife.usc.edu/max-kade\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nMedia, Economics & Entrepreneurship (M{2e})\nMedia, Economics & Entrepreneurship—M{2e}—is an interdisciplinary program  and undergraduate minor that studies the economic forces reshaping the communications landscape. We combine your media skills with business skills to help you launch your own career in the industry. We work with leading companies in the field to provide hands-on opportunities to students who want to lead the next wave of change in media.\n\n\n\n\n\n\nannenberg.usc.edu/research/m2e\n\nCenters and InstitutesEngineering and Technology \n\nMESH Academy\nThe MESH Academy is a dedicated team at the Keck School of Medicine of USC, formed to create a connective tissue across disciplines to empower convergence, and accelerate the pace of groundbreaking discoveries and their translation into revolutionary therapies. MESH collaborates with USC faculty to find collaborators, create new conceptual and translational innovations, build transdisciplinary teams, and connect with industry.\n\n\n\n\n\n\nkeck.usc.edu/mesh-academy\n\nCenters and InstitutesMedicine and Health \n\nMetamorphosis\nOur mission is to understand the transformation of urban community under the forces of globalization, new communication technologies, and population diversity so that our research can inform practitioner and policy maker decisions. Our site of study is Los Angeles and its many ethnic communities of both new and settled immigrants.\n\n\n\n\n\n\nwww.metamorph.org\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nMETRANS Transportation Consortium\nAs a center of both international trade and immigration, the Los Angeles region is home to both extreme wealth and extreme poverty, and has one of the largest transit-dependent populations in the country. METRANS is committed to addressing the transportation challenges of regions such as Los Angeles. METRANS includes the Pacific Southwest Region University Transportation Center, METRANS Tier 1 University Transportation Center, MetroFreight, National Center for Sustainable Transportation, Southwest Transportation Workforce Center, and Center for Sustainable Cities.\n\n\n\n\n\n\nmetrans.org\n\nCenters and InstitutesSocial and Behavioral Sciences, Sustainability \n\nMind and Society Center\nThe USC Dornsife Mind & Society Center research addresses the interface of individual and society by investigating how people think about societal issues and how societal context shapes individuals' thoughts and actions. Understanding this interface requires insight into the context sensitivity of basic cognitive and affective processes, which the Mind and Society Center studies in laboratory experiments and social surveys, and their real-world implications, which we study through field experiments and controlled interventions. \n\n\n\n\n\n\ndornsife.usc.edu/mindandsociety\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nMing Hsieh Institute\nThe centerpiece of the Ming Hsieh Institute at USC is the integration of engineering, scientific and medical research that together generates novel thinking, speeds discovery and creates new pathways by which research can be translated into real improvements in human health. While the institute’s initial emphasis is on developing new treatments and cures for cancer, it ultimately seeks to fuel new approaches to any human health challenge.\n\n\n\n\n\n\nmhicancer.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nMixed Reality Lab\nThe Mixed Reality Lab (MxR) was established at the University of California Institute for Creative Technologies in 2008, with the goal of exploring emerging human-machine interactions and coming up with innovative hardware, platform, and system solutions along the way. The resulting research in virtual reality (VR) and augmented reality (AR) pushed immersive technology out of the lab and introduced it to the public, directly impacting the development of high-end VR headsets like the Oculus Rift and inspiring the creation of low-cost VR headsets like Google Cardboard. MxR has since broadened its scope to include immersive content design, adaptive optimization techniques for virtual assets, intelligent system integration into virtual experiences, complex data visualization, and next generation interface development. From training and operations, to education and entertainment, MxR continues to create impact through rapid prototyping and thoughtful approaches to human centered design.\n\n\n\n\n\n\nthemxrlab.com\n\nCenters and InstitutesCommunication and Information Sciences \n\nMobile and Environmental Media Lab\nHoused within USC’s School of Cinematic Arts, the Mobile and Environmental Media Lab’s design methodology straddles the cultures of visual storytelling, games, and interaction design. Accordingly, their work mashes together conceptual tools of storytelling (dramatic arc, character motivation, conflict, obstacles, and resolution) with the core concerns of game design (systems, procedures, constraints, objectives, resources, core mechanics). Their research has explored context- and location-specific mobile storytelling, interactive architecture, vehicular and environmental lifelogging, and automotive experience design.\n\n\n\n\n\n\nmobilemedia.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nNeely Center for Ethical Leadership and Decision Making\nThe Center’s mission is to advance the practice of ethical business leadership though research, educational programs, curriculum development, seminars, and community outreach. The Neely Center seeks to inspire a new generation of leaders dedicated to informed and morally courageous decision making that is in the best interest of both the organization and society. The Center has been established as an institution of learning and discovery and purpose of which is to educate and prepare values-guided, principles-driven men and women to serve the highest-order needs of the individuals, organizations, and communities they lead.\n\n\n\n\n\n\nmarshall.usc.edu/neely-center-ethical-leadership-and-decision-making\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nNeurorestoration Center\nThe USC Neurorestoration Center creates new strategies for the restoration of an injured or diseased nervous system by developing new technologies that harness advances in basic neuroscience and neural engineering. These strategies are driven by patient needs and further refined within our world-class clinical programs. \n\n\n\n\n\n\nkeck.usc.edu/neurorestoration-center\n\nCenters and InstitutesMedicine and Health \n\nNey Center for Healthspan Science\nThe Ney Center for Healthspan science is designed to be a hub of multidisciplinary exploration into the biological, demographic and psychosocial aspects of aging. It leverages the school’s uniquely wide-ranging expertise in investigating the science of aging and implementing innovations to help people live with purpose, safety and security.\n\n\n\n\n\n\ngero.usc.edu/major-programs-initiatives/institutes-centers/ney-center-for-healthspan-science\n\nCenters and InstitutesMedicine and Health, Social and Behavioral Sciences \n\nNIH Biomedical Simulations Resource\nEstablished in 1985, the Biomedical Simulations Resource (BMSR) at the University of Southern California is dedicated to the advancement of the state-of-the-art in biomedical system modeling and simulation through Technological Research and Development (Core) projects, as well as the application and dissemination of this knowledge through Collaborative Research, Service, Training and Dissemination activities aimed at the biomedical community at large.\n\n\n\n\n\n\nbmsr.usc.edu\n\nCenters and InstitutesEngineering and Technology, Medicine and Health \n\nNIH FaceBase Coordinating Center\nFaceBase is a collaborative NIDCR-funded project that houses comprehensive data in support of advancing research into craniofacial development and malformation. It serves as a community resource by curating large datasets of a variety of types from the craniofacial research community and sharing them via this website. Practices emphasize a comprehensive and multidisciplinary approach to understanding the developmental processes that create the face. The data offered spotlights high-throughput genetic, molecular, biological, imaging and computational techniques. One of the missions of this project is to facilitate cooperation and collaboration between the central coordinating center (ie, the Hub) and the craniofacial research community.\n\n\n\n\n\n\nwww.facebase.org\n\nCenters and InstitutesLife Sciences, Medicine and Health \n\nNIH GenitoUrinary Development Molecular Anatomy Project Coordinating Center\nThe GenitoUrinary Development Molecular Anatomy Project (GUDMAP) provides data and tools that facilitate research on the GenitoUrinary (GU) tract for the scientific and medical community.\n\n\n\n\n\n\nwww.gudmap.org\n\nCenters and InstitutesEngineering and Technology, Medicine and Health \n\nNIH Pediatric Research Using Integrated Sensor Monitoring Systems\nThe Pediatric Research using Integrated Sensor Monitoring Systems (PRISMS) Program pursues dual goals: to develop a non-invasive health monitoring system for pediatric asthma research and to make the resulting environmental and health data available to epidemiologists.\n\n\n\n\n\n\nprisms-data.org.s3-website-us-west-2.amazonaws.com\n\nCenters and InstitutesEngineering and Technology, Medicine and Health \n\nNorman Lear Center \nThe Norman Lear Center is a nonpartisan research and public policy center that studies the social, political, economic and cultural impact of entertainment on the world. The Lear Center translates its findings into action through testimony, journalism, strategic research and innovative public outreach campaigns. Through scholarship and research; through its conferences, public events and publications; through its role in the formulation of the academic field of entertainment studies; and in its attempts to illuminate and repair the world, the Norman Lear Center works to be at the forefront of discussion and practice in the field.\n\n\n\n\n\n\nlearcenter.org\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nNorris Comprehensive Cancer Center\nThe USC Norris Comprehensive Cancer Center (NCCC) is an innovative leader in the cancer field, setting a global standard for cutting edge research that is accelerating programs to prevent, control, and cure cancer. They've created a highly inclusive and engaging culture of collaboration, an environment that fosters and supports revolutionary, interdisciplinary approaches to the treatment and prevention of cancer. They are a magnet for the best minds in integrated cancer research and education and deliver promising clinical trials to a diverse patient population and support for their families. They are a preferred destination for patients, clinicians, and scientists who seek advanced research, clinical trials, and exceptional compassionate care.\n\n\n\n\n\n\nuscnorriscancer.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nNorthrop Grumman Institute of Optical Nanomaterials and Nanophotonics\nThe Northrop Grumman Institute of Optical Nanomaterials and Nanophotonics (NG-ION2) is a thematic research collaboration between Northrop Grumman Basic Research group and the University of Southern California Viterbi School of Engineering.  It is focused on the development of the next generation optical materials and their application in photonic devices and architectures.  The institute architecture and environment facilitates interactions between Northrop Grumman technical staff and the participating USC researchers, thereby accelerating the research efforts at both institutions.\n\n\n\n\n\n\nngion.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nPacific Center for Health Policy and Ethics\nThe Pacific Center — created in 1991 jointly by the USC Law and the USC Keck School of Medicine — brings an interdisciplinary as well as inter-institutional perspective to the study of ethical problems and health policy development. Recognizing that important issues in health care and research require the broadest possible discussion, the Pacific Center brings together experts form a wide range of fields at USC with representatives from healthcare providers, consumer groups, government, insurers, and other ethics centers.\n\n\n\n\n\n\ngould.usc.edu/pacific-center\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nPacific Council on International Policy\nThe Pacific Council on International Policy inspires commitment to global engagement across Los Angeles and California. As a nonprofit, nonpartisan membership organization, the Pacific Council engages members through programs that connect local experience to global affairs, including renowned speaker events, conferences, international and national delegations, leadership development, and community volunteer efforts. \n\n\n\n\n\n\nannenberg.usc.edu/pacific-council-international-policy\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nPIPE Collaborative\nThe Political Institutions and Political Economy (PIPE) Collaborative is a university-wide research endeavor jointly sponsored by the Price School’s Bedrosian Center and the Office of the Provost. The PIPE Collaborative will include faculty and graduate students with common interests in various aspects of political institutions and political economy.\n\n\n\n\n\n\npriceschool.usc.edu/pipe\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nPolish Music Center\nThe Polish Music Center at the USC Thornton School of Music is the only institute of its kind outside of Poland. An exceptional resource for research in Polish music and culture, it houses a unique collection of manuscripts by leading Polish composers (Lutoslawski, Penderecki, Bacewicz and many others), in addition to over 10,000 library items, including scores, books, periodicals, and recordings of Polish music.\n\n\n\n\n\n\npolishmusic.usc.edu\n\nCenters and InstitutesArts and Humanities \n\nPopulation Dynamics Research Group\nThe Population Dynamics Research Group uncovers demographic trends that drive major changes in society, providing insights that lead to effective policies. These population patterns underlie areas as diverse as housing, immigration, education, health, labor, transportation, the environment, and urban growth. The Popdynamics team monitors the future using multiple data sources including the decennial U.S. Census, the American Community Survey, and our own carefully crafted Demographic Futures projections which incorporate layers of demographic analysis and include greater detail than the census provides.\n\n\n\n\n\n\npopdynamics.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nPratt & Whitney Institute for Collaborative Engineering\nPWICE was established a few years and is funded by Pratt & Whitney and Korean Air to promote collaborative research in aerospace technology. This research collaboration is between USC and Inha University in Korea.\n\n\n\n\n\n\nviterbischool.usc.edu/pratt-whitney-globalization\n\nCenters and InstitutesEngineering and Technology \n\nPullias Center for Higher Education\nPromoting Equity in Higher Education. The world’s leading research center on student access and success in higher education, the Pullias Center for Higher Education advances innovative, scalable solutions to improve college outcomes for underserved students and to enhance the performance of postsecondary institutions. Their work is devoted to the key issues of college access, retention, and accountability for underserved students — and the effectiveness of the colleges and universities that serve them. Both directly and through their research, they engage with institutional leaders, policymakers and the community at large to address the major challenges in educational equity today.\n\n\n\n\n\n\npullias.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nQuantum Computing Center\nA joint effort of Lockheed Martin Corporation and the University of Southern California, the Quantum Computing Center (QCC) is housed at USC’s Information Sciences Institute, one of the world’s leading computer science and engineering research entities. Faculty, researchers and students are performing basic and applied research into noisy, intermediate-scale quantum (NISQ) computing devices, and are collaborating with researchers around the world. QCC was the first organization outside of D-Wave to house and operate its own system, and it has conducted pioneering research on three different generations of these early NISQ processors.\n\n\n\n\n\n\nisi.edu/quantum_computing\n\nCenters and InstitutesEngineering and Technology \n\nRace and Equity Center\nThe mission of the Race and Equity Center is to illuminate, disrupt, and dismantle racism in all its forms through rigorous interdisciplinary research, high-quality professional learning experiences, the production and wide dissemination of useful tools, trustworthy consultations and strategy advising, and substantive partnerships. While race and ethnicity are at the epicenter of their work, they also value their intersectionality with other identities, and therefore aim to advance equity for all persons experiencing marginalization.\n\n\n\n\n\n\nrace.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nResearch Center for ALPD and Cirrhosis\nThe Southern California Research Center for Alcoholic Liver and Pancreatic Diseases (ALPD) and Cirrhosis unifies 69 investigators from major academic institutions in Southern California to pursue a common mission of being a leader in research, training, and outreach for the diseases. The center, since its inception in 1999, has devoted its efforts for development and use of clinically relevant animal models to gain novel insights into the molecular mechanisms underlying the predisposition to advanced ALPD.\n\n\n\n\n\n\nkeck.usc.edu/alpd-and-cirrhosis-research-center\n\nCenters and InstitutesMedicine and Health \n\nResearch Center for Liver Diseases\nThe USC Research Center for Liver Diseases (RCLD) is one of 17 Digestive Diseases Research Centers (DDRCC) in the United States, whose purpose is to achieve the key goal of facilitating and fostering interdisciplinary collaborative research, which leads to a better understanding of the pathobiology of diseases of the liver and digestive tract and the development of new treatments for these diseases through the use of Cores, Pilot/Feasibility (P/F) support and Enrichment Program.\n\n\n\n\n\n\nkeck.usc.edu/liver-diseases-research-center\n\nCenters and InstitutesMedicine and Health \n\nRobotics and Autonomous Systems Center\nRobotics and Autonomous Systems Center (RASC) is an interdisciplinary organized research unit in the USC Viterbi School of Engineering that focuses on the science and technology of effective, robust, human-centric, and scalable robotic systems, with broad and far-reaching applications. The Center facilitates interdisciplinary interactions and collaborations through its robotics faculty and its large team of interdisciplinary affiliates.\n\n\n\n\n\n\nrasc.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nRoski Eye Institute\nThe USC Roski Eye Institute has more than 30 faculty covering all subspecialties of ophthalmology. Over the past four decades, USC Roski Eye Institute faculty members have received international acclaim for their contributions to vision research, including the development of optical coherence tomography (OCT) and OCT angiography, a non-invasive imaging technique used to diagnose glaucoma, diabetic eye disease, macular degeneration and other retinal and optic nerve disorders, the Baerveldt glaucoma implant, the world’s most widely used glaucoma implant – the most effective minimally invasive glaucoma surgery.\n\n\n\n\n\n\neye.keckmedicine.org\n\nCenters and InstitutesMedicine and Health \n\nSaban Research Institute of Children’s Hospital Los Angeles\nAs a leading pediatric academic medical center, research is a vital component of Children’s Hospital Los Angeles. All research at the hospital happens under the auspices of The Saban Research Institute of Children’s Hospital Los Angeles, which is one of the largest and most productive pediatric research facilities in the United States. The Saban Research Institute of Children’s Hospital Los Angeles maintains strong scientific and strategic affiliations with the University of Southern California and the Keck School of Medicine of USC, where CHLA physicians and scientists hold faculty appointments. \n\n\n\n\n\n\nchla.org/research\n\nCenters and InstitutesMedicine and Health \n\nSafe Communities Institute\nThe Safe Communities Institute (SCI) at the University of Southern California Sol Price School of Public Policy engages in research, interdisciplinary education, and collaboration to advance sustainable public safety strategies, policies, and programs. The Institute’s mission is three-fold: reaching people with a new understanding of public safety that hinges on education, awareness and research, and community engagement; advancing violence prevention strategies, policies and research; and contributing to global security in a time of increasing threats. \n\n\n\n\n\n\nsci.usc.edu\n\n\n\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nSaks Institute for Mental Health Law, Policy, and Ethics\nThe Saks Institute for Mental Health Law, Policy, and Ethics is a think tank dedicated to interdisciplinary and collaborative research among scholars and policymakers around issues of mental illness and mental health. As a research institute, the goal is to study issues at the intersection of law, mental health, and ethics as well as influence policy reform and advocacy actions for improved treatment of people with mental illness. Ultimately, an interdisciplinary approach to these important issues will promote a society of well-rounded persons who work with deep satisfaction and integrity and enjoy a clear mind.\n\n\n\n\n\n\ngould.usc.edu/saks\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nSchaeffer Center\nThe Leonard D. Schaeffer Center for Health Policy & Economics brings together health policy experts, a seasoned pharmacoeconomics team as well as faculty from across USC and other leading universities to solve the pressing challenges in healthcare. Their mission is to measurably improve value in health through evidence-based policy solutions, research excellence, and private and public-sector engagement. \n\n\n\n\n\n\nhealthpolicy.usc.edu\n\nCenters and InstitutesMedicine and Health \n\nSchwarzenegger Institute for State and Global Policy\nThe USC Schwarzenegger Institute for State and Global Policy is committed to advancing post-partisanship, where leaders put people over political parties and work together to find the best ideas and solutions to benefit the people they serve. The Institute seeks to influence public policy and public debate in finding solutions to the serious challenges we face.\n\n\n\n\n\n\nschwarzeneggerinstitute.com\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nSea Grant\nUSC Sea Grant contributes to solving the problems of the Urban Ocean, while recognizing the opportunities for coastal commerce, recreation, and improving the quality of life in coastal regions such as Southern California. USC Sea Grant solicits and funds relevant, innovative research to help find solutions for pressing coastal management problems that demand science to help resolve issues of the greatest ecological and social importance.\n\n\n\n\n\n\ndornsife.usc.edu/uscseagrant\n\nCenters and InstitutesLife Sciences \n\nShinso Ito Center for Japanese Religions and Culture\nThe Ito Center’s mission is to promote the study of Japan at USC. The center fosters this area of study through support of faculty-led research and publications, public conferences and events, supporting graduate students, offering postdoctoral fellowships and hosting visiting scholars.\n\n\n\n\n\n\ndornsife.usc.edu/cjrc\n\nCenters and InstitutesArts and Humanities \n\nSidney Harman Academy for Polymathic Study\nThe USC Sidney Harman Academy for Polymathic Study offers a series of conversational encounters intended to intensify polymathic (integrated interdisciplinary) awareness. These discussions are anchored in and structured by the Four Quadrants of Polymathic Inquiry: critical and integrative thinking, study of the great polymaths, tapestry, and communication.\n\n\n\n\n\n\npolymathic.usc.edu\n\nCenters and InstitutesArts and Humanities \n\nSignal and Image Processing Institute\nSIPI was one of the first research organizations in the world dedicated to image processing. Faculty in SIPI are involved in applying state of the art signal processing techniques to a wide range of real world problems.\n\n\n\n\n\n\nminghsiehece.usc.edu/sipi\n\nCenters and InstitutesEngineering and Technology \n\nSignal and Information Processing Institute (SIPI)\nThe USC Signal and Image Processing Institute (SIPI) was one of the first research organizations in the world dedicated to image processing. Image processing work began at USC in 1962 and the Institute itself was founded in 1971 by William K. Pratt and Harry C. Andrews with support from the Defense Advanced Research Projects Agency (DARPA). During the 1970s, research at SIPI focused on the basic theory of image processing and applications to image de-blurring, image coding, and feature extraction. Much of the early work on transform coding, now the basis of the JPEG and MPEG standards for still and video image compression and transmission, was conducted within SIPI. \n\n\n\n\n\n\nminghsiehece.usc.edu/groups-and-institutes/sipi\n\n\n\n\nCenters and InstitutesEngineering and Technology \n\nSleepHub Center\nSleepHuB is a unique network of clinicians, scientists and engineers who work collaboratively to conceptualize and operationalize translational projects related to sleep. We seek to improve sleep health through the development of novel diagnostic and therapeutic technologies. We will facilitate and perform innovative interdisciplinary research that encompasses: the quantitative physiology of normal and abnormal sleep; the development & application of state-of- the-art predictive models and imaging methodologies for sleep apnea; for pediatric and adult sleep apnea and snoring.\n\n\n\n\n\n\nsleephub.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nSol Price Center for Social Innovation\nThe USC Price Center for Social Innovation develops ideas and illuminates strategies to improve the quality of life for people in low-income, urban communities. Together with the Price School’s academic rigor and practice-based expertise, the Sol Price Center for Social Innovation works to advance new models of equity and opportunity for low-income children and families, as well as advance the field of social innovation through scholarship and rigorous academic inquiry.\n\n\n\n\n\n\nsocialinnovation.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nSouthern California Children's Environmental Health Center\nThe Southern California Children's Environmental Health Center (SC-CEHC) is a new center established in 2013. Obesity and its metabolic consequences have become critical public health issues. A better understanding of the causes of childhood obesity is needed to develop the effective preventive intervention. Recent studies indicate that early-life exposures to near roadway traffic-related air pollution increase childhood obesity and have the potential to contribute to fat redistribution, systemic inflammation, and metabolic changes associated with increased risk for type 2 diabetes, non-alcoholic fatty liver disease, and cardiovascular disease.\n\n\n\n\n\n\npm.usc.edu/cehc\n\nCenters and InstitutesMedicine and Health, Sustainability \n\nSouthern California Clinical and Translational Science Institute\nEstablished in 2010, the Southern California Clinical and Translational Science Institute (SC CTSI) is one of 60 NIH-funded Clinical Translational Science Awards with a mandate to increase the efficiency and quality of translational research. SC CTSI helps accelerate scientific discoveries and their application in real-life settings in order to address the specific health needs of urban and diverse populations and improve human health by helping researchers obtain the education, resources and collaborations necessary to translate discoveries into practice.\n\n\n\n\n\n\nsc-ctsi.org\n\nCenters and InstitutesMedicine and Health \n\nSouthern California Earthquake Center\nThe SCEC community advances earthquake system science through three basic activities: (a) gathering information from seismic and geodetic sensors, geologic field observations, and laboratory experiments; (b) synthesizing knowledge of earthquake phenomena through physics-based modeling, including system-level hazard modeling; and (c) communicating our understanding of seismic hazards to reduce earthquake risk and promote community resilience.\n\n\n\n\n\n\nscec.org\n\nCenters and InstitutesPhysical Sciences, Sustainability \n\nSouthern California Environmental Health Sciences Center\nThe mission of the Southern California Environmental Health Sciences Center (SCEHSC) is to develop the scientific knowledge base, investigator teams, and community engagement needed to reduce the burden of diseases and disability from environmental impacts.\n\n\n\n\n\n\nscehsc.usc.edu\n\nCenters and InstitutesMedicine and Health, Sustainability \n\nSpace Engineering Research Center\nThe Space Engineering Research Center (SERC) is dedicated to disruptive space engineering, research and education of the second-generation workforce – including hands-on build, test and flight demonstrations of spacecraft and satellites. SERC seeks to challenge traditional methods of space R&D, manufacturing and exploration with approaches that dramatically reduce costs, enable novel capabilities and support vital democratization of the space domain.\n\n\n\n\n\n\nisi.edu/centers/serc\n\nCenters and InstitutesEngineering and Technology \n\nSpace Sciences Center(SSC)\nAt the University of Southern California, research in the space sciences is carried out by the Space Sciences Center and Department of Physics and Astronomy. Work at SSC involves both laboratory and space based investigations of photoabsorption and emission processes in atomic and molecular gasses in the spectral region from the extreme ultraviolet through the infrared. Missions include rocket launches at White Sands Missile Range (usually during the summer),  experiments aboard the orbital platforms, e.g. Space Shuttles, onboard the Solar Heliospheic Observatory (SOHO), and the Solar Dynamics Observatory (SDO). Two Extreme ultraviolet Solar instruments designed and built at the SSC: the Solar EUV Monitor (SEM) working onboard the SOlar and Heliospheric Observatory (SOHO) since 1996 and the Extreme ultraviolet  Spectrophotometer (ESP) - a channel of SDO/EVE instrument provide regular EUV solar irradiance measurements suitable for studying solar spectral variability, Solar Cycle changes, solar activity and flare dynamics and model impacts on Space Weather, including Earth Ionosphere, Thermosphere, and satellite drag.\n\n\n\n\n\n\ndornsife.usc.edu/space-sciences-center/main\n\nCenters and InstitutesEngineering and Technology, Physical Sciences \n\nSpatial Analysis Lab\nSLAB, the Spatial Analysis Lab at USC Price, advances visualization of the city for public service through research, public engagement, and teaching. Their research experiments with developing cartographic narratives and their potential roles in fostering an inclusive society. Aligned with Price’s commitment to social justice and equity, the various activities of SLAB focus on bringing creativity and a humanistic attention to marginalized peoples and places. \n\n\n\n\n\n\nslab.today\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nSpatial Sciences Institute\nAs the hub of spatial thinking and analysis at USC, the Spatial Sciences Institute partners with researchers, businesses, non-profits, NGOs, and other entities to analyze, model, and visualize location-based data. Their internationally-recognized faculty contribute to the rapidly-evolving body of geospatial knowledge. Through innovative academic programs, they develop the next generation of spatial thinkers, empowering them with capabilities to solve real-world issues.\n\n\n\n\n\n\nspatial.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nSystems Engineering Research Center\nThe Systems Engineering Research Center (SERC), a University-Affiliated Research Center of the US Department of Defense, leverages the research and expertise of senior lead researchers from 22 collaborator universities throughout the United States. The SERC is unprecedented in the depth and breadth of its reach, leadership, and citizenship in systems engineering through its conduct of vitally important research and the education of future systems engineering leaders.\n\n\n\n\n\n\nsercuarc.org\n\nCenters and InstitutesEngineering and Technology \n\nThe New Normal\nThe New Normal: Parents, Teens, and Mobile Devices Around the World is a multi-year research collaboration between USC Annenberg and Common Sense designed to advance cross-cultural exploration of family digital media engagement. This global mapping project has a unique and specific focus on parents and teens, the ways in which they are adopting and adapting to mobile devices in their lives, and how they see each other’s device use. As society observes the first generation of teens to grow up with a mobile device in their hands — and the first generation of parents to face unprecedented challenges in managing digital media in their own lives and the lives of their children — this project aims to spark a global conversation by introducing timely and relevant data from around the world. \n\n\n\n\n\n\nannenberg.usc.edu/research/new-normal\n\nCenters and InstitutesArts and Humanities, Engineering and Technology \n\nThe Stevens-USC Systems Engineering Research Center\nThe Systems Engineering Research Center (SERC), is a University Affiliated Research Center (UARC) of the Department of Defense, leveraging the research and expertise of faculty, researchers, and students from more than 20 collaborating universities throughout the United States. The SERC is unprecedented in the depth and breadth of its reach, leadership, and citizenship in Systems Engineering.\n\n\n\n\n\n\nsercuarc.org\n\nCenters and InstitutesEngineering and Technology \n\nTomas Rivera Policy Institute\nThe Tomás Rivera Policy Institute works to address the challenges and opportunities of demographic diversity in the 21st century global city. The Institute is a special initiative of the Price Center for Social Innovation and produces original research, student activities, and policy solutions. Policy focus areas include: Latinos and the criminal justice system, civic engagement and capacity building among immigrant-serving organizations, and demographic change in major metropolitan regions of the United States.\n\n\n\n\n\n\nsocialinnovation.usc.edu/tomas-rivera-policy-institute\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nU.S.-China Institute\nThe USC U.S.-China Institute informs public discussion of the evolving and multidimensional U.S.-China relationship through policy-relevant research, graduate and undergraduate training, and professional development programs for teachers, journalists, and officials. In fall 2011, USCI became part of the USC Annenberg School for Communication and Journalism, whose world-class programs include those on public diplomacy, new Chinese media, and economics reporting.\n\n\n\n\n\n\nchina.usc.edu\n\nCenters and InstitutesSocial and Behavioral Sciences \n\nUSC Annenberg Institute of Sports, Media & Society\nHoused in the USC Annenberg School for Communication and Journalism, the Annenberg Institute of Sports, Media, and Society promotes academic programs, international research initiatives and professional engagement in the competitive world of sports and media.\n\n\n\n\n\n\naisms.uscannenberg.org\n\nCenters and InstitutesArts and Humanities, Social and Behavioral Sciences \n\nUSC Center for Elder Justice\nThe USC Center for Elder Justice will bring together the existing and wide-ranging elder mistreatment expertise at USC—in medicine, gerontology, health services, psychology, and policy—as well as encourage new partnerships in biology, genetics, biodemography, economics, law, neuroscience, allied health, biostatistics, and social work. The Center will enable USC students of all levels to participate in interdisciplinary research and education. It will be the reliable resource that policymakers turn to when information on this topic is needed.\n\n\n\n\n\n\neldermistreatment.usc.edu\n\nCenters and InstitutesMedicine and Health, Social and Behavioral Sciences \n\nUSC Institute for Addiction Science\nRecognizing the outstanding base of addiction experts at USC and that interdisciplinary collaboration among them had historically been underleveraged, IAS was launched in July 2018 under the leadership of Adam Leventhal (IAS Director, Preventive Medicine) and John Clapp (IAS Co-Director, Social Work) with 30 inaugural faculty members across 5 schools. Institute Startup was supported by financial seed funding for IAS membership interaction activities by the USC Office of Research Collaboration Fund and IAS leadership salary support by the Keck School of Medicine and Suzanne Dworak-Peck School of Social Work. A $467,000 gift from the Red Rosebud Foundation in April 2019 supported hiring an IAS director of operations, which accelerated the Institute’s productivity and scope of programming.\n\n\n\n\n\n\nias.usc.edu\n\nCenters and InstitutesEngineering and Technology, Medicine and Health \n\nUSC International Museum Studies Institute (IMI)\nThe USC Dana and David Dornsife College of Letter, Arts & Sciences International Museum Institute (IMI) is dedicated to the study of museums and their changing roles in society. IMI fulfills its mission by bringing together scholars, students and museum professionals from around the globe to address the most pressing museological matters of the day. USC partners with UNAM (MUAC) on IMI activities.\n\n\n\n\n\n\nfisher.usc.edu/imi\n\nCenters and InstitutesLife Sciences, Physical Sciences \n\nUSC-Buck Nathan Shock Center\nThe USC-Buck Nathan Shock Center of Excellence in the Biology of Aging is a fully integrated multi-institutional center focused on training the next generation of geroscientists and providing access to cutting edge geroscience technologies to investigators across the nation. The USC-Buck NSC is devoted to forging a deeper understanding of how and why aging processes cause disease in order to advance the translation of basic research on aging into effective preventions and therapies. Specialized cores provide services to all Shock Center members, as well as for-fee services to the community at large.\n\n\n\n\n\n\nuscbucknsc.org\n\nCenters and InstitutesMedicine and Health, Social and Behavioral Sciences \n\nUSC-Chevron Center for Interactive Smart Oilfield Technologies\nCiSoft is a USC-Chevron Center of Excellence for Research and Academic Training on Interactive Smart Oilfield Technologies. Established in December 2003, the Center includes participating research scientists from various departments in the Viterbi School of Engineering at the University of Southern California and from Chevron. Two important entities associated with the Viterbi School of Engineering, IMSC (Integrated Media Systems Center) and ISI (Information Sciences Institute) are closely associated with CiSoft. Expertise of participating USC faculty includes Petroleum and Chemical Engineering, Computer Science, Electrical Engineering and Industrial and Systems Engineering.\n\n\n\n\n\n\ncisoft.usc.edu\n\nCenters and InstitutesEngineering and Technology \n\nUSC-Lockheed Martin Quantum Computing Center\nA joint effort of Lockheed Martin Corporation and the University of Southern California, the Quantum Computing Center (QCC) is housed at USC’s Information Sciences Institute, one of the world’s leading computer science and engineering research entities. Faculty, researchers and students are performing basic and applied research into noisy, intermediate-scale quantum (NISQ) computing devices, and are collaborating with researchers around the world. QCC was the first organization outside of D-Wave to house and operate its own system, and it has conducted pioneering research on four different generations of these early NISQ processors.\n\n\n\n\n\n\nwww.isi.edu/centers-qcc\n\nCenters and InstitutesEngineering and Technology \n\nVanEck Digital Assets Initiative\nThe VanEck Digital Assets Initiative at USC’s Marshall School of Business is a hub for education, research, industry partnerships, academia-meets-industry events, and promoting the ecosystem of digital assets, blockchain, cryptocurrencies, non-fungible tokens, and the metaverse.\n\n\n\n\n\n\nmarshall.usc.edu/institutes-and-centers/vaneck-digital-assets-initiative\n\nCenters and InstitutesEngineering and Technology \n\nVisual Studies Research Institute\nFunded primarily by USC Dornsife and building on the success of the Visual Studies Graduate Certificate, the VSRI focuses on the nature, analysis and evaluation of visual evidence in order to interrogate the relationship of seeing, believing, and proving from Antiquity to the present.\n\n\n\n\n\n\ndornsife.usc.edu/vsri\n\nCenters and InstitutesArts and Humanities \n\nWestern Research Application Center\nThe Western Research Application Center (WESRAC) is a non-academic department of the University of Southern California (USC) School of Engineering. It was established in 1967 to stimulate technology transfer and economic development, and to provide technical assistance to improve competitiveness of the manufacturing sector. WESRAC is staffed by full-time business and management professionals and maintains linkages to the faculty and administrative systems of the University.\n\n\n\n\n\n\nsites.usc.edu/wesrac\n\nCenters and InstitutesEngineering and Technology \n\nWorld Building Institute\nThe World Building Institute is a cutting edge USC non-profit Organized Research Unit dedicated to the dissemination, education, and appreciation of the future of narrative media through World Building.\n\n\n\n\n\n\nworldbuilding.institute\n\nCenters and InstitutesCommunication and Information Sciences \n\nWorld Building Media Lab\nThe World Building Media Lab (WbML), directed by award-winning designer and professor Alex McDowell RDI, defines an experiential, collaborative and interdisciplinary practice that integrates imagination and emergent technologies, creating new narratives from inception through iteration and prototyping into multimedia making.\n\n\n\n\n\n\nworldbuilding.usc.edu\n\nCenters and InstitutesCommunication and Information Sciences \n\nWrigley Institute for Environmental Studies\nThe USC Wrigley Institute for Environmental Studies brings together all of the marine and environmental sciences at the University of Southern California, and its crown jewel is a unique marine lab on Catalina Island, the Philip K. Wrigley Marine Science Center. The institute's mission is to inspire global environmental solutions through frontier research and education. Affiliated faculty conduct research in all aspects of the environment. Wrigley Institute scientists investigate biological adaptations to climate change, study interactions among humans and natural systems, and connect science to environmental policy. \n\n\n\n\n\n\ndornsife.usc.edu/wrigley\n\nCenters and InstitutesLife Sciences, Physical Sciences, Sustainability \n\nZilkha Neurogenetic Institute\nNow with more than 30 laboratories populated by hundreds of researchers, ZNI is fast becoming the hub of the USC neuroscience community. Clinicians, physician scientists along with researchers and trainees at all levels—from undergraduate to graduate to postdoctoral—are forging collaborations across departments, disciplines and schools. We are beginning to see other universities follow this model, aligning traditional wet lab research space directly amid their clinical operations.\n\n\n\n\n\n\nkeck.usc.edu/zilkha\n\nCenters and InstitutesMedicine and Health \n\n\n\n\n\n\n\n\n\n\n\n\n\nNews\nMonthly Update – April 2023\nUSC Ranked in NAI’s Top 100 Worldwide University Utility Patent Holders\nAndrew T. Guzman Named USC Provost and Senior Vice President for Academic Affairs\nMonthly Update – March 2023\nDental Day 2023 Winners Announced by USC Stevens Center\n\nMore News\nEvents  Designing and Writing a Successful NSF Broader Impacts Friday, May 19, 2023  10:00 am PDT – 12:00 pm PDT   Introduction and Strategies for ARPA-H Thursday, May 25, 2023  10:00 am PDT – 12:00 pm PDT  \n\nMore Events\nQuick LinksAbout\nContact Us\nNews\nResearch and Scholarship\nResearch Administration\nFunding\nLimited Submissions\nCOVID-19 Research Continuity\nTotal Access for Research Administration\nCenters and Institutes\nShared Resources\nStudents and Postdocs\nTraining\nEvents\n \nUniversity of Southern CaliforniaContent managed by USC Research and Innovation TwitterTwitterThe logo for the social media platform Twitter.\nLinkedInLinkedInThe logo for the social media platform LinkedIn.\nSlackLinkAn icon of a link in a chain.\nYouTubeYouTubeThe logo for video sharing platform YouTube.\n \nWe're happy to announce new grant programs supporting a diverse range of research areas, scholarship, and artistic and cultural expression! Click to learn more. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "http://www.usc.edu",
        "https://research.usc.edu/",
        "https://research.usc.edu/news/",
        "https://research.usc.edu/events/",
        "https://research.usc.edu/research-and-scholarship/",
        "https://research.usc.edu/research-administration/",
        "https://research.usc.edu/funding/",
        "https://research.usc.edu/training/",
        "https://research.usc.edu/about/",
        "https://research.usc.edu/wp-content/uploads/2022/02/institute-governance.doc",
        "https://rii.usc.edu/funding/collaborative-research-planning-award/",
        "https://forms.gle/5mdG8pd8Kux2VGbQ7",
        "http://viterbischool.usc.edu/aier",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gero.usc.edu/airpollbrain-group",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ami.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://adrc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://keck.usc.edu/atri",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ali.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.asc.upenn.edu/",
        "https://annenberg.usc.edu/research/annccc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://annenberg.usc.edu/research/aii",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://annenberglab.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://uscann.tumblr.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://arnicusc.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/arclab",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://architectureandadvocacy.org/en/mission",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sites.usc.edu/watercenter",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ai.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://bedrosian.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "sites.usc.edu/bice",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://bmsr.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sites.usc.edu/smarttextiles",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/bci",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/bridge-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/brittingham-social-enterprise-lab",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://stemcell.keck.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://calrightmeds.org/#",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/casden-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/cagr",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cam.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://annenberg.usc.edu/research/annccc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/cams",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cana.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cais.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://aai.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://uscbodycomputing.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sites.usc.edu/phillips-fisher/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://citydesign.uscarch.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://climatecenter.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://modelingcancer.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ccmb.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cci.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://darkenergybiosphere.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gero.usc.edu/cda",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://gould.usc.edu/faculty/centers/dispute-resolution/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/cdd",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://michelson.usc.edu/usc-center-drug-discovery-development/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cesr.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ced.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://socialjustice.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/center-effective-organizations",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://empoweredtech.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://edge.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cerpp.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/cfr",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://keck.usc.edu/genetic-epidemiology-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gero.usc.edu/cga",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/center-global-innovation",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://healthequityamericas.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://improvinghealth.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://centerforhealthjournalism.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://h3e.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://h3e.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cia.ini.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://immunoengineering.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cid.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cir.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sites.usc.edu/cieborg",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cic.ini.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://intelligentenvironments.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cisoft.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/cis",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/center-investment-studies",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dornsife.usc.edu/center-for-languages-and-cultures/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://lawphilosophy.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gould.usc.edu/centers/class",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gould.usc.edu/clhc/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/clwoc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dworakpeck.usc.edu/research/centers-affiliations/center-for-lgbtq-health-equity",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://lifespanhealth.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://ibt.usc.edu/about/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://chan.usc.edu/about-us/center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cppe.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://annenberg.usc.edu/research/center-public-relations",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://pharmacyschool.usc.edu/cqddm",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cqist.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://crcc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/labs/center-for-research-on-crime",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://create.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://viterbischool.usc.edu/viterbi-internal-center-incubator",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sustainabilitysolutions.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://metrans.org/csc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://csc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://csse.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sites.usc.edu/ctmh",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dornsife.usc.edu/labs/usc-ccf/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://digitalcenter.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife-center-for-political-future.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dornsife.usc.edu/csii",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://uscthirdspace.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://uscrten.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gould.usc.edu/centers/ctlb",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cue.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://pharmacyschool.usc.edu/translational-research/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/nanobiophysicscore",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gero.usc.edu/cbph",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://communicationleadership.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cepeg.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://eldermistreatment.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cppp.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://uscpublicdiplomacy.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dornsife.usc.edu/stpl",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cmml-usc.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.thecharlottabasslab.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.datanetwork.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://civicpaths.uscannenberg.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://kuhn.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cni.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cprc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://cmbhc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://criticalmediaproject.org/mission-statement/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dar.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://usc-dori.org/our-story/",
        "http://usc-dori.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://magics.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://magics.usc.eduu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/emsi",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/eascenter",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://roybal.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://eitm.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://www.usc.edu/",
        "http://emergentcities.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://energyinstitute.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://etcenter.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/eri",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://homemods.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://fcsc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://fccchr.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gero.usc.edu/usc-free-radical-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gameinnovationlab.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gehrcenter.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://composites.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/global-branding-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/faculty-research/centers-excellence/randall-r-kendrick-global-supply-chain-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://hastingscenter.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://annenberg.usc.edu/faculty/robin-stevens",
        "https://annenberg.usc.edu/",
        "http://healthequitymedia.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sites.usc.edu/healme",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://socialinnovation.usc.edu/homelessness-policy-research-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/icw",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://igc.ini.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://cinema.usc.edu/research/labs.cfm",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://cinema.usc.edu/research/labs.cfm",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://isi.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://iandrinstitute.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.marshall.usc.edu/institutes-and-centers/initiative-on-digital-competition",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/iacs",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ibt.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/ibis",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ict.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://annenberg.usc.edu/research/idea",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ipr.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://map.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://itsc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://armenian.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://aisms.uscannenberg.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://itg.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://globalhealth.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://globalhealth.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://regulatory.usc.edu/international-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://fisher.usc.edu/imi",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sites.usc.edu/iris-cvlab",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/labs/janegoodall",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://animation.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://keck.usc.edu/usc-ukro-kidney-research-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/ksi",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/levan-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/departments/lloyd-greif-center-entrepreneurial-studies",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/loker-hydrocarbon-research-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gero.usc.edu/longevity-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/laih",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://lusk.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://composites.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://viterbischool.usc.edu/viterbi-internal-center-incubator",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://mascle.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ini.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://magics.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://madres.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/max-kade",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://annenberg.usc.edu/research/m2e",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://keck.usc.edu/mesh-academy",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://www.metamorph.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://metrans.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/mindandsociety",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://mhicancer.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://themxrlab.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://mobilemedia.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://marshall.usc.edu/faculty-research/centers-excellence/neely-center-ethical-leadership-and-decision-making",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://keck.usc.edu/neurorestoration-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://adrc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://magics.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://magics.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.gudmap.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://magics.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://learcenter.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://uscnorriscancer.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://ngion.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gould.usc.edu/faculty/centers/pacific-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://annenberg.usc.edu/research/pacific-council-international-policy",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.provost.usc.edu/",
        "https://eldermistreatment.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://polishmusic.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://popdynamics.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://viterbischool.usc.edu/pratt-whitney-globalization",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://pullias.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://isi.edu/research_groups/quantum_computing",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://race.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://keck.usc.edu/alpd-and-cirrhosis-research-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://keck.usc.edu/liver-diseases-research-center",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://rasc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://eye.keckmedicine.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://chla.org/research",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sci.usc.edu",
        "https://www.facebook.com/USC.SCI/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://gould.usc.edu/faculty/centers/saks",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://healthpolicy.usc.edu/about/",
        "http://healthpolicy.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://schwarzeneggerinstitute.com",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://research.usc.edu/wp-admin/post.php?post=100&action=edit",
        "http://dornsife.usc.edu/uscseagrant",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://dornsife.usc.edu/cjrc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://polymathic.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://minghsiehece.usc.edu/sipi",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://minghsiehece.usc.edu/groups-and-institutes/sipi/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sleephub.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://socialinnovation.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://pm.usc.edu/cehc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://sc-ctsi.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://scec.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://scehsc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "http://isi.edu/centers/serc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dornsife.usc.edu/space-sciences-center/main/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://slab.today/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://spatial.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://sercuarc.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.commonsensemedia.org/research/The-New-Normal-Parents-Teens-and-Devices-Around-the-World",
        "https://annenberg.usc.edu/research/new-normal",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://sercuarc.org",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://socialinnovation.usc.edu/tomas-rivera-policy-institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://china.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://annenberg.usc.edu/research/annccc",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://eldermistreatment.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://ias.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://fisher.usc.edu/imi/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://adrc.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://cisoft.usc.edu/",
        "http://viterbi.usc.edu/",
        "http://www.usc.edu/",
        "http://www.chevrontexaco.com/",
        "http://imsc.usc.edu/",
        "http://www.isi.edu/",
        "http://chems.usc.edu/",
        "http://www.cs.usc.edu/",
        "http://ee.usc.edu/",
        "http://www.usc.edu/dept/ise/",
        "https://magics.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.isi.edu/centers-qcc/",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://www.marshall.usc.edu/institutes-and-centers/vaneck-digital-assets-initiative",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dornsife.usc.edu/vsri",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://research.usc.edu/wp-admin/post.php?post=98&action=edit",
        "https://sites.usc.edu/wesrac",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://worldbuilding.institute",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://worldbuilding.usc.edu",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://dornsife.usc.edu/wrigley",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://keck.usc.edu/zilkha",
        "https://research.usc.edu/news/category/centers-and-institutes/",
        "https://research.usc.edu/news/2023/05/monthly-update-april-2023/",
        "https://research.usc.edu/news/2023/04/usc-ranked-in-nais-top-100-worldwide-university-utility-patent-holders/",
        "https://research.usc.edu/news/2023/04/announcing-uscs-new-provost/",
        "https://research.usc.edu/news/2023/03/monthly-update-march-2023/",
        "https://research.usc.edu/news/2023/03/dental-day-2023-winners-announced-by-usc-stevens-center/",
        "https://research.usc.edu/news/",
        "https://calendar.usc.edu/event/designing_and_writing_a_successful_nsf_broader_impacts_5148",
        "https://calendar.usc.edu/event/introduction_and_strategies_for_arpa-h",
        "https://research.usc.edu/events/",
        "https://research.usc.edu/about/",
        "https://research.usc.edu/about/leadership/",
        "https://research.usc.edu/news/",
        "https://research.usc.edu/research-and-scholarship/",
        "https://research.usc.edu/research-administration/",
        "https://research.usc.edu/funding/",
        "https://orif.usc.edu/limited-submissions/",
        "https://research.usc.edu/coronavirus/",
        "https://research.usc.edu/research-administration/usc-research-administration-system/",
        "https://research.usc.edu/research-and-scholarship/centers/",
        "https://orif.usc.edu/shared-resources/",
        "https://research.usc.edu/research-and-scholarship/students/",
        "https://research.usc.edu/training/",
        "https://research.usc.edu/events/",
        "https://twitter.com/ResearchAtUSC",
        "https://www.linkedin.com/company/researchatusc",
        "https://join.slack.com/t/researchatusc/shared_invite/zt-dcn18aif-9NXRJSDZrk1U~uuG6RQwFg",
        "https://youtube.com/researchatusc",
        "https://research.usc.edu/new-funding-opportunities/"
    ]
}