{
    "title": "Highlighting Brown’s distinction in economics | Brown University",
    "body": "\n\n\n\n\n\n\nSkip to Main Content\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \nNews from Brown\n\n\n\n\n\n\nSite Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTopics\n\nSocial Sciences\n\n\n\nDate\n\n                  January 10, 2019\n                  2019-01-10\n\n\n\nMedia Contact\n\n                    \nGillian Kiley\n [email protected]\n\n  401-863-7287\n\n\n\n\n\n\n\n\n\nAll News\n\n\n\nShare\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\nLinkedin\n\n\n\n\n\n\nEmail\n\n\n\n\n\n\n\n\n\n\n  Highlighting Brown's Distinction\n\n\n\n\n\n\nRelated stories\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHighlighting Brown’s distinction in economics\nWith an increased focus on unearthing novel data sources for analysis, Brown’s economics scholars are bringing new insights to complex problems and teaching the next generation of researchers and policymakers to do the same.\n\n\n\n\n\n\n\n\n\nEmily Oster, professor of economics and international and public affairs, is among the economics department faculty finding new ways to answer critical questions by using novel data.Nick Dentamaro / Brown UniversityPROVIDENCE, R.I. [Brown University] —In recent years, as the vast availability of data has launched a sea change in the field of economics, Brown University’s investments to build on the traditional strengths of its Department of Economics have propelled Brown to the leading edge among economics departments nationally.\nAs new and novel data sources proliferate, the department’s faculty have excelled in taking full advantage of this exponential surge to conduct data-driven research in ways that are broadening Brown’s impact. The department’s work has led to a climb in respected research rankings, and its alumni continue to excel to top positions as professional economists.\nIn a departure from using classic data sets, faculty and student scholars are calling on historical records housed in state archives, data from the Air Force Defense Meteorological Satellite Program, and insights collected by businesses, among other newer data sources. Their work reflects an innovative approach, a commitment to data fluency and an openness to drawing connections across diverse areas of study.\n“Our vibrant empirical group is just blowing away the old limits on what kinds of data we use,” said Professor of Economics David Weil. “These new research directions expand the portfolio of a department that was already known for seminal work in economic growth, game theory, development and econometric theory, among other areas.”\nThe department, which dates to 1828, has long been known for influential work in theoretical economics. Now, using novel data sources and innovative methods for analysis, faculty are answering critical questions about government programs, health and medicine, education, politics, media, and infrastructure: What is the long-term impact of federal welfare programs on the children of indigent mothers? What effect does a new subway system have on air pollution in urban areas? How does the choice of college impact a student’s future earning potential?\n“The advent of big data, I think, is changing the economics profession,” said Matthew Turner, a Brown professor of economics who has worked with NASA satellite data to study air pollution.\nReflecting the integral role of students in discovery at Brown, students often work with faculty to tackle increasingly complex issues.\nProfessor of Economics Anna Aizer, chair of the department, credits the department’s focus on encouraging undergraduate research with enabling faculty to undertake long-term, labor-intensive projects that yield better results and impact policy. The success of the projects often is based on the ability to extract new insights from new data.\n“As a profession, we are going after more and better data,” Aizer said. “This is a natural evolution — you use the available data sets as much as you can, but for the next generation of questions, you need new data.”\nThe use of data-driven research to develop real-world insights is an outgrowth of the University’s efforts to build on the existing strengths in the department in recent years. Brown has been aggressive in hiring additional faculty, supporting integrative scholarship and curricular opportunities, and promoting data fluency — all priorities outlined in Building on Distinction, Brown’s strategic plan launched in 2014.\nEconomics faculty are working across academic boundaries and affiliating with centers and institutes at Brown including the Watson Institute for International and Public Affairs, the Institute at Brown for Environment and Society, the Population Studies and Training Center, the Data Science Initiative and others. The high-impact findings they produce are proving to have important implications for policy.\nA new perspective on policy\nCan a student’s choice of college lift them out of poverty? John Friedman, an associate professor of economics and of international and public affairs, took on a massive statistical analysis to discern trends in access to colleges for low-income students. He and   colleagues at the Equality of Opportunity Project identified the schools that move the most low-income students up the economic ladder.\nFriedman and the research team looked at 30 million students, using data that included family incomes in students’ teenage years, as well as statistics on the earnings of those graduates who have reached their early 30s. Students from divergent economic backgrounds who graduate from the same universities, he said, can achieve similar economic status later in life. With so much data, the study created a foundation for the development of policies that might increase access and mobility in a way that takes into account the specific characteristics of a place or higher education institution.\n“There’s no reason to think the educational policy that works in Providence will translate to El Paso,” he said. “The great value of the data that we work with is that you can paint a picture of the world that’s much more fine-grained than it was before, allowing you to do policy work that takes heterogeneity seriously.”\nFriedman — who also published a major study and “Opportunity Atlas” in October 2018 that tracks economic mobility by U.S. neighborhood — also takes seriously the accessibility of data and makes data for subsets of students at each college available online.\n“This is our attempt to share the complexity in as direct a way as possible,” he said. “That’s helpful both for researchers who can take on projects with the data we release, and it makes data and findings salient for policymakers and the public.”\nFor Aizer, identifying and linking data that is not otherwise readily available can provide answers to long-held policy questions. In a 2016 study, Aizer and colleagues set out to find evidence of the impact of welfare — defined as cash transfers to mothers with poor children — on their children’s outcomes.\n“Welfare, for the most part, is a means-tested program, so only poor, but not all poor moms receive it,” Aizer said. “It is very difficult to come up with the ‘counterfactual’ — what these kids’ lives would have looked like in the absence of welfare.”\nAizer turned to the Mothers’ Pension program, the first government-sponsored welfare program in the United States, which ran from 1911 to 1935. With the help of 25 undergraduate research assistants who ventured to 14 county and state archives across the country, Aizer built a data set on 80,000 children whose mothers had applied to the welfare program, including those who were rejected. The team then matched the data to Census, World War II and death records that had been publicly released.\n“This was a new data set built to study an incredibly important question from a policy perspective — what is the impact of welfare on children’s health and well-being?” Aizer said. “We found that male children of accepted applicants lived one year longer than those of rejected mothers, obtained more schooling, were less likely to be underweight and had higher income in adulthood than children of rejected mothers.”\nThis is just one of many examples of the growing focus on applied research and scholarship in economics at Brown.\nIn another study that addressed a longstanding policy question in a novel way, faculty members Justine Hastings (international and public affairs and economics) and Jesse Shapiro (economics) researched the shopping habits of recipients of the Supplemental Nutrition Assistance Program (SNAP, historically known as food stamps). They used an enormous amount of anonymized data from a grocery chain, analyzing records on more than 500 million transactions.\nWhat did they find? Not what many traditional economic models would predict. SNAP benefits increase overall food spending by between 50 and 60 percent of the benefit’s value, while an equivalent cash benefit would end up spent largely on items other than groceries. That finding is important, Shapiro said, “because the stated intention of the SNAP program is to help people buy food” — previously, there had been no conclusive answer on whether that is the main effect, despite the fact that the program dates to the Food Stamp Act in 1964.\nThis kind of research impacts policy as well as the thinking of other leading economists. Prior work on human behavior and economic decision-making concerning household budgeting and gasoline expenditures by Hastings and Shapiro was cited in the scientific background document for Richard Thaler’s 2017 Nobel prize in economics, as was work by Friedman on decision-making and retirement accounts.\nCollaborating across disciplines and earning national recognition\nSometimes, answering an economics research question requires access to or analysis of data from other academic fields entirely. In distinctively Brown fashion, faculty collaborate frequently with researchers in other disciplines to yield innovative work and new insights.\nEmily Oster, a professor of economics and of international and public affairs, has studied whether mortality risks (like having a terminal illness) influence people’s choices about education or other future-oriented human capital investments. With a particular interest in Huntington’s disease, an inherited neurological disorder that dramatically shortens lifespan, she worked with a Huntington’s disease researcher who agreed to share his data.\nThe data allowed Oster to investigate why few at-risk individuals choose to undergo genetic testing. The answer — that some patients do not want to live with the anticipation of future ill health — is now informing how doctors approach adult-onset genetic conditions in clinical settings. In order to preserve hope, doctors should not reveal the genetic status of a patient who chooses to avoid testing, Oster and her colleague argued.\n“These patients are not making a mistake, nor do they lack information,” Oster said. “Individuals are avoiding testing because they prefer to consume happiness in the anticipation period.”\nWhereas Oster forged her research collaboration deliberately, at other times fortunate encounters prompted by the open intellectual exchange among scholars on campus can drive new approaches to problems.\nWeil learned through a casual conversation with a graduate student in environmental studies that federal scientists publish raw data from weather satellites that circle the Earth 14 times per day. The satellites record the intensity of Earth-based light. Weil used that data as the basis for an analysis measuring economic growth in poor countries based on light produced at night. The data served as a new indicator of income for countries or regions that measure economic growth poorly or not at all.\nIn that study and others using the same source, Weil made use of material originally collected for the purposes of the Air Force, with tools developed for geographers and Earth studies researchers. He was able to do this because a second graduate student collaborator had learned how to use those tools for social science research — and because the Brown ethos involves breaking through disciplinary boundaries when doing so can lead to new insights.\nWeil says his colleagues in the department are building upon an already accomplished portfolio of work and using a wide array of new techniques to produce high-impact research. That’s why it’s fair to say they are “blowing away the old limits.”\nThat vitality that Weil cites is attracting notice from well beyond Brown, too.\nProfessor of Economics Oded Galor assessed the Research Papers in Economics (RePEc) rankings of Brown’s economics department over time, and pointed out that Brown is currently ranked eighth among all departments in the country, while more six years ago its ranking fluctuated in the range of 16 to 19.\n“There has been a significant improvement in the quality and the reputation of the economics department in the past six years,” Galor said. “This transformation is partly captured by the changes in the ranking of the economics department among other U.S. economics departments.”\nThe success of the department’s graduates is another indicator of a growing impact, Weil says.\n“Scholars who earned their doctorates in the Brown economics department are found throughout the top ranks of university economics departments in the U.S. and abroad, as well as in the Federal Reserve system, World Bank, IMF and the central banks of many foreign countries,” he said.\nDistinguished undergraduate alumni of the department — including 1967 graduate Janet Yellen, previous chair of the U.S. Federal Reserve — are well represented in the top ranks of academia, finance, business and public policy, Weil added.\nThe next generation of researchers\nIf the spread of technology has led to vast amounts of data accessible to economists, it has simultaneously created the need for the next generation of researchers and policymakers to know what to do with that data. And that’s where the economics department’s dual research and teaching missions intersect.\nDaniel Bjorkegren, an assistant professor in the department, teaches Big Data, a course he developed after colleagues in the technology industry noted a skills gap between new hires who had studied computer science or data science, versus economics.\n“Economists are trained to have a good sense for causality, interpretation, and the limits of data; computer scientists and data scientists tend to be more adept at using complex forms of data, and making analysis compute quickly,” Bjorkegren said. “I realized that a student could take a course in statistics, machine learning and econometrics, and walk away thinking there were three completely isolated approaches to learning from data. There weren't many places that allowed them to wrestle with the tradeoffs that different fields prioritize.”\nThe Big Data course creates a venue for that conversation, weaving together different approaches to answer questions. Greater data fluency will mean greater professional opportunity, faculty say — and that’s especially important given the size of the undergraduate program’s enrollment. Economics has long been one of Brown’s most in-demand concentrations. With 164 graduates among the Class of 2018 (plus more in joint concentrations with applied mathematics, computer science and mathematics), the number of economics students was superseded only by computer science.\nBeyond the classroom, graduate and undergraduate students contribute as research assistants. Data needed for study is often highly dispersed, and undergraduates play a critical role in finding it. One undergraduate researcher spent a year collecting county-level disease and vaccination data from as many states as possible in support of Oster’s study on whether disease outbreaks lead to higher vaccination rates in the U.S. Separately, Brown undergraduates as well as students from other institutions assisted Aizer in collecting archival data for her Mother’s Pension program study. Graduate student roles often involve merging and validating the data.\nWhile such projects require investments of time and money, Aizer said, they yield higher-quality results and help undergraduates gain experience and build the skills that will propel them as next-generation economists.\nSome faculty say that the many hands that touch the data, and the increasing number of coauthors on economics papers, reflects the collaborative approach common in the hard sciences, which is a distinction at Brown. Many faculty marvel at the degree to which assisting with research inspires innovative methods for solving problems.\n“Students often have to come up with a way to measure something that hasn’t been measured before,” Shapiro said. “It takes creative thinking to find a way to get the data that they want and use it in a sensible way.”\nWhat sets Brown apart, Friedman says, is the impact of finding answers to the questions that the department’s researchers are asking.\n“The challenge is not collecting data, but making sense of it — taking a big data set and determining what questions you’re going to ask of it,” Friedman said. “You can ask a million questions, but what’s interesting?”\nIf the research published, the insights gleaned and the policies informed are any indication, faculty and students in Brown’s Department of Economics will continue to answer that question for generations to come.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nof\n7\n\n\nBrown's economics department, long influential in theoretical economics, has emerged as a leader in the innovative use of big data. John Abramowski\n\n\n\n\n\n\n\n\n\n\n\n\n2\nof\n7\n\n\nAmong the courses John Friedman teaches is Public Economics, which covers core issues in the design of optimal government policies and the empirical analysis of those policies in the world. Nick Dentamaro / Brown University\n\n\n\n\n\n\n\n\n\n\n\n\n3\nof\n7\n\n\nJohn Friedman's \"Opportunity Atlas\" makes accessible data on economic mobility at the neighborhood level for locations across the United States. Nick Dentamaro / Brown University\n\n\n\n\n\n\n\n\n\n\n\n\n4\nof\n7\n\n\nBrown economics students develop the kind of data fluency that will enable them to weave together different approaches to answering critical research questions. Nick Dentamaro / Brown University\n\n\n\n\n\n\n\n\n\n\n\n\n5\nof\n7\n\n\nEconomics students leave a classroom in Robinson Hall — alumni from the concentration have gone on to be leaders in academia, finance, public policy and business. Nick Dentamaro / Brown University\n\n\n\n\n\n\n\n\n\n\n\n\n6\nof\n7\n\n\n“The challenge is not collecting data, but making sense of it — taking a big data set and determining what questions you’re going to ask of it,” John Friedman said.\n\n\n\n\n\n\n\n\n\n\n\n\n7\nof\n7\n\n\nIn addition to studying with faculty (like Emily Oster, pictured here), undergraduate and graduate students play a critical role in research efforts, helping to identify, collect and analyze data. Nick Dentamaro / Brown University\n\n\n\n\n\n\n\n\n\nTags\n\nHighlighting Brown's Distinction\n\n\n\n\n\n\n\n\n\n\n\n  Highlighting Brown's Distinction\n\n\n\n\n\n\nRelated stories\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n\n\nProvidence\nRI\n02912\n\n\n\n\n\n\n\n\n401-863-1000\n\n\n\n\n\n\nQuick Navigation\n\n\n\n\nVisit Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Map\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA to Z\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter Navigation\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEvents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Safety\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccessibility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers at Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe campaign for building on distinction\n\nGive To Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSocial Navigation\n\n\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\n\n\nInstagram\n\n\n\n\n\n\n\n\nLinkedIn\n\n\n\n\n\n\n\n\nSnapchat\n\n\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\n\n\nYouTube\n\n\n\n\n\n\n\n\nSocial Media Directory\n\n\n\n\n© Brown University \n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \n\n\nFor You\n\n\n\n\n\n\n\nCurrent Students\n\n\nFaculty\n\n\nStaff\n\n\nParents & Families\n\n\nAlumni\n\n\nFriends & Neighbors\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\nMobile Site Navigation\n\n\n\n\nMobile Site Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\nTopics\n\n\n\n\n\nArts and Humanities\n\n\n\n\nEnvironment\n\n\n\n\nHealth and Medicine\n\n\n\n\nNews and Events\n\n\n\n\nScience and Technology\n\n\n\n\nSocial Sciences\n\n\n\n\nStudent Life\n\n\n\n\nUniversity Initiatives\n\n\n\n\n\n\n\n\nMobile Secondary Navigation Navigation\n\n\n\n\nCOVID-19 Info\n\n\n\n\nAbout\n\n\n\n\nEvents\n\n\n\n\nFor You\n\n\n\n\nGive to Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAll of Brown.edu\n\n\n\n\n\n\nPeople\n\n\n\n\n\n\nNews\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\nSearch people\n\n\n\n\n\n\n\nAdvanced Search\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Search\n\n\n\n\n\n\n\n\n\n\n\nHighlighting Brown’s distinction in economics\n\n\n\n\n\nOpen details for Highlighting Brown’s distinction in economics\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark this Page\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page_main_content",
        "/",
        "/news",
        "/news/featured-events",
        "/news/for-journalists",
        "#flyout_search",
        "#menu",
        "/news/social-sciences",
        "/cdn-cgi/l/email-protection#3057595c5c59515e6f5b595c55497052425f475e1e555445",
        "tel:4018637287",
        "/news/all",
        "#",
        "#",
        "#",
        "#",
        "/news/highlighting-browns-distinction",
        "/news/highlighting-browns-distinction",
        "/news/highlighting-browns-distinction",
        "https://www.brown.edu/academics/economics/",
        "http://watson.brown.edu/",
        "https://ibes.brown.edu/",
        "https://www.brown.edu/academics/population-studies/",
        "https://www.brown.edu/initiatives/data-science/",
        "http://www.equality-of-opportunity.org/papers/coll_mrc_paper.pdf",
        "http://www.equality-of-opportunity.org/team/",
        "https://news.brown.edu/articles/2018/10/opportunity",
        "https://www.brown.edu/research/projects/oster/sites/brown.edu.research.projects.oster/files/uploads/Disease_and_Vaccination.pdf",
        "/news/tag/highlighting-distinction",
        "/news/highlighting-browns-distinction",
        "/news/highlighting-browns-distinction",
        "/news/highlighting-browns-distinction",
        "https://www.google.com/maps/dir/?api=1&destination=Brown%20University%2075%20Waterman%20St.%20Providence%20RI%2002912",
        "tel:4018631000",
        "https://www.brown.edu/about/visit",
        "https://www.brown.edu/Facilities/Facilities_Management/maps/#building/",
        "https://www.brown.edu/a-z",
        "https://www.brown.edu/about/contact-us",
        "https://www.brown.edu/news",
        "https://events.brown.edu/",
        "https://dps.brown.edu/",
        "https://www.brown.edu/website-accessibility",
        "https://www.brown.edu/careers",
        "http://alumni-friends.brown.edu/giving/",
        "https://www.facebook.com/BrownUniversity",
        "https://instagram.com/brownu",
        "https://www.linkedin.com/edu/school?id=19348",
        "https://www.snapchat.com/add/brown-u",
        "https://twitter.com/BrownUniversity",
        "https://www.youtube.com/brownuniversity",
        "https://www.brown.edu/social/",
        "/",
        "/current-students",
        "/faculty",
        "/staff",
        "/families",
        "https://alumni-friends.brown.edu/",
        "/friends-neighbors",
        "#flyout_search",
        "#menu",
        "/news/featured-events",
        "/news/for-journalists",
        "/taxonomy/term/146",
        "/taxonomy/term/311",
        "/taxonomy/term/161",
        "/taxonomy/term/301",
        "/taxonomy/term/306",
        "/taxonomy/term/316",
        "/taxonomy/term/521",
        "/taxonomy/term/526",
        "https://healthy.brown.edu/",
        "/about",
        "https://events.brown.edu",
        "",
        "https://alumni-friends.brown.edu/giving",
        "https://directory.brown.edu/",
        "#header",
        "https://www.brown.edu/news/2019-01-10/economics"
    ]
}