{
    "title": "Computer Labs – IT Support Services – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        IT Support Services\n\t\t\t    \n                            ITSS Menu\n                        Show search box.IT Support ServicesAbout UsITSS TeamStudent JobsChico State PortalComputer LabsComputer LabsAccessible Technology CenterPrintingLab PolicyInstalled SoftwareComputer Labs HoursDepartment LabsOffice CopiersPoliciesSecurityWildcat Card ProgramSchedule an AppointmentIT Support ServicesAbout UsITSS TeamStudent JobsChico State PortalComputer LabsComputer LabsAccessible Technology CenterPrintingLab PolicyInstalled SoftwareComputer Labs HoursDepartment LabsOffice CopiersPoliciesSecurityWildcat Card ProgramSchedule an Appointment\n        Our Office\n        Location Icon\n                                                                            Meriam Library, Room 142\n                                                                530-898-4357itss@csuchico.eduBusiness Hours\n                                                                            7:30 AM – 5:00 PM\n                                                                \n                                                                                Monday – Friday\n                                                                \n                                                                                Closed on weekends and holidays.\n                                                                    ITSSCurrent page:  Computer Labs\n                                        \n    \t\tComputer Labs\n    \tIT Support Services operates an on-campus open access computer labs for use by Chico State students in Meriam Library 450. This lab is equipped with Windows PCs. Check the Lab Hours page for updated lab open hours.We also support a virtual lab called the Wildcat Lab(opens in new window) that is accessible from any modern web browser or from a downloadable application.IT Support Services provides some support for department labs on campus. Please see the support page for details of services available.Failure to comply with the below policies may lead to revoking your lab use privileges.Always bring a flash drive to the lab, or save to your Google Drive, and save your work frequently on the drive. Keep important files in more than one place. We are not responsible for work lost because of computer failure.Computer Lab Use PolicyNo food, drink, or tobacco is allowed in the labs. Any food or drink in your possession must be kept in a closed pack, purse, etc. while using the lab.Lab computers are for academic use. Chat functions and game playing are restricted from all computers except as required for academic purposes.Users should take care not to display images, sounds, or messages which could create an atmosphere of discomfort or harassment to others. Students should make arrangements through their instructor for a private work area if a class assignment requires them to access such materials.Users must not tamper with lab computers. This includes adding or removing any devices (except for USB drives).Wired network ports in labs are for state-owned computers only. Plugging personal computers into the wired lab network is prohibited.Users must not intentionally disrupt the campus computing system or obstruct the work of other users, including sending chain letters or blanket e-mail messages, or knowingly consuming inordinately large amounts of system resources.All students are responsible for using campus computer resources in accordance with the campus Acceptable Use Policy. By using campus resources you agree to abide by these policies.Wildcat Lab (Virtual Lab)The Wildcat Lab(opens in new window) is available to all students, faculty, and staffThe lab saves some of your data, but it is still advisable to save your work in Google Drive, Onedrive, or another cloud serviceIf you have issues with the Wildcat Lab, please submit a ticketCampus Student Conduct PolicyStudent Conduct Policy (PDF)Accessibility HelpIf you need special accommodation to access any content on this page, please contact the Office of Accessible Technology and Services at 530-898-6532.Information TechnologyMeriam Library, Room 338www.csuchico.edu/itSupport Our CollegeMore in our divisionComputing & Communication ServicesCreative Media & TechnologyEnterprise ApplicationsInformation SecurityInstitutional Research and Strategic Analytics (IRSA)IT Administrative ServiceIT Support ServicesTechnology Equity and Inclusion\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "../index.shtml",
        "javascript:void(0)",
        "../index.shtml",
        "../about/people/index.shtml",
        "../about/jobs/index.shtml",
        "../portal/index.shtml",
        "index.shtml",
        "assistive-tech.shtml",
        "printing.shtml",
        "lab-policy.shtml",
        "installed-software.shtml",
        "hours.shtml",
        "department-labs.shtml",
        "../officecopier/index.shtml",
        "../policies/index.shtml",
        "../security.shtml",
        "https://www.csuchico.edu/idcard/",
        "https://outlook.office365.com/owa/calendar/ITSSLobby1@csuchico.onmicrosoft.com/bookings/s/-ys7kxk2hUuDJ8UBbxJivg2",
        "../index.shtml",
        "../about/people/index.shtml",
        "../about/jobs/index.shtml",
        "../portal/index.shtml",
        "index.shtml",
        "assistive-tech.shtml",
        "printing.shtml",
        "lab-policy.shtml",
        "installed-software.shtml",
        "hours.shtml",
        "department-labs.shtml",
        "../officecopier/index.shtml",
        "../policies/index.shtml",
        "../security.shtml",
        "https://www.csuchico.edu/idcard/",
        "https://outlook.office365.com/owa/calendar/ITSSLobby1@csuchico.onmicrosoft.com/bookings/s/-ys7kxk2hUuDJ8UBbxJivg2",
        "tel:530-898-4357",
        "mailto:itss@csuchico.edu",
        "../index.shtml",
        "hours.shtml",
        "https://support.csuchico.edu/TDClient/1984/Portal/KB/ArticleDet?ID=112333",
        "https://support.csuchico.edu/TDClient/1984/Portal/KB/ArticleDet?ID=112333",
        "department-labs.shtml",
        "https://www.csuchico.edu/pres/em/1997/97-018.shtml",
        "https://support.csuchico.edu/TDClient/1984/Portal/KB/ArticleDet?ID=112333",
        "https://support.csuchico.edu/TDClient/1984/Portal/Requests/ServiceDet?ID=44992",
        "../_assets/documents/title5.pdf",
        "tel:530-898-6532",
        "https://www.csuchico.edu/it/index.shtml",
        "https://www.csuchico.edu/giving/index.shtml",
        "https://www.csuchico.edu/ccsv//index.shtml",
        "https://www.csuchico.edu/cmt/index.shtml",
        "https://www.csuchico.edu/eapp/index.shtml",
        "https://www.csuchico.edu/isec/index.shtml",
        "https://www.csuchico.edu/ir/index.shtml",
        "https://www.csuchico.edu/iasc/index.shtml",
        "../index.shtml",
        "https://www.csuchico.edu/tein/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}