{
    "title": "Report on refinery closure provides guide for changing economy | School of Social Ecology",
    "body": "\n\nSkip to main content\n\n\n\n\n\n\n\n\n\n\n\nResources for\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\n \n\n\n\n\n\n\n\n\n\nSearch form\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nContact\nGive\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nAboutAbout the SchoolMeet the DeanSchool LeadershipStrategic PlanGiveEmploymentDirectoriesAcademicsDepartments & ProgramsDegree ProgramsOnline Degree ProgramsCertificateResearchResearch HubsCenters, Institutes & InitiativesGlobal Research MapResearch ResourcesPeopleFacultyUndergraduate StudentsGraduate StudentsAlumniDirectoriesNews & EventsEventsIn the NewsE-newsletterMagazineVideosAwardsOutreachRegional and NationalGlobal \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReport on refinery closure provides guide for changing economy \n\n\n\n\n\n\n\n\n\n\n\nApr\n26\n2023\n\n\n\n\n\n\n\nProfessor Parks documents displaced fossil fuel workers’ experience\nA new report by Virginia Parks, professor of urban planning and public policy, documents the difficult post-layoff job search and working conditions of hundreds of California fossil fuel workers in the aftermath of the 2020 closure of the Marathon Martinez oil refinery in Contra Costa County, providing an illuminating case study of the perils and needs of workers in the nation’s changing energy landscape.\nOne of the first, in-depth, representative studies of displaced fossil fuel workers, the report draws on a survey of 140 former Marathon workers and nearly two dozen interviews. The study finds that while the laid off workers broadly support the region’s transition to a clean energy economy, they faced significant financial strain, mental health challenges and difficulty securing high-quality, union jobs in the aftermath of the refinery shutdown.\n\n“Oil and gas workers are highly skilled, hard-working experts who have so much to offer in emerging clean industries. We recognize the need for this nationwide change, and we want to be a part of it — but we can’t do it alone,” said Tracy Scott, president of United Steelworkers Local 5, which represented 345 of the approximately 700 workers laid off at the facility. “The personal, financial and generational impact of these closures on working people is immense. Elected leaders must do better, from a public policy standpoint, to ensure those impacted by the transition to a clean economy are supported.”\nIn October 2020, as the COVID-19 pandemic raged across the country, the Marathon oil refinery in Martinez, CA shut down after 100 years of operation. Hundreds of workers were laid off, losing stable, union jobs. While 3 out of 4 former Marathon workers eventually found new work, they made a median $12 an hour less than prior to their layoff, the study finds. Another 26 percent of workers remained unemployed one year after their layoff. \nFunded by the State of California’s Workforce Development Board, the study found that 91 percent of the surveyed former Marathon workers are willing to enroll in a subsidized training program, but many workers were apprehensive about the efficacy of training, in the absence of clear pathways into job opportunities with comparable pay and benefits. The report, commissioned by UC Berkeley, compiles a set of recommendations for local, state and federal leaders to better support workers through job and career transitions and lays out a blueprint for leaders to ensure equitable transition to clean energy for all workers. \n“California leads the nation in the shift to clean energy, and our state must also be a leader in supporting workers through this transition,” said Tim Rainey, Executive Director of the California Workforce Development Board. “Building an economy where working families can prosper requires that elected leaders and employers listen to workers, plan ahead and get creative in finding solutions that support and empower people as they move into new roles. UC Berkeley’s report offers critical insights about how we can navigate the challenges of our changing economy, based on workers' real experiences.”\nThe energy transition is already happening, Parks said, “but we cannot be transitioning the economy at the expense of workers and the communities they live in. The experience of the Marathon workers clearly demonstrates the need for proactive, worker-centered policies and supports in order to build a high-road, carbon-neutral economy.”\nMarathon Martinez Workers Struggle to Recover Post-Layoff\nThe UC Berkeley study paints a stark picture of the deep financial and personal hardships facing those laid off following the shutdown and repurposing of this oil refinery mid-pandemic. One-third of workers surveyed said they were falling behind financially — up from only 3 percent before the layoffs — and nearly a one-third took early withdrawal from their retirement accounts to make ends meet.  \n“I was devastated,” said James Feldermann, a former Marathon refinery worker who was laid off. “It's not losing a job, it's losing a career. It's losing where you were going to retire from.”\nA majority of respondents also stated that they cycled through two or more jobs in the year after their layoff, and many expressed frustration with the lack of safety protections or union representation in their new jobs. What’s more, a quarter of workers encountered problems applying for or receiving unemployment insurance and another quarter didn’t apply for UI at all. \nWhile all of the workers who responded to the survey were members of United Steelworkers Local 5 during their employment at the Marathon refinery, only 43 percent held union jobs after the closure. Without the strength of a union behind them, the former Marathon workers reported losing the ability to advocate effectively for better pay, benefits and training. \n“Our top priority as a union is keeping our members at work,” said USW District 12 Director Gaylan Prescott, who represents workers in California and ten other Western states, “but we also fight for workers when the worst happens. Our union is committed both to connecting laid-off oil and gas workers with existing resources and continuing to push employers and policymakers to provide long-term solutions.”\nWorker-Informed Solutions Key to an Equitable Transition\nIn consultation with former refinery workers interviewed for the study, the report compiles a list of recommendations for how federal, state and local leaders should approach the transition to clean energy and support the growing ranks of displaced workers across California and nationwide. The worker-recommended solutions include:\n\nCash support to ensure those laid off by oil refineries can keep their families afloat during transition periods, including extended unemployment benefits, and financial aid to cover the 24% average gap in workers pre-layoff wages.\nSkill certification and subsidized training, to help workers transition their expertise and credentials into new sectors and into roles that match their years of experience.\nTargeted, individualized job search assistance and affordable training targeted towards oil and gas workers searching for employment in a new sector.\nFinancial planning and bridge-to-retirement funding, to both support working families post-layoff and provide full retirement benefits to workers eligible for early retirement following layoff.\nAccess to counseling, health care, and transparent communication for workers and their families, including mental health support\nEmpower unions to provide information, communication and resources to workers transitioning between jobs\n\n“We have a responsibility to recognize that, as we move towards cleaner sources of energy, hardworking, union refinery workers have played a critical role in powering California for generations,” said Chris Markuson, Western States Director of the BlueGreen Alliance. “This report provides valuable insights into the transition challenges workers are likely to face and highlights opportunities to support them and their communities as we build a cleaner and more equitable economy.”\n\nRelated:\nThe Atlantic: The Blue-Collar Workers Left Behind by the Green Economy\nUCI opens Labor Center\nUCI Labor Center website\nFaculty Spotlight: Virginia Parks\n\nContact:\nMimi Ko Cruz\nDirector of Communications\n949-824-1278\nFeatures\n\nShare \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on social media\n\n\n\nFacebook\nTwitter\nYouTube\nLinkedIn\nInstagram\nFlickr\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContact Us\nEmployment\nAdministrative Services\nUCI Homepage\n \n\n\n\n\n\n\n\n\n\nUC Irvine\nSchool of Social Ecology\n5300 Social and Behavioral Sciences Gateway\nIrvine, CA 92697-7050\n© 2020 UC Regents\nWebsite Questions\nWebsite Accessibility\nRequest Web Login\n \n\n\n\n\n\n\n\n\n\n\nLogin\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "/pages/prospective-students",
        "http://students.soceco.uci.edu/",
        "/pages/alumni-and-friends",
        "/pages/administrative-services",
        "/pages/contact-us",
        "/pages/giving-priorities",
        "/",
        "http://socialecology.uci.edu/pages/about-school",
        "http://socialecology.uci.edu/pages/about-school",
        "http://socialecology.uci.edu/pages/meet-dean",
        "http://socialecology.uci.edu/pages/school-leadership",
        "http://socialecology.uci.edu/pages/leap-ahead-social-ecologys-five-year-strategic-plan",
        "http://socialecology.uci.edu/pages/giving-priorities",
        "https://socialecology.uci.edu/pages/employment",
        "http://socialecology.uci.edu/pages/contact-us",
        "http://socialecology.uci.edu/pages/academics",
        "http://socialecology.uci.edu/pages/departments",
        "http://socialecology.uci.edu/pages/degree-programs-0",
        "/pages/online-graduate-degree-programs",
        "https://students.soceco.uci.edu/pages/environmental-changemakers-certificate",
        "http://socialecology.uci.edu/pages/research-social-ecology",
        "http://socialecology.uci.edu/pages/research-hubs",
        "http://socialecology.uci.edu/pages/research-centers-school-social-ecology",
        "http://socialecology.uci.edu/se-research-map",
        "/pages/research-resources",
        "http://socialecology.uci.edu/pages/people",
        "http://socialecology.uci.edu/faculty",
        "http://students.soceco.uci.edu/",
        "https://grads.soceco.uci.edu/",
        "http://socialecology.uci.edu/pages/alumni-and-friends",
        "https://socialecology.uci.edu/pages/contact-us",
        "/news",
        "/events",
        "/news",
        "http://socialecology.uci.edu/pages/e-newsletter",
        "/pages/embark-magazine",
        "/pages/videos",
        "http://socialecology.uci.edu/pages/faculty-and-student-accolades",
        "http://socialecology.uci.edu/pages/social-ecology-community",
        "http://socialecology.uci.edu/pages/regional-and-national-engagement",
        "http://socialecology.uci.edu/pages/global",
        "https://laborcenter.berkeley.edu/fossil-fuel-layoff/",
        "https://faculty.sites.uci.edu/virginiaparks/",
        "https://laborcenter.berkeley.edu/fossil-fuel-layoff/",
        "https://www.theatlantic.com/ideas/archive/2023/04/oil-refinery-workers-california-green-new-deal/673852/",
        "https://socialecology.uci.edu/news/uc-irvine-labor-center-opens-campus",
        "https://socialecology.uci.edu/pages/uci-labor-center",
        "https://youtu.be/TFWbDQOCtfw",
        "mailto:mcruz@uci.edu",
        "/news-category/features",
        "https://www.facebook.com/pages/UCI-School-of-Social-Ecology/174762852363",
        "https://twitter.com/Social_Ecology",
        "http://www.youtube.com/user/UCISocialEcology",
        "https://www.linkedin.com/company/university-of-california-irvine-school-of-social-ecology",
        "https://www.instagram.com/ucisoceco/",
        "https://www.flickr.com/photos/149310722@N02/albums/",
        "/pages/contact-us",
        "/pages/employment",
        "http://socialecology.uci.edu/pages/administrative-services",
        "http://www.uci.edu/",
        "http://uci.edu/copyright/",
        "http://computing.soceco.uci.edu/webforms/computing-services-request",
        "http://computing.soceco.uci.edu/pages/web-accessibility",
        "http://computing.soceco.uci.edu/webforms/request-website-login",
        "/user/login/ucinetid"
    ]
}