{
    "title": "Guide: 76 ways AI could transform WordPress | Human Made",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen main menu\n\n\nClose main menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWordPress download\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n76 ways AI could transform WordPress\nAs an open-source platform and the most popular CMS in the world, WordPress stands to be reshaped in the coming years as the true capabilities of AI continue to unfurl. Let's explore the possibilities.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe starting point for WordPress users exploring AI\n\n\n\n\n\n\nThe use cases for Natural Language Processing and AI in general seem endless, so it can be overwhelming to know where to begin. \nWe've been thinking about how to make the most of the ground-breaking new innovations that are freely available to us, and are predicting where the impacts will be felt most.\nIt's sure to inspire you to get head of the AI curve. Here's how we've been using AI... 👇\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGutenberg meets ChatGPT: an AI assistant that builds pages with WordPress blocks\n\n\n\n\n\n\nWe've already been working on what the next stages of the WordPress block editor could look like, infused with the power of AI. With this WordPress \"Copilot\", we've made it so that ChatGPT can speak to and control Gutenberg blocks. \nThe possibilities are huge. And we're just getting started.\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe’ve included innovations that are already happening, as well as speculative ideas, and we haven’t shied away from the challenges this tech will bring. \nSpoiler: it’s not all going to be upside.  \n \nJoe Hoyle, CTO, Human Made\n\n\n\n\n\n\n\n\n\n\n\n\n Download guide \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n © 2010–2023 Human Made Limited | Privacy Policy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://humanmade.com?hsLang=en",
        "#report-form",
        "https://humanmade.com?hsLang=en",
        "https://humanmade.com/privacy/?hsLang=en"
    ]
}