{
    "title": "Priced Out of API Access: Jetpack and WordPress.com Discontinue Support for Twitter Auto-Sharing – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nMay 1, 2023\nSarah Gooding\nPriced Out of API Access: Jetpack and WordPress.com Discontinue Support for Twitter Auto-Sharing\n\nJetpack and WordPress.com announced they will no longer support the Twitter API in their products. Last month Twitter suspended WordPress.com’s access to its API, which broke Jetpack Social Sharing – the mechanism that auto-tweets published posts. \nAlthough WordPress.com’s access to the API was reinstated for a few weeks, the company has now been priced out of offering features that rely on Twitter’s API:\n\nTwitter recently notified Automattic that it was dramatically changing the terms and pricing of the Twitter API. The cost increase is prohibitive for us to absorb without passing a significant price increase along to you, and we don’t see that as an option. We have attempted to negotiate a path forward, but haven’t been able to reach an agreement in time for Twitter’s May 1 cutoff. \nGiven that, we have decided to discontinue using the Twitter API.\n\nWordPress.com did not detail its estimated API usage, but Enterprise access starts at $42,000/month for 50 million tweets and scales upwards based on usage, with 100 million tweets priced at $125,000/month and 200 million priced at $210,000 per month. This astronomical price increase will swiftly cull many applications, institutions, and large scale publishers that don’t have an extra $500k/year – $2.5M/year in the budget for Twitter API access.\nIn October 2022, Jetpack started monetizing this feature with a paid plan that limited the free version to 30 social shares per month (to any social network), a controversial decision that sent many users in search of alternatives. Passing the cost to the customer here was already beyond what most users wanted to pay for these features and is not sustainable.\nWordPress.com will be removing Twitter from Jetpack Social and refocusing its efforts on other social media sharing capabilities. The company is adding Instagram and Mastodon to its auto-sharing lineup soon. Auto-sharing for Tumblr, Facebook, and LinkedIn still works. \nStarting, today, users who want to share their published posts on Twitter will need to share the link manually through the Twitter app. For clarification, sharing posts by clicking the Tweet button will continue working. This change only affects auto-sharing.\nThe massive increase in API pricing has competitors fired up to support users migrating away from Twitter. Automattic, which also owns Tumblr, took a stab at Twitter in the conclusion of the announcement: “If your recent experiences with Twitter have left you dissatisfied, go take Tumblr for a spin — we hear it’s quite a party over there.”\nIn February, Mastodon promised that the platform would never charge for API access. After Automattic’s announcement today, Mastodon tweeted they are excited to see the company expanding support for the platform in Jetpack.\n\nMany of Twitter's most recognizable features were invented in third-party apps, and we're thrilled to see what those developers are now doing with Mastodon. Powered by open source, we can promise: Mastodon will never charge for API access!— Mastodon (@Mastodon@mastodon.social) (@joinmastodon) February 3, 2023\n\nTwitter may be shooting itself in the foot by making it more costly, in terms of time and automation, to have incoming content from the open web. It’s becoming more cumbersome for publishers to share their content. This has further aggravated Twitter’s user base who is used to coming to the platform for up-to-the-minute news. Too many smaller apps are now priced out of providing these kinds of updates. Some users have started encouraging their followers to follow them on other networks to be alerted when posts are published.\n“This is an example of the minor annoyances that will ultimately make people look for alternatives to Twitter,” WordPress.com user @MoviesSilently said. “Frictionless sharing isn’t a make or break but it’s nice.”\n\nI guess I need to go fire up my Tumblr account again or make a new one, and possibly see what Mastadon is all about. I'm not getting any reach on Twitter anyway.— MUDPIX OUTDOORS (@mudpiix) April 29, 2023\n\nToday’s news has added to users’ compounding disappointment with Twitter. Not only has it is become more costly to have an active voice but advertising has a stranglehold on the feed. As major brands have ceased advertising on the platform, the quality of ads has declined to where scrolling the app has become like wading through a flea market. Twitter users may soon be in for more changes to their feeds as any content originating from WordPress.com or Jetpack-powered sites will require a manual share to be found on the platform.\nCategory: NewsTags: twitterShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n1\n\n\n\n\t\tOne response to “Priced Out of API Access: Jetpack and WordPress.com Discontinue Support for Twitter Auto-Sharing”\t\n\n\n\n\n\n\n\n\n\n Kev Provance says: \n\nMay 1, 2023 at 11:01 PM \n\n\nTHirty free social shares a month? Where? When? I get fifteen. If that. Thirty, indeed. Charging for something that used to be free was pretty week, IMHO.\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Notify me of follow-up comments by email. Notify me of new posts by email. \n\n Join the discussion via emailGet only replies to your comment, the best of the rest, as well as a daily recap of all comments on this post. No more than a few emails daily, which you can reply to/unsubscribe from directly from your inbox.Δ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nYou may also like\nTwitter Suspends WordPress.com’s Access to Twitter API, Breaking Jetpack Social SharingApril 4, 2023WordPress.com Developer Site Gets a Fresh Look and Updated DocumentationMarch 18, 2014Automattic’s WordAds Network is Now Open to Self-Hosted WordPress SitesDecember 29, 2015\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://wordpress.com/blog/2023/04/29/why-twitter-auto-sharing-is-coming-to-an-end/",
        "https://wptavern.com/twitter-suspends-wordpress-coms-access-to-twitter-api-breaking-jetpack-social-sharing",
        "https://www.wired.com/story/twitter-data-api-prices-out-nearly-everyone/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month",
        "https://www.tumblr.com/",
        "https://twitter.com/joinmastodon/status/1652511061352800259",
        "https://twitter.com/joinmastodon/status/1621331792019030016?ref_src=twsrc%5Etfw",
        "https://twitter.com/pianodao/status/1652587846690111488",
        "https://twitter.com/mudpiix/status/1652436811556306944?ref_src=twsrc%5Etfw",
        "https://twitter.com/wordpressdotcom/status/1652424620069330946/retweets/with_comments",
        "https://wptavern.com/category/news",
        "https://wptavern.com/tag/twitter",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?share=twitter",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?share=mastodon",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?share=facebook",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?share=telegram",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?share=jetpack-whatsapp",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?share=pocket",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20Priced%20Out%20of%20API%20Access%3A%20Jetpack%20and%20WordPress.com%20Discontinue%20Support%20for%20Twitter%20Auto-Sharing&body=https%3A%2F%2Fwptavern.com%2Fpriced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing&share=email",
        "https://www.kevinprovance.com",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing#comment-438812",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing?replytocom=438812#respond",
        "/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing#respond",
        "https://akismet.com/privacy/",
        "https://wptavern.com/twitter-suspends-wordpress-coms-access-to-twitter-api-breaking-jetpack-social-sharing",
        "https://wptavern.com/twitter-suspends-wordpress-coms-access-to-twitter-api-breaking-jetpack-social-sharing",
        "https://wptavern.com/wordpress-com-developer-site-gets-a-fresh-look-and-updated-documentation",
        "https://wptavern.com/wordpress-com-developer-site-gets-a-fresh-look-and-updated-documentation",
        "https://wptavern.com/automattics-wordads-network-is-now-open-to-self-hosted-wordpress-sites",
        "https://wptavern.com/automattics-wordads-network-is-now-open-to-self-hosted-wordpress-sites",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge"
    ]
}