{
    "title": "#67 – Talisha Lewallen on How CertifyWP Is Hoping To Offer WordPress Certification – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\n\nMarch 15, 2023\nNathan Wrigley\n#67 – Talisha Lewallen on How CertifyWP Is Hoping To Offer WordPress Certification\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tJukebox\t\t\t\t\t\n#67 – Talisha Lewallen on How CertifyWP Is Hoping To Offer WordPress Certification\n\n\n\n\nPlay Episode\n\n\nPause Episode\n\n\n\n\n\n\n\n\n\n\n\n\n\nMute/Unmute Episode\n\n\nRewind 10 Seconds\n\n1x\n\nFast Forward 30 seconds\n\n\n\n00:00\n/\n\n00:41:57\n\n\n\n\n\nSubscribe\nShare\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tApple Podcasts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tSpotify\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\tRSS Feed\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tShare\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tLink\t\t\t\t\n\n\n\n\n\n\n\n\t\t\t\t\tEmbed\t\t\t\t\n\n\n\n\n\n\n\n\nDownload file | Play in new window | Duration: 00:41:57 | Recorded on March 15, 2023Subscribe: Apple Podcasts | Spotify\n\n\n\nTranscript\n[00:00:00] Nathan Wrigley: Welcome to the Jukebox podcast from WP Tavern. My name is Nathan Wrigley.\nJukebox is a podcast which is dedicated to all things WordPress. The people, the events, the plugins, the blocks, the themes, and in this case, what a WordPress certification might look like.\nIf you’d like to subscribe to the podcast, you can do that by searching for WP Tavern in your podcast, player of choice, or by going to WPTavern.com forward slash feed forward slash podcast. And you can copy that URL into most podcast players.\nIf you have a topic that you’d like us to feature on the podcast, I’m keen to hear from you, and hopefully get you all your ideas featured on the show.\nHead to WPTavern.com forward slash contact forward slash jukebox, and you use the form there.\nSo on the podcast today we have Talisha Lewallen.\nYou might have found your way into WordPress intentionally, or perhaps you stumbled across it and decided to explore further. Whichever it was, you’ve learned things along the way. Some of it might have been through training, but there’s likely been some self discovery on the way as well.\nPerhaps you’re a coder, or a designer. In fact, there are dozens of different pathways in the WordPress ecosystem. Given the broad range of knowledge you might possess, how can you prove that you know what you know?\nMany industries provide training programs which, when completed successfully, allow you to assert that you were competent in a given area. You’d want your lawyer or surgeon to have passed through the appropriate programs of study, so that they’re equipped to do the work.\nWith WordPress being such a dominant force in the world of websites. Would it be a good idea to have a certification for WordPress? Talisha certainly thinks so, and has founded CertifyWP to try to make that happen.\nWe approach this subject through the work that she’s been doing at WPConnects, in which she’s been trying to provide training to military veterans, so that on the departure from the services they have the prospect of finding work in the WordPress space.\nWe talk about whether there’s a need for certification for WordPress and how such a certification would come about. What levels of training does Talisha see as essential, and how many such layers might there be?\nWe discuss whether the WordPress community is ready for a third party to be certifying people’s abilities, and whether this strays away from the approach that we’ve had so far in which routes into employment have relied on other, less formal, methods.\nLater in the podcast, we talk about the structure of CertifyWP, and who’s behind the project. You’ll hear that it’s not just Talisha. There’s quite a few members of the WordPress community who want this project to succeed.\nIf you’re curious about certifications in the WordPress space, this podcast is for you.\nIf you’re interested in finding out more, you can find all the links in the show notes by heading to WPTavern.com forward slash podcast, where you’ll find all the other episodes as well.\nAnd so without further delay, I bring you Talisha Lewallen.\nI am joined on the podcast today by Talisha Lewallen, Hello Talisha.\n[00:04:00] Talisha Lewallen: Hi Nathan.\n[00:04:02] Nathan Wrigley: Very nice to meet with you. You’re welcome on the podcast. Thank you for joining us. Would you mind just introducing yourself and give us some indication of what you do, perhaps who you work for, and how come you are in any way connected with WordPress?\n[00:04:18] Talisha Lewallen: Yes. I am Talisha Lewallen. And I am the owner of WPConnects, which is a company that helps US military veterans or really any veterans, but helps them receive training while they’re active duty, and then when they’re separating from the military we provide them with mentors and help them find employment within WordPress.\nAnd then I’ve also started this new venture with some very amazing people within the WordPress community called CertifyWP Foundation. And that is where we are creating a couple of WordPress credentials.\n[00:04:51] Nathan Wrigley: So we’re going to talk about both of those endeavors today, but I think probably the correct road into both of those subjects is if we begin with WPConnects. Now, you mentioned that this is a company that you are the founder of. It’s got a mission, it’s connected with the military, but in broad outline really, it’s a, it’s an endeavor to connect people who are looking for work and are in need of guidance. Do you just want to tell us how all this started and what really the bedrock, the core philosophy is, and who you are helping and how you are helping?\n[00:05:26] Talisha Lewallen: Yeah. So I worked at Post Status for a little while, and while we were over there, we kept hearing a lot of people state that they really needed some trained WordPress developers and employees. And so that really got us thinking, you know, it’s one of those twist of fate things, that we ran into a gentleman named Hector who has a similar company to WPConnects.\nAnd he’s definitely been a very big mentor to me. So when service members go in and sign up to join the military, a lot of times they’ve never had an interview, they’ve never had job experience, they’re literally just starting their career. Well, when they get out there are transferable skills, but not a lot employers are looking for, if that makes sense. So we want to provide them with, it’s called transitioning assistance. And we want to provide them with that training and so it helps them transition into the civilian sector a lot easier. There’s different skills that, you know, we do over here. And then we’re training them for WordPress front end and backend development.\nAnd if they wanted to do anything else in WordPress. You know, it’s really expanding past just developer careers. And so we’re just really helping them find the right connections, along with mentors who have been where they’ve been and can help them transition and really just know that experience.\nAnd so it really just comes from a place of, I have several members in my family that were in the military, and seeing them transition out of the military was kind of hard. I took the general route over here and I went to high school, college and then started my professional career and seeing my family members and friends join the military, and then when they get out and they had these amazing jobs in the military. They had all of this training and then they get out and they can’t even get a job.\nI heard one of my friends tell me the story of a gentleman who was a military police officer and couldn’t get a job as a police officer here in the States. And it’s because he didn’t have, in that town, you had to have an associate’s degree. So he didn’t have the training to become a police officer when that’s all he did for 10 years in the military, was be a police officer.\nAnd so it’s very interesting to see the skills that they have and the jobs that these men and women have had, and then transferring it into civilian life. It’s just not, or hasn’t been there. They’ve just been struggling to find these employment. And so we’re really just reaching out a hand and saying, let us help you and let us get you introduced to these amazing people inside of WordPress. WordPress has the best community that I have ever been a part of, and so it really just seems like a good fit for them.\n[00:08:04] Nathan Wrigley: Can I ask, do you give them a curriculum which they follow? In other words, have you mapped out, in the same way that a university may do, you know, you’d attend a university and you would fully expect that they would provide you with the course and they’re not just making it up on the fly? Or is it more working with them to try and figure out what they need? It might be a mixture of both. I don’t know.\n[00:08:25] Talisha Lewallen: Yeah, so how we do it, we have three pathways right now. And this is what makes WPConnects very unique, even within the military training field. So there’s a saying in the military that’s crawl, walk, run. So you’re not just going to get something and immediately start running. So our steps for crawl, walk, run are these three pathways.\nThe first one is the credentialing assistance program. Active duty and reserve military personnel are able to take a credential and it is funded through the military, so it does not cost them a dime. And they’re able to take this training. So we currently have the web foundation associate credential. And this is also where CertifyWP comes in.\nSo currently we’re using that WFA course. So once they complete that and they decide to transition out of the military. It could be the next month, whenever their service contract’s up. It can be two, three years later. Whenever they are transitioning out in the last 180 days of their service contract, they can join what’s called a Skill Bridge program.\nSo we also have a WordPress Skill Bridge program. This program is an instructor-led 12 week course. And it’s all over the US. We do it over Zoom, and we’re looking at a few other platforms. But again, it’s that instructor is there. There is a curriculum, and they are learning how to, mostly that one is backend development, is what they’re learning currently.\nAnd then whenever they finish that, we just opened up an apprenticeship program in Texas. And we’re about to open one in Oklahoma. And so it’s just this three step process. The apprenticeship program, they have certain skills that they will acquire throughout the year long apprenticeship program. And then they are 100% ready to be employed and be able to do any job that they’re really wanting to do, because we will give them that individualized skill.\nAnd through all of that, they have a mentor that they can reach out to, and the mentors reach out to them and just help them with anything they’re struggling with or have questions about. There’s different terminology that we use in civilian life than they’ve used in the military. And so really that person’s just to be there, to just have a helping hand.\nBut yeah, it’s a little bit of both. We have a pathway, we have curriculum. And we do change our curriculum. We get feedback from other people within WordPress. Nikki with Liquid Web has been the biggest help for our Skill Bridge program. She comes through and interviews and mock interviews just about every person we have in our programs and helps give us feedback so we can help them gain those interview skills. We have them write a resume and then I go through and help them work on their resume, so then they have that resume whenever they get out as well.\n[00:10:59] Nathan Wrigley: I guess if you are in a different industry, there may already have been for a great deal of time, there may have been institutions or pathways like this already set up. You mentioned the example there of the police and that pathway not really working out. But presumably there are other ways that people leaving the military can go and there’s things that are already concrete. Institutions that they can join. Companies that they can join. Programs that they can go through. But not in the WordPress space.\nAnd given WordPress’ 43, and counting, percent share of the internet, it’s a really credible career to go in, but it’s a difficult thing to, I would imagine, to even understand. If you’ve never touched the internet before, apart from being a user and a consumer of the web, you may have no skills or whatsoever.\nSo I’m guessing it’s bridging that gap. Trying to persuade people that actually there’s a job in here. It’s an in demand job. Can be well paid and a good career path, and there’s a nice community behind it all as well.\n[00:11:57] Talisha Lewallen: Right. And you know, we have some people that are literally, I’ve never touched a computer before. But we also have people that come through the program that have been a part of the satellite operations within the military, or have done tech in the military. But getting that pathway to employment is what they really need. And learning WordPress. There’s a lot that goes into WordPress that we want our individuals to learn and that will help them grow within whatever job they decide to do. But yeah, so we have two opposite ends of the spectrum usually. We have the ones that have a ton of tech experience, or the ones that have no tech experience.\n[00:12:33] Nathan Wrigley: So that was a really nice introduction into the why really, for the next bit of the podcast, which I think will consume the rest of the show. So we’re going to talk now, instead of talking about WPConnects, we’re going to talk about credentialing in the WordPress space. And maybe I’ll begin this way.\nIf I were to attend a university that everybody’s heard of, let’s say I’ve been to, I don’t know, Harvard or Cambridge or somewhere like that. That credential that you hold, it’s a real passport. Everybody understands what that means, and you present it to employers and they get, okay. Right, you’ve been to a university, we know what that university is about. We understand that it’s been around for a while and, that’s a credible piece of paper that you are holding. But curiously, in the tech space, there are things like this, but specifically in the WordPress space, there’s nothing like this.\nThere’s a great big hole there, isn’t there? So people who wish to be employed, going to an employer, you really are relying on testimonials, the CV, the reputation that you’ve got from your previous employer, and the letters that they may write on your behalf. But there’s no bit of paper that you can hold, going in cold, to say, I’ve done this. Look, there it is. It’s certifiable. This is what I’ve achieved.\n[00:13:51] Talisha Lewallen: Yes. And you know, that’s what we’re kind of finding out on both ways. Having a credential helps both employers and people looking for employment, especially within the WordPress space, without having that credential. There’s a lot of people that I would say could very well do certain jobs. But because there’s not that level of credentialing and there’s not that standard education.\nWhat does a WordPress developer mean? What can you do if you say you’re a WordPress developer? And that’s what a lot of companies are running into. So it really is almost word of mouth. Sometimes I feel like I should say that it’s almost word of mouth for you to get hired, because somebody’s worked with you and knows your level of skill. If you’re new to the WordPress space, it could possibly be harder to find a job because nobody knows who you are, your work ethic and what your skillset is.\n[00:14:39] Nathan Wrigley: Yeah. So that’s the premise behind all of this. So I guess I should ask at the beginning, what level are you going in at? Because really in the WordPress space, we could probably come up with 50 curricular that people could follow, probably more. We could have things on the hosting side, speed optimization, SEO, backend WordPress. The sky’s the limit, but I’m presuming. That in the scenario that you are dealing with, mainly it’s getting started?\n[00:15:08] Talisha Lewallen: You know, that’s the interesting thing. So we, so we have the advisory board. I should say, whenever I first decided this is something I want to do, I really want to make this credential. I reached out to several people, because I kept hearing nos and yeses, and so we put together a team of an advisory board and we had this conversation.\nBecause originally I was thinking about one credential, that would have three tiers. So now we’ve decided on two. We’re going to have a front end developer credential and the backend developer credential. So each one will have three tiers. So it starts at base level of here’s how I download a WordPress. This is how I can add admins. This is how I do, you know, very, very basic.\nThen there’s the next level, and then there’s the expert level. So to obtain the credential, you must pass, it’s either one cumulative exam, or you could take it with each course. So you take that exam that has all three tiers of those, and that’s how you obtain that credential.\nAnd that’ll be on the backend credential too. It’ll have that three tiers again, crawl, walk, run. We’re not going to expect you to be able to do it if you’ve never been taught the why behind it. So with that being said, one conversation that I had with a gentleman was, well, you know, it almost turned into some people can take tests, but some people can’t. That doesn’t mean that they’re able to do the job. And I said exactly, and that’s where we are trying to find a way. It’s still, still alluding me a little bit, but we are trying to find a way to have a practical part to the exam, in the top two tiers.\nThe first tier exam probably will just be question and answer type exam. But in that expert level, I want there to be a practical part of it. To have people show that, yes, I did learn how to master this skill. And yes, I can do this. And so I think that that’ll help. Also with the credential and why it’s, I think, beneficial to WordPress is, you know, WordPress changes sometimes.\nWe have big changes, we have small changes. So there’s a certification that you can take. And that can just be a course. Anybody can come up with a course. I could just go to my back room and be like, this is what I think somebody should know for WordPress and create this certification.\nAnd then I never have to re-certify. I never have to go back in and show that my knowledge has not waned, or that I do still know what I’m doing, and still have that level, just standard level of education. With a credential, there is an advisory board and a board of directors and you have to re-certify every three years, to show that you are still maintaining that knowledge. So it’s not 10 years down the road, oh look, I took this and I’m still here. You’re able to show that you still maintain that level of credentialing.\n[00:17:53] Nathan Wrigley: That’s an industry practice that I’ve seen before, especially in things like networking. And I mean networking in the sense of cables and connecting routers. The organizations often behind that will require you to come back after a given period of time and re-certify yourself. Just because otherwise that credential kind of loses all meaning, because the technology itself has moved on so far in the three, four however many years. That if you claim to know from 10 years ago what’s required to be known today, there could be a complete mismatch. Okay, that’s really interesting to know.\n[00:18:25] Talisha Lewallen: There’s been a lot of thought that went into this credentialing. Along with having, you know, just what I would consider WordPress experts that are being there and really talking about what they feel somebody should know in the WordPress for each level of the credentialing.\nBut, let’s see. I think JavaScript has a credential that you have to re-certify. If you’re a nurse, here in the US you have to re-certify your knowledge. Car mechanics. You know, so there’s a lot of credentialing out there in every industry that does have that continuing education piece. Just because things do change, the world changes so much, and it’s very beneficial.\n[00:18:58] Nathan Wrigley: So given that you are hoping to find people who wish to take these credentials. Is it open to anybody? We know that your background was connecting with people leaving the military. Is the intention of CertifyWP, and of course I should have mentioned the URL. The URL that you’ll go to, which of course I’ll put in the the show notes is certifywp.com, as you’d imagine, it’s all spelled in the typical way. No, no underscores or anything like that. Is the intention that these certifications will be open to everybody? Or is there a subset of people? What’s the audience for this?\n[00:19:37] Talisha Lewallen: So the audience for the credential is everybody. CertifywP is for anybody and everybody to take. Our hope would be that companies start looking at their credential and stating that, yes, I want to hire people that have this credential because we know they have this baseline education. So it is open to every single person.\nThe baseline, the level one certifications I hope to get into some smaller communities. I live here in Oklahoma and so there’s a lot of Indian capital technology centers and stuff like that, that I would really like them to start taking these credentials and really trying to help the minority groups get more into WordPress as well.\nBut one thing that has confused a lot of people, and I have to say that this is definitely my fault. I expect everybody to be on my brainwave sometimes. The mention of the DoD, the Department of Defense has thrown a lot of people off. And so they think that this is just a credential for the military and that is really the farthest from it.\nAnd I just have not fully been able to explain that to everybody. But the DoD approving the credential comes in for WPConnects, so that we can train our military. Instead of using that web foundation associate credential, we will use our WordPress credentialing to train them. So they will be trained from the bottom up in WordPress. So that’s where that has came in. But CertifyWP is open to everybody to take.\n[00:21:03] Nathan Wrigley: Okay, so just to clarify that. There was a hoop that you had to jump through in order to receive money from the government to train people from the military, but the training is ostensibly the same, but there’s that slightly strange mixed messaging there. Have I parsed that right?\n[00:21:20] Talisha Lewallen: Yes, yeah. And that’s all it is, is for our military members to be able to take the training where the government pays for it. They have educational grants and stipends in the Army and Air Force, especially here in the US that they don’t have to take those, they don’t have to pay for those credentialing. So for us, for them to be able to use those monies, our credential has to be approved through the DoD.\n[00:21:43] Nathan Wrigley: Speaking of money, that’s an interesting segue for a minute. Is the intention for this then to have a fee bound to it? In other words, if you want to take this credential and receive the training materials and the time of the tutors and all of that, that there’ll be a fee attached to it? And, if that’s the case, do you have plans to have scholarships and things like that? Is there any of that afoot even as an idea?\n[00:22:07] Talisha Lewallen: Yes. That’s, you know, partly why we actually turned CertifyWP into a nonprofit, is so that we can offer those scholarships. For the credential to be, I almost want to be, say accepted into definitely DoD standards. But if we ever get it accredited, either, there has to be certain qualifications that credentialing meets.\nSo we’re trying to set up CertifyWP credentials to meet the qualifications for, one, the DoD, but also if we ever do decide to get it accredited. And one of them is that it has to meet the standard for financial costs. So, I think there’s even a PHP credential, but the other tech credentials out there, ours will have to match that price.\nBut we are going to be able to scholarship people in. That is definitely our hope. Because again, we don’t want this to be a gatekeeping thing of you have to pay to play. Not everybody can do that. And so we definitely want to work with people and companies on just trying to get this credential out to the community and making it affordable for every person.\nAnd there are ways to do that. The board hasn’t fully decided on one and cost has not even been mentioned yet, just other than the fact that we have to have one and it has to meet an industry standard. But yes, definitely trying to find a way to cut costs down for just the regular person is something that we are looking at, because it can be, they can be quite expensive. And I know that that’s been a talk within, that I’ve seen in the Post Status Slack channels before. Whenever somebody moved CertifyWP into one of the channels, somebody was like, oh, here we go, gatekeeping. And oh, it’s going to cost so much and stuff like that.\nAnd it’s a very good concern and conversation to have. But our whole intention, and I don’t want to speak for everybody on the board or advisory board, but isn’t to keep it away from people. We want everybody to be able to take it. So we are finding ways to really scholarship and bring people in.\n[00:24:01] Nathan Wrigley: So we’ve talked about the audience, well, one of the audiences or one of the, one of the spokes of the wheel, if you like, for you. But of course there’s another side to this, and I’m, imagining that you really are a bridge between the people who want to be certified and the people who subsequently want to receive the wisdom that you’ve given them, the certification.\nIn other words, the employers, the people who are going to be employing the people out the other end. And presumably that’s going to be a challenge that you’re going to face as well, is convincing businesses that look the certificate that we’ve given them the certification that they’ve gone through and achieved actually means something. And I’m guessing there’s going to be quite a lot of your time spent making those people aware that it really is bonafide.\n[00:24:46] Talisha Lewallen: Yes. That’s where having the DoD backing, and also possibly getting it accredited shows that this is a real credential. There are people out there that do see that this credential is a massive benefit. So with that, for us there’s different ways to get it DoD approved, I should say.\nAnd the easiest way is to have community buy-in. So having those companies state that yes, I do see a need for this education level and to have credentialing. So that’s where on the website we have the endorsement letters. And I know Sophia Desrosiers has been making some phone calls and we have a couple of people that have been reaching out to companies and explaining what we’re really doing.\nBecause we’re trying to get those endorsement letters because that will help us get it DoD approved. It’s just showing that there is a need in the community for a credential. Not even our credential. It’s one of those fun little things, but it’s just saying that there is a need in the community.\nAnd I definitely think once we get our credentials up and running and people start seeing what we have in there, and the education. I really think that a lot of companies will come around to it. The ones that I’ve talked to so far, I talked to one that was a little hesitant and I love that he booked a meeting with me and talked to me about his concerns, and that I was able to, I don’t want to say that I argued my point, just was able to genuinely share what we are trying to do at CertifyWP, which is just to make a community built and maintain credential.\nAnd he ended up signing our endorsement letter, and I absolutely loved it. But I loved that space to be able to fully explain what we’re doing and how we’re setting up the credential to really benefit not only employers, but the job seeker.\n[00:26:29] Nathan Wrigley: It’s a virtuous cycle in a way, isn’t it? In that if you get people on board and you can take them through the whole process and then they are ultimately employed, and the employers are happy that they can hit the ground running at whatever level that may be. That has a sort of feedback loop to it, doesn’t it?\nAfter a period of time, the employers will broadcast that message. It will presumably encourage people who are looking for a way to be certified in tech, to hop on board and on it goes. So yeah, that’s going to quite an important part. So you are reaching out to those people and you’re hoping to get some more on board to bolster the whole enterprise.\n[00:27:07] Talisha Lewallen: Yeah, we definitely need more endorsement letters from the community. It could be individuals or companies. The companies are what really the DoD is looking for. But just showing the need in the community. And like I said, I’ve talked to quite a few either hiring managers or companies that have sat here and said, you know, I put out a job description and I need a WordPress developer. And then I pay them the salary and they come in and they can’t do what we need them to do.\nBut on their resume it looked fine. And they were able to say these things, but they didn’t have the education that they needed. So then it costs the company more money to have to train this person to be able to get them up to this level, to where if we are able to train them and then you’re able to hire them, and you know they passed this, I hate to say they passed the test, but they’re able to show that their competency is there. It saves companies time and money on hiring.\n[00:28:00] Nathan Wrigley: Speaking of the test, you mentioned that in some scenarios it may be like a written paper or something like that, but presumably the higher up you go on the ladder of difficulty, the more need there will be for practical implementations. And you said that there was still room to be, you’re still trying to figure all that out, and work out what that path might be, but I guess that’d be an interesting subject to pause on for a moment.\nWhat are your thoughts around that? Testing in some kind of platform that allows you to do code examples on the screen, live. Those kind of things. Just essentially making sure that it’s legit, it’s bonafide, and that the people that are doing it are actually doing it. You could be bringing them into test centres. There’s all sorts of permutations here, isn’t there?\n[00:28:41] Talisha Lewallen: Exactly. And that’s where, right now, I’m looking at LMSs, Learning Management Systems to put the coursework, but also the exam on. And so I’ve been talking a lot with these companies about what this exam could look like with this practical application. And what I hear a lot, and even this has been suggested in conversations with the advisory board is almost having like a capstone, or a project that they complete after they take the written assessment. In having this practical that they turn in.\nAnd that is always an option, and we might have to go to that. I’m leery about that because then we will have to train and hire people to look at these capstone projects if you will. And determine if somebody has passed or failed it. And so then you run into, well maybe I got somebody that graded my capstone or my project harder than person B.\nI really shy away from that type of stuff and I’d rather have it be computer generated. It’s unbiased. There’s just so many ways you can set that up to where there’s not that fault in there. So definitely the back end and coding one, there will be sides once you get higher up for you to actually code. I’m not a coder, so I don’t want to sit here and use terminology that I don’t understand myself.\nBut there is that practical part in there where you’re actually going to go in there and you’re going to do it. The front end side’s going to look, you know, a little bit differently, but still, I’m not a test taker, but I can perform the task and I can do the job generally.\nBut then you have other people, and I always use the example of my sister. I love her to death. She’s very, very smart. And she could take a test like nobody’s business, but that doesn’t always mean that she can do the work that she just tested on. It just means that she can have really good memory recollection. But doing the task is not something that is there all the time.\nAnd so we really want to hit both sides. As well as companies having the confidence that when they hire somebody with this credential, they know that they passed the practical part and they can do it. And so it’s really just trying to find out the best, we’ll say best, most efficient, cost effective way to really have this and what is best for everybody.\nBecause what I really don’t want to get into is somebody sitting there and saying, well, I didn’t pass the exam because of, you know, X, Y, Z. And it ended up, it could have been human error. Computers have errors too, and we can work with that. But I just want to take the human error side out of it.\n[00:31:07] Nathan Wrigley: I can imagine there’s going to be a subset of people listening to this podcast who will be thinking there should be no canonical certification in WordPress. We should be open to go wherever we choose. It feels like you would like this to have some sort of backing, if you like. Community backing, if nothing else. Not necessarily official backing. But you’d like this to become a baseline. Something that anybody can aspire to, and anybody can see within the community that this is something which represents a decent beginning if you like.\nNot really sure I’ve phrased that question particularly well, but what I’m trying to say is that there’s going to be some people who say, why do we need this? What’s the point when we’ve been getting along just fine for many, many years? We don’t want one player dominating the market in accreditation and certifications. So we’ll just speak to that for a minute.\n[00:32:00] Talisha Lewallen: Yeah. I’ve had this conversation, it actually might have been on Bob’s podcast. And through a conversation that I had with somebody else, it got brought up to why CertifyWP. Why should a third party be able to have this credentialing instead of either the hosting companies or Automattic themselves, whichever way you want to look at it.\nWhy should this third party be able to do it? And my answer is always, why not? We are able to have this just absolutely community built and maintained. I think it gives us the freedom is what I should say. It gives us the freedom to be able to keep it unbiased as possible, to where it benefits the most people that we can.\nNot everybody’s going to be happy with it, no matter what we do, and that’s fine. We’re here to help the most people that we can. So having it community built and maintained just allows for a little bit more freedom to get the information that we see as a community that people need to learn, and have to be able to do the jobs that we are hiring them for, or that we want them to do.\nAnd so my example, if you go onto Fiverr, and again, I’m not dissing anybody that works on Fiverr or does websites. It is a great platform for you to be able to get contract work. But when you look on there and you look at a WordPress developer, I need a WordPress website. There are, I mean, it seems like thousands of people out there that are like, oh, I’m a WordPress expert.\nAnd I even saw a couple that were I’m certified in WordPress. And I’m like, no you’re not, because there’s not one. It’s one of those that people that are just an average Joe that’s trying to get their website built is not going to know about the community. That we don’t already have this certification. That we don’t already have all of this baseline knowledge. They’re not going to know.\nAnd so this credential allows even contractors to hire the right person and know that they have been certified, and that they know what they’re doing and they know what they’re going to get out of the product based off of that. So it really, it’s really just this, I keep going back to community built and maintained, because I want, I really want everybody to know it’s not us sitting here saying that, oh, we have the master knowledge and we, we know what everybody needs, because we don’t.\nAnd that’s where we are willing to hear your side and your opinion and really build the credential that the community needs and is going to use and finds the most benefit out of. We’re coming from a very big place of love and light and you know, trying just to help. And you know, that’s just really where we’re at at this point.\n[00:34:28] Nathan Wrigley: With that conversation in mind, have you had any collisions with the use of WordPress, because obviously WordPress, the word is a trademark. I noticed that you’re calling it CertifyWP, so you’ve, you’ve sidestep that one, but I wonder if there are any collisions there that need to be avoided.\n[00:34:49] Talisha Lewallen: So, so far, I’ll say now, we have been in contact with Josepha and Matt Mullenweg has been on some email chains. I have not personally got to speak to Matt about these, but Michelle Frechette, fantastic woman, and saves my life every day, I swear. Michelle, and myself had a meeting with Josepha and we sat down and we explained what we are trying to, and it really, I mean it was a very positive conversation in my opinion.\nAnd so it was never brought up that, I’d hate to say that, you know, we get trademark or you know, cease and desist, but it was really, they were just trying to figure out where they wanted their position to be and that they would get back to us.\nAnd that was around December and, you know, you got to love the holidays and everything else. But so far, no. But we are definitely wanting to also work with everybody with inside WordPress. So we would never want to do anything that Matt or Josepha would think that was not appropriate to the point of wanting us to cease and desist or whatever else.\nAnd I also know that there’s another company, I don’t know if it’s public knowledge, so I don’t want to just like throw it out there. But there is another company that is building or hoping to build a top tier credential. So it would be like our credentialing, and then you would be able to take theirs.\nAnd that would allow participants who had that credential to be hired by these absolutely massive corporations that are in WordPress. There are very large companies that use WordPress and they need a certain type of developer and security knowledge. And so that level of credentialing would take it one step above ours.\nAnd since that company works with those high level companies, they would be the best fit to be able to create that level of credentialing. I mean, that’s the fun thing. The credentialing is coming. It’s been talked about a lot and I’m excited for the growth. I’m excited for the next couple of years to see where these credentials really take us as a community. But yeah, no, so far the conversations we’ve had with, I’ll say the powers that be, have been very positive.\n[00:36:50] Nathan Wrigley: Okay. It’s just nice to hear that you’ve had those conversations because obviously that would be an area of, uh, of concern if you hadn’t, so at least that, that’s been put on the table, shall we say. You mentioned community a few times there, and it might be an interesting moment just to wrap this up to talk about the people that are involved and what have you.\nSo, Talisha, there’s obviously you. But you’ve got a whole bunch of other people on board. Do you just want to give us a bit of a name drop on who’s involved so far. And I guess an ancillary question to that is, are you still open for other people to join and lead certain areas, and be involved? Is this still a group which is welcoming community members in to help?\n[00:37:30] Talisha Lewallen: Yes. So right now our advisory board and I always say this like, oh, sorry if I forget anybody. I always feel so bad. Because we have added people on in the last little bit. So we have Courtney Robertson, we have Gabriel Cohen of PMC. Jess Frick from Pressable. Michelle Frechette, love her. And we also have Nikki Bulmer. So they’re both from the Liquid Web brand. And then we have Robbie Adair with OS Training, and we just brought on Zach Stepek, and we brought him on because once we started talking about, okay, we needed the front end and the back end credential. All of us are talking about the front end, and I said, okay, so what do we know about backend?\nWhat do we know about really coding and what do we know about all of this? And we all just kind of sat there and we’re like, okay, we need to find somebody else that could be that expert in that field. So whenever we find there is a lack of our knowledge, or that we could find somebody that has a little bit more, we are definitely open to bringing them on.\nIt’s not that we’re trying to keep it small, but we want to keep the team progressing. And so when you get too many people, sometimes that can be a hindrance to the progression forward, but we also need to have as many people as we need to get the best product possible as well. So we are still open to certain people. If anybody wants to be involved, definitely reach out. If we have the space and need that area of knowledge, definitely want to do that. And then we have our board of directors. And we are trying to keep the board as separate from the advisory board as possible. There are a few people that are crossing over, just because of their expertise and skills whenever we are putting the board together.\nSo we have myself, Michelle, Nikki and Jess. But then we also have Rob Howard, and Hans. That is currently our board of directors. We have our first meeting today, actually. I’m very excited about that. And then we have our next advisory board meeting on Thursday, and we are hoping to get the level, so for the front end credential, the level one course and exam approved by the board and the level two course and exam as well. Very exciting stuff happening this week.\n[00:39:50] Nathan Wrigley: Yeah, it’s all moving forward, isn’t it? This is really great. We’re probably just going to have to round it up in terms of time, but before we do that, if people have been listening to this and they’d like to find out more, possibly get involved from either direction, whether that’s from the company side, looking to consume the accreditation, or if somebody would like to be involved in taking the accreditation and wants a little bit more information, where are the best places to go to contact either CertifyWP or just you?\n[00:40:18] Talisha Lewallen: Me, you could find me on Post Status Slack. Or you can always hit the contact forms on either website page. They get emailed to myself to either wpconnects.com or certifywp.com. And we are also in Twitter and we now have Tumblr. We just recently got on Tumblr as well. So any of those ways are perfect ways to get ahold of us. Or my email is always a great way, which is just talisha @ wpconnects.com\n[00:40:46] Nathan Wrigley: As always, I’ll put the links that you mentioned into the show notes, so if anybody wants to follow those up, just head over to the WP Tavern website, search for this episode and you should be able to find the links there. So it only remains for me to thank you Talisha for coming on the podcast today. I really appreciate it.\n[00:41:02] Talisha Lewallen: Well, I very much appreciate you having me and WPConnects and CertifyWP all in one. I know it’s a lot of information, but I very much appreciate it.\n[00:41:11] Nathan Wrigley: Thank you very much indeed.\n\nOn the podcast today we have Talisha Lewallen.\nYou might have found your way into WordPress intentionally, or perhaps you stumbled across it and decided to explore further. Whichever it was, you’ve learned things along the way. Some of it might have been through training, but there’s likely been some self-discovery on the way as well. Perhaps you’re a coder, or a designer. In fact, there are dozens of different pathways in the WordPress ecosystem.\nGiven the broad range of knowledge you might possess, how can you prove that you know what you know?\nMany industries provide training programs which, when completed successfully, allow you to assert that you are competent in a given area. You’d want your lawyer and surgeon to have passed through the appropriate program of study, so that they’re equipped to do that work.\nWith WordPress being such a dominant force in the world of websites, would it be a good idea to have a certification for WordPress? Talisha certainly thinks so and has founded CertifyWP to try to make that happen.\nWe approach this subject through the work that she’s been doing at WPConnects in which she’s been trying to provide training to military veterans, so that on their departure from the services, they have the prospect of finding work in the WordPress space.\nWe talk about whether there is a need for a certification for WordPress and how such a certification would come about. What levels of training does Talisha see as essential, and how many such layers might there be?\nWe discuss whether the WordPress community is ready for a third party to be certifying people’s abilities and whether this strays away from the approach that we’ve had so far, in which routes into employment have relied upon other, less formal, methods.\nLater in the podcast we talk about the structure of CertifyWP and who is behind the project. You’ll hear that it’s not just Talisha, there are quite a few members of the community who want this project to succeed.\nIf you’re curious about certifications in the WordPress space, this podcast is for you.\nUseful links.\nWPConnects website\nCertifyWP website\nTalisha on the Do the Woo podcast\nWPConnects Twitter\nWP Connects Tumblr\nShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n \niTunes\n\nRSS\n\n\nPocket Casts\n\nStitcher\n\n\nGoogle Play\n\n\nDownload\n\n\n\n\n\n\n\nTagged\ncertification podcast\n\nPrevious Episode: #66 – Sé Reed and Courtney Robertson on How the WP Community Collective Is Helping WordPress Contributors\nNext Episode: #68 – Chris Reynolds on Why To Use Composer With WordPress\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n0\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Notify me of new posts by email. \n\n Join the discussion via emailGet only replies to your comment, the best of the rest, as well as a daily recap of all comments on this post. No more than a few emails daily, which you can reply to/unsubscribe from directly from your inbox.Δ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\n\n\n\n\n\nListen to more episodes\n\n#72 – Steve Bruner and Timothy Jacobs on Using Gutenberg Outside of WordPress\nApril 19, 2023\n\n#71 – Nathan Ingram on How To Manage Contracts With Your WordPress Clients\nApril 12, 2023\n\n#70 – Steve Persch and Brian Perry on How Hosting Is Changing\nApril 5, 2023\n\n#69 – Joost De Valk on What’s Happening After Yoast\nMarch 29, 2023\n\n\n\nRelated Reads\n#29 – Remkus de Vries on How WordCamp Europe Got StartedJune 8, 2022#25 – Joe Casabona on Why WordPress Is a Great Choice for Your PodcastMay 4, 2022#10 – What’s in WordPress 5.9, and What Is Openverse?December 2, 2021\n\n\n\n\nLatest Podcast\n\n#73 – Ryan Welcher on Using the create-block Tool to Quickly Scaffold a New Block Plugin\nOn the podcast today we have Ryan Welcher. He’s a developer advocate sponsored by Automattic. He has been developing with WordPress since 2009 and before becoming a developer advocate, worked for agencies large and small and as a freelancer. If you’ve been using WordPress for any length of time, you’ll have come across the new…Listen Now\n\n\n\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://podcasts.apple.com/gb/podcast/jukebox/id1559974424",
        "https://open.spotify.com/show/4JKqugYjTZJTPnTr9hYvDp",
        "https://www.facebook.com/sharer/sharer.php?u=https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification&t=#67 - Talisha Lewallen on How CertifyWP Is Hoping To Offer WordPress Certification",
        "https://twitter.com/intent/tweet?text=https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification&url=#67 - Talisha Lewallen on How CertifyWP Is Hoping To Offer WordPress Certification",
        "https://wptavern.com/podcast-player/142702/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification.mp3",
        "https://wptavern.com/podcast-download/142702/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification.mp3?ref=download",
        "https://wptavern.com/podcast-download/142702/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification.mp3?ref=new_window",
        "https://podcasts.apple.com/gb/podcast/jukebox/id1559974424",
        "https://open.spotify.com/show/4JKqugYjTZJTPnTr9hYvDp",
        "https://www.linkedin.com/in/talisha-lewallen-57758b85/",
        "https://certifywp.com/",
        "https://wpconnects.com/",
        "https://wpconnects.com/",
        "https://certifywp.com/",
        "https://dothewoo.io/wordpress-certification/",
        "https://twitter.com/wp_connects",
        "https://www.tumblr.com/wp-connects",
        "https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification?share=twitter",
        "https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification?share=mastodon",
        "https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification?share=facebook",
        "https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification?share=telegram",
        "https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification?share=jetpack-whatsapp",
        "https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification?share=pocket",
        "https://wptavern.com/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20%2367%20-%20Talisha%20Lewallen%20on%20How%20CertifyWP%20Is%20Hoping%20To%20Offer%20WordPress%20Certification&body=https%3A%2F%2Fwptavern.com%2Fpodcast%2F67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification&share=email",
        "https://podcasts.apple.com/gb/podcast/jukebox/id1559974424",
        "/feed/podcast",
        "https://pca.st/gXd9",
        "https://www.stitcher.com/show/wordpress-weekly-podcast",
        "https://podcasts.google.com/feed/aHR0cHM6Ly93d3cud3B0YXZlcm4uY29tL2ZlZWQvcG9kY2FzdA",
        "https://wptavern.com/podcast-download/142702/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification.mp3?ref=download",
        "https://wptavern.com/tag/certification",
        "https://wptavern.com/tag/podcast",
        "https://wptavern.com/podcast/66-se-reed-and-courtney-robertson-on-how-the-wp-community-collective-is-helping-wordpress-contributors",
        "https://wptavern.com/podcast/68-chris-reynolds-on-why-to-use-composer-with-wordpress",
        "/podcast/67-talisha-lewallen-on-how-certifywp-is-hoping-to-offer-wordpress-certification#respond",
        "https://akismet.com/privacy/",
        "https://wptavern.com/podcast/72-steve-bruner-and-timothy-jacobs-on-using-gutenberg-outside-of-wordpress",
        "https://wptavern.com/podcast/71-nathan-ingram-on-how-to-manage-contracts-with-your-wordpress-clients",
        "https://wptavern.com/podcast/70-steve-persch-and-brian-perry-on-how-hosting-is-changing",
        "https://wptavern.com/podcast/69-joost-de-valk-on-whats-happening-after-yoast",
        "https://wptavern.com/podcast/29-remkus-de-vries-on-how-wordcamp-europe-got-started",
        "https://wptavern.com/podcast/29-remkus-de-vries-on-how-wordcamp-europe-got-started",
        "https://wptavern.com/podcast/25-joe-casabona-on-why-wordpress-is-a-great-choice-for-your-podcast",
        "https://wptavern.com/podcast/25-joe-casabona-on-why-wordpress-is-a-great-choice-for-your-podcast",
        "https://wptavern.com/podcast/10-whats-in-wordpress-5-9-and-what-is-openverse",
        "https://wptavern.com/podcast/10-whats-in-wordpress-5-9-and-what-is-openverse",
        "https://wptavern.com/podcast/73-ryan-welcher-on-using-the-create-block-tool-to-quickly-scaffold-a-new-block-plugin",
        "https://wptavern.com/podcast/73-ryan-welcher-on-using-the-create-block-tool-to-quickly-scaffold-a-new-block-plugin",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge"
    ]
}