{
    "title": "WP Engine Acquires Array Themes – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nOctober 26, 2018\nJeff Chandler\nWP Engine Acquires Array Themes\n\nWP Engine has acquired Array Themes and Atomic Blocks from Mike McAlister for an undisclosed amount. McAlister has been developing WordPress themes since 2009. He initially sold his themes on ThemeForest. In 2011, he founded Array Themes.\nI reached out to McAlister to learn why he chose to be acquired, what excites him most about Gutenberg, and what the plans are going forward.\nInterview with Mike McAlister\nWhat ultimately made you decide to move on from managing your own theme and products company to a larger, more established company?\nThe catalyst was when Brian Gardner reached out this summer and started a conversation about joining his team at WP Engine. As I told him at the time, he certainly wasn’t the first to make that offer, but he was definitely the most interesting. I had always respected Brian’s ethos on quality and design and really enjoyed our chats over the years.\nOnce I started meeting folks at WP Engine like Jason Cohen and David Vogelpohl, it became obvious that we were all striving for the same future and outcome for customers. It just made sense to join forces to make it happen together.\nThis was also a unique opportunity for me to start fresh and focus on crafting products with a stellar team. Although I was able to create an industry-respected theme collection and recently the Atomic Blocks plugin for Gutenberg, I wanted a new challenge. \nCouldn’t Array Themes have been built to directly support the Genesis framework without being acquired by WP Engine?\nIt would be a lot of work to infuse the Array Themes collection and Genesis. The idea wasn’t exactly to bring Genesis to Array, rather to bring the expertise and craft of Array and Atomic Blocks to WP Engine, StudioPress and Gutenberg. \nStudioPress already has one of the biggest and best theme collections out there and is doubling down on Gutenberg support. I’m going to contribute what I’ve learned building Array Themes and Atomic Blocks to make the StudioPress offering even better.\nWill future themes require the Genesis framework?\nAlthough there will not be any new themes released under the Array Themes brand, some of the designs will live on as StudioPress themes in the future and those will be powered by the Genesis framework. \nWe’re working on some really exciting new themes and features for Genesis that are going to continue making it the go-to solution for creating beautiful websites on WordPress, especially in the Gutenberg era.\nWhat do you think of the consolidation of brands in the WordPress space?\nWe’re seeing a very unique and transitional time in the WordPress industry. The old way of doing things is going out the window as WordPress and its community changes before our eyes. \nNow, more than ever, WordPress needs companies with stellar talent to help usher it through to the next era and contribute to its long term success. I’m excited to be part of a team that is willing to take on that challenge!\nI can’t speak to the motivations of other businesses in the WordPress space, but the WP Engine acquisition of the Array product suite makes a lot of sense. \nWith their recent acquisition of StudioPress, Array Themes, and Atomic Blocks, WP Engine is showing its customers and the WordPress community that they are doubling down on quality, design, Gutenberg, and an unmatched customer experience. These are all shared qualities between these individual entities and part of the long term strategy at WP Engine.\nWhat excites you most about Gutenberg?\nI’ve been excited about Gutenberg for over a year now. I was one of the first WordPress product developers to release a blocks plugin, a Gutenberg-friendly theme, a blog with tutorials, and the Gutenberg News site. \nI created all of these resources as a way of learning Gutenberg as well as contributing back to the community, and I will continue to do that with WP Engine and StudioPress!\nGutenberg unlocks the WordPress editor and the endless opportunities that follow for content creators, developers, and everyone in between. Gutenberg is already responsible for a flood of new products and new solutions to problems the classic editor couldn’t solve and it hasn’t even been merged into core yet! \nThe reality here is that Gutenberg isn’t just the future of WordPress, it’s the future of the Internet.\nDiscounts Available for Array Themes Customers\nMcAlister is joining WP Engine as a full-time employee. In addition, John Parris, a code wrangler for Array Themes has also joined WP Engine. \nStudioPress and WP Engine are offering discounts to single theme and theme club members. Those who purchased a lifetime membership will receive free access to the StudioPress Pro Plus All-Theme package with support and updates.\nTo learn more about these discounts and how the acquisition came about, check out McAlister’s post where he says thanks and farewell to his customers. \nCategory: NewsTags: acqusition, array themes, wp engineShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n13\n\n\n\n\t\t13 responses to “WP Engine Acquires Array Themes”\t\n\n\n\n\n\n\n\n\n\n Jesse says: \n\nOctober 26, 2018 at 8:00 PM \n\n\nTL;DR = WP Engine is the new GoDaddy.\nAny services who get acquired by these corps seem to perform mental gymnastics to explain/justify the acquisition…\nAt least all the “bloat” in WP’s ecosystem is being consolidated.\nIt will be interesting to watch Automattic’s relationship with WP Engine as the future unfolds…\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mike Kravitz says: \n\nOctober 29, 2018 at 8:07 AM \n\n\nAutomattic owns already a part of WP Engine: https://wptavern.com/automattic-makes-second-investment-wpengine\nWP Engine also bought other Theme producers: https://wptavern.com/wp-engine-acquires-studiopress\n\nLoading…\n\n\n\n\n\n\n\n\n\n David Vogelpohl says: \n\nOctober 29, 2018 at 2:24 PM \n\n\nHey Jesse. David Vogelpohl from WP Engine here. As an FYI, we see one of the key areas of value in the Array product acquisition as Atomic Blocks and the role they may play in the Genesis universe. We have some ideas behind what that means, but of course the fun is in figuring out the specifics :)\n\nLoading…\n\n\n\n\n\n\n\n\n\n David Alexander says: \n\nNovember 12, 2018 at 10:32 PM \n\n\nPlease acquire Beaver Builder and roll the whole thing into one with Genesis! \nDoes pretty please help? :)\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Matt B says: \n\nOctober 29, 2018 at 2:42 PM \n\n\nAll that’s left to do now is have Envato acquire WP Engine and perhaps the cycle would be complete.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Bob says: \n\nOctober 26, 2018 at 9:53 PM \n\n\nPersonally I find this dissapointing.\nArray Themes produce the best looking and best engineered themes on the market. I use them as the basis for most of sites. When I need to create a child theme I usually create one based on a theme from the Array collection.\nWith the team subsumed by Studiopress there will be no new themes from Array.\nArray have offered there lifetime customers access to Studiopress themes. \nHowever, I personally find this unsatisfactory. Studiopress themes all use the Genesis framework as their base. And I simply don’t like working with Genesis. Their developer documentation is sparse and inadequate. And having to create functions for simple things that would otherwise just require template overrides is a pointless time-sink. Once a project gets to a certain level of complexity Genesis themes simply aren’t a practical choice.\nI’ve been hoping for a new theme shop or two that produces themes as beautifully designed and built as Array Themes.  Guess I’ll keep hoping.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mike McAlister says: \n\nOctober 29, 2018 at 6:04 PM \n\n\nHey Bob, \nThanks for the kind words about the Array collection. You’re free to continue using your Array themes for starting new projects. Although we won’t be releasing any new themes under the Array brand, we will be providing bug fixes as needed via support. \nThere is a lot of change happening right now in the WordPress ecosystem, and the same is true with Genesis and StudioPress. We’re taking the feedback we’re collecting from developers and users (we just had a huge user survey) and we’re using that to both refine existing parts of Genesis (including documentation) as well as using it to shape the future of theming with Genesis and StudioPress themes. \nHopefully the need for template overrides becomes less critical as this new era of blocks is introduced. Personally, I think WordPress is moving in a direction where that is true. That puts the power of site-building in your hands, right inside the editor. \nAlthough the Array theme collection is going away, the ethos with which I built that theme collection isn’t going anywhere. I know my teammates at WP Engine and StudioPress share that vision, which is why I joined them in the first place. Stay tuned, I think your previous experiences will be challenged in a very positive way.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Marcus Tibesar says: \n\nOctober 27, 2018 at 5:48 PM \n\n\nWe love Array Theme! Since the Array Themes are being sunset and are not going to be converted to the Genesis Framework, we wish Michael and John all the luck in improving the quality of the StudioPress themes. \nArray Themes has been Quality over Quantity while we perceive StudioPress as Quantity over Quality. \nGenerally, mergers don’t go well but we are optimistic Michael and John will be impactive in turning out better StudioPress products. \nThese days the Drupal websites seem to be so much better than WordPress so we are asking WP Engine to up their design game considerably!\n\nLoading…\n\n\n\n\n\n\n\n\n\n Ryan says: \n\nOctober 28, 2018 at 1:52 PM \n\n\nMcAlister’s post only vaguely mentions a “discount” being offered by WPEngine, with no actual details or links.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mike McAlister says: \n\nOctober 29, 2018 at 11:28 AM \n\n\nHey Ryan, \nWe’ll be emailing customers this week with a follow up about the discounts they are receiving since they are specific to the type of membership they had on the site.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Dave says: \n\nOctober 29, 2018 at 6:32 AM \n\n\nCan’t say this enough: if you build custom stuff, start from your own custom theme rather then complain if the next theme company is being acquired. It’s THE best advice i’ve ever toke on after the same thing happened to me as an early adopter for WooThemes.\n\nLoading…\n\n\n\n\n\n\n\n\n\n David Morgan says: \n\nOctober 30, 2018 at 1:14 PM \n\n\nCongrats on the acquisition Mike! I’ve always loved your theme designs, and often looked to them to get inspired. I hope your design talents don’t get stifled in a more corporate environment. Best of luck!\n\nLoading…\n\n\n\n\n\n\n\n\n\n Ant Ekşiler says: \n\nOctober 30, 2018 at 4:08 PM \n\n\nCongrats Mike :)\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou may also like\nOllie Block Theme Now in Public BetaApril 26, 2023Array Returns to Themeforest After Disappointing Experiences Selling on Creative Market and WordPress.comApril 16, 2015Okay Themes Pulls Out of Themeforest, Rebrands as ArrayApril 1, 2014\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://wpengine.com/blog/bringing-array-themes-into-the-wp-engine-family/",
        "https://arraythemes.com/",
        "https://atomicblocks.com/",
        "https://wpengine.com",
        "https://wordpress.org/plugins/atomic-blocks/",
        "https://my.studiopress.com/themes/",
        "https://wordpress.org/plugins/atomic-blocks/",
        "https://wordpress.org/themes/atomic-blocks/",
        "https://atomicblocks.com/blog/",
        "http://gutenberg.news/",
        "https://arraythemes.com/about/",
        "https://arraythemes.com/onward/",
        "https://wptavern.com/category/news",
        "https://wptavern.com/tag/acqusition",
        "https://wptavern.com/tag/array-themes",
        "https://wptavern.com/tag/wp-engine",
        "https://wptavern.com/wp-engine-acquires-array-themes?share=twitter",
        "https://wptavern.com/wp-engine-acquires-array-themes?share=mastodon",
        "https://wptavern.com/wp-engine-acquires-array-themes?share=facebook",
        "https://wptavern.com/wp-engine-acquires-array-themes?share=telegram",
        "https://wptavern.com/wp-engine-acquires-array-themes?share=jetpack-whatsapp",
        "https://wptavern.com/wp-engine-acquires-array-themes?share=pocket",
        "https://wptavern.com/wp-engine-acquires-array-themes?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20WP%20Engine%20Acquires%20Array%20Themes&body=https%3A%2F%2Fwptavern.com%2Fwp-engine-acquires-array-themes&share=email",
        "https://www.littlebizzy.com",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266522",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266838",
        "https://wptavern.com/automattic-makes-second-investment-wpengine",
        "https://wptavern.com/wp-engine-acquires-studiopress",
        "https://wpengine.com",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266864",
        "https://mazepress.com/",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-268907",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266866",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266533",
        "https://atomicblocks.com/",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266876",
        "http://tibesar.com",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266666",
        "https://www.heyitsfree.net",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266755",
        "https://atomicblocks.com/",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266852",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266828",
        "https://organicthemes.com",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266963",
        "https://fuelthemes.net",
        "https://wptavern.com/wp-engine-acquires-array-themes#comment-266981",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta",
        "https://wptavern.com/array-returns-to-themeforest-after-disappointing-experiences-selling-on-creative-market-and-wordpress-com",
        "https://wptavern.com/array-returns-to-themeforest-after-disappointing-experiences-selling-on-creative-market-and-wordpress-com",
        "https://wptavern.com/okay-themes-pulls-out-of-themeforest-rebrands-as-array",
        "https://wptavern.com/okay-themes-pulls-out-of-themeforest-rebrands-as-array",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge"
    ]
}