{
    "title": "Q&A With Vice Provost for Undergraduate Education Sarah Church — The Major Declaration Journey | Families",
    "body": "\n \n \n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nFamilies\n\n\nStanford University\n\n\n\n\n\n\n\n\n\n\n\n    Menu\n\n\n\n\n\nSearch form\nSearch term\n\n\n\n\n\nHome\nFAQ\nGet Involved\nHow Do I Pay?\nStay Informed\nTips\nVital Info\nLatest News\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nQ&A With Vice Provost for Undergraduate Education Sarah Church — The Major Declaration Journey\n\nApril 18, 2023 3:41 pm\n\nCategories: Uncategorized\n\n\nSpring each year at Stanford shines a spotlight on Major Declaration Season, as undergraduates are required to select a major no later than the spring of their sophomore year. Vice Provost for Undergraduate Education Sarah Church offers insights into the major declaration process and some guidance for parents and families who may be navigating this process with their students.\nHow does Stanford help students choose a major?\nEvery incoming student is matched with Undergraduate Advising Directors (UADs) who play a very important role in helping students understand the major declaration process and the many resources that help students reach a decision they’re excited about. More holistically, we encourage all students to use the first two years to take a variety of courses—many of which meet their general education requirements—to enable them to explore different disciplines and perhaps discover a curricular interest that really excites them. \nMy student is a sophomore and still is unsure of a major. How can I be helpful as they narrow down their options?\nStanford data tells us that students choose and declare their major across the full expanse of their first two years. Many sophomores are still deciding up until spring of their sophomore year because they’ve embraced the opportunity to explore all their interests and passions. If they haven’t reached out to their academic advisor, my first advice would be to encourage them to do so, as our advisors are in the best position to help students think through all their academic options and what that might mean in terms of future course loads, how their considerations relate to potential future plans, and also what they may be realizing they truly are passionate about! I’d also encourage you to ask questions about what really interests them and encourage them to be honest and forthright without being overly prescriptive about what you think they should major in. We regularly hear that students are thinking of a major that they believe will make their parents happy even though it’s not an area that truly interests or excites them. Having genuine, open dialogue with your student is the kind of support I imagine your student would most welcome.\nHow important is a major, really, when it comes to one’s career after Stanford?\nMuch has been written by CEOs of companies and graduate schools as well that they’re looking less at specific majors and more about the broad knowledge that our undergraduates are bringing with them. Most appealing to them are Stanford graduates who can demonstrate they think critically, write well and speak thoughtfully, and who best characterize the ideals of a broad-based liberal education that Stanford offers, well beyond any area of disciplinary specialization. For instance, English or Public Policy majors can go on to medical school as long as they have some applicable courses that might be required or highly recommended.  And students don’t have to be computer science or engineering majors to pursue a career in tech. \nMy student is considering a double major. How feasible is that given all the requirements for just one major?\nIt’s feasible, especially if your student plans thoughtfully and in close coordination with their academic advisor who can help them map out how to pursue both major pathways. That said, it may be just as fruitful to pursue a minor or consider a notation program—such as the Notation in Science Communication or Notation in Cultural Rhetorics—to pair with a previously chosen major. As we think more broadly about issues of academic well-being, we want to ensure that students are making decisions that best support their goals without leaving them feeling overloaded and exhausted. Fortunately we have a great team of advisors and a supportive campus community in place to help students consider their options and potential consequences.\nWhat’s the last possible quarter in which my student can declare a major? And what if they want to change their major during their junior year—is that possible?\nWe ask students to declare by spring of their sophomore year, although transfers coming into Stanford as juniors have until the end of their junior year. Students can pivot to another major at any time leading up to their graduation, if they’re able to fulfill the requirements. This might mean expanding a minor into a major, assuming they’ve taken a good number of courses already in that area. \nMy student wants to major in a subject I’m not sure sets them up for success down the road. Should I try to persuade them to change course?\nIdeally we want students to make choices about a major and future career pathways that reflect their greatest disciplinary interests and passions. When we hear students convey that they feel pressured by their families to step away from a particular major which the family doesn’t view as useful or applicable to a prospective career, we are often seeing that it’s these conflicted students who often struggle to flourish. It’s been our experience that students who are chasing their passions and feel supported by their families in those decisions do best academically and that translates into great stories of success after Stanford.\nI heard that capstones are going to be required for all majors. Why is this, what does it entail, and how might this relate to my student’s choice of major?\nStarting with the Class of 2025, all Stanford students must complete as part of their major a robust capstone requirement that will help them integrate learning from different aspects of their major or undergraduate education, extend their learning and develop their expertise, and develop skills in managing a complex and extended project. Capstones may take the form of an honors thesis; senior paper or project; capstone seminar with group or individual projects; a substantial, scaffolded individual project, or other options acceptable to the major department or program which ultimately determines what counts for a capstone for students majoring in their field and determines procedures for certifying that students have completed this requirement. This would be a useful area of exploration for students to have with their academic advisor in advance of choosing a major or with their major advisor in their affiliated department if they’ve already chosen a major and will graduate in 2025 or later.\nRead about the unique journeys four Stanford undergraduates have taken in their selection of major. \n \nPost navigation\n\n Previous postAn update on social life on the Farm from Student Affairs’ Samuel Santos Jr. \n\n\n\n\n\n\n\nCategories\n\nAcademics at Stanford (83)\n\nAlcohol at Stanford (16)\n\nCareer Education (3)\n\nFinances at Stanford (12)\n\nHealth at Stanford (40)\n\nLiving at Stanford (60)\n\nParents Program (5)\n\nParents' Club (4)\n\nSafety at Stanford (41)\n\nStanford Events (56)\n\nUncategorized (14)\n\n\n\n\nArchives\nArchives\n\nSelect Month\n April 2023  (1)\n November 2022  (1)\n September 2022  (1)\n April 2022  (1)\n February 2022  (1)\n November 2021  (1)\n September 2021  (3)\n August 2021  (1)\n June 2021  (4)\n May 2021  (4)\n April 2021  (3)\n March 2021  (4)\n February 2021  (5)\n January 2021  (2)\n December 2020  (1)\n September 2020  (3)\n August 2020  (2)\n July 2020  (1)\n June 2020  (4)\n May 2020  (3)\n March 2020  (3)\n February 2020  (2)\n January 2020  (2)\n December 2019  (1)\n November 2019  (2)\n October 2019  (5)\n September 2019  (4)\n August 2019  (2)\n July 2019  (3)\n June 2019  (3)\n May 2019  (3)\n April 2019  (2)\n March 2019  (2)\n February 2019  (6)\n January 2019  (3)\n December 2018  (1)\n November 2018  (2)\n October 2018  (2)\n September 2018  (4)\n August 2018  (2)\n May 2018  (4)\n April 2018  (2)\n March 2018  (6)\n February 2018  (4)\n January 2018  (1)\n November 2017  (4)\n October 2017  (3)\n September 2017  (5)\n August 2017  (5)\n July 2017  (2)\n June 2017  (2)\n May 2017  (5)\n April 2017  (3)\n March 2017  (4)\n February 2017  (2)\n January 2017  (3)\n December 2016  (3)\n October 2016  (3)\n September 2016  (4)\n August 2016  (2)\n July 2016  (3)\n June 2016  (3)\n May 2016  (2)\n April 2016  (4)\n March 2016  (2)\n February 2016  (8)\n January 2016  (3)\n December 2015  (2)\n November 2015  (7)\n October 2015  (2)\n September 2015  (7)\n August 2015  (1)\n July 2015  (3)\n June 2015  (5)\n May 2015  (1)\n April 2015  (3)\n March 2015  (3)\n February 2015  (1)\n January 2015  (1)\n December 2014  (1)\n November 2014  (1)\n October 2014  (4)\n September 2014  (3)\n June 2014  (3)\n May 2014  (1)\n April 2014  (2)\n March 2014  (1)\n February 2014  (5)\n January 2014  (2)\n November 2013  (1)\n October 2013  (1)\n September 2013  (3)\n August 2013  (1)\n June 2013  (1)\n April 2013  (2)\n March 2013  (5)\n February 2013  (1)\n December 2012  (3)\n September 2012  (3)\n June 2012  (1)\n May 2012  (2)\n February 2012  (1)\n January 2012  (2)\n December 2011  (4)\n November 2011  (1)\n August 2011  (2)\n May 2011  (1)\n April 2011  (1)\n February 2011  (1)\n January 2011  (2)\n October 2010  (1)\n August 2010  (1)\n July 2010  (1)\n March 2010  (1)\n\n\n\n\n\n\n  \n\nNewsletter\n\nEmail newsletter archive\n \n\n\n\n\n\nStanford + Parents/Guardians\n The student is at the center — and is the focus — of this important partnership.\n\nOur Policy\nProspective Parents\n\n\n  \n\nParents' Helpline\n\nmykidis@stanford.edu\n650-725-0649\n \n\n\n  \n\nIn an Emergency\n\nemergency.stanford.edu\n650-725-5555\n 844-ALERTSU (844-253-7878)  \n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University,  Stanford, California 94305.\n\n \n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/faq/",
        "https://parents.stanford.edu/get-involved/",
        "https://parents.stanford.edu/how-do-i-pay/",
        "https://parents.stanford.edu/stay-informed/",
        "https://parents.stanford.edu/tips/",
        "https://parents.stanford.edu/vital-information/",
        "https://parents.stanford.edu/newsletter/",
        "https://parents.stanford.edu/category/uncategorized/",
        "https://undergrad.stanford.edu/about-vpue/meet-vice-provost",
        "https://news.stanford.edu/report/2023/04/17/stanford-undergraduates-travel-varied-paths-toward-major-declaration/",
        "https://parents.stanford.edu/2022/11/17/an-update-on-social-life-on-the-farm-from-student-affairs-samuel-santos-jr/",
        "https://parents.stanford.edu/category/academics-at-stanford/",
        "https://parents.stanford.edu/category/alcohol-at-stanford/",
        "https://parents.stanford.edu/category/career-education/",
        "https://parents.stanford.edu/category/finances-at-stanford/",
        "https://parents.stanford.edu/category/health-at-stanford/",
        "https://parents.stanford.edu/category/living-at-stanford/",
        "https://parents.stanford.edu/category/parents-program/",
        "https://parents.stanford.edu/category/parents-club/",
        "https://parents.stanford.edu/category/safety-at-stanford/",
        "https://parents.stanford.edu/category/stanford-events/",
        "https://parents.stanford.edu/category/uncategorized/",
        "/newsletter-archive/",
        "/stanford-parents/",
        "http://www.stanford.edu/dept/uga/parents/",
        "mailto:mykidis@stanford.edu",
        "tel:16507250649",
        "http://emergency.stanford.edu/",
        "tel:16507255555",
        "tel:18442537878",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}