{
    "title": "Teams | Strategic Plan | SDSU",
    "body": "\n\n\n\n\n\nskip to main content\nClose Menu\n\n\n\n\n\n\n\nSan Diego State University\n\nStrategic Plan\n\n\n\n\n\n\nDisability Services\nCampus Directory\nInformation for…\n\nFuture Students\nCurrent Students\nFaculty/Staff\nAlumni\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSan Diego State University\n\nStrategic Plan\n\n\nMenu\n\n\n\n\n\n\n\n\nTeams\n\n\n\n\n\nSkip site navigation\n\n\n\nPlan and Process\n\n\nTimeline and Updates\n\n\nTeams\n\n\nCampus Events\n\n\nCommunications and Documents\n\n\nFAQ\n\n\n\n\nImplementation Teams\nEach co-chair will be tasked with implementing a specific set of activities to meet\n                        the university's defined goals. Team members are designated to support efforts to\n                        meet the defined goal within each of the five priorities.\n                     \n\n\n\nAgnes Wong Nickerson, MBA\nVice President for Business and Financial Affairs & CFO\nStrategic Plan Implementation Co-Chair\n \n\n\n\n\n\nJ. Luke Wood, Ph.D.\nVice President for Student Affairs and Campus Diversity\nStrategic Plan Implementation Co-Chair\n \n\n\n \n\n\nBecoming a Premier Public Research University: A New Kind of HSI.\nExecutive Sponsor: Hala Madanat, Ph.D., Interim Vice President for Research\n                     \nGOAL 1: Position SDSU to ultimately achieve R1 status:\nKey Activities:\n\n\n\nActivity 1: Assessing to adopt new or enhanced resources for the university’s research\n                                       infrastructure.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nJohn Crockett, Ph.D.\nAssociate Vice President of Research Advancement\n\n\nScott Walter, Ph.D.\nSDSU Library Dean\n\n\n\n\n\n\nCommittee Members\n\n\n\nHala MadanatMichele GoetzJerry SheehanPam LachEdgar HodgeJennifer SchenkenfelderHeriberto Vasquez (past member)\n\n\n\n\n\n\n\n\n\nActivity 2: Developing proposals for at least three new collaborative research centers.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nKaren May-Newman, Ph.D.\nProfessor of Mechanical Engineering\n\n\nSteven Hooker, Ph.D.\nDean of the College of Health and Human Services\n\n\n\n\n\n\nCommittee Members\n\n\n\nCassie AaronJennie AmisonDebbie BrightonJohn CrockettHala MadanatNatasha BlissErika LarkinsSalvadore EspinosaKristen WellsYasmine Shead\n\n\n\n\n\n\n\n\n\nActivity 3: Identifying and proposing new strategically placed Ph.D. programs.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nTracy Love, Ph.D.\nDean of the College of Graduate Studies\n\n\nMonica Casper, Ph.D.\nDean of the College of Arts and Letters\n\n\n\n\n\n\nCommittee Members\n\n\nCassie AaronGraduate CouncilEd Balsdon (past member)\n\n\n\n\n\n\n\n\nActivity 4: Helping secure funding for at least one new LEED research facility.\n\n\n\n\n\n\nChair\n\n\n\n\n\nStanley Maloy, Ph.D.\n\n\nAssociate Vice President of Research and Innovation\n\n\n\n\n\n\n\nCommittee Members\n\n\n\n\n\nNatalie Mladenov\n\n\n\n\nHeriberto Vasquez\n\n\n\nOlivia Humphrey\n\n\n\n\n\n\n\n\n\n\nGOAL 2: Leverage SDSU’s unique identity to enhance the quantity and quality of scholarship.\nKey Activities:\n\n\n\nActivity 5: Identifying proposals to enhance SDSU’s eligibility for federally designated\n                                       Hispanic-Serving Institution competitions.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nJohn Crockett\nAssociate Vice President of Research Advancement\n\n\nEmilio Ulloa\nAssociate Professor of Psychology\n\n\n\n\n\n\nCommittee Members\n\n\n\nMichael DominguezAraceli SaucedoJoi ColesKarina EstebanJennie Amison (past member)Debbie Brighton (past member)Antonio Marquez (past member)\n\n\n\n\n\n\n\n\n\nActivity 6: Establishing new research partnerships with three universities in Latin\n                                       America.\n\n\n\n\n\n\nChair\n\n\n\n\n\nRamona Pérez\n\n\nProfessor of Anthropology and Center for Latin American Studies Directora\n\n\n\n\n\n\n\nCommittee Members\n\n\nCristina AlfaroMarcela PolancoAntonio MarquezAlondra Hernandez\n\n\n\n\n\n\n\n\nActivity 7: Conducting cluster hires of faculty around public-facing, border or Indigenous\n                                       scholarship.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\n\nRamona Pérez\n\n\nProfessor of Anthropology and Center for Latin American Studies Directora\n\n\n\n\nJeff Roberts\n\n\nDean of the College of Sciences\n\n\n\n\n\n\n\nCommittee Members\n\n\nJoanna BrooksJennifer ImazekiDavid KamperKylee WebsterKate Vinegas\n\n\n\n\n\n\n\nResilience. Designed to Thrive\nExecutive Sponsor: Agnes Wong Nickerson, Vice President for Business and Financial Affairs, and Adrienne\n                        Vargas, Vice President for University Relations and Development\n                     \nGOAL 1: Diversify and expand revenue streams that support our mission and our scholarly\n                           and creative activities, teaching and athletic aspirations.\nKey Activities:\n\n\n\nActivity 8: Developing revenue plans for units that include SDSU Global Campus, Athletics\n                                       and the auxiliary units, and also for research, technology transfer and other priorities.\n\n\n\n\n\n\nChair\n\n\n\n\nBrittany Santos-Dereig\nChief-of-Staff\n\n\n\n\n\n\nCommittee Members\n\n\n\nAustin BarberChristina BrownNikki ClayCynthia CervantesMary DarlingMichele GoetzLeslie LevinsonRachel LindellHala MadanatTommy MartindaleVictor NavaAgnes Wong NickersonTim RiceJerry SandersRadhika SeshanJerry SheehanJohn PutmanVictor PeneraAdrienne VargasJohn David WickerTodd Summer (past member)\n\n\n\n\n\n\n\n\n\nActivity 9: Developing a structure that promotes entrepreneurial aspirations for each\n                                       college.\n\n\n\n\n\n\nChair\n\n\n\n\n\nWilliam Tong\n\n\nInterim Vice Provost\n\n\n\n\n\n\n\nCommittee Members\n\n\n\n\n\nTod ReederMark ReedMichelle GoetzCathy PucherAlex DeNobleSalvador OchoaVictor PeneraStephen Jackson\n\n\n\n\n\n\n\n\n\n\n\n\nActivity 10: Developing and launching a comprehensive brand strategy for SDSU to build\n                                       on the strengths of SDSU Athletics, enhance public-private partnerships and philanthropy,\n                                       and contribute to student recruitment.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nSeth Malios\nProfessor of Anthropology\n\n\nStefan Hyman\nInterim Associate Provost for Enrollment and Retention Management at Stony Brook University\n\n\nThom McElroy\nCo-founder of Volcom\n\n\nMegan Newton\nDirector of Marketing and Digital Media\n\n\n\n\n\n\nCommittee Members\n\n\n\nJason BenitoCandy CarsonJeff ErnstKarina EstebanTimothy GonzalezCourtney HarmonGiselle LuevanosShawki MooreLori PadelfordLeomarc PastorQuentin SkaggsKellie WoodhouseTammy Blackburn (past member)Joe Brock (past member)LaMonica Everett-Haynes (past member)Jim Herrick (past member)Gina Jacobs (past member)Maria Keckler (past member)Chuck Lang (past member)Mike May (past member)Victor Nava (past member)Victor Penera (past member)Steve Schnall (past member)Polly Sipper (past member)Catherine Snapp (past member)\n\n\n\n\n\n\n\n\n\nActivity 11: Realigning central marketing initiatives with the university’s strategic plan.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nAdam Armolea (past member) \nAssistant Director of Marketing and Communications for SDSU Alumni\n\n\nMegan Newton\nDirector of Marketing and Digital Media\n\n\n\n\n\n\nCommittee Members\n\n\n\n\n\nTammy BlackburnJeff ErnstKarina EstebanLa Monica Everett-HaynesJim HerrickStefan HymanGina Jacobs Giselle LuevanosSeth MalliosMike MayThom McElroyShawki MooreVictor NavaMelissa Porter Steve Schnall Amando SepulvedaCatherine SnappTodd SummerKellie WoodhouseJoe Brock (past member)\n\n\n\n\n\n\n\n\n\n\n\nGOAL 2: Allocate resources with transparency, equity, efficiency and accountability.\nKey Activities:\n\n\n\nActivity 12: Identifying areas to advance synergies for shared services across campus\n                                       units for improved efficiency and accountability.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nMary Anne Kremicki\nDirector Academic Resources, Academic Affairs\n\n\nCrystal Little\nInterim Associate Vice President\n\n\n\n\n\n\nCommittee Members\n\n\n\nJerry SheehanAgnes Wong NickersonHector OchoaRashmi PrabaJerry SheehanMyra VillaltaAri WeizmanLuke WoodChristian Holt (past member)\n\n\n\n\n\n\n\n\n\nActivity 13: Enhancing the viability and excellence of SDSU’s auxiliaries in providing\n                                       opportunities for students, faculty, staff, and community partners.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nTodd Summer\nCEO of Aztec Shops\n\n\nChristina Brown\nExecutive Director of Associated Students\n\n\n\n\n\n\nCommittee Members\n\n\nAustin BarberNikki ClayMichele GoetzRachel LindellHala MadanatAgnes Wong NickersonChristy SamarkosJerry SandersAdrienne VargasChristian Holt (past member)\n\n\n\n\n\n\n\n\nActivity 14: Developing and aligning a process for multi-year objective setting and budget\n                                       planning for the university.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nSherry Ryan\nDirector of the School of Public Affairs\n\n\nBruce Reinig\nInterim Thomas and Evelyn Page Dean of the Fowler College of Business\n\n\n\n\n\n\nCommittee Members\n\n\n\nAustin BarberHala MadanatAgnes Wong NickersonHector OchoaBrittany Santos-DereigJerry SheehanAdrienne VargasLuke WoodWil WestonChristian Holt (past member)Tom McCarron (past member)\n\n\n\n\n\n\n\n\nGOAL 3: Invest in organizational practices that prioritize the responsible management\n                           of resources with a focus on global and environmental sustainability.\nKey Activities:\n\n\n\nActivity 15: Developing a team to then provide a strategy and oversight of SDSU’s\n                                       sustainability efforts.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nIana Castro\nAssistant Professor of Marketing\n\n\nEric Hansen\nAssociate Vice President for Business Operation\n\n\n\n\n\n\nCommittee Members\n\n\nGener AbdonTenaya BearmarGlen BrandenburgLiv HumphreySimran JainKeven JefferyMaribel MaderoDaryn OckeyTyler RogersDave WeilCharlotte Roberts (past member)\n\n\n\n\n\n\n\n\nActivity 16: Updating the University Climate Action Plan, inclusive of all campus\n                                       locations, with defined benchmarks.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\n\nJessica Barlow\n\n\nInstructional Faculty for the School of Speech, Language and Hearing Sciences\n\n\n\n\n\n\n\nCommittee Members\n\n\nGener AbdonLi AnTenaya BearmarTrent BiggsGlen BrandenburgEric HansenSimran JainLaura ShinnJosh MaysPaul MelchiorCharlotte RobertsPresidential Task Force for Climate ActionEric Frost (past member)Robert Shultz (past member)\n\n\n\n\n\n\n\n\nActivity 17: Developing Guiding Principles for Sustainability that include local and\n                                       international standards.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nChristy Samarkos\nAssociate Vice President for Student Affairs\n\n\nRobert Schulz\nAssociate Vice President of Real Estate, Planning and Development\n\n\n\n\n\n\nCommittee Members\n\n\nGener AbdonTenaya BearmarAsfaw BeyeneGlen BrandenburgAdrienne FusekSimran JainKeven JefferyCharlotte Roberts\n\n\n\n\n\n\n\nWe Are SDSU.\nExecutive Sponsor: Jerry Sheehan, Vice President for Information Technology\n                     \nGOAL 1: Foster an inter-connected and equitable SDSU experience through implementing resource generation and allocation, communication and information-sharing, and systems of transportation. \nKey Activities:\n\n\n\nActivity 18: Establishing a campuswide working group to explore university-industry partnerships.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\n\nStacy Carota\n\n\nExecutive Director of Development, College of Sciences\n\n\n\n\nGina Jacobs\n\n\nAssociate Vice President of Mission Valley Development\n\n\n\n\n\n\n\nCommittee\n\n\nHala MadanatShawki MooreKumar NarayananVictor NavaDaniel NietoAngela PinaJerry SheehanShara TscheulinAmando Sepulveda (past member)\n\n\n\n\n\n\n\n\nActivity 19: Developing plans to ensure that SDSU Imperial Valley and SDSU Mission\n                                       Valley have representation on university resource planning and recommending bodies.\n\n\n\n\n\n\nChair\n\n\n\n\n\nWil Weston\n\n\nHead of Collection Management, Chair of the University Senate 2020-2021\n\n\n\n\n\n\n\nCommittee Members\n\n\nJazmin Horton AlvaradoJulieanna GutierrezDaniel NietoAmando SepulvedaMark Wheeler\n\n\n\n\n\n\n\n\nActivity 20: Establishing an action plan for instructional and information technology\n                                       to create interconnected campuses.\n\n\n\n\n\n\nChair\n\n\n\n\nJames Frazee\nAssociate Vice President AVP for Information Technology\n\n\n\n\n\n\nCommittee Members\n\n\nCristina AlfaroCarlos CareagaPete DelaneyMargot EmerAdrian GonzalezKate HalvoetNoah HansenITITSKevin JeffreyGiselle LuevanosMichelle PetersonRachel RaynohaAmando SepulvedaMark SiprutJoe WolfmanMark Wheeler\n\n\n\n\n\n\n\n\nActivity 21: Developing and implementing a Culture of Communication Plan to improve\n                                       synergy and collaboration between all campuswide communication personnel.\n\n\n\n\n\n\nChair\n\n\n\n\nCory Marshall\nAssociate Director of Media Relations\n\n\n\n\n\n\nCommittee Members\n\n\nRahim BakerTammy BlackburnDeborah BrightonGiselle LuevanosShawki MooreAmando SepulvedaCatherine SnappRaquel Herriot (past member)\n\n\n\n\n\n\n\n\nActivity 22: Launching a pilot shuttle service between SDSU microsites in San Diego county.\n\n\n\n\n\n\nChair\n\n\n\n\nDebbie Richeson\nDirector of Parking and Transportation Services\n\n\n\n\n\n\nCommittee Members\n\n\n\nKarina EstebanJosh MaysLisa PearsonSteve SchnallAmando SepulvedaJanusz SupernakJoe WolfmanRachel Szakmary (past member)\n\n\n\n\n\n\n\n\n\nActivity 23: Launching a pilot for a daily shuttle service between the SDSU and SDSU\n                                       Imperial Valley.\n\n\n\n\n\n\nChair\n\n\n\n\nDebbie Richeson\nDirector of Parking and Transportation Services\n\n\n\n\n\n\nCommittee Members\n\n\nAlan CastroKarina EstebanJosh MaysJohn Moreno, Jr.Amando SepulvedaHenry VillegasLawson Hardick (past member)Daniel Nieto (past member)Miguel Rahiotis (past member)Rachel Szakmary (past member)\n\n\n\n\n\n\n\n\nActivity 24: Developing a subsidy program to lower public transportation fare costs between\n                                       SDSU and SDSU Mission Valley.\n\n\n\n\n\n\nChair\n\n\n\n\nDebbie Richeson\nDirector of Parking and Transportation Services\n\n\n\n\n\n\nCommittee Members\n\n\nBeth BridgesRachel GreggEric HansenVictor Penera (past member)Amando Sepulveda (past member)Rachel Szakmary (past member)\n\n\n\n\n\n\n\n\nActivity 25: Developing a green transportation plan between the SDSU and SDSU Mission\n                                       Valley campus locations.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nDebbie Richeson\nDirector of Parking and Transportation Services\n\n\n\n\n\n\nCommittee Members\n\n\nAli MooreGina Jacobs (past member)Amando Sepulveda (past member)Laura Shinn (past member)Rachel Szakmary (past member)\n\n\n\n\n\n\n\nGOAL 2: Expand SDSU’s academic infrastructure and partnerships to meet the needs of\n                           broadly diverse learners in our region, across the nation, and the world.\nKey Activities:\n\n\n\nActivity 26: Establishing a SDSU microsite at every community college in SDSU’s service\n                                       area.\n\n\n\n\n\n\nChair\n\n\n\n\n\nKaren Myers-Bowman\n \n\nInterim Dean of SDSU Global Campus\n\n\n\nRadhika Seshan (past chair and member) \n\nAssociate Vice President for Career Relations and Strategic Partnerships\n\n\n\n\n\n\nCommittee Members\n\n\n\nJacq BanalEdgar HodgeChristy SamarkosCrystal SanchezMark Wheeler\n\n\n\n\n\n\n\n\n\nActivity 27: Establishing a plan for continued collaborations for SDSU Georgia by\n                                       June 2021.\n\n\n\n\n\n\nChair\n\n\n\n\nHalil Güven\nDean of SDSU Georgia\n\n\n\n\n\n\nCommittee Members\n\n\nSDSU Georgia Executive CommitteeStephen SchellenbergAri Weizman\n\n\n\n\n\n\n\n\nActivity 28: Finalizing a formal partnership agreement for admissions and recruitment\n                                       with Kumeyaay Community College.\n\n\n\n\n\n\nChair\n\n\n\n\nJacob Alvarado Waipuk\nTribal Liaison\n\n\n\n\n\n\nCommittee Members\n\n\nDavid GambleDavid KamperLuke WoodCrystal Sanchez (past member) (Associated Students)\n\n\n\n\n\n\n\n\nActivity 29: Creating a Global Strategy Action Plan to address global program infrastructure,\n                                       international student recruitment, yield and retention.\n\n\n\n\n\n\nChair\n\n\n\n\nCristina Alfaro\nAssociate Vice President for International Affairs\n\n\nMaria Keckler\nDirector of International Affairs Strategy and Communications\n\n\n\n\n\n\nCommittee Members\n\n\n\nAdrienne FusekNoah HansenLawson HardickStefan HymanLinda OsunaEddie WestCrystal SanchezJennifer SchenkenfelderSandra Temores-ValdezInternational Coordinators representing each college across campus\n\n\n\n\n\n\n\n\n\nActivity 30: Establishing new bachelor’s and master’s programs at SDSU Imperial Valley.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nMark Wheeler\nInterim Dean SDSU Imperial Valley\n\n\n\n\n\n\nCommittee Members\n\n\nExecutive Council & Program Coordinators from SDSU IVAndrew BohanakLawson HardickLinda OsunaCrystal SanchezJennifer SchenkenfelderGregorio Ponce (past member)\n\n\n\n\n\n\n\nEquity and Inclusion in Everything We Do\nExecutive Sponsor: J. Luke Wood, Ph.D., Vice President for Student Affairs and Campus Diversity\n                     \nGOAL 1: Ensure that diversity, equity and inclusion (DEI) initiatives across campus\n                           arealigned and implemented consistently, effectively and efficiently.\nKey Activities:\n\n\n\nActivity 31: Establishing a sustainable centrally-funded information technology unit.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\n\nErica Aros\n\n\nDirector of Student Ability Success Center\n\n\n\n\nRahim Baker\n\n\nAccessible Technology Initiative Coordinator\n\n\n\n\n\n\n\nCommittee Members\n\n\n\nAustin BarberMark FigueroaITDonald KirsonStacy WarnerIsabella Martelino (past member)\n\n\n\n\n\n\n\n\n\nActivity 32: Ensuring that every major campus unit has a standing diversity council\n                                       to better coordinate and promote unit-specific diversity, equity and inclusion activities.\n\n\n \n                                 \n                                 \n\n\nChair\n\n\n\n\nJennifer Imazeki\nAssociate Chief Diversity Officer for Faculty & Staff\n\n\n\n\n\n\nCommittee Members\n\n\n\nDiversity LiaisonsSim BawejaJenny BramerElizabeth CorderoJohn CrockettKristine CatanoAnne DonadeyTheresa GarciaGabriel GonzalezThom HarpoleJennifer LakinDaniella LuistroArion MayesDeb NaylonClaire NorbergMelanie PattonAmy RandelPatricia ReaJessica RenttoGloria RhodesNate RogriguezSweta SarkarCristian Sterling AquinoMary TaylorSarah VanderburghAllison VaughnAurora VelascoRoy WhitakerDavid Engstrom (past member)Raquel Herriott (past member)Isabella Martelino (past member)Paula Peter (past member)Rick Schultz (past member)\n\n\n\n\n\n\n\n\n\nActivity 33: Developing a structured, universitywide calendar to promote and highlight\n                                       diversity-related programs and events.\n\n\n \n                                 \n                                 \n\n\nCo Chairs\n\n\n\n\nRandy Timm\nAssistant Vice President for Student Affairs and Dean of Students\n\n\nNicole Belisle\nAssociate Chief Diversity Officer for Strategic Initiatives\n\n\n\n\n\n\nCommittee Members\n\n\nJeff ErnstMark FigeroaKayla Mari Vale Cruz Jessica NareAndrew PiersonDion Akers (past member)Daniella Luistro (past member)Isabella Martelino (past member)\n\n\n\n\n\n\n\n\nActivity 34: Expand the role of the Diversity Liaisons to better coordinate diversity, equity\n                                       and inclusion activities across colleges and units.\n\n\n \n                                 \n                                 \n\n\nChair\n\n\n\n\nJennifer Imazeki\nAssociate Chief Diversity Officer for Faculty & Staff\n\n\n\n\n\n\nCommittee Members\n\n\n\nDiversity LiaisonsSim BawejaJenny BramerElizabeth CorderoJohn CrockettKristine CatanoAnne DonadeyTheresa GarciaNina GoGabriel GonzalezThom HarpoleJennifer LakinArion MayesDeb NaylonClaire NorbergMelanie PattonAmy RandelPatricia ReaJessica RenttoGloria RhodesNate RogriguezSweta SarkarCristian Sterling AquinoMary TaylorMaya TaylorSarah VanderburghAllison VaughnAurora VelascoRoy WhitakerDavid Engstrom (past member)Raquel Herriott (past member)Daniella Luistro (past member)Isabella Martelino (past member)Paula Peter (past member)Rick Schultz (past member)\n\n\n\n\n\n\n\n\n\nActivity 35: Developing a task force and applying for Asian American and Native American\n                                       Pacific Islander-Serving Institutions (AANAPISI) status.\n\n\n \n                                 \n                                 \n\n\nCo Chairs\n\n\n\n\nMike Juan\nAssociate Director of Counseling & Psychological Services\n\n\nVirginia Loh-Hagan\nDirector of Asian Pacific Desi American (APIDA) Resource Center\n\n\n\n\n\n\nCommittee Members\n\n\nKoko NishiDaniella LuistroSandra WawryktoIsabella Marteelino (past member)\n\n\n\n\n\n\n\nGOAL 2: Foster and sustain an environment where all students, faculty, staff and alumni feel welcomed, supported, and valued by the university.\nKey Activities:\n\n\n\nActivity 36: Establishing a process and organized structure to coordinate, expand,\n                                       and increase visibility of heritage month programs and events.\n\n\n\n\n\n\nChair\n\n\n\n\nJessica Nare\nAssociate Chief Diversity Officer for Student Engagement\n\n\n\n\n\n\nCommitte Members\n\n\nJessica ChangElzbeth IslasVirginia Loh-HaganJoy MooreMegan NewtonWesley PalauMelissa PorterDarren Wilson\n\n\n\n\n\n\n\n\nActivity 37: Developing a protocol for continuous review and development of campus\n                                       materials, events and programs to ensure diverse backgrounds, identities, and experiences\n                                       are reflected with respect and authenticity.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nLa Monica Everett-Haynes\nAssociate Vice President and Chief Communications Officer\n\n\nCatherine Snapp\nDirector of Communication Services for Student Affairs\n\n\n\n\n\n\nCommittee Members\n\n\nMeena AlexanderTiffany Dykstra-DeVetteLisa HaneyPaige HernandezCaryl Montero AdamsDarren Wilson (past member)\n\n\n\n\n\n\n\n\nActivity 38: Engaging Arts Alive SDSU to display permanent outdoor representations\n                                       of diverse communities.\n\n\n\n\n\n\nChair\n\n\n\n\nPeggy Shannon\nDean of Professional Studies and Fine Arts\n\n\n\n\n\n\nCommittee Members\n\n\nAlanie AbronKarina EstebanJoyce GattasMaribel MaderoRagini ParkhiAresa RochesterEric Smigel\n\n\n\n\n\n\n\n\nActivity 39: Establish a Diversity, Equity and Inclusion Initiative to drive action.\n\n\n\n\n\n\nChair\n\n\n\n\nRebecca Lewison, Ph.D.\nProfessor, Department of Biology\n\n\n\n\n\n\nCommittee Members\n\n\n\nAnahi AcevesAnne DonadeyEdgar HodgeMadhavi McCallJoy MooreGloria RhodesCarolina Rodriguez-UribeJennifer StanleyRandy TimmTiffany Dykstra-DeVette (past member)Raquel Herriot (past member)Maria Keckler (past member)Isabella Martelino (past member)\n\n\n\n\n\n\n\n\n\nActivity 40: Establishing and launching intergroup dialogue programs.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\n\nJessica Chang\n\n\nDiversity Officer for Student Engagement, Center for Intercultural Relations\n\n\n\n\nNicole Belisle\n\n \n\n\n\n\n\n\nCommittee Members\n\n\nYea Wen ChenJessica ChangSureshi JayawardeneAlan MobleyJoy MooreLaWana RichmondAlanie Abron (past member)Justine Darling (past member)Anne Guanciale (past member)Tierney Trujillo-Harrison (past member)\n\n\n\n\n\n\n\n\nActivity 41: Implementing an on-boarding program that emphasizes SDSU’s values and\n                                       educates all newly hired employees and new students about implicit bias, inclusive\n                                       communication, designation and identity as an Hispanic-Serving Institution, and connection\n                                       with the Kumeyaay people.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\n\nJennifer Imazeki\n\n\nAssociate Chief Diversity Officer for Faculty & Staff\n\n\n\n\nFrancisco Velazquez\n\n\nDirector of New Student and Parent Programs\n\n\n\n\n\n\n\nCommittee Members\n\n\nMichael BorgstromJoanna BrooksJessica ChangBelen GaminoDaniel ReinholzAllison VaughnGianna WoodEd Balsdon (past member)Sarah Elkind (past member)Darren Wilson (past member)\n\n\n\n\n\n\n\nGOAL 3: Recruit, retain and advance graduate students, faculty and staff who can and\n                           will effectively support the diverse student body and communities served by SDSU.\n\n\n\nActivity 42: Ensuring participation in professional learning on inclusive practices\n                                       for all committees responsible for admissions and also search, retention, tenure and promotion of employees.\n\n\n\n\n\n\nChair\n\n\n\n\nJennifer Imazeki\nAssociate Chief Diversity Officer for Faculty & Staff\n\n\n\n\n\n\nCommittee Members\n\n\nAndrew BohanakJoanna BrooksThom HarpoleFrank Harris IIIJessica RenttoGianna WoodThierry Devos (past member)Allen Gontz (past member)Max Johnson (past member)\n\n\n\n\n\n\n\n\nActivity 43: Establishing and providing institutional support for structured mentoring\n                                       programs for all faculty and staff.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nSasha Chizhik\nDirector of Academic Labor Relations\n\n\nEmilio Ulloa\nAssociate Chief Diversity Officer for HSI and Regional Affairs\n\n\n\n\n\n\nCommittee Members\n\n\nMark ReedCharlie SalleeDustin ThomanKaren WhitedMari Luisa ZunigaJoanna Brooks (past member)Allen Gontz (past member)Max Johnson (past member)\n\n\n\n\n\n\n\n\nActivity 44: Establishing and providing institutional support for structured leadership\n                                       development opportunities for all faculty and staff.\n\n\n\n\n\n\nChair\n\n\n\n\nThom Harpole\nDirector of Human Resources\n\n\n\n\n\n\nCommittee Members\n\n\nMeena AlexanderJoanna BrooksCourtney HarmonJennifer ImazekiAllen Gontz (past member)JR Lauron (past member)\n\n\n\n\n\n\n\nStudents at Our Core \nExecutive Sponsor: Salvador Hector Ochoa, Ph.D., Provost and Senior Vice President\n                     \nGOAL 1: Ensure that all members of the campus community are prepared to advance student success by deepening the quality of learning and closing equity gaps.\nKey Activities:\n\n\n\nActivity 45: Providing all faculty and advisors with information on student success and equity gaps in their classrooms and their respective colleges to drive improved student support.\n\n\n\n\n\n\nChair\n\n\n\n\nJeanne Stronach\nAssociate Vice President Analytic Studies and Institutional Research\n\n\nErin Jacobs\nDirector of Student Success Analytics\n\n\n\n\n\n\nCommittee Members\n\n\nMichael BorgstromJennifer ImazekiAlane LockwoodMichelle LopezEstralita MartinMadhavi McCallSalvador Hector OchoaNoemi PortillioSonja Pruitt-LordNorah ShultzRandy TimmJoanna Brooks (past member)Sarah Elkind (past member)Ashley Tejeda (past member)\n\n\n\n\n\n\n\n\nActivity 46: Identifying solutions for campuswide technological and professional development\n                                       support for a coordinated campus approach to advising, teaching, and co-curricular\n                                       support services.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nJoanna Brooks\nAssociate Vice President for Faculty Advancement\n\n\nChristy Samarkos\nAssociate Vice President for Student Affairs\n\n\n\n\n\n\nCommittee Members\n\n\nITSAmanda FullerTito HernandezStefan HymanMichelle LopezChristine MolinaJose PreciadoRandy TimmJoyce Chen (past member)Kristie Dock (past member)Jerry Sheehan (past member)\n\n\n\n\n\n\n\n\nActivity 47: Developing plans for all academic programs to be actively engaged in\n                                       equity-driven, evidence-based continuous improvement efforts. By December 2021, SDSU\n                                       will ensure that all academic programs are actively engaged in equity-driven, evidence-based\n                                       continuous improvement efforts that reflect best practices of assessment.\n\n\n\n\n\n\nChair\n\n\n\n\nMadhavi McCall\nAssociate Vice President, Curriculum, Assessment & Accreditation\n\n\n\n\n\n\nCommittee Members\n\n\n\nSalvador Hector OchoaAlexia OduroNina PotterAshley TejedaStephen Schellenberg (past member)Reynaldo Monzon (past member)\n\n\n\n\n\n\n\n\n\nActivity 48: Improving the university’s placement rate for undergraduates in internships,\n                                       research opportunities, and fellowships.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nJulianna Saenz\nInterim Director, Career Services\n\n\n\n\n\n\nCommittee Members\n\n\nGraduate AffairsResearch AffairsJoyce ChenMartha EncisoMegan MahoneyMalerie McNeillChristy SamarkosKristie Dock (past member)James Tarbox (past member)\n\n\n\n\n\n\n\n\nActivity 49: Ensuring that all graduate programs will develop a professional development\n                                       plan for graduate students.\n\n\n\n\n\n\nChair\n\n\n\n\nAndrew Bohonak\nAssistant Dean for Graduate Affairs\n\n\n\n\n\n\nCommittee Members\n\n\nGraduate CouncilResearch AffairsRamona AcunaJosh BarfussJohn McMillanTina TanAllison VaughnFeion VillodasKylee WebsterJames Tarbox (past member)\n\n\n\n\n\n\n\nGOAL 2: Expand access to affordable, high-quality university undergraduate and graduate\n                           education for the people of our region and beyond.\nKey Activities:\n\n\n\nActivity 50: Developing an infrastructure to sustain regional partnerships with K-12\n                                       schools, colleges and industry to promote college readiness and a college-going culture.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nY. Barry Chung\nDean of the College of Education\n\n\nMary Taylor\nDirector for Compact for Success & Collaborative Programs\n\n\n\n\n\n\nCommittee Members\n\n\nCristina AlfaroSarah HoangMiguel RahiotisChristy SamarkosJeanne StronachSandra Temores-ValdezHenry VillegasFabiola Moreno (past member)\n\n\n\n\n\n\n\n\nActivity 51: Increasing the number of SDSU Global Campus adult learners by 25% in five years.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nEugene Olevsky\nDean of the College of Engineering\n\n\nKaren Myers-Bowman \nInterim Dean of SDSU Global Campus\n\n\nRadhika Seshan (past co-chair and member) \nAssociate Vice President for Career Relations and Strategic Partnerships\n\n\n\n\n\n\nCommittee Members\n\n\nHannah Berman SchneiderJoanna BrooksSean HauzeRay SavageAshley Tejada\n\n\n\n\n\n\n\nGOAL 3: To support student success and well-being both inside and outside the classroom,\n                           SDSU will strategically increase its programming, resources and capacity to provide\n                           mental health, wellness and basic needs support for all undergraduate and graduate\n                           students.\nKey Activities:\n\n\n\nActivity 52: Implement a wellness toolkit for faculty and staff to further promote\n                                       and educate about counseling and economic crisis support.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nStephanie Galia\nDirector for Well-being & Health Promotion\n\n\nJen Rikard\nDirector for Counseling & Psychological Services\n\n\n\n\n\n\nCommittee Members\n\n\n\nECRT CommitteeChelsea PayneAva GrellAbigail Tamayo (past member)\n\n\n\n\n\n\n\n\n\nActivity 53: Developing a service delivery model that expands placement of its therapists\n                                       in university programs, departments and centers.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nMichael Juan\nAssociate Director of Counseling & Psychological Services\n\n\nBrent Taylor\nDepartment Chair & Associate Professor of Counseling and School Psychology\n\n\n\n\n\n\nCommittee Members\n\n\nFrida DiazRay SavageKole WellensteinNola Butler Byrd (past member)Jen Rikard (past member)Abigail Tamayo (past member)\n\n\n\n\n\n\n\n\nActivity 54: Creating plans to open a new multidisciplinary space to house and support\n                                       campus basic needs initiatives.\n\n\n\n\n\n\nCo Chairs\n\n\n\n\nAndrea Dooley\nAssociate Vice President for Student Affairs\n\n\nStephanie Galia\nDirector for Well-being & Health Promotion\n\n\n\n\n\n\nCommittee Members\n\n\n\nECRT CommitteeGener AbdonDustin AdkinsKeiara AllenStephanie DatheAva GrellChelsea PayneMayah TaylorVanessa Malcarne (past member)Rosanne Pasenelli (past member)Todd Summer (past member)Abigail Tamayo (past member)\n\n\n\n\n\n\n\n\nStrategic Planning Committee\n\n\n\nCo-Chair\nSalvador Hector Ochoa, Ph.D.SDSU Provost and Senior Vice President\n                                 \n\n\n\n\n\nCo-Chair\nJ. Luke Wood, Ph.D.SDSU Vice President for Student Affairs and Campus Diversity\n                                 \n\n\n\n\nStrategic Planning Team Organizational Structure\nCommittee Members\n\nCassie Aaron\nPresident of Graduate Student Association\n\n\nEd Balsdon, Ph.D.\n                        \nInterim Dean of Graduate Affairs\n\n\nKyla E. Blaylock\nSDSU Student\n\n\nJoanna Brooks, Ph.D.\n                        \nAssociate Vice President for Academic Affairs – Faculty Advancement\n\n\nJenny Bramer\nExecutive Associate Athletic Director\n\n\nKaren Emmorey, Ph.D.\n                        \nProfessor of Speech Language in the College of Health and Human Services\n\n\nAngelica A. Espinoza\nSDSU Student\n\n\nLa Monica Everett-Haynes, Ph.D.\n                        \nAssociate Vice President and Chief Communications Officer\n\n\nMichele Goetz\nAssociate Vice President and Executive Director of SDSU Research Foundation\n\n\nMaureen A. Guarcello, Ph.D.\n                        \nResearch, Analytics, and Communications Specialist, Instructional Technology Services\n\n\nJim Herrick\nAssistant Vice President, Alumni\n\n\nEdgar Hodge, Ed.D.\n                        \nAssistant Vice President for Information Technology\n\n\nHelina Hoyt, Ph.D., RN, PHN\n                        \nSchool of Nursing, SDSU Imperial Valley\n\n\nJennifer Imazeki, Ph.D.\n                        \nAssociate Chief Diversity Officer for Faculty Success and Director of the Center for\n                           Teaching and Learning\n                        \n\n\nGina Jacobs\nAssociate Vice President for Mission Valley Development\n\n\nShane James\nSDSU Student\n\n\nMaria Keckler\nPresidential Communications Director\n\n\nVanessa Malcarne, Ph.D.\n                        \nProfessor of Psychology in the College of Sciences\n\n\nAntionette Marbray, J.D.\n                        \nAssociate Vice President for Student Affairs\n\n\nKaren May-Newman, Ph.D.\n                        \nProfessor of Mechanical Engineering\n\n\nChristian Onwuka\n2019-20 Associated Students President\n\n\nGregorio Ponce, Ph.D.\n                        \nDean of SDSU Imperial Valley\n\n\nJessica Rentto, J.D.\n                        \nAssociate Vice President, Administration\n\n\nJeffrey Roberts, Ph.D.\n                        \nDean of the College of Sciences\n\n\nSherry Ryan, Ph.D.\n                        \nProfessor and Director of the School of Public Affairs\n\n\nBrittany Santos-Derieg\nChief-of-Staff\n\n\nRadhika Seshan, Ph.D.\n                        \nDean of SDSU Global Campus\n\n\nStephanie Smith\nProfessional Graduate Fee Coordinator for the Fowler College of Business\n\n\nJeanne Stronach\nAssistant Vice President, Analytic Studies and Institutional Research\n\n\nMark Wheeler, Ph.D.\n                        \n\nUniversity Senate Chair and Professor of Philosophy\n\n\nMeet our Consultants\nSan Diego State University is embarking in a landmark planning process and, through\n                        that process, is committed to generating input from all levels of the university.\n                        To ensure broad participation, SDSU is drawing on expertise from both within and outside\n                        of the organization. An expert-informed initiative will strongly contribute to the\n                        campus community’s ability to develop a strategic plan that will define not just the\n                        future of one campus, but three: the SDSU main campus, SDSU Imperial Valley, and the\n                        potential development of SDSU Mission Valley. Skilled and nationally-recognized experts\n                        have been engaged to support and help guide this effort, and we encourage you to get\n                        to know them below.\n                     \nEmeritus Consulting Group\nAlma R. Clayton-Pedersen is Chief Executive Officer of Emeritus Consulting Group, a firm that uses organizational\n                        development principles to assist nonprofit, public and education entities in enhancing\n                        their effectiveness for the public good. Clayton-Pedersen brings a wealth of experience\n                        to the firm’s work, particularly with respect to advancing diversity, equity and inclusion\n                        and facilitating discussions around inclusive excellence.\n                     \nClayton-Pedersen previously worked with the Association of American Colleges and Universities\n                        (AAC&U) in several capacities. From 2010 to 2016, she was a Senior Scholar and co-Principal\n                        Investigator directing the work of AAC&U’s Preparing Critical Faculty for the Future\n                        Program, funded by the National Science Foundation. From 2000 to 2010, she served\n                        first as a Senior Policy Director, then Vice President for Education and Institutional\n                        Renewal, directing ongoing programs and several grant-funded projects. Prior to joining\n                        AAC&U, Dr. Clayton-Pedersen was deeply engaged for 16 years at Vanderbilt University,\n                        where she served in senior leadership roles in student affairs, a public policy center,\n                        academic affairs and athletic affairs. She conducted more than 20 institutional studies\n                        on retention, climate for diversity, and student programming. Throughout her 35-year\n                        career in higher education, Clayton-Pedersen has provided consultation on program\n                        evaluation, inter-organizational collaboration, diversity and institutional change\n                        in a range of settings and working with stakeholders nationally and internationally.\n                     \nSonja C. P. Armstrong, whose expertise stems from developing an expansive legal practice to public, is\n                        president and chief operating officer of Emeritus Consulting Group LLC.\n                     \nArmstrong has served as both associate general counsel and special counsel at Chicago\n                        State University, a public, urban institution. As a generalist in higher education\n                        law, she has been responsible for oversight of issues relating to labor and employment,\n                        governance, athletics, residence life, academic affairs and student discipline, among\n                        other areas. One of Armstrong’s most significant campus endeavors involved a 15-month\n                        presidential appointment as interim director of intercollegiate athletics to restructure\n                        an emerging division of the university – creating a culture of compliance, an environment\n                        for successful student outcomes and a focus on institutional mission.\n                     \nPrior to joining Chicago State University, Armstrong was an attorney at Katten Muchin\n                        Rosenman LLP, one of the largest, most well-respected national law firms based in\n                        Chicago. While in private practice, she served as legal counsel and advocate for a\n                        diverse group of public and private entities – including higher education institutions\n                        – in business, regulatory, complex litigation and dispute resolution matters. Overall\n                        she was responsible for resolving challenges faced by her clients and fostering trusting\n                        relationships at all levels within these organizations. Handling that work effectively\n                        required her to use collaborative approaches to chart the best course of action to\n                        reach each client’s organizational objectives.\n                     \nAASCU Penson Center for Professional Development\nHoward Cohen, Ph.D. is the AASCU Penson Center for Professional Development (APC) Executive Director\n                        and a Senior Associate of its consulting group, which works primarily with public\n                        regional universities. Cohen also holds the distinction of Chancellor Emeritus at\n                        Purdue University Northwest. Prior to his 10-year tenure as Chancellor, Cohen also\n                        served in academic and administrative appointments within the University of Massachusetts\n                        and University of Wisconsin systems. His areas of focus include strategic and academic\n                        planning, department chair leadership, leadership team development and executive coaching.\n                        Cohen is expected to be the lead consultant for the strategic planning components\n                        of our engagement, working in conjunction with other APC colleagues as needed.\n                     \nSal Rinella, Ph.D. is a former university president who has served as a consultant with APC and other\n                        organizations in all sectors of higher education for the past 14 years. Rinella also\n                        has been a facilitator and author for the Society for College and University Planning\n                        (SCUP) roundtables and monographs, leading discussions of timely topics including\n                        New Forces and Realities: Making the Adjustment and The Presidential Role in Disaster\n                        Planning and Response. From 1994 to 2000, Rinella served at the helm of Austin Peay\n                        State University, an institution known for its collaborative, integrative learning\n                        community that tremendously expanded over the past three decades. Rinella’s areas\n                        of emphasis include strategic planning and positioning, identifying transformational\n                        programs and initiatives, formulating partnerships to advance the institution and\n                        team development.\n                     \n\n\n\n\n\n\nWe thank all members of our campus community – students, faculty, staff and administrators\n                  – for providing input and feedback, which will then inform San Diego State University’s\n                  future vision, mission and strategic priorities.\n               \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5500 Campanile DriveSan Diego, CA 92182\n619-594-5200\n\n\n\n\n\n\n\n\nA-Z Index\n\n\nCampus Directory\n\n\nMaps\n\n\nParking\n\n\n\n\n\n\nEmployment\n\n\nMedia Relations\n\n\nGive to SDSU\n\n\nCanvas\n\n\n\n\n\n\nGeneral Contact\n\n\nNetwork Status\n\n\nStrategic Plan\n\n\nNewsletter Sign Up\n\n\n\n\n\n\n\n\n\n\nCopyright © 2023 San Diego State University\n\n\n\n\nRequires SDSUid\n indicates links which require an SDSUid.\n\n\n\nAccessibility\n\n\nSDSU Digital Privacy Statement\n\n\nFeedback\n\n\n\n\n \n\n\nDocument Readers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLast Updated 2/22/22\n",
    "links": [
        "#maincontent",
        "#",
        "/",
        "/strategic-plan/",
        "https://newscenter.sdsu.edu/student_affairs/sds/",
        "https://directory.sdsu.edu/",
        "#",
        "https://admissions.sdsu.edu/",
        "https://newscenter.sdsu.edu/home/currentstudents.aspx",
        "https://www.sdsu.edu/faculty-staff",
        "http://www.sdsualumni.org/",
        "https://www.facebook.com/SanDiegoState",
        "https://twitter.com/sdsu",
        "https://www.youtube.com/user/SDSUVideo",
        "https://instagram.com/sandiegostateuniversity",
        "https://communities.sdsu.edu/",
        "/",
        "/strategic-plan/",
        "#siteNavigation",
        "#post-site-nav",
        "https://www.sdsu.edu/strategic-plan/process",
        "https://www.sdsu.edu/strategic-plan/updates",
        "https://www.sdsu.edu/strategic-plan/teams",
        "https://www.sdsu.edu/strategic-plan/events",
        "https://www.sdsu.edu/strategic-plan/communications",
        "https://www.sdsu.edu/strategic-plan/faq",
        "#collapsed19e405_1",
        "#collapsed19e446_1",
        "#collapsed19e446_2",
        "#collapsed19e405_2",
        "#collapsed19e586_1",
        "#collapsed19e586_2",
        "#collapsed19e405_3",
        "#collapsed19e732_1",
        "#collapsed19e732_2",
        "#collapsed19e405_4",
        "#collapsed19e861_1",
        "#collapsed19e861_2",
        "#collapsed19e1021_1",
        "#collapsed19e1062_1",
        "#collapsed19e1062_2",
        "#collapsed19e1021_2",
        "#collapsed19e1203_1",
        "#collapsed19e1203_2",
        "#collapsed19e1021_3",
        "#collapsed19e1328_1",
        "#collapsed19e1328_2",
        "#collapsed19e1482_1",
        "#collapsed19e1523_1",
        "#collapsed19e1523_2",
        "#collapsed19e1482_2",
        "#collapsed19e1684_1",
        "#collapsed19e1684_2",
        "#collapsed19e1482_3",
        "#collapsed19e1845_1",
        "#collapsed19e1845_2",
        "#collapsed19e1482_4",
        "#collapsed19e2048_1",
        "#collapsed19e2048_2",
        "#collapsed19e2244_1",
        "#collapsed19e2285_1",
        "#collapsed19e2285_2",
        "#collapsed19e2244_2",
        "#collapsed19e2430_1",
        "#collapsed19e2430_2",
        "#collapsed19e2244_3",
        "#collapsed19e2574_1",
        "#collapsed19e2574_2",
        "#collapsed19e2725_1",
        "#collapsed19e2766_1",
        "#collapsed19e2766_2",
        "#collapsed19e2725_2",
        "#collapsed19e2912_1",
        "#collapsed19e2912_2",
        "#collapsed19e2725_3",
        "#collapsed19e3059_1",
        "#collapsed19e3059_2",
        "#collapsed19e3212_1",
        "#collapsed19e3255_1",
        "#collapsed19e3255_2",
        "#collapsed19e3212_2",
        "#collapsed19e3410_1",
        "#collapsed19e3410_2",
        "#collapsed19e3212_3",
        "#collapsed19e3539_1",
        "#collapsed19e3539_2",
        "#collapsed19e3212_4",
        "#collapsed19e3685_1",
        "#collapsed19e3685_2",
        "#collapsed19e3212_5",
        "#collapsed19e3814_1",
        "#collapsed19e3814_2",
        "#collapsed19e3212_6",
        "#collapsed19e3946_1",
        "#collapsed19e3946_2",
        "#collapsed19e3212_7",
        "#collapsed19e4079_1",
        "#collapsed19e4079_2",
        "#collapsed19e3212_8",
        "#collapsed19e4202_1",
        "#collapsed19e4202_2",
        "#collapsed19e4324_1",
        "#collapsed19e4365_1",
        "#collapsed19e4365_2",
        "#collapsed19e4324_2",
        "#collapsed19e4510_1",
        "#collapsed19e4510_2",
        "#collapsed19e4324_3",
        "#collapsed19e4627_1",
        "#collapsed19e4627_2",
        "#collapsed19e4324_4",
        "#collapsed19e4747_1",
        "#collapsed19e4747_2",
        "#collapsed19e4324_5",
        "#collapsed19e4893_1",
        "#collapsed19e4893_2",
        "#collapsed19e5031_1",
        "#collapsed19e5072_1",
        "#collapsed19e5072_2",
        "#collapsed19e5031_2",
        "#collapsed19e5224_1",
        "#collapsed19e5224_2",
        "#collapsed19e5031_3",
        "#collapsed19e5411_1",
        "#collapsed19e5411_2",
        "#collapsed19e5031_4",
        "#collapsed19e5552_1",
        "#collapsed19e5552_2",
        "#collapsed19e5031_5",
        "#collapsed19e5743_1",
        "#collapsed19e5743_2",
        "#collapsed19e5877_1",
        "#collapsed19e5918_1",
        "#collapsed19e5918_2",
        "#collapsed19e5877_2",
        "#collapsed19e6046_1",
        "#collapsed19e6046_2",
        "#collapsed19e5877_3",
        "#collapsed19e6180_1",
        "#collapsed19e6180_2",
        "#collapsed19e5877_4",
        "#collapsed19e6307_1",
        "#collapsed19e6307_2",
        "#collapsed19e5877_5",
        "#collapsed19e6449_1",
        "#collapsed19e6449_2",
        "#collapsed19e5877_6",
        "#collapsed19e6601_1",
        "#collapsed19e6601_2",
        "#collapsed19e6755_1",
        "#collapsed19e6800_1",
        "#collapsed19e6800_2",
        "#collapsed19e6755_2",
        "#collapsed19e6931_1",
        "#collapsed19e6931_2",
        "#collapsed19e6755_3",
        "#collapsed19e7070_1",
        "#collapsed19e7070_2",
        "#collapsed19e7205_1",
        "#collapsed19e7258_1",
        "#collapsed19e7258_2",
        "#collapsed19e7205_2",
        "#collapsed19e7413_1",
        "#collapsed19e7413_2",
        "#collapsed19e7205_3",
        "#collapsed19e7561_1",
        "#collapsed19e7561_2",
        "#collapsed19e7205_4",
        "#collapsed19e7690_1",
        "#collapsed19e7690_2",
        "#collapsed19e7205_5",
        "#collapsed19e7821_1",
        "#collapsed19e7821_2",
        "#collapsed19e7955_1",
        "#collapsed19e7996_1",
        "#collapsed19e7996_2",
        "#collapsed19e7955_2",
        "#collapsed19e8139_1",
        "#collapsed19e8139_2",
        "#collapsed19e8287_1",
        "#collapsed19e8328_1",
        "#collapsed19e8328_2",
        "#collapsed19e8287_2",
        "#collapsed19e8462_1",
        "#collapsed19e8462_2",
        "#collapsed19e8287_3",
        "#collapsed19e8596_1",
        "#collapsed19e8596_2",
        "/strategic-plan/_files/revised-2020-01-17-strategic-planning-team-org-structure.pdf",
        "https://www.sdsu.edu/",
        "tel:1-619-594-5200",
        "/departments/",
        "https://directory.sdsu.edu/",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/campus/parkingtrans/permits",
        "https://bfa.sdsu.edu/hr/jobs",
        "https://brand.sdsu.edu/stratcomm/media-relations",
        "https://give.sdsu.edu/",
        "https://canvas.sdsu.edu/",
        "/contact/",
        "https://status.sdsu.edu/",
        "/strategic-plan/",
        "https://www.sdsu.edu/newscenter-newsletter-signup",
        "https://it.sdsu.edu/sdsuid",
        "https://accessibility.sdsu.edu/",
        "https://sdsu.edu/digitalprivacy",
        "https://www.sdsu.edu/feedback?utm_source=www&utm_medium=web&utm_campaign=analytics",
        "https://www.sdsu.edu/document-readers",
        "https://www.facebook.com/SanDiegoState",
        "https://twitter.com/sdsu",
        "https://www.youtube.com/user/SDSUVideo",
        "https://instagram.com/sandiegostateuniversity",
        "https://communities.sdsu.edu/",
        "https://a.cms.omniupdate.com/11/?skin=sdsu&account=prod&site=www&action=de&path=/strategic-plan/teams/index.pcf"
    ]
}