{
    "title": "Kelola pekerjaan, proyek, & tugas tim Anda secara online • Asana",
    "body": "Asana HomeNavigation InstructionsUse left and right arrow keys to navigate between columns.Use up and down arrow keys to move between submenu items.Use Escape to close the menu.Mengapa Asana? Mengapa AsanaIkhtisarBuat rencana proyek, koordinasi tugas, dan tepati batas waktuUntuk PemasaranRencanakan dan lacak kampanye, peluncuran, dan banyak lagiUntuk OperasiBuat, ukur dan persingkat proses meningkatkan efisiensiUntuk Pemimpin BaruTingkatkan kejelasan, fokus, dan pertumbuhan pribadiUntuk ProdukBuat peta jalan, rencanakan periode waktu, kelola pengiriman dan peluncuranUntuk Alur Kerja AndaManajemen ProyekRencanakan, awasi, dan kelola proyek tim dari awal hingga akhirManajemen KampanyeBuat, luncurkan, dan awasi strategi pemasaran AndaProduksi KreatifDesain, tinjau, dan kirim hasil kerja inspirasionalPelacakan PermintaanLacak, prioritaskan, dan penuhi permintaan untuk tim AndaPopuler tim jarak jauhKolaborasi dan kelola pekerjaan dari mana punProduktivitasLebih berhati-hati bagaimana mengelola waktu AndaAgile ManagementBuat cepat, sering kirim, dan lacak itu semua di satu tempatLihat semua alur kerjaTemplatBeranda TemplatMulai sesuatu dengan cepat memakai templat yang dirancang untuk kasus penggunaan AndaTemplat PopulerPerkembangan timAgenda rapatRencana proyekPermintaan kerjaPerencanaan gol & tujuan timHubungi PenjualanLihat DemoFitur Fitur UtamaPembuat Alur Kerja BaruCiptakan proses otomatis untuk mengoordinasi tim AndaLinimasaBuat diagram Gantt cantik dalam hitungan menitPapanLihat dan awasi pekerjaan Anda di Papan kanbanKalenderLihat hasil kerja tim Anda di satu kalender bersamaIntegrasi AppLihat cara Asana menyatukan app untuk mendukung tim AndaPelaporanDapatkan pemahaman real-time tentag progres rangkaian pekerjaan apa punGolAtur gol strategis dan lacak progres di satu tempatFormulirKirim dan kelola permintaan kerja di satu tempatAutomasiPersingkat proses, kurangi kesalahan, dan habiskan sedikit waktu pada tugas rutinBeban kerjaLihat berapa banyak pekerjaan anggota tim miliki di seluruh proyekDesktop dan App SelulerSinkronkan pekerjaan dengan semua perangkat Anda secara langsungLihat semua fiturSemua PaketBasicUntuk manajemen tugas dan proyek sederhana. Gratis untuk tim hingga 15 orangPremiumUntuk merencanakan dan mengelola proyek tim secara efektifBisnisUntuk mengelola inisiatif lebih besar dan meningkatkan kolaborasi lintas timEnterpriseUntuk organisasi yang memerlukan keamanan, kontrol, dan dukungan tambahanBandingkan semua paketHubungi PenjualanLihat DemoSumber daya PelajariSumber Daya Manajemen KerjaTemukan praktik terbaik, saksikan webinar, dapatkan informasiPanduan AsanaDapatkan banyak kiat, trik, dan nasihat untuk memanfaatkan Asana secara maksimalAsana AcademyDaftar kursus dan webinar interaktif untuk mempelajari AsanaBlogTemukan produk Asana dan berita perusahaan terkiniHubungkanAcaraCari tahu tentang acara mendatang di dekat AndaProgram KomunitasGabung dan belajar dari pelanggan Asana di seluruh duniaDukunganButuh bantuan? Hubungi tim pendukung AsanaMitraPelajari selengkapnya tentang program mitra kamiDeveloperPelajari selengkapnya tentang membuat app di platform AsanaAsana untuk Badan NirlabaDapatkan lebih banyak informasi soal program diskon nirlaba kami, dan daftar.Bacaan yang DitampilkanDorong dampak pegawai: Alat baru untuk memberdayakan kepemimpinan yang tangguh,LaporanBaca SelengkapnyaThe Anatomy of Work: Global Index 2023,LaporanBaca Selengkapnya2 fitur baru untuk membantu tim Anda mendapatkan kejelasan dan konteks di tahun baru,BlogBaca SelengkapnyaHubungi PenjualanLihat DemoEnterpriseHargaMulaiMulaiMasukBuka AsanaHubungi PenjualanLihat DemoBahasa IndonesiaDeutschEnglishEspañolFrançaisItaliano日本語한국어NederlandsPolskiPortuguêsРусскийSvenska繁體中文Hubungi PenjualanMasukMulaiJadikan pekerjaan yang bekerja untuk Anda.Asana mengatur semua pekerjaan, mulai hal kecil hingga gambaran umum, sehingga tim mengetahui apa yang harus dilakukan, mengapa itu penting, dan cara menyelesaikannya.MulaiHubungi penjualanMarketingProductITOperationsSalesKumpulkan umpan balik kreat...Kumpulkan umpan balik kreat...Dapatkan persetujuan anggar...Dapatkan persetujuan anggar...Luncurkan kampanye merekLuncurkan kampanye merekMANAJEMEN PROYEKTetap tertata dan terhubungKumpulkan pekerjaan tim di satu tempat bersama. Pilih tampilan proyek yang sesuai dengan gaya Anda dan berkolaborasilah di mana pun Anda berada.PerencanaanPengembangan KontenMaretAprilUntuk dikerjakanBerlangsungSiap ditinjauKembangkan kerangka kerja olahpesan31 - 10 MarTulis brief kampanye5 – 15 MarSelesaikan rencana peluncuran42012 – 15 AprAdakan rapat perdana55 – 12 MarBuat materi pemasaran1 – 20 AprTinjau aset kampanye1211 – 15 AprPerencanaanPengembangan KontenMaretAprilUntuk dikerjakanBerlangsungSiap ditinjauKembangkan kerangka kerja olahpesan31 - 10 MarTulis brief kampanye5 – 15 MarSelesaikan rencana peluncuran42012 – 15 AprAdakan rapat perdana55 – 12 MarBuat materi pemasaran1 – 20 AprTinjau aset kampanye1211 – 15 AprTampilan daftarTata dan beri tugas. Dengan daftar, tim melihat langsung hal yang harus dilakukan, tugas prioritas, dan kapan pekerjaan memasuki tenggatnya.MulaiPerencanaanPengembangan KontenMaretAprilUntuk dikerjakanBerlangsungSiap ditinjauKembangkan kerangka kerja olahpesan31 - 10 MarTulis brief kampanye5 – 15 MarSelesaikan rencana peluncuran42012 – 15 AprAdakan rapat perdana55 – 12 MarBuat materi pemasaran1 – 20 AprTinjau aset kampanye1211 – 15 AprLinimasaLihat pemetaan pekerjaan dari waktu ke waktu. Kelola tugas dependen, tumpang tindih, dan belum terjadwal serta buat rencana yang dapat diandalkan tim.MulaiPerencanaanPengembangan KontenMaretAprilUntuk dikerjakanBerlangsungSiap ditinjauKembangkan kerangka kerja olahpesan31 - 10 MarTulis brief kampanye5 – 15 MarSelesaikan rencana peluncuran42012 – 15 AprAdakan rapat perdana55 – 12 MarBuat materi pemasaran1 – 20 AprTinjau aset kampanye1211 – 15 AprPapanPermudah tim untuk fokus pada tugas yang sedang ditangani. Tentukan setiap tahap pekerjaan untuk melihat hal-hal penting maupun yang tidak menghasilkan kemajuan.MulaiMANAJEMEN PROSESOtomatiskan pekerjaan rutinSerahkan hal-hal monoton kepada kami sehingga Anda dapat menangani lebih banyak pekerjaan terbaik.Ikhtisar ProyekPastikan tim memiliki kejelasan dan konteks sejak awal. Bagikan gol, sumber daya utama, dan lainnya untuk menetapkan tahap pekerjaan dan menyelaraskan tim.Pelajari tentang Ikhtisar ProyekAturanBuat Aturan kustom dalam beberapa detik untuk mengotomatiskan tugas umum dan mengurangi kesalahan. Seperti memberikan pekerjaan, menetapkan tenggat, dan lainnya.Pelajari tentang AturanFormulirSiapkan Formulir untuk memudahkan orang lain mengajukan permintaan pekerjaan. Dapatkan detail yang diperlukan tim untuk memulai pekerjaan. Dan, kelola semuanya di satu tempat.Pelajari tentang FormulirTemplatPilih dari 50+ templat proyek. Sesuaikan templat untuk melakukan pekerjaan sesuai keinginan, pastikan tidak ada yang melewatkan satu langkah pun, dan buat tim tetap memiliki tujuan yang sama.Pelajari tentang TemplatIntegrasiSatu platform untuk mengelola pekerjaanDengan lebih dari 200+ integrasi, Anda dapat mengumpulkan segala hal yang dibutuhkan tim untuk mengomunikasikan, mengolaborasikan, dan mengoordinasikan pekerjaan mulai dari awal hingga akhir.EverhourUntuk pelacakan waktu. Siapkan anggaran proyek, lacak jam, dan lainnya di Asana.Microsoft TeamsUntuk komunikasi. Tambahkan dan lakukan kolaborasi pada tugas Asana tanpa keluar dari Teams.Google SheetsUntuk pelaporan. Tarik data dari Asana ke Sheets untuk membuat tabel kustom, diagram, dan …ZoomUntuk koordinasi. Ubah item tindakan, dari rapat menjadi tugas di Asana, langsung dari Zoom.Adobe Creative CloudUntuk komunikasi. Lihat tugas Asana, dapatkan umpan balik, dan banyak lagi langsung dari …Google KalenderUntuk manajemen waktu. Tambahkan tugas Asana ke kalender untuk melihat batas waktu.HarvestUntuk pelacakan waktu. Lacak waktu untuk mencatat jam yang dapat ditagih dan buat faktur di …DropboxUntuk berbagi file. Lampirkan file dari Dropbox ke tugas Asana dari panel tugas Asana.SlackUntuk komunikasi. Tambahkan, berikan, bahkan komentari tugas Asana (dan lainnya) di Slack.Google DriveUntuk berbagi file. Lampirkan file dari Google Drive ke tugas Asana dari panel tugas.Jira CloudUntuk koordinasi. Buat isu Jira dan lacak pekerjaan tanpa keluar dari Asana.SalesforceUntuk koordinasi. Berkolaborasi pada tugas Asana untuk kebutuhan pra-penjualan di Salesforce.GmailUntuk koordinasi. Ubah email menjadi tugas di Asana langsung dari kotak masuk Gmail.OneDriveUntuk berbagi file. Lampirkan file Microsoft ke tugas Asana dari panel tugas Asana.ZapierUntuk menghubungkan banyak aplikasi. Terhubung dengan 1000+ aplikasi untuk membagikan data …TableauUntuk pelaporan. Tarik data dari Asana ke Tableau untuk membuat dasbor kustom.SharepointUntuk berbagi file. Lampirkan file dari Sharepoint ke tugas Asana dari panel tugas Asana.OutlookUntuk koordinasi. Ubah email menjadi tugas di Asana langsung dari kotak masuk Outlook.Office 365Untuk komunikasi. Terus dapatkan informasi terbaru tentang pekerjaan di Asana tanpa keluar …BoxUntuk berbagi file. Lampirkan file dari Box ke tugas Asana dari panel tugas Asana.Microsoft Power BIUntuk pelaporan. Tarik data dari Asana ke Power BI untuk membuat dasbor kustom.InstaganttUntuk penjadwalan. Buat diagram Gantt untuk melihat tugas Asana dan lainnya pada linimasa.EverhourUntuk pelacakan waktu. Siapkan anggaran proyek, lacak jam, dan lainnya di Asana.Microsoft TeamsUntuk komunikasi. Tambahkan dan lakukan kolaborasi pada tugas Asana tanpa keluar dari Teams.Google SheetsUntuk pelaporan. Tarik data dari Asana ke Sheets untuk membuat tabel kustom, diagram, dan …ZoomUntuk koordinasi. Ubah item tindakan, dari rapat menjadi tugas di Asana, langsung dari Zoom.Adobe Creative CloudUntuk komunikasi. Lihat tugas Asana, dapatkan umpan balik, dan banyak lagi langsung dari …Google KalenderUntuk manajemen waktu. Tambahkan tugas Asana ke kalender untuk melihat batas waktu.HarvestUntuk pelacakan waktu. Lacak waktu untuk mencatat jam yang dapat ditagih dan buat faktur di …DropboxUntuk berbagi file. Lampirkan file dari Dropbox ke tugas Asana dari panel tugas Asana.SlackUntuk komunikasi. Tambahkan, berikan, bahkan komentari tugas Asana (dan lainnya) di Slack.Google DriveUntuk berbagi file. Lampirkan file dari Google Drive ke tugas Asana dari panel tugas.Jira CloudUntuk koordinasi. Buat isu Jira dan lacak pekerjaan tanpa keluar dari Asana.SalesforceUntuk koordinasi. Berkolaborasi pada tugas Asana untuk kebutuhan pra-penjualan di Salesforce.GmailUntuk koordinasi. Ubah email menjadi tugas di Asana langsung dari kotak masuk Gmail.OneDriveUntuk berbagi file. Lampirkan file Microsoft ke tugas Asana dari panel tugas Asana.ZapierUntuk menghubungkan banyak aplikasi. Terhubung dengan 1000+ aplikasi untuk membagikan data …TableauUntuk pelaporan. Tarik data dari Asana ke Tableau untuk membuat dasbor kustom.SharepointUntuk berbagi file. Lampirkan file dari Sharepoint ke tugas Asana dari panel tugas Asana.OutlookUntuk koordinasi. Ubah email menjadi tugas di Asana langsung dari kotak masuk Outlook.Office 365Untuk komunikasi. Terus dapatkan informasi terbaru tentang pekerjaan di Asana tanpa keluar …BoxUntuk berbagi file. Lampirkan file dari Box ke tugas Asana dari panel tugas Asana.Microsoft Power BIUntuk pelaporan. Tarik data dari Asana ke Power BI untuk membuat dasbor kustom.InstaganttUntuk penjadwalan. Buat diagram Gantt untuk melihat tugas Asana dan lainnya pada linimasa.PelaporanDapatkan gambaran secara keseluruhan. Akhirnya.Pantau progres dan beban kerja tim. Dapatkan bagan real-time dan sorotan visual lain untuk membagikan status, menemukan potensi masalah, serta menjaga pekerjaan sesuai rencana.Sesuai RencanaBerisikoTidak Sesuai RencanaMemiliki semua informasi di satu tempat terpusat itu penting sekali. Kami menggunakan Asana untuk menyimpan semua dokumen, catatan, dan langkah berikutnya untuk mempertahankan konsistensi.Ashlee George // Direktur Muda di Impact JusticeBerkat Asana, kami membangun relasi yang baik dengan departemen lainnya. Saya dapat berinteraksi dengan para insinyur secara langsung serta menjalin hubungan kerja, dan kolaborasi kami memberikan manfaat yang luar biasa.Kyler Rose // Manajer Layanan PemasaranDengan Asana, kami menghemat sekitar 50 jam per minggu yang sebelumnya dihabiskan untuk menjawab email dan menghadiri rapat pemeriksaan.Jamie Chappell // Direktur KreatifSemua orang menggunakan Asana, mulai dari C level hingga setiap dan seluruh kontributor individu perusahaan...Ini meningkatkan produktivitas kami.Jan Hofmann // Direktur Strategi di ViessmannDalam pemerintahan, tantangan selalu ada, tetapi ada banyak hal yang dapat kami kendalikan. Ada proses yang dapat kami tingkatkan dan perbaiki. Alat seperti Asana memungkinkan kami bekerja dengan lebih baik.Walikota Jorge Elorza // Kota ProvidencePegawai baru dapat melihat papan Permintaan Kreatif dan segera memahami pekerjaan yang ditangani seluruh tim pemasaran tanpa harus bertanya.Kerry Hoffman // Kepala Manajemen & Operasi Proyek Global, Pemasaran, ClassPassInilah pelanggan kamiMulai dengan mudahBaik ingin memulai dengan templat pra-bangun untuk pemasaran, operasi, produk, mempelajari selengkapnya dari demo, atau menghubungi tim dukungan kami, Asana dapat membantu Anda.Mulai dengan templatLihat templatLihat cara kerja AsanaLihat demoHubungi tim penjualan kamiHubungi penjualanLihat segala hal yang dikerjakan tim di satu tempat.MulaiThe best platform for cross-functional workWant more efficiency in your organization? Asana is easy for all teams to use, so you can deliver quality work, faster.Get startedSee how it worksAsana HomeAsanaBerandaProdukHargaPremiumBusinessEnterpriseKesuksesan PelangganTemplat AsanaKepercayaan & KeamananStatusTentang KamiPerusahaanKepemimpinanPelangganKeragamanKarirPersWavelengthThe WorkbackHubungan InvestorPeta SitusPernyataan Transparansi Perbudakan ModernSolusi Alur KerjaManajemen ProyekManajemen GolAgile ManagementManajemen TugasTingkatkan ProduktivitasManajemen KerjaPerencanaan ProyekDaftar PekerjaanLihat Semua PenggunaanLihat Semua TimSumber DayaPanduan AsanaForumDukunganDirektori AppDeveloper & APIMitraKomunitas AsanaAcaraAsana untuk Badan NirlabaAksesibilitasPelajari11 Gaya Kepemimpinan110 Pertanyaan Pencair SuasanaKiat Ringkasan EksekutifKiat Impostor SyndromeCegah Burnout TimKiat Analisis SWOTApa itu OKR?Apa itu Gol SMART?Apa itu Scope Creep?Lihat Semua Panduan© 2023 Asana, Inc.LanguageBahasa IndonesiaDeutschEnglishEspañolFrançaisItaliano日本語한국어NederlandsPolskiPortuguêsРусскийSvenska繁體中文Ketentuan & PrivasiTwitterLinkedinInstagramFacebookYoutube",
    "links": [
        "https://asana.com/idundefined",
        "/id/?noredirect",
        "/id/product",
        "/id/teams/marketing",
        "/id/teams/operations",
        "/id/teams/leaders",
        "/id/teams/product-managers",
        "/id/uses/project-management",
        "/id/workflows/campaign-management",
        "/id/workflows/creative-production",
        "/id/workflows/request-tracking",
        "/id/uses/manage-remote-teams",
        "/id/uses/increase-productivity",
        "/id/uses/agile-management",
        "/id/workflows",
        "/id/templates",
        "/id/templates/for/other/business-continuity-plan",
        "/id/templates/for/other/qbr-meeting-agenda",
        "/id/templates/for/other/cross-functional-project-plan",
        "/id/templates/for/other/work-requests",
        "/id/templates/for/other/team-goals-planning-example",
        "/id/sales",
        "/id/go/demo",
        "/id/product/workflow-builder",
        "/id/product/timeline",
        "/id/uses/kanban-boards",
        "/id/uses/team-calendar",
        "/id/integrations",
        "/id/product/reporting",
        "/id/product/goals",
        "/id/product/forms",
        "/id/product/automation",
        "/id/product/workload",
        "/id/download",
        "/id/features",
        "/id/pricing",
        "/id/premium",
        "/id/business",
        "/id/enterprise",
        "/id/pricing",
        "/id/sales",
        "/id/go/demo",
        "/id/resources",
        "/id/guide",
        "https://academy.asana.com/",
        "https://theworkback.com/",
        "https://events.asana.com",
        "/id/community",
        "/id/support",
        "/id/partners",
        "/id/developers",
        "/id/nonprofit",
        "https://blog.asana.com/2022/06/impact",
        "http://asana.com/resources/anatomy-of-work",
        "https://blog.asana.com/2021/01/clarity-through-context",
        "/id/sales",
        "/id/go/demo",
        "/id/enterprise",
        "/id/pricing",
        "/id/create-account",
        "/id/create-account",
        "https://app.asana.com",
        "https://app.asana.com",
        "/id/sales",
        "/id/go/demo",
        "/id/sales",
        "https://app.asana.com/-/login",
        "/id/create-account",
        "/id/create-account",
        "/id/sales",
        "/id/create-account",
        "/id/create-account",
        "/id/create-account",
        "/id/create-account",
        "/id/create-account",
        "/id/create-account",
        "/id/create-account",
        "/id/apps?category=featured-apps",
        "#",
        "/id/apps/everhour",
        "/id/apps/microsoft",
        "/id/apps/google-sheets",
        "/id/apps/zoom",
        "/id/apps/adobe-creative-cloud",
        "/id/apps/google-calendar",
        "/id/apps/harvest",
        "/id/apps/dropbox",
        "/id/apps/slack",
        "/id/apps/google-drive",
        "/id/apps/jiracloud",
        "/id/apps/salesforce",
        "/id/apps/google-gmail",
        "/id/apps/microsoft-one-drive",
        "/id/apps/zapier",
        "/id/apps/tableau",
        "/id/apps/sharepoint",
        "/id/apps/outlook",
        "/id/apps/microsoft-office365-connector",
        "/id/apps/box",
        "/id/apps/powerbi",
        "/id/apps/instagantt",
        "/id/apps/everhour",
        "/id/apps/microsoft",
        "/id/apps/google-sheets",
        "/id/apps/zoom",
        "/id/apps/adobe-creative-cloud",
        "/id/apps/google-calendar",
        "/id/apps/harvest",
        "/id/apps/dropbox",
        "/id/apps/slack",
        "/id/apps/google-drive",
        "/id/apps/jiracloud",
        "/id/apps/salesforce",
        "/id/apps/google-gmail",
        "/id/apps/microsoft-one-drive",
        "/id/apps/zapier",
        "/id/apps/tableau",
        "/id/apps/sharepoint",
        "/id/apps/outlook",
        "/id/apps/microsoft-office365-connector",
        "/id/apps/box",
        "/id/apps/powerbi",
        "/id/apps/instagantt",
        "/id/customers",
        "/id/templates",
        "/id/go/demo",
        "/id/sales",
        "/id/create-account",
        "/create-account",
        "/product",
        "/id?noredirect",
        "/id?noredirect",
        "/id/product",
        "/id/pricing",
        "/id/premium",
        "/id/business",
        "/id/enterprise",
        "/id/customer-success",
        "/id/templates",
        "/id/trust",
        "https://status.asana.com",
        "/id/company",
        "/id/leadership",
        "/id/customers",
        "/id/diversity-and-inclusion",
        "/id/jobs",
        "/id/press",
        "https://wavelength.asana.com/",
        "https://theworkback.com/",
        "https://investors.asana.com/",
        "/id/site-map",
        "/id/terms/modern-slavery-statement",
        "/id/uses/project-management",
        "/id/product/goals",
        "/id/uses/agile-management",
        "/id/uses/task-management",
        "/id/uses/increase-productivity",
        "/id/uses/work-management",
        "/id/uses/project-planning",
        "/id/uses/to-do-list",
        "/id/uses",
        "/id/teams",
        "/id/guide",
        "https://forum.asana.com",
        "/id/support",
        "/id/apps",
        "https://developers.asana.com/docs/",
        "/id/partners",
        "/id/community",
        "https://events.asana.com/",
        "/id/nonprofit",
        "/id/accessibility",
        "/id/resources/leadership-styles",
        "/id/resources/icebreaker-questions-team-building",
        "/id/resources/executive-summary-examples",
        "/id/resources/impostor-syndrome",
        "/id/resources/what-is-burnout",
        "/id/resources/swot-analysis",
        "/id/resources/okr-meaning",
        "/id/resources/smart-goals",
        "/id/resources/what-is-scope-creep",
        "/id/resources",
        "#i18n",
        "/id",
        "/de",
        "/",
        "/es",
        "/fr",
        "/it",
        "/ja",
        "/ko",
        "/nl",
        "/pl",
        "/pt",
        "/ru",
        "/sv",
        "/zh-tw",
        "/id/terms",
        "/id/terms#privacy-policy",
        "https://twitter.com/intent/follow?screen_name=asana",
        "https://www.linkedin.com/company/asana",
        "https://www.instagram.com/asana/",
        "https://www.facebook.com/asana",
        "https://www.youtube.com/channel/UC2BoogM0AqwOJyoSp1S4ClQ",
        "https://itunes.apple.com/us/app/asana-mobile/id489969512?mt=8",
        "https://play.google.com/store/apps/details?id=com.asana.app"
    ]
}