{
    "title": "Distinguished Alum and Nonprofit Chair Marti Sutton - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nDistinguished Alum and Nonprofit Chair Marti Sutton\n\nAshley Gebb\nFebruary 22, 2023\n\n\n\n\n \n\n\n\nMarti Sutton (Business Administration, ’92) remembers the moment she found her advocacy voice. “Forced to do public speaking,” as she describes it, she remembers shaking at the front of an undergraduate classroom before returning to her desk and thinking “I just did that.” Soon thereafter, during a management course with Professor Pamela Johnson, she had to write an essay on sexual harassment in the workplace during one of her biggest exams. It wasn’t until after she turned in the test she realized she had answered that essay incorrectly. When students returned to class, Sutton sat anxiously awaiting her grade and felt even more defeated when Johnson told the class only one person got an A. Imagine Sutton’s surprise when her paper came back and the professor had scrawled that even though her answer was incorrect, she argued her point so well that she earned full credit.\n“I was a pretty shy kid, and it was the first time I realized my voice mattered,” she said.\nSutton has taken her voice far since then—from a small nonprofit working on education and health care reform in Washington, DC, to the Office of Management and Budget in the White House during the Clinton Administration to helping found the National Campaign to Prevent Teenage Pregnancy. After moving back to California and raising her family, she began donating her expertise to causes she cared about, spending time as chair of the board of BayKids and eight years on the Los Positas College Foundation Board. Today, she is chair of the Tri-Valley Nonprofit Alliance and serves on the Human Services Commission for the City of Livermore.\nWith more than 20 years of nonprofit and government agency experience, Sutton has seen firsthand how hard nonprofits work to raise funds and serve their clients, and she wants to give them the tools they need to be successful. She’s also deeply committed to supporting students at Chico State, as a founding member of the Women’s Philanthropy Council, creator of the Professional Attire Fund in the College of Business, and advisory board member for the College of Business. Honored this spring as the Distinguished Alumna for the College of Business, Sutton said she hopes to inspire today’s students, especially women, to find their own voice and use it for a greater good.\nWhat does it mean to you to be receiving this award?\nI am overwhelmed … speechless … and I am very proud. The thing I am most proud of in my work at Chico State is the Professional Attire Fund, which provides a $500 stipend to students to buy the clothes they need for an interview or job. It’s just something you don’t think about, and it fills such a huge hole that no one saw. These students have done all the hard work, and they should have the clothes that fit them so they can go in with confidence and hit that interview out of the park. Now we are trying to expand it. I’m thrilled to offer matching funds of $25,000 for all gifts to the Professional Attire Fund for Chico State Giving Day. That means $50,000 to help 100 students get the outfits they need. I hope everyone will join me.\nAs a member of the Women’s Philanthropy Council, you’re demonstrating the incredible leadership of women and the impact they can have. Why is that important for you?\nThe two big topics I’ve always cared about are education and women’s health. As women, it’s so important that we all support each other and raise all of us up together. I have had instances with women who were competitive and didn’t want to support other women—I saw that a lot in DC—and I just think it’s so important that all of us work to lift one another up. I’m still inspired by my boss in DC, Isabel Sawhill [a prominent authority on fiscal policy, poverty and inequality, welfare, and changes in the American family] from our time together at the Urban Institute. She worked with so many women in powerful positions and really broke the ceiling in DC.\nHow do you shake things up and create positive change in your work today?\nI once heard someone say, “They tell me to pull myself up by my boot straps, but what if I don’t have boots?” I am always looking to get people their own boots—and not just boots, but boots that fit them. As an example, when I was on the Human Services Commission and we were awarding grants to nonprofits, Spectrum Community Services, which provides meals on wheels, did not get the funding I thought they deserved. So, I went to them and said, ‘What can I do to help?’ Five years later, I head up their fundraising committee. We just hosted an event in our backyard in May and raised over $50,000 for our local seniors! I could have just sat on the commission and said ‘Try again next year,” but I reached out to them. To me, making change is raising your hand if you see something that is not right and saying “What can I do to help?”\nHow did you get into your current role?\nWhen COVID hit, we were all at home watching the news all day about how so many people in our community were struggling. My husband, John, and I said, “We have to do something.” I found out that Tri-Valley Nonprofit Alliance (TVNPA) was seeking donations for a new fund for six safety net organizations. I reached out, and John and I donated $25,000 in matching funds—and the fund ended up raising over $183,000. Since we couldn’t meet in person, Kathy Young, CEO of TVNPA, and I started going on long hikes to talk about TVNPA and their goals. I realized TVNPA was doing the work I wanted to be a part of. One day she asked me to be on the Board. I always wanted to start my own foundation, but I realized in serving on the TVNPA board, I could help them in a very powerful and effective way. There, I found my home, and after a year, I became chair. Today, we work with all nonprofits in the Tri-Valley to strengthen them through advocacy, collaboration, and education. We have continued the fund that we started in 2020 and last year gave out a total of $100,000 to over 30 local nonprofits!\nKnowing what you know now, what would you tell your freshman self? \nI have learned as I have gotten older that doing the hard stuff helps you grow, and part of that growth is finding your own voice and your own path. At Chico, doing some of the hard stuff certainly helped me grow. At one point, I remember there were only two women in one of my accounting classes and it was intimidating. In my jobs after that, being the only woman in all those classes really prepared me for the workforce, especially in finance departments. I had to learn to speak up, find my voice, and say what I thought was right and wrong. Also, when I was trying to climb that professional ladder, one of my sister’s friends told me that she always looked at jobs that were not necessarily up the ladder but could go to the right or the left as long as they were more interesting and/or more challenging. Everybody has their own path and there is no right path. As I went to the right or left on that ladder, there were times in my life when I was like, “What am I doing?” but it’s all worked out and I couldn’t be happier to be where I am today.\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tAshley Gebb\t\t\n\n\n\t\tA proud alumna, Ashley Gebb (Journalism, '08) is the executive director of University Communications. She leads its exceptional communications team, manages the Chico State brand, and directs marketing and storytelling.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/ashley-gebb/",
        "https://givingday.csuchico.edu/campaigns/professional-attire-fund",
        "https://today.csuchico.edu/distinguished-alum-marti-sutton/?share=facebook",
        "https://today.csuchico.edu/distinguished-alum-marti-sutton/?share=twitter",
        "https://today.csuchico.edu/distinguished-alum-marti-sutton/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Distinguished%20Alum%20and%20Nonprofit%20Chair%20Marti%20Sutton&body=https%3A%2F%2Ftoday.csuchico.edu%2Fdistinguished-alum-marti-sutton%2F&share=email",
        "https://today.csuchico.edu/distinguished-alum-marti-sutton/#print",
        "#",
        "https://today.csuchico.edu/author/ashley-gebb/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}