{
    "title": "Stanford | Faculty Positions",
    "body": "\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford\n\n\n\nFaculty Positions\n\n\n\n\n\nApplicant login\n\n\n\nMenu\n\nApplicant login\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Faculty Positions\n\n\nSend me jobs like these\n\n\nWe will email you new jobs that match this search.\n\n\n\nGreat, we can send you jobs like this, if this is your first time signing up, please check your inbox to confirm your subscription.\nThe email address was invalid, please check for errors.\nYou must agree to the privacy statement\nSubscribe\n\nRecaptcha\n\n\nPrivacy agreement\n\n\n\n\nSearch results\n\n\n\n\nStanford Center for Biomedical Ethics- Academic Scholar\n\n\nStanford University\n\n\n\n\n\nThe Stanford Center for Biomedical Ethics in the Department of Pediatrics at Stanford University seeks an Academic Scholar with a record indicating scholarly activity in any areas related to Ethical, Legal, and Social Issues in Genetics, Genomics, or Precision Medicine to join the Department as Assistant Professor or Associate Professor in the Non-tenure Line (Research) faculty line. We are particularly interested in candidates who have a terminal degree (PhD, JD, MD, etc.) at the time of appointment.\n\n\n\nBasic Science Faculty Position in Urology\n\n\nStanford University\n\n\n\n\n\nThe Department of Urology is recruiting a full-time basic science research faculty member committed to the development of a research program in the following fields: imaging science, image-guided therapy, biomedical engineering, and/or molecular, developmental, stem cell biology with relevance to urological cancer and benign urological diseases. This position is at the Assistant, Associate, or Full Professor level in the University Tenure Line or Non-Tenure Line (Research).\n\n\n\nASSISTANT or ASSOCIATE PROFESSOR TRANSLATIONAL NEUROSCIENCE NON-TENURE LINE (RESEARCH)\n\n\nStanford University\n\n\n\n\n\nASSISTANT or ASSOCIATE PROFESSOR\nTRANSLATIONAL NEUROSCIENCE\nNON-TENURE LINE (RESEARCH)\n\n\n\nAssistant or Associate  Professor for Ophthalmology (Optometrist)\n\n\nStanford University\n\n\n\n\n\nThe Department of Ophthalmology at Stanford University seeks a part time optometrist to join at the Livermore Valley Care location in the Clinician Educator Line at the level of Assistant or Associate Professor. This is anticipated to be initially a 60% FTE position, with potential for growth to fit the clinical needs of the department.\n\n\n\nAssistant, Associate or Full Professor for Ophthalmology (Oculoplastic)\n\n\nStanford University\n\n\n\n\n\nThe Department of Ophthalmology at Stanford University seeks a ophthalmologist candidates to join the Department in the subspecialty of oculoplastic at the rank of Assistant, Associate, or full Professor in the University Medical Line or Clinician Educator Line.\n\n\n\nAssistant, Associate or Full Professor (Surgical Pathology - GI and Breast Pathology)\n\n\nStanford University\n\n\n\n\n\nThe Stanford Department of Pathology seeks an outstanding MD or MD/PhD with expertise in surgical pathology, preferable with a focus in gastrointestinal and breast pathology, for appointment at the rank of Assistant, Associate, or Full Professor in the University Medical Line or Clinician Educator Line. Board eligibility or equivalent training in Anatomic Pathology or Anatomic Pathology plus Clinical Pathology is required. Subspecialty fellowship training is strongly preferred.\n\n\n\nAssistant, Associate or Full Professor (Surgical Pathology and/or Cytopathology)\n\n\nStanford University\n\n\n\n\n\nThe Stanford Department of Pathology seeks an outstanding MD or MD/PhD with subspecialty expertise in surgical pathology and/or cytopathology for appointment at the rank of Assistant, Associate, or Full Professor in the University Medical Line or Clinician Educator Line. Board eligibility or equivalent training in Anatomic Pathology or Anatomic Pathology plus Clinical Pathology is required. Subspecialty fellowship training is strongly preferred.\n\n\n\nPediatric Gastroenterology- Immunologist in Pancreatic Disorders\n\n\nStanford University\n\n\n\n\n\nThe Division of Gastroenterology in the Department of Pediatrics at Stanford University seeks an immunologist in pancreatic disorders to join the Division as Assistant Professor, Associate Professor or Professor in the University Tenure Line, University Medical Line, or the Non-Tenure Line (Research). We are particularly interested in candidates who have an MD, MD/PhD, or PhD (or equivalent degree).\n\n\n\nPediatric Hem/Onc Psychologist Clinical Assistant, Associate, or Professor\n\n\nStanford University\n\n\n\n\n\nThe Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University is seeking a pediatric psychologist who can contribute to the Divisions development of a pre-eminent pediatric psychosocial oncology/hematology/stem cell program that seamlessly integrates both clinical and research agendas at the Assistant, Associate, or Full Professor level in the Clinician Educator lines.\n\n\n\nPulmonary and Critical Care Physician Scientists (2 Positions)\n\n\nStanford University, VA Palo Alto Health Care System (VAPAHCS)\n\n\n\n\n\nThe Division of Pulmonary, Allergy, and Critical Care Medicine in the Department of Medicine at Stanford University seeks two faculty members at the Assistant, Associate or Full Professor level for appointment in the University Medical Line or University Tenure Line. One position will be based at Stanford University Medical Center and one at the Veterans Affairs Palo Alto Health Care System. We are particularly interested in candidates who have a clinical or basic research focus in pulmonary and critical care medicine.\n\n\n\nNeuroimmunology Clinician Educator\n\n\nStanford University\n\n\n\n\n\nThe Division of Neuroimmunology in the Department of Neurology at Stanford University seeks a neurologist with fellowship training in Neuroimmunology and/or Autoimmune Neurology to join the Department as Clinical Assistant or Clinical Associate Professor in the Clinician Educator Line. We are particularly interested in candidates with expertise in the diagnosis and management of immune-mediated and neurological disorders of the central nervous system, who have been inspiring medical educators with experience in clinical trial execution and collaborative translational research initiatives.\n\n\n\nChild Neuro-Immuno-Oncology - Clinician Educator in Neurology\n\n\nStanford University\n\n\n\n\n\nThe Department of Neurology at Stanford University seeks a board-certified neurologist to join the Department as Clinical Assistant Professor in the Clinician Educator Line. We seek a broad applicant pool that is anchored by knowledge and expertise in neurology and critical care, and are particularly interested in candidates who have experience in neuro-immuno-oncology managing neuro-inflammation and immunotherapy for central nervous system tumors.\n\n\n\nLaboratory Director of SLAC National Accelerator Laboratory Operated by Stanford University for the United States Department of Energy\n\n\nSLAC National Accelerator Laboratory\n\n\n\n\n\nStanford University invites nominations, applications, and inquiries as it seeks an experienced faculty leader with a deep commitment to access and academic excellence to serve as the next director of SLAC National Accelerator Laboratory (SLAC). Please address inquiries to SLACDirector@russellreynolds.com.\n\n\n\nPediatrics CVICU Hospitalist Clinical Instructor or Clinical Assistant\n\n\nStanford University\n\n\n\n\n\nAt this time, the Division of Cardiology in the Department of Pediatrics at Lucile Packard Children’s Hospital/Stanford University School of Medicine is recruiting a CVICU Hospitalist in the Clinician Educator line as a Clinical Instructor or Clinical Assistant. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative, and/or scholarship appropriate to the programmatic need the individual is expected to fulfill.\n\n\n\nDivision Chief of Musculoskeletal Imaging\n\n\nStanford University\n\n\n\n\n\nThe Department of Radiology at Stanford School of Medicine is searching for a Division Chief of Musculoskeletal Imaging. This full-time faculty appointment would be in the University Medical Line, University Tenure Line, or Clinician Educator Line at the Associate Professor or Full Professor level.\n\n\n\nMFM Fetal Therapy Specialist\n\n\nStanford University\n\n\n1 Feb 2024 \n\n\n\nThe Department of Obstetrics and Gynecology at Stanford University School of Medicine seeks exceptional applicants (MD or MD/PhD) with clinical expertise in fetal therapy to join our successful and growing fetal therapy program. Based on the applicant’s credentials, this appointment will be at the rank of Assistant Professor, Associate Professor or Professor in the Clinical Educator (CE) or University Medical Line (UML). Successful applicants should have experience in the pre-operative evaluation and counseling of fetal therapy candidates, hands-on experience and intra-operative expertise in fetal therapeutic procedures, and experience in post-operative pregnancy management and delivery of patients undergoing fetal therapy.\n\n\n\nPediatric Hospital Medicine Clinical Instructor, Assistant, Associate or Full Professor\n\n\nStanford University\n\n\n\n\n\nThe Division of Pediatric Hospital Medicine in the Department of Pediatrics at Lucile Packard Children’s Hospital/Stanford University School of Medicine is recruiting a Clinician Educator as a(n) Instructor, Assistant, Associate, or Full Professor. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill.\n\n\n\nInvestigator or Clinician-Investigator in Sexual and Gender Minority Health\n\n\nStanford University\n\n\n\n\n\nThe Department of Medicine and the Department of Obstetrics and Gynecology at Stanford University School of Medicine are seeking two faculty members with an investigative (clinical research or health services research) focus in sexual and gender minority (SGM) health. We are seeking dynamic, creative individuals to develop their own SGM health research program and to foster collaborations with other faculty members in Stanford Medicine’s new LGBTQ+ Health Program, a unique and comprehensive multi-disciplinary approach to improve the health and well-being of the LGBTQ+ communities. The program will be a national model in clinical care, research, education, and advocacy. Successful and qualified candidates will exhibit demonstrated experience and reputation in SGM health research and have a growing track record of publications and funding commensurate with experience and career stage. The candidate will be expected to contribute to our mission through education and teaching including training and mentoring of residents, fellows, and other trainees in graduate programs associated with the Stanford University School of Medicine.\n\n\n\nAssociate Director for Clinical Research\n\n\nStanford University\n\n\n\n\n\nThe Stanford Cancer Institute (SCI) seeks applicants for an Associate Director for Clinical Research (AD for CR) to join the School of Medicine at Stanford University as Associate Professor or Professor in the University Medical Line (UML). We are particularly interested in candidates who have outstanding record of innovation and accomplishment in research, translation, and education. Exceptional physician/physician-scientists with a strong clinical/translational emphasis in clinical trials development and implementation are encouraged to apply.\n\n\n\nPediatric Rheumatology Clinical Scholar\n\n\nStanford University\n\n\n\n\n\nAt this time, the Division of Allergy, Immunology, and Rheumatology in the Department of Pediatrics at Lucile Packard Children’s Hospital/Stanford University School of Medicine is recruiting a 1-2 years position as a faculty scholar who intends to be dedicated to the field of immuno-psychiatry and is interested in gaining specialized expertise in clinical care of children/adolescents with Pediatric Acute-onset Neuropsychiatric Syndrome(PANS/PANDAS), Sydenham’s Chorea, post-infectious/autoimmune psychiatric disorders, and associated autoimmune conditions including arthritis, inflammatory bowel disease, psoriasis, lupus, etc. The incumbent will be classified as a Clinician Instructor and mentorship will be provided by core clinicians and faculty in Pediatrics and Psychiatry within the Immune Behavioral Health (IBH) Clinic, overseen by Clinical Professor of Pediatrics-Rheumatology, Stanford PANS Research Program Director and IBH Medical Director, Jennifer Frankovich, MD MS. Academic line will be determined by the qualification and experience of the successful candidate.\n\n\n\nMore Jobs 77\n\nCurrent opportunities\n\n\n\n\nStanford Center for Biomedical Ethics- Academic Scholar\n\n\nStanford University\n\n\n\n\n\nThe Stanford Center for Biomedical Ethics in the Department of Pediatrics at Stanford University seeks an Academic Scholar with a record indicating scholarly activity in any areas related to Ethical, Legal, and Social Issues in Genetics, Genomics, or Precision Medicine to join the Department as Assistant Professor or Associate Professor in the Non-tenure Line (Research) faculty line. We are particularly interested in candidates who have a terminal degree (PhD, JD, MD, etc.) at the time of appointment.\n\n\n\nBasic Science Faculty Position in Urology\n\n\nStanford University\n\n\n\n\n\nThe Department of Urology is recruiting a full-time basic science research faculty member committed to the development of a research program in the following fields: imaging science, image-guided therapy, biomedical engineering, and/or molecular, developmental, stem cell biology with relevance to urological cancer and benign urological diseases. This position is at the Assistant, Associate, or Full Professor level in the University Tenure Line or Non-Tenure Line (Research).\n\n\n\nASSISTANT or ASSOCIATE PROFESSOR TRANSLATIONAL NEUROSCIENCE NON-TENURE LINE (RESEARCH)\n\n\nStanford University\n\n\n\n\n\nASSISTANT or ASSOCIATE PROFESSOR\nTRANSLATIONAL NEUROSCIENCE\nNON-TENURE LINE (RESEARCH)\n\n\n\nAssistant or Associate  Professor for Ophthalmology (Optometrist)\n\n\nStanford University\n\n\n\n\n\nThe Department of Ophthalmology at Stanford University seeks a part time optometrist to join at the Livermore Valley Care location in the Clinician Educator Line at the level of Assistant or Associate Professor. This is anticipated to be initially a 60% FTE position, with potential for growth to fit the clinical needs of the department.\n\n\n\nAssistant, Associate or Full Professor for Ophthalmology (Oculoplastic)\n\n\nStanford University\n\n\n\n\n\nThe Department of Ophthalmology at Stanford University seeks a ophthalmologist candidates to join the Department in the subspecialty of oculoplastic at the rank of Assistant, Associate, or full Professor in the University Medical Line or Clinician Educator Line.\n\n\n\nAssistant, Associate or Full Professor (Surgical Pathology - GI and Breast Pathology)\n\n\nStanford University\n\n\n\n\n\nThe Stanford Department of Pathology seeks an outstanding MD or MD/PhD with expertise in surgical pathology, preferable with a focus in gastrointestinal and breast pathology, for appointment at the rank of Assistant, Associate, or Full Professor in the University Medical Line or Clinician Educator Line. Board eligibility or equivalent training in Anatomic Pathology or Anatomic Pathology plus Clinical Pathology is required. Subspecialty fellowship training is strongly preferred.\n\n\n\nAssistant, Associate or Full Professor (Surgical Pathology and/or Cytopathology)\n\n\nStanford University\n\n\n\n\n\nThe Stanford Department of Pathology seeks an outstanding MD or MD/PhD with subspecialty expertise in surgical pathology and/or cytopathology for appointment at the rank of Assistant, Associate, or Full Professor in the University Medical Line or Clinician Educator Line. Board eligibility or equivalent training in Anatomic Pathology or Anatomic Pathology plus Clinical Pathology is required. Subspecialty fellowship training is strongly preferred.\n\n\n\nPediatric Gastroenterology- Immunologist in Pancreatic Disorders\n\n\nStanford University\n\n\n\n\n\nThe Division of Gastroenterology in the Department of Pediatrics at Stanford University seeks an immunologist in pancreatic disorders to join the Division as Assistant Professor, Associate Professor or Professor in the University Tenure Line, University Medical Line, or the Non-Tenure Line (Research). We are particularly interested in candidates who have an MD, MD/PhD, or PhD (or equivalent degree).\n\n\n\nPediatric Hem/Onc Psychologist Clinical Assistant, Associate, or Professor\n\n\nStanford University\n\n\n\n\n\nThe Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University is seeking a pediatric psychologist who can contribute to the Divisions development of a pre-eminent pediatric psychosocial oncology/hematology/stem cell program that seamlessly integrates both clinical and research agendas at the Assistant, Associate, or Full Professor level in the Clinician Educator lines.\n\n\n\nPulmonary and Critical Care Physician Scientists (2 Positions)\n\n\nStanford University, VA Palo Alto Health Care System (VAPAHCS)\n\n\n\n\n\nThe Division of Pulmonary, Allergy, and Critical Care Medicine in the Department of Medicine at Stanford University seeks two faculty members at the Assistant, Associate or Full Professor level for appointment in the University Medical Line or University Tenure Line. One position will be based at Stanford University Medical Center and one at the Veterans Affairs Palo Alto Health Care System. We are particularly interested in candidates who have a clinical or basic research focus in pulmonary and critical care medicine.\n\n\n\nNeuroimmunology Clinician Educator\n\n\nStanford University\n\n\n\n\n\nThe Division of Neuroimmunology in the Department of Neurology at Stanford University seeks a neurologist with fellowship training in Neuroimmunology and/or Autoimmune Neurology to join the Department as Clinical Assistant or Clinical Associate Professor in the Clinician Educator Line. We are particularly interested in candidates with expertise in the diagnosis and management of immune-mediated and neurological disorders of the central nervous system, who have been inspiring medical educators with experience in clinical trial execution and collaborative translational research initiatives.\n\n\n\nChild Neuro-Immuno-Oncology - Clinician Educator in Neurology\n\n\nStanford University\n\n\n\n\n\nThe Department of Neurology at Stanford University seeks a board-certified neurologist to join the Department as Clinical Assistant Professor in the Clinician Educator Line. We seek a broad applicant pool that is anchored by knowledge and expertise in neurology and critical care, and are particularly interested in candidates who have experience in neuro-immuno-oncology managing neuro-inflammation and immunotherapy for central nervous system tumors.\n\n\n\nLaboratory Director of SLAC National Accelerator Laboratory Operated by Stanford University for the United States Department of Energy\n\n\nSLAC National Accelerator Laboratory\n\n\n\n\n\nStanford University invites nominations, applications, and inquiries as it seeks an experienced faculty leader with a deep commitment to access and academic excellence to serve as the next director of SLAC National Accelerator Laboratory (SLAC). Please address inquiries to SLACDirector@russellreynolds.com.\n\n\n\nPediatrics CVICU Hospitalist Clinical Instructor or Clinical Assistant\n\n\nStanford University\n\n\n\n\n\nAt this time, the Division of Cardiology in the Department of Pediatrics at Lucile Packard Children’s Hospital/Stanford University School of Medicine is recruiting a CVICU Hospitalist in the Clinician Educator line as a Clinical Instructor or Clinical Assistant. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative, and/or scholarship appropriate to the programmatic need the individual is expected to fulfill.\n\n\n\nDivision Chief of Musculoskeletal Imaging\n\n\nStanford University\n\n\n\n\n\nThe Department of Radiology at Stanford School of Medicine is searching for a Division Chief of Musculoskeletal Imaging. This full-time faculty appointment would be in the University Medical Line, University Tenure Line, or Clinician Educator Line at the Associate Professor or Full Professor level.\n\n\n\nMFM Fetal Therapy Specialist\n\n\nStanford University\n\n\n1 Feb 2024 \n\n\n\nThe Department of Obstetrics and Gynecology at Stanford University School of Medicine seeks exceptional applicants (MD or MD/PhD) with clinical expertise in fetal therapy to join our successful and growing fetal therapy program. Based on the applicant’s credentials, this appointment will be at the rank of Assistant Professor, Associate Professor or Professor in the Clinical Educator (CE) or University Medical Line (UML). Successful applicants should have experience in the pre-operative evaluation and counseling of fetal therapy candidates, hands-on experience and intra-operative expertise in fetal therapeutic procedures, and experience in post-operative pregnancy management and delivery of patients undergoing fetal therapy.\n\n\n\nPediatric Hospital Medicine Clinical Instructor, Assistant, Associate or Full Professor\n\n\nStanford University\n\n\n\n\n\nThe Division of Pediatric Hospital Medicine in the Department of Pediatrics at Lucile Packard Children’s Hospital/Stanford University School of Medicine is recruiting a Clinician Educator as a(n) Instructor, Assistant, Associate, or Full Professor. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill.\n\n\n\nInvestigator or Clinician-Investigator in Sexual and Gender Minority Health\n\n\nStanford University\n\n\n\n\n\nThe Department of Medicine and the Department of Obstetrics and Gynecology at Stanford University School of Medicine are seeking two faculty members with an investigative (clinical research or health services research) focus in sexual and gender minority (SGM) health. We are seeking dynamic, creative individuals to develop their own SGM health research program and to foster collaborations with other faculty members in Stanford Medicine’s new LGBTQ+ Health Program, a unique and comprehensive multi-disciplinary approach to improve the health and well-being of the LGBTQ+ communities. The program will be a national model in clinical care, research, education, and advocacy. Successful and qualified candidates will exhibit demonstrated experience and reputation in SGM health research and have a growing track record of publications and funding commensurate with experience and career stage. The candidate will be expected to contribute to our mission through education and teaching including training and mentoring of residents, fellows, and other trainees in graduate programs associated with the Stanford University School of Medicine.\n\n\n\nAssociate Director for Clinical Research\n\n\nStanford University\n\n\n\n\n\nThe Stanford Cancer Institute (SCI) seeks applicants for an Associate Director for Clinical Research (AD for CR) to join the School of Medicine at Stanford University as Associate Professor or Professor in the University Medical Line (UML). We are particularly interested in candidates who have outstanding record of innovation and accomplishment in research, translation, and education. Exceptional physician/physician-scientists with a strong clinical/translational emphasis in clinical trials development and implementation are encouraged to apply.\n\n\n\nPediatric Rheumatology Clinical Scholar\n\n\nStanford University\n\n\n\n\n\nAt this time, the Division of Allergy, Immunology, and Rheumatology in the Department of Pediatrics at Lucile Packard Children’s Hospital/Stanford University School of Medicine is recruiting a 1-2 years position as a faculty scholar who intends to be dedicated to the field of immuno-psychiatry and is interested in gaining specialized expertise in clinical care of children/adolescents with Pediatric Acute-onset Neuropsychiatric Syndrome(PANS/PANDAS), Sydenham’s Chorea, post-infectious/autoimmune psychiatric disorders, and associated autoimmune conditions including arthritis, inflammatory bowel disease, psoriasis, lupus, etc. The incumbent will be classified as a Clinician Instructor and mentorship will be provided by core clinicians and faculty in Pediatrics and Psychiatry within the Immune Behavioral Health (IBH) Clinic, overseen by Clinical Professor of Pediatrics-Rheumatology, Stanford PANS Research Program Director and IBH Medical Director, Jennifer Frankovich, MD MS. Academic line will be determined by the qualification and experience of the successful candidate.\n\n\n\nMore Jobs 77\nPowered by PageUp\n\n\n\n\n\nJob search\n\n\n\nRefine search\nWork type\n\nCE - Clinician Educator 51\nNon-Tenure Line (Research) 12\nNon-Tenure Line (Teaching) 1\nPolicy Institute Fellows 1\nUniversity Medical Line 49\nUniversity Tenure Line 29\nLocations\n\nSLAC National Accelerator Laboratory 1\nStanford University 95\nVA Palo Alto Health Care System (VAPAHCS) 2\nCategories\nSchool\nDean of Research 1\nDoerr School of Sustainability 1\nSchool of Humanities & Sciences 2\nSchool of Medicine 92\nSLAC National Accelerator Laboratory 1\n\n\n\n\n\n\n\n\n\n\n\n\nGet Help\nQuestions about a job or your application?\nFind out how to request help\n\n\nEqual Opportunity\nConsistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job.\nStanford is an equal employment opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity,\n                            national origin, disability, protected veteran status, or any other characteristic protected by law.\nStanford welcomes applications from all who would bring additional dimensions to the University’s research, teaching, and clinical missions.\n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use\n\n\nPrivacy\n\n\nCopyright\n\n\nTrademarks\n\n\nNon-Discrimination\n\n\nAccessibility\n\n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "http://facultypositions.stanford.edu",
        "https://secure.dc4.pageuppeople.com/apply/1054/aw/applicationForm/default.asp",
        "https://secure.dc4.pageuppeople.com/apply/1054/aw/applicationForm/default.asp",
        "/en-us/listing/",
        "/en-us/job/493558/stanford-center-for-biomedical-ethics-academic-scholar",
        "/en-us/job/493557/basic-science-faculty-position-in-urology",
        "/en-us/job/493512/assistant-or-associate-professor-translational-neuroscience-nontenure-line-research",
        "/en-us/job/493555/assistant-or-associate-professor-for-ophthalmology-optometrist",
        "/en-us/job/493553/assistant-associate-or-full-professor-for-ophthalmology-oculoplastic",
        "/en-us/job/493556/assistant-associate-or-full-professor-surgical-pathology-gi-and-breast-pathology",
        "/en-us/job/493554/assistant-associate-or-full-professor-surgical-pathology-andor-cytopathology",
        "/en-us/job/493552/pediatric-gastroenterology-immunologist-in-pancreatic-disorders",
        "/en-us/job/493551/pediatric-hemonc-psychologist-clinical-assistant-associate-or-professor",
        "/en-us/job/493550/pulmonary-and-critical-care-physician-scientists-2-positions",
        "/en-us/job/493549/neuroimmunology-clinician-educator",
        "/en-us/job/493548/child-neuroimmunooncology-clinician-educator-in-neurology",
        "/en-us/job/493544/laboratory-director-of-slac-national-accelerator-laboratory-operated-by-stanford-university-for-the-united-states-department-of-energy",
        "/en-us/job/493546/pediatrics-cvicu-hospitalist-clinical-instructor-or-clinical-assistant",
        "/en-us/job/493547/division-chief-of-musculoskeletal-imaging",
        "/en-us/job/493545/mfm-fetal-therapy-specialist",
        "/en-us/job/493543/pediatric-hospital-medicine-clinical-instructor-assistant-associate-or-full-professor",
        "/en-us/job/493541/investigator-or-clinicianinvestigator-in-sexual-and-gender-minority-health",
        "/en-us/job/493542/associate-director-for-clinical-research",
        "/en-us/job/493539/pediatric-rheumatology-clinical-scholar",
        "/en-us/listing/?page=2&page-items=20",
        "/en-us/job/493558/stanford-center-for-biomedical-ethics-academic-scholar",
        "/en-us/job/493557/basic-science-faculty-position-in-urology",
        "/en-us/job/493512/assistant-or-associate-professor-translational-neuroscience-nontenure-line-research",
        "/en-us/job/493555/assistant-or-associate-professor-for-ophthalmology-optometrist",
        "/en-us/job/493553/assistant-associate-or-full-professor-for-ophthalmology-oculoplastic",
        "/en-us/job/493556/assistant-associate-or-full-professor-surgical-pathology-gi-and-breast-pathology",
        "/en-us/job/493554/assistant-associate-or-full-professor-surgical-pathology-andor-cytopathology",
        "/en-us/job/493552/pediatric-gastroenterology-immunologist-in-pancreatic-disorders",
        "/en-us/job/493551/pediatric-hemonc-psychologist-clinical-assistant-associate-or-professor",
        "/en-us/job/493550/pulmonary-and-critical-care-physician-scientists-2-positions",
        "/en-us/job/493549/neuroimmunology-clinician-educator",
        "/en-us/job/493548/child-neuroimmunooncology-clinician-educator-in-neurology",
        "/en-us/job/493544/laboratory-director-of-slac-national-accelerator-laboratory-operated-by-stanford-university-for-the-united-states-department-of-energy",
        "/en-us/job/493546/pediatrics-cvicu-hospitalist-clinical-instructor-or-clinical-assistant",
        "/en-us/job/493547/division-chief-of-musculoskeletal-imaging",
        "/en-us/job/493545/mfm-fetal-therapy-specialist",
        "/en-us/job/493543/pediatric-hospital-medicine-clinical-instructor-assistant-associate-or-full-professor",
        "/en-us/job/493541/investigator-or-clinicianinvestigator-in-sexual-and-gender-minority-health",
        "/en-us/job/493542/associate-director-for-clinical-research",
        "/en-us/job/493539/pediatric-rheumatology-clinical-scholar",
        "/en-us/listing/?page=2&page-items=20",
        "https://www.pageuppeople.com/powered-by-pageup/",
        "https://fsat.stanford.edu/get-help",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}