{
    "title": "Ollie Block Theme Now in Public Beta – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nApril 26, 2023\nSarah Gooding\nOllie Block Theme Now in Public Beta\n\nWordPress developer Mike McAlister has launched Ollie, his first block theme, into public beta. McAlister, whose theme company Array Themes was acquired by WP Engine in 2018, along with the Atomic Blocks plugin, recently departed from his role at the company to pursue other projects.\nOllie supports all the latest Site Editor features, including global styles, patterns, templates, and template parts. It is a beautiful, multipurpose theme of the high caliber one might expect from McAlister, a veteran developer whose past products were well known for their minimalist and clean design.\n\nOllie includes an impressive set of more than 50 custom block patterns, making page building a delight. There are page sections for testimonials, company logos, multiple hero designs, pricing tables, various headers and footers, calls to action, and more. Ollie includes six different full-page patterns for the homepage, about, profile, features, pricing, and a download page. They are featured on the theme’s live demo under the Patterns menu item.\n\nOllie includes seven style variations, with blue, green, orange, pink, red, and teal accent color palettes in addition to the default. \nLike many other block themes, Ollie is speedy, getting top scores on Google’s Pagespeed Insights.\n“One of the most powerful performance features is the selective loading of assets,” McAlister said. “Instead of loading a large stylesheet on every page, Ollie only loads the styles needed on the page. This results in a much smaller page size, far less page requests, and an instantly-loading page, which search engines love.”\nAfter testing Ollie, I found the user experience to be friendly and an accurate representation of one of the taglines for the theme: “Get a 40 hour head start.” As soon as users install the theme and click “Customize,” they are taken directly to the Site Editor with the front page template pre-populated to match the demo site. This, combined with all the improvements in the Site Editor in WordPress 6.2, creates a smooth editing experience.\n\nAlthough it hasn’t been officially released yet, Ollie could be one of the next majorly successful block themes, with its sheer number of patterns and flexibility for so many different use cases.\nOllie is currently on GitHub during the public beta but McAlister plans to get it approved for WordPress.org after more testing. He is not yet sure whether he will be jumping back into the commercial theme market.\n“With this first block theme, my goal is simply to learn as much as possible about block themes, how users are using them, and what kind of potential there is for a premium offering,” McAlister told the Tavern. “This flagship theme will remain as an educational tool and will be free for all to use. Although I have some ideas for monetization, the reality is that we don’t know much about how users will take to block themes or what kind of premium features they’re willing to pay for yet.\n“We’re very early in this new paradigm, so I’m taking the opportunity to ask lots of questions learn about the problems users are facing. What I do know is that any modern commercial WordPress product needs a supreme customer experience and a wealth of quality education to help users navigate all of these new features and drive adoption.”\nWordPress.org has 286 block themes available and even the best ones have just a few thousand active installs. Building block themes that people will want to use is a new frontier, even for McAlister whose former company was a war-horse in the Classic Themes era.\n“Block themes are going to be a game changer for many different personas of WordPress users,” McAlister said. “Being able to customize virtually every aspect of your site is super powerful, but it means that block themes have a lot more moving parts than classic themes. Theme.json, global styles, patterns, templates, template parts — all of these have to be accounted for and they all have to work together seamlessly for an excellent block theme experience.”\n WordPress theme developers are still getting a handle on these changes but the Themes Team is putting a stake in the ground by making block theming the focus of the Theme Handbook overhaul. Although Classic Themes will still have a chapter in the handbook, the Themes Team has made it clear that block themes are “the present and future of WordPress.” \n“Since a lot of the block theme building is done in the editor, it requires a new mastery of the editor that few are intimately familiar with yet,” McAlister said. “To build patterns or layouts, you need to know which blocks to use, how to structure them effectively, how to leverage your design system in theme.json, and you need a good design sense to pull it all together. \n“However, when it all finally comes together, block themes provide an unmatched site building and editing experience in comparison to classic themes. I’m very optimistic about the opportunity to revitalize the WordPress theme space, but it’s going to take a lot of work and collective education to get there.”\nCategory: News, ThemesTags: free wordpress themesShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n7\n\n\n\n\t\t7 responses to “Ollie Block Theme Now in Public Beta”\t\n\n\n\n\n\n\n\n\n\n Marcus Tibesar says: \n\nApril 26, 2023 at 12:57 AM \n\n\nWhen Array was acquired by WPEngine, I did not want to continue my license with Array. Not because of Mike, but because WPEngine modified my WordPress database without my knowledge nor authorization (that’s another story in itself). Anyways, Mike quickly refunded my money, and I was very satisfied with my Array Themes ending.\nMike is a wonderful theme developer as his Array themes were polished, complete, error-free and did not require a lot of custom css to fix obvious design errors (unlike most other theme houses including Genesis at the time).  Some of his Array theme websites are still going strong to this day. So,I am very happy to see that Mike has picked up theme development again.\nIf he decides to monetize his new block theme(s), you all can rest assured, Mike is an honest businessman. Good luck Mike and we’ll keep an eye out for your work!\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n Niall Flynn says: \n\nApril 26, 2023 at 9:05 AM \n\n\nI would not advise WPE anymore, really stagnant business offering in the last few years. They were a great upstart but they stagnated imo, service and support really poor. I moved all my folks off them as sales was so greasy too.\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n Mike McAlister says: \n\nApril 26, 2023 at 11:45 AM \n\n\nThat’s surprising, Niall! I only ever hear great things about WP Engine’s customer support. And with their acquisition of ACF and WP Migrate, they’ve really made some big improvements to the plugins that have been well regarded.\nEveryone has their own experience though, and you have to make the right decision for your customers.\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n\n\n Mike McAlister says: \n\nApril 26, 2023 at 11:42 AM \n\n\nThanks for your kind words, Marcus! I’m always really surprised and excited when I stumble upon a website that’s still using one of my themes (and still looks great!). 😎\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n\n\n Val Lynn says: \n\nApril 26, 2023 at 8:11 AM \n\n\nWelcome back to theming Mike!\nI like the balance in this theme: not too minimalistic and not crowded at all.  Some WordPress Minimalistic themes feel like a desert visually and have a sense of coldness about them.  Ollie, though, is inviting. It isn’t overcrowded and I am looking forward to its official release.\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n Brin Wilson says: \n\nApril 26, 2023 at 8:19 AM \n\n\nLooks excellent! And I really like that there are over 50 block patterns! Block patterns seem to almost make the theme in the world of FSE themes. Just wondering: does Ollie include an option for a blog sidebar?\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n Nathan Wrigley says: \n\nApril 28, 2023 at 10:56 AM \n\n\nI had a fairly long play with this today, and I have to say that I really, really like what you’ve done here. The available patterns are excellent and will enable a quick build of most sites very quickly. Bravo!\n\nLoading…\n\n\n\nReply \n\n\n\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Notify me of follow-up comments by email. Notify me of new posts by email. \n\n Join the discussion via emailGet only replies to your comment, the best of the rest, as well as a daily recap of all comments on this post. No more than a few emails daily, which you can reply to/unsubscribe from directly from your inbox.Δ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nYou may also like\nArray Launches Free Gutenberg-Ready Atomic Blocks Theme on WordPress.orgJuly 12, 2018Okay Themes Pulls Out of Themeforest, Rebrands as ArrayApril 1, 2014Array Returns to Themeforest After Disappointing Experiences Selling on Creative Market and WordPress.comApril 16, 2015\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://olliewp.com/introducing-the-ollie-wordpress-block-theme/",
        "https://wptavern.com/wp-engine-acquires-array-themes",
        "https://demo.olliewp.com/patterns/",
        "https://github.com/OllieWP/ollie/",
        "https://make.wordpress.org/themes/2023/04/04/theme-handbook-overhaul-proposal/",
        "https://wptavern.com/category/news",
        "https://wptavern.com/category/themes",
        "https://wptavern.com/tag/free-wordpress-themes",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?share=twitter",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?share=mastodon",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?share=facebook",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?share=telegram",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?share=jetpack-whatsapp",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?share=pocket",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20Ollie%20Block%20Theme%20Now%20in%20Public%20Beta&body=https%3A%2F%2Fwptavern.com%2Follie-block-theme-now-in-public-beta&share=email",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta#comment-438649",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?replytocom=438649#respond",
        "https://niallflynn.com",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta#comment-438674",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?replytocom=438674#respond",
        "https://olliewp.com",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta#comment-438684",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?replytocom=438684#respond",
        "https://olliewp.com",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta#comment-438683",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?replytocom=438683#respond",
        "https://www.vallynn.com",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta#comment-438671",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?replytocom=438671#respond",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta#comment-438672",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?replytocom=438672#respond",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta#comment-438739",
        "https://wptavern.com/ollie-block-theme-now-in-public-beta?replytocom=438739#respond",
        "/ollie-block-theme-now-in-public-beta#respond",
        "https://akismet.com/privacy/",
        "https://wptavern.com/array-launches-free-gutenberg-ready-atomic-blocks-theme-on-wordpress-org",
        "https://wptavern.com/array-launches-free-gutenberg-ready-atomic-blocks-theme-on-wordpress-org",
        "https://wptavern.com/okay-themes-pulls-out-of-themeforest-rebrands-as-array",
        "https://wptavern.com/okay-themes-pulls-out-of-themeforest-rebrands-as-array",
        "https://wptavern.com/array-returns-to-themeforest-after-disappointing-experiences-selling-on-creative-market-and-wordpress-com",
        "https://wptavern.com/array-returns-to-themeforest-after-disappointing-experiences-selling-on-creative-market-and-wordpress-com",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge",
        "#",
        "#"
    ]
}