{
    "title": "Five Siblings Fulfill Father’s Dream - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nFive Siblings Fulfill Father’s Dream\n\nAlmendra Lawrence\nApril 28, 2023\n\n\n\n\n(Photos by Jason Halley / University Photographer) \n\n\n\nChico State has been a second home to countless families who’ve shared and cherished the Wildcat experience. For these families—and more than 177,000 alumni—Chico State is not just a university or campus. It is the branches of the family tree. This is one of six profiles of families who are rooted in their Wildcat connection.\nSalvador and Maria Hernandez arrived in Chico from their small town in Michoacán, Mexico, nearly 30 years ago. Salvador uprooted his family hoping his children would flourish in the United States.\nThe young family settled close enough to campus that the Trinity Hall carillon still serenades them every day. Early on, Salvador, a stable hand, instilled in his children the importance of going to school and encouraged them to pursue a degree. \n“The only reason he came to this country was so his children could get a good education,” Maria said. “He wanted them to be studious, to get their degrees, and to obtain a career, so they wouldn’t have to be like him and work all the time—in the rain and the heat.”\nIn May, Salvador’s wish will be fulfilled when his youngest son, history major Eriberto Hernandez-Campos, graduates from Chico State. He will be the fifth sibling to do so.\nForty-two-year-old Salvador died in 2005 of complications of autoimmune neuropathy and did not see any of his children graduate. Yet, he was always confident—maybe even more than they were—that they would achieve the dream he created for them since he couldn’t experience it himself.\n“In Mexico, there wasn’t an opportunity for him—that’s why he wanted his kids to finish school,” Maria said. “He would be so proud to see how all his children are moving forward and advancing in life. For me, it’s also an honor that they all have attended a university. I am very proud of them.”\n\nSalvador and Maria Hernandez\nTheir eldest and only daughter, Elia, earned her BA in business administration in 2005. Salvador got his BS in computer engineering in 2009 and an MS in electrical and computer engineering in 2014; Marco graduated in 2013 with a BA in business administration; and Guadalupe earned his BS in mathematics in 2019 and an MS in data science from Stanford University in 2022.\n“My father was a man who dedicated himself fully to whatever challenge or task was placed on him,” said Guadalupe, an operations research analyst for the United States Air Force. “If he lacked the necessary skills or knowledge, he went out of his way to acquire those skills and get the job done. He never made any excuses.”\nInfluencing his children through his actions, Salvador would routinely take classes at Butte College to become qualified on various farm equipment, like tree shakers for almond trees.\n“He wanted to be the best at everything he attempted,” Guadalupe said. “His relentlessness in the pursuit of excellence was awe-inspiring.”\nSalvador began working at a very young age and was only able to attend elementary school. Still, Elia said her father was a brilliant man with a knack for numbers and mathematics. He also had the most beautiful handwriting, which is something not often seen in men, said Elia, who is a fiscal analyst for Glenn County.\nAs the oldest sibling, it was important for Elia to pursue a degree to set an example for her brothers to follow.\n\nMaria Hernandez and her youngest of five children, Eriberto.\n“I feel completely satisfied and proud knowing all of my siblings have graduated from college,” she said. “I know that if my father was here, he would feel the same way.”\nEriberto—the youngest sibling—chose Chico State for its academic excellence, as well as to be close to home and to follow in his siblings’ footsteps.\n“Many little kids are not usually thinking about college or what they will do with their lives, but I grew up watching my sister start her career—I was 3 years old saying I wanted to be an accountant,” Eriberto said.\nGuadalupe said knowing that all his siblings have graduated from Chico State fills him with pride. He called it a significant achievement that represents the culmination of decades of hard work, determination, and perseverance not just for him, but for the entire family.\n“It speaks volumes about the caliber of people I was fortunate enough to call my family,” he said.\nAs graduation day nears, Eriberto’s been thinking a lot about his family, his dad, and how his parents will have five college graduates.\n“It makes me a bit emotional because I’m the last one,” he said. “I’m closing this chapter for our family. But it also makes me feel proud of my family and my siblings—some pursued master’s degrees and all have found successful careers.\n“After all the sacrifices and obstacles my family faced along the way, we still met our goals,” he continued. “We’re ready to face anything.”\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tAlmendra Lawrence\t\t\n\n\n\t\tAlmendra (Journalism, '11) is a bilingual content producer that helps empower and inspire audiences through storytelling. She also assists with editing and communications project management. She is a proud alumna and former editor-in-chief of The Orion.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/acarpizo/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://today.csuchico.edu/five-siblings-fulfill-fathers-dream/?share=facebook",
        "https://today.csuchico.edu/five-siblings-fulfill-fathers-dream/?share=twitter",
        "https://today.csuchico.edu/five-siblings-fulfill-fathers-dream/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Five%20Siblings%20Fulfill%20Father%E2%80%99s%20Dream&body=https%3A%2F%2Ftoday.csuchico.edu%2Ffive-siblings-fulfill-fathers-dream%2F&share=email",
        "https://today.csuchico.edu/five-siblings-fulfill-fathers-dream/#print",
        "#",
        "https://today.csuchico.edu/author/acarpizo/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}