{
    "title": "FAQ | Families",
    "body": "\n \n \n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nFamilies\n\n\nStanford University\n\n\n\n\n\n\n\n\n\n\n\n    Menu\n\n\n\n\n\nSearch form\nSearch term\n\n\n\n\n\nHome\nFAQ\nGet Involved\nHow Do I Pay?\nStay Informed\nTips\nVital Info\nLatest News\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nFAQ\n\n\nA student conveys her gratitude during the Wacky Walk at Stanford 128th Commencement.\n\nI am worried about my student. Who do I call?\nUnless it is an emergency situation, call the Parent Help Line at (650) 725-0649 for advice. After you speak with someone there, a set of conversations can occur among the people most involved in your son’s or daughter’s life. If it is an emergency situation, however, call the Stanford Police directly at (650) 329-2413.\nHow do I send a package to Stanford?\nVisit the page on Mail Delivery and Shipping for detailed information on how to send packages to students.\nWhat is the weather like at Stanford?\nThe weather in the Palo Alto area stays summer-like and warm–to the 70s and 80s–through October. The region is cool and wet during the winter. Rainwear is essential. A chilly morning fog that burns off by midday is typical. Clothing warm enough for temperatures to the 30s is recommended from December to March. Spring temperatures return to the 70s, and many students quickly don shorts, T-shirts and sandals. Summer in Palo Alto is warm and dry.\nHow do I obtain enrollment verifications for students for insurance purposes?\nOnce a student has enrolled, he or she can generate the enrollment certificate on Axess, which is the online student information system. The certification is available without fee. To obtain the enrollment certificate, students should select the Student Center tab and select Request Enrollment Certification. Students who have issues with printing certifications through Axess can go to the Students Services Center for help.\nWhen are the dates for Family Weekend?\nGenerally, Family Weekend has been held on the last full weekend of February.\nWhat are the dates of school breaks so that I can plan my student’s flights home?\nStart by accessing the university’s academic calendar. Generally speaking, you can anticipate a weeklong break at Thanksgiving, about a three-week break after fall quarter and a one-week break between winter and spring quarters. It is best to wait to learn your son or daughter’s schedule for finals before booking flights. They generally learn that schedule at the beginning of classes each quarter, although it can change.\nWhat do you recommend in terms of airport transportation?\nA good place to start planning your trip is the Visit Stanford website. Area airports include San Francisco International, San Jose Mineta International  and Oakland International. All of the airport websites have information about transportation options.\nThe ASSU, the Stanford student government, often arranges airport shuttles for students during breaks, but that information generally is not available until the last minute.\nWhen is Commencement scheduled?\nCommencement Weekend is generally held mid June. We advise families to plan their visits early.\nIs there a limit to the number of tickets families can order for graduation?\nIn non COVID-19 years, generally no. Commencement is held in the Stanford Stadium, and when social distancing is not required, it is big enough to accommodate everyone who wishes to attend. The same is true of the departmental ceremonies, which are during non-COVID years are generally held at small venues throughout campus. The departmental ceremonies are where students are actually handed their diplomas.\nFamily members should know that Commencement Weekend involves a great deal of walking. Families often underestimate how difficult it is to help members with disabilities get from location to location. If you have a family member with accessibility concerns, plan early for his or her visit to Commencement.\nWhat are students’ storage options?\nThe best place to start is with the Student Housing website.\nHow do I order a birthday cake for my student?\nVisit the web pages of the Parents’ Club.\nHow do I update my address with the university?\nSend an email to mykidis@stanford.edu with all the information.\nHow do I pay my student’s bill? How do I add money to the Stanford card plan?\nRemember that although Stanford acknowledges and respects parents’ and guardians’ financial support, payment is the responsibility of students. Students may authorize others to access their Stanford account and make payments on their behalf through Axess, the student database system. The best place to look for more information is the Student Financial Services website.\n \n\n\n\nStanford + Parents/Guardians\n The student is at the center — and is the focus — of this important partnership.\n\nOur Policy\nProspective Parents\n\n\n  \n\nParents' Helpline\n\nmykidis@stanford.edu\n650-725-0649\n \n\n\n  \n\nIn an Emergency\n\nemergency.stanford.edu\n650-725-5555\n 844-ALERTSU (844-253-7878)  \n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University,  Stanford, California 94305.\n\n \n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/faq/",
        "https://parents.stanford.edu/get-involved/",
        "https://parents.stanford.edu/how-do-i-pay/",
        "https://parents.stanford.edu/stay-informed/",
        "https://parents.stanford.edu/tips/",
        "https://parents.stanford.edu/vital-information/",
        "https://parents.stanford.edu/newsletter/",
        "tel:16507250649",
        "tel:16503292413",
        "https://rde.stanford.edu/studenthousing/mail-deliveries",
        "https://studentservicescenter.stanford.edu/",
        "https://parentsweekend.stanford.edu/",
        "https://registrar.stanford.edu/academic-calendar",
        "https://visit.stanford.edu/",
        "http://www.flysfo.com",
        "http://www.sjc.org",
        "https://www.oaklandairport.com/",
        "http://commencement.stanford.edu",
        "http://commencement.stanford.edu",
        "https://rde.stanford.edu/studenthousing",
        "http://stanfordparentsclub.org",
        "http://www.stanford.edu/group/parentsclub",
        "mailto:mykidis@stanford.edu",
        "https://sfs.stanford.edu/",
        "/stanford-parents/",
        "http://www.stanford.edu/dept/uga/parents/",
        "mailto:mykidis@stanford.edu",
        "tel:16507250649",
        "http://emergency.stanford.edu/",
        "tel:16507255555",
        "tel:18442537878",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}