{
    "title": "New blue light technique could enable advances in understanding nanoscale technologies | Brown University",
    "body": "\n\n\n\n\n\n\nSkip to Main Content\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \nNews from Brown\n\n\n\n\n\n\nSite Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTopics\n\nScience and Technology\n\n\n\nDate\n\n                  April 19, 2023\n                  2023-04-19\n\n\n\nMedia Contact\n\n                    \nJuan Siliezar\n [email protected]\n\n  401-863-3766\n\n\n\n\n\n\n\n\n\nAll News\n\n\n\nShare\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\nLinkedin\n\n\n\n\n\n\nEmail\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew blue light technique could enable advances in understanding nanoscale technologies\nA team of Brown University researchers created a solution to a nanoscale resolution challenge that has for decades limited the study of materials that could lead to more energy efficient semiconductors and electronics.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPROVIDENCE, R.I. [Brown University] — With a new microscopy technique that uses blue light to measure electrons in semiconductors and other nanoscale materials, a team of Brown University researchers is opening a new realm of possibilities in the study of these critical components, which can help power devices like mobile phones and laptops.\nThe findings are a first in nanoscale imaging and provide a workaround to a longstanding problem that has greatly limited the study of key phenomena in a wide variety of materials that could one day lead to more energy-efficient semiconductors and electronics. The work published in Light: Science & Applications.\n“There is a lot of interest these days in studying materials with nanoscale resolution using optics,” said Daniel Mittleman, a professor in Brown’s School of Engineering and author of the paper describing the work. “As the wavelength gets shorter, this becomes a lot harder to implement. As a result, nobody had ever done it with blue light until now.”\nTypically, when researchers use optics like lasers to study nanoscale materials, they use light that emits long wavelengths such as red light or infrared. The method the researchers looked at in the study is called scattering-type scanning near-field microscopy (s-SNOM). It involves scattering light from a sharpened tip that is only a few tens of nanometers across. The tip hovers just above the sample material to be imaged. When that sample is illuminated with optical light, the light scatters and a portion of the scattered light is left with information about the nano-sized region of the sample directly beneath the tip. The researchers analyze that scattered radiation to extract information about this small volume of material.\nThe technique has been at the foundation of many technological advances, but it hits a wall when it comes to using light with a much shorter wavelength, like blue light. This means that using blue light, which is better suited for studying certain materials for which red light is ineffective, to gain new insights from already well-studied semiconductors has been out of reach since the 1990s when the technique was invented.\nIn the new study, the researchers from Brown present how they got around this roadblock to perform what’s believed to be the first ever experimental demonstration of s-SNOM using blue light instead of red.\nFor the experiment, the researchers used the blue light to get measurements from a silicon sample that cannot be obtained using red light. The measurements provided a valuable proof-of-concept about the use of shorter wavelengths to study materials on the nanoscale.\n“We were able to compare these new measurements to what one might expect to see from silicon, and the match was very good,” Mittleman said. “It confirms that our measurement works and that we understand how to interpret the results. Now we can start studying all these materials in a way that we couldn't before.”\nTo conduct the experiment, the researchers had to get creative. Essentially, they decided to make things easier by making them more complicated. With the typical technique, for instance, blue light is hard to use because its wavelength is so short, meaning that it is more challenging to focus over the right spot near the metal tip. If not aligned just right, the measurement won’t work. With the red light, this focusing condition is more relaxed, making it easier to align the optics in order to extract the scattered light efficiently.\nWith those challenges in mind, the researchers used the blue light to not only illuminate the sample so that the light scatters, but also to produce a burst of terahertz radiation from the sample. The radiation carries important information about the sample’s electrical properties. While the solution adds an extra step and increases the amount of data the scientists have to analyze, it eliminates the need to be as precise in how they align the tip over the sample. The key here is that because the terahertz radiation has a much longer wavelength, it is much more easily aligned.\n“It still has to be really close, but it doesn’t have to be as close,” Mittleman said. “When you hit it with the light, you’ll still be able to get information in the terahertz.”\nThe researchers are excited to see what comes next in terms of new information and discoveries the method leads to, such better insights into semiconductors used to produce blue LED technology. Mittleman is currently developing plans to use blue light to analyze materials researchers haven’t been able to before.\nThe work was led by Angela Pizzuto, a Brown physics Ph.D. student who will graduate in May. Pingchuan Ma, a Ph.D. student in Brown’s School of Engineering, also contributed.\nThe work was supported by the National Science Foundation Division of Electrical Communications and Cyber Systems, the Kansas City National Security Campus and the Department of Energy.\n\n\n\n\n\n\n\n\nTags\n\nResearch\nSchool of Engineering\n\n\n\n\nRelated news:\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Science and Technology\n\n\nFour years later, AI language dataset created by Brown graduate students goes viral\n\n\n\n\n\n April 25, 2023\n\n  Thanks to the popularity of new AI-powered chatbots and technology, Brown alumni Aaron Gokaslan and Vanya Cohen are seeing newfound interest in their dataset replicating OpenAI’s language processing model GPT-2.\n\n\nRead Article\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen details for Four years later, AI language dataset created by Brown graduate students goes viral\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Science and Technology\n\n\nOn the eve of Earth Day, Brown climate scientist outlines solutions for a warming world\n\n\n\n\n\n April 20, 2023\n\n  Kim Cobb, a Brown University professor and director of the Institute at Brown for Environment and Society, spoke about the need to act on climate change, urging that action must be taken collaboratively and equitably.\n\n\nRead Article\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen details for On the eve of Earth Day, Brown climate scientist outlines solutions for a warming world\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Science and Technology\n\n\nWomen university presidents, engineering deans issue open letter supporting CHIPS and Science Act\n\n\n\n\n\n April 20, 2023\n\n  The 13 signatories, including Brown’s Christina H. Paxson and Tejal Desai, call on universities to help meet the U.S. Commerce Secretary’s semiconductor workforce goals by preparing more women, people of color to enter the field.\n\n\nRead Article\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen details for Women university presidents, engineering deans issue open letter supporting CHIPS and Science Act\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n\n\nProvidence\nRI\n02912\n\n\n\n\n\n\n\n\n401-863-1000\n\n\n\n\n\n\nQuick Navigation\n\n\n\n\nVisit Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Map\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA to Z\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter Navigation\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEvents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCampus Safety\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccessibility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers at Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe campaign for building on distinction\n\nGive To Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSocial Navigation\n\n\n\n\n\n\n\n\nFacebook\n\n\n\n\n\n\n\n\nInstagram\n\n\n\n\n\n\n\n\nLinkedIn\n\n\n\n\n\n\n\n\nSnapchat\n\n\n\n\n\n\n\n\nTwitter\n\n\n\n\n\n\n\n\nYouTube\n\n\n\n\n\n\n\n\nSocial Media Directory\n\n\n\n\n© Brown University \n\n\n\n\n\n\n\n\nBrown University\n\n\n\n\n\n \n\n\nFor You\n\n\n\n\n\n\n\nCurrent Students\n\n\nFaculty\n\n\nStaff\n\n\nParents & Families\n\n\nAlumni\n\n\nFriends & Neighbors\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\nMobile Site Navigation\n\n\n\n\nMobile Site Navigation\n\n\n\n\n\nFeatured Events\n\n\n\n\n\n\nFor Journalists\n\n\n\n\n\n\n\n\n\n\nTopics\n\n\n\n\n\nArts and Humanities\n\n\n\n\nEnvironment\n\n\n\n\nHealth and Medicine\n\n\n\n\nNews and Events\n\n\n\n\nScience and Technology\n\n\n\n\nSocial Sciences\n\n\n\n\nStudent Life\n\n\n\n\nUniversity Initiatives\n\n\n\n\n\n\n\n\nMobile Secondary Navigation Navigation\n\n\n\n\nCOVID-19 Info\n\n\n\n\nAbout\n\n\n\n\nEvents\n\n\n\n\nFor You\n\n\n\n\nGive to Brown\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAll of Brown.edu\n\n\n\n\n\n\nPeople\n\n\n\n\n\n\nNews\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\nSearch people\n\n\n\n\n\n\n\nAdvanced Search\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Search\n\n\n\n\n\n\n\n\n\n\n\nNew blue light technique could enable advances in understanding nanoscale technologies\n\n\n\n\n\nOpen details for New blue light technique could enable advances in understanding nanoscale technologies\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBookmark this Page\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page_main_content",
        "/",
        "/news",
        "/news/featured-events",
        "/news/for-journalists",
        "#flyout_search",
        "#menu",
        "/news/science-technology",
        "/cdn-cgi/l/email-protection#137966727d4c607a7f7a766972615371617c647d3d767766",
        "tel:4018633766",
        "/news/all",
        "#",
        "#",
        "#",
        "#",
        "https://www.nature.com/articles/s41377-023-01137-y",
        "/news/tag/research",
        "/news/tag/engineering",
        "/news/2023-04-25/open-web-text",
        "/news/2023-04-25/open-web-text",
        "/news/2023-04-25/open-web-text",
        "/news/2023-04-20/earth-week-lecture",
        "/news/2023-04-20/earth-week-lecture",
        "/news/2023-04-20/earth-week-lecture",
        "/news/2023-04-20/chips-act",
        "/news/2023-04-20/chips-act",
        "/news/2023-04-20/chips-act",
        "https://www.google.com/maps/dir/?api=1&destination=Brown%20University%2075%20Waterman%20St.%20Providence%20RI%2002912",
        "tel:4018631000",
        "https://www.brown.edu/about/visit",
        "https://www.brown.edu/Facilities/Facilities_Management/maps/#building/",
        "https://www.brown.edu/a-z",
        "https://www.brown.edu/about/contact-us",
        "https://www.brown.edu/news",
        "https://events.brown.edu/",
        "https://dps.brown.edu/",
        "https://www.brown.edu/website-accessibility",
        "https://www.brown.edu/careers",
        "http://alumni-friends.brown.edu/giving/",
        "https://www.facebook.com/BrownUniversity",
        "https://instagram.com/brownu",
        "https://www.linkedin.com/edu/school?id=19348",
        "https://www.snapchat.com/add/brown-u",
        "https://twitter.com/BrownUniversity",
        "https://www.youtube.com/brownuniversity",
        "https://www.brown.edu/social/",
        "/",
        "/current-students",
        "/faculty",
        "/staff",
        "/families",
        "https://alumni-friends.brown.edu/",
        "/friends-neighbors",
        "#flyout_search",
        "#menu",
        "/news/featured-events",
        "/news/for-journalists",
        "/taxonomy/term/146",
        "/taxonomy/term/311",
        "/taxonomy/term/161",
        "/taxonomy/term/301",
        "/taxonomy/term/306",
        "/taxonomy/term/316",
        "/taxonomy/term/521",
        "/taxonomy/term/526",
        "https://healthy.brown.edu/",
        "/about",
        "https://events.brown.edu",
        "",
        "https://alumni-friends.brown.edu/giving",
        "https://directory.brown.edu/",
        "#header",
        "https://www.brown.edu/news/2023-04-19/blue-light"
    ]
}