{
    "title": "About SSU | Sonoma State University",
    "body": "\n\nJump to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApply\nVisit\nGive\nLogin\nSearch\nToggle Menu\n\n\n\n\n\n\n\n\n\nClose Nav\nsearch query *\n\n\n\n\n\nCommon Searches\n\nWhat majors and minors are offered?\nWhere can I find information about graduate programs?\nHow much is tuition?\nWhat financial aid packages are available?\nWhere can I log in to SSU Online?\n\n\nClose Nav\n\n\nClose Nav\nsearch query *\n\n\n\n\n\n\nApply\nVisit\nGive\nLogin\nA - Z\nLibrary\nDirectory\nStudents\nMaps\nFaculty & Staff\nAthletics\nAlumni\nAbout UsToggle Submenu Mission\nHistory\nFacts\nDiversity\nPresident\nAdministration\nDivisions & Departments\nStrategic Plan\nSustainability\n\nAcademicsToggle Submenu Degree Programs\nSchools & Departments\nAcademic Calendar\nAcademic Support\nAdvising Central\nSchedule of Classes\nCatalog\n\nAdmissions & AidToggle Submenu Experience Sonoma State\nHow to Apply\nI Have Applied\nForms\nFinancial Aid\nStudent Fees & Charges\nRegistrar\n\nCampus LifeToggle Submenu Associated Students\nSeawolf Living\nClubs & Organizations\nFraternities & Sororities\nCampus Recreation\nHousing\nCulinary Services\nThings to do at SSU\nAbout the Area\n\nNews & EventsToggle Submenu Seawolf Calendar\nSocial Media Feeds\nInsights Magazine\nCampus Updates\nFor the Media\nGreen Music Center\nBox Office Tickets\n\n\n\nClose Nav\n\n\n\n\n\n\n\n\n\n\n\nYou are hereSSU Home ›  \nAbout SSU\n\n\n\n\n\n\n \n\nLocated in California's premier wine country one hour north of San Francisco, Sonoma State is a small campus with big ideas. With a tradition of promoting intellectual and personal growth, leadership opportunities and technological proficiency, SSU offers its students a friendly, safe and informal atmosphere on a beautiful campus setting. Currently, campus housing accommodates students in both apartment and residential suite style facilities.\nWhile SSU generally accepts all qualified students who apply from high schools in its service area, 80 percent of the freshmen and 55 percent of the junior transfer students come from outside the North Bay region. With 34 percent of the student body living on campus, it is one of the most residential campuses within the California State University system.\nAcademic Profile \nAccreditation \nAlumni Association\nAthletics\nAwards and Honors\nBuildings and Learning Center\nDegree/Program Offerings\nEthnicity Profile\nFounders\nGreek Life and Campus Clubs \nHousing\nRegional Resource\nStudent Life\nAcademic Profile\nThe SSU educational experience fosters intellectual, cognitive, social and personal growth. The faculty and staff provide collaborative relationships with students and an education that fosters ethical exploration, civic engagement, social responsibility, and global awareness combined with a solid foundation in an academic discipline. Many classes average fewer than 40 students, allowing close interaction between students and faculty.\nSSU has a commitment to graduating students who have the ability to think critically and ethically and can effectively use information technology. There is a strong move to develop a global perspective in much of the curriculum to prepare students for the needs of the 21st century workplace. \nAccreditation\nSonoma State University is accredited by the Western Association of Schools and Colleges (WASC) and the California State Board of Education. The School of Education is accredited at the state and national levels by CCTC and NCATE. The School of Business and Economics is accredited by AACSB-International, the Association to Advance Collegiate Schools of Business. Many departments and programs are individually accredited.\nAlumni Association\nSSU has an active Alumni Association that maintains a continuing connection between University and its 53,000 alumni, by sponsoring educational projects, programs and activities to continue the relationship students have with their university.\nVisit SSU Alumni Association's website.\nAthletics\nThe Department of Intercollegiate Athletics sponsors 13 sports: five for men and eight for women. SSU is a member of the NCAA Division II and competes in the California Collegiate Athletic Association, the premier intercollegiate Division II athletic association in the country. It is also a member and part of the California Collegiate Athletic Association (CCAA) and Western Water Polo Association (WWPA). Eleven of SSU's sports are in the CCAA, water polo is in the WWPA, and men's tennis is a Division II independent.\nSonoma State athletics got its start in 1964 with the school's first men's basketball team. Through the years, the Seawolves have had much success including national championships in 1990 (women's soccer), 2002 (men's soccer) and 2009 (men's golf).\nAwards and Honors\nOne of the most requested campuses in the CSU system and regularly named a “Best Regional University” by U.S. News & World Report. SSU has also been named one of the “most wired” campuses in the nation by Princeton Review. SSU is the only California university invited to be a member of the Council of Public Liberal Arts Colleges, a prestigious group of 25 universities and colleges across the nation committed to providing superior liberal arts and sciences education to their students.\nBuildings and Learning Centers\nThe Jean and Charles Schulz Information Center is named after Peanuts cartoon creator Charles Schulz and his wife. It holds one of the largest libraries in the CSU system and the state of California with more than 400,000 volumes. A unique 750,000-volume automated-retrieval system is one of only four in the country. It also houses a valued collection of Jack London’s writings, original letters and memorabilia.\nThe 59,000 square foot Campus Recreation Center, designed with high standards for sustainable building methods, houses state-of-the-art aerobic equipment, a climbing wall, exercise and dance studios, two gyms, a large weight lifting and machine area, locker rooms and a spa. Known as a \"building that teaches,” the Environmental Technology Center is a demonstration of sustainable architecture and energy efficiency that consumes only 50% of the energy of similar structures.\nOur brand new, 130,000 sq. ft. student center opened in November of 2013. It houses areas and programs for students such as the living room; food venues including the Kitchens, Weyden + Brewster, The Café, and Lobo's as well as the University store, the HUB, Student Activities Office, meeting and activity rooms, the Copy Center and the campus post office on the first two floors. The third floor is home to the ballroom, meeting and activity rooms, Overlook restaurant, Conference and Event Services, Housing, and Culinary Services office spaces.\nThe Green Music Center was designed to become one of the great concert halls of the world and is modeled after Seiji Ozawa Hall at Tanglewood in Massachusetts (the summer home of the Boston Symphony Orchestra).\nThe Cerent Engineering Complex houses state-of-the-art equipment for research and teaching in computer and engineering sciences. Students have unique opportunities to work with high tech companies in the area.\nThe university also owns and operates the 450-acre Fairfield Osborn Preserve nearby and the 3,200 acre Galbreath Wildland Preserve in Mendocino County. Both offer major opportunities for research in the natural sciences rare for students.\nDegree/Program Offerings\nThe University offers nine credential programs and eight undergraduate and graduate certificate programs. Basic teaching credential programs in education include multiple subject, multiple subject BCLAD, single subject, administrative services, reading/language arts (certificate or specialist), special education (mild/moderate or moderate/severe), and pupil personnel services (via the Counseling Department).\nThe university is comprised of six schools: Arts and Humanities, Business and Economics, Education, Extended and International Education, Science and Technology and Social Sciences. Degrees are offered in 46 majors and 47 minors at the bachelor's level and 15 at the master's level. The university offers a joint master’s degree in mathematics with San Francisco State University. It also offers nine credential programs and eight undergraduate and graduate certificate programs. Sonoma State offers one of the only wine business programs in the country.\nStudent Ethnicity Profile\nStudent Ethnicity Profile, Fall 2015, Summarized from CSU Statistical Abstract (self-reported)\nEthnicity\nPercentage (rounded)\nCaucasian\n49%\nLatino/Hispanic\n28%\nMulti-Racial\n7%\nAsian\n5%\nAfrican American\n2%\nDeclined to State\n7%\nAmerican Indian \n1%\nHawaiian/Pacific Islander\n0.2%\n \nFounders of SSU\nAccording to a 1994 article by Gaye LeBaron, longtime newspaper columnist for The Press Democrat that specializes in local history, there were ten founding members of Santa Rosa Center, San Francisco State College, which would become Sonoma State College in 1960. They were:\nBarbara Biebush, Librarian\nCharles \"Chuck\" Rhinehart, Mathematics (d. 2008)\nDorothy Overly, English (d. 1983)\nCheryl Peterson, Political Science\nWright Putney, Art\nMario DiGesu, Education\nDee Hinman, Sociology\nHobart \"Red\" Thomas, Psychology (d. 2009)\nGeorge McCabe, Director (d. 1996)\nEl Doris Wood, Education\nGreek Life and Campus Clubs\nGreek Life and Campus Clubs: There are currently 19 sororities and fraternities on campus. Four new local and ethnic sororities were started in the recent years. More than 120 clubs and organizations are available to accommodate a wide range of interests.\nHousing\nThe residential community provides some of the most attractive suite-style housing in the area. Non-dormitory suites are served by a dining hall and are clustered in villages, offering students a similar experience to living off campus. Freshmen generally live in residential suites; sophomores and upper-level students in the apartments. Available to all are swimming pools, spas, computer labs, a convenience store, a pizzeria, and outdoor recreational areas. The newest complex, Tuscany Village, opened in Fall 2009.\nVisit the Housing website\nRegional Resource\nFounded in 1960 as a teacher education center for the North Bay, Sonoma State University is now a liberal arts and sciences university dedicated to providing high-quality undergraduate education and selected professional graduate programs. Dedicated to the liberal arts and sciences and known for its active use of technology, the SSU educational experience fosters intellectual, cognitive, social and personal growth. The faculty and staff of Sonoma State provide close mentoring relationships and an education that fosters ethical exploration, civic engagement, social responsibility, and global awareness combined with a solid foundation in an academic discipline.\nSonoma State University also serves as an educational and cultural resource for its region by offering courses, lectures, workshops and programs that are open to the public and by entering into partnerships with local businesses, industries, and cultural and educational institutions to enhance the quality of life in the North Bay and beyond.\nAs California's premier public undergraduate institution, SSU has a commitment to graduating students who have the ability to think critically and ethically and can effectively use information technology.\nStudent Life\nStudent Involvement organizes a wide variety of social and educational activities for students. This can run the gamut from karaoke, community service events, video game contests, live music shows, comedy contests, lectures, trips to local Bay Area theatres, sporting events, museums, and much more. The alcohol and drug education program has become a model for other CSU campuses. The campus has a student newspaper, The Star,  and a student-run radio station, KSUN Radio. For more information on events, visit the Seawolf Calendar.\nMore than 100 clubs and organizations are available to accommodate a wide range of interests from ethnic and international to special hobbies and pursuits.\nA community service program supported by the Associated Students, JUMP (Join Us Making Progress) offers students the opportunity to serve in numerous volunteer programs and gain experiences relevant to their education. Some of the many JUMP projects are Adopt-a-Grandparent, Study Buddies, Bodega Bay Homework Project, and Serving Our Unfed People.\n\n\n\n\n\n\n\n\n\nMission\nHistory\nFacts\nDiversity\nPresident\nAdministration\nDivisions & Departments\nStrategic Plan\nSustainability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\nTwitter\nInstagram\nYoutube\nRSS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1801 East Cotati Ave\nRohnert Park, CA 94928\n707.664.2880\n\n\n\n\n\n\n\nContact SSU\nPrivacy Notice\nCalifornia State University\n\n\n\nAccessibility\nSafeSSU\nWebsite Feedback\n\n\n\nEmergency Information\nJobs\nTitle IX\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "/",
        "http://admissions.sonoma.edu/apply",
        "/visit",
        "/give",
        "https://login.sonoma.edu/",
        "#",
        "#",
        "#",
        "/academics/degree-programs",
        "http://www.sonoma.edu/aa/gs/",
        "http://www.sonoma.edu/registration/fees.html",
        "http://www.sonoma.edu/finaid",
        "https://login.sonoma.edu/",
        "#",
        "#",
        "http://admissions.sonoma.edu/apply",
        "/visit",
        "/give",
        "https://login.sonoma.edu/",
        "/a-z",
        "http://library.sonoma.edu/",
        "https://ldaps.sonoma.edu/fasd/",
        "/students",
        "https://map.sonoma.edu/",
        "/faculty-staff",
        "http://sonomaseawolves.com/",
        "http://www.ssualumni.org/",
        "/about",
        "#",
        "/about/mission",
        "/about/history",
        "/about/facts",
        "http://diversity.sonoma.edu",
        "/about/president",
        "/about/administration",
        "/divisions-departments",
        "http://strategicplan.sonoma.edu/",
        "http://sustainablessu.sonoma.edu/",
        "/academics",
        "#",
        "/academics/degree-programs",
        "/academics/schools-departments",
        "/academics/calendar",
        "/academics/support",
        "//advising.sonoma.edu/",
        "/academics/schedule-classes",
        "http://catalog.sonoma.edu",
        "http://admissions.sonoma.edu/",
        "#",
        "http://admissions.sonoma.edu/experience",
        "http://admissions.sonoma.edu/how-apply",
        "http://admissions.sonoma.edu/i-have-applied",
        "http://admissions.sonoma.edu/forms",
        "http://www.sonoma.edu/finaid/",
        "http://seawolfservices.sonoma.edu/fees",
        "http://registrar.sonoma.edu/",
        "http://getinvolved.sonoma.edu/",
        "#",
        "http://as.sonoma.edu/",
        "http://www.seawolfliving.com/",
        "http://getinvolved.sonoma.edu/recognized-student-organizations",
        "http://getinvolved.sonoma.edu/fraternity-and-sorority-life",
        "http://campusrec.sonoma.edu/",
        "http://housing.sonoma.edu",
        "http://culinary.sonoma.edu/",
        "/campus-life/things-to-do",
        "/campus-life/about-area",
        "http://news.sonoma.edu",
        "#",
        "/calendar",
        "http://news.sonoma.edu/social-media-feeds",
        "http://news.sonoma.edu/insights",
        "/updates",
        "http://news.sonoma.edu/media",
        "http://gmc.sonoma.edu/",
        "http://tickets.sonoma.edu/",
        "#",
        "/",
        "#academicprofile",
        "#accreditation",
        "#alumni",
        "#athletics",
        "#awards",
        "#buildings",
        "#degree",
        "#ethnicity",
        "#founders",
        "#greek",
        "#housing",
        "#resource",
        "#student",
        "http://www.ssualumni.org/s/937/3col.aspx",
        "http://www.sonomaseawolves.com/",
        "https://campusrec.sonoma.edu/",
        "http://gep.sonoma.edu/research-activity-centers/environmental-technology-center",
        "http://gmc.sonoma.edu/",
        "http://ee.sonoma.edu/resources/laboratory-resources/cerent-engineering-science-complex",
        "https://cei.sonoma.edu/preserves/osborn",
        "https://cei.sonoma.edu/preserves/galbreath",
        "https://ah.sonoma.edu",
        "https://sbe.sonoma.edu",
        "https://education.sonoma.edu",
        "https://seie.sonoma.edu/",
        "https://scitech.sonoma.edu",
        "https://socialsciences.sonoma.edu/",
        "http://www.pressdemocrat.com/",
        "https://getinvolved.sonoma.edu/fraternity-and-sorority-life",
        "https://getinvolved.sonoma.edu/recognized-student-organizations",
        "https://housing.sonoma.edu",
        "https://getinvolved.sonoma.edu/",
        "/calendar",
        "https://as.sonoma.edu/",
        "https://as.sonoma.edu/jump",
        "/about/mission",
        "/about/history",
        "/about/facts",
        "http://diversity.sonoma.edu",
        "/about/president",
        "/about/administration",
        "/divisions-departments",
        "http://strategicplan.sonoma.edu/",
        "http://sustainablessu.sonoma.edu/",
        "https://www.facebook.com/sonomastateuniversity",
        "https://twitter.com/ssu_1961",
        "https://instagram.com/sonomastateuniversity",
        "https://www.youtube.com/csusonoma/",
        "http://news.sonoma.edu/rss.xml",
        "/",
        "/contact-ssu",
        "/privacy",
        "https://www.calstate.edu/",
        "http://accessibility.sonoma.edu/",
        "https://safessu.sonoma.edu",
        "/website-feedback",
        "http://www.sonoma.edu/ps/emergency/",
        "/employment",
        "http://ophd.sonoma.edu/"
    ]
}