{
    "title": "Jetpack Social Plugin Adds Paid Plan, Free Users Now Limited to 30 Shares per Month – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nOctober 18, 2022\nSarah Gooding\nJetpack Social Plugin Adds Paid Plan, Free Users Now Limited to 30 Shares per Month\n\nJetpack has announced changes to its Jetpack Social plugin that may impact publishers who frequently share across social media networks. Previously, users could share an unlimited number of posts automatically via their connected social media accounts. Jetpack is shuffling its monetization strategy for this extension and has capped social sharing at 30 shares per month for the free tier.\nA new paid plan offers 1,000 shares and re-shares per month, starting at $1/month for the first month and is $10/month thereafter. As a concession, Jetpack is rolling the social previews and re-sharing into the free plan.\n\nWith Jetpack Social, if a post is automatically shared to Twitter, Facebook, and LinkedIn, that counts as three shares. It’s easy to see how quickly these shares can rack up to where even a casual blogger might require a paid plan. Publishers that are used to being able to automatically share all their posts for free should be aware this change that limits them to to 30 shares per month.\nI would not be surprised to see some users switch to another social sharing plugin, as many others offer far more social networks and don’t limit the number of times users can share. Instead they opt to restrict re-sharing, scheduling, or the ability to connect multiple accounts per social network. \nJetpack Social has a new team behind it focused on making the product better. In 2021, Automattic acquired the Social Image Generator plugin with plans to integrate it into Jetpack’s social media tools. This may make the product more compelling, since it currently doesn’t stand up well to the myriad of free sharing plugins out there. Jetpack only supports four social networks, but the team is working on expanding the plugin’s capabilities. The plugin’s development team also accepts feature suggestions on its GitHub repository.\nVersion 1.4.0 of the Jetpack Social plugin moved the share limits code to the Publicize package and added a meter to show users how many shares they have remaining. Users on the free plan should notice these changes in their dashboards.\nCategory: News, PluginsTags: jetpackShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n20\n\n\n\n\t\t20 responses to “Jetpack Social Plugin Adds Paid Plan, Free Users Now Limited to 30 Shares per Month”\t\n\n\n\n\n\n\n\n\n\n Paxton says: \n\nOctober 18, 2022 at 4:31 PM \n\n\nWell folks, what’s a good alternative, in your view?\n\nLoading…\n\n\n\n\n\n\n\n\n\n Brad says: \n\nOctober 18, 2022 at 5:10 PM \n\n\nThis seems like a really sad “reach” at an attempted fishing expedition to monetize something so simple as social sharing.\nMonetize VideoPress into Jetpack so that one never has to jack with Vimeo, YouTube or any CDN for whitelabelled videos …. the community is in.  Monetize something that is an ‘additional’ feature in Jetpack, and again …the community is on board with it.\nBut to attempt to monetize something so frivolous as “social sharing” into a PAID feature?   That will not turn people TOWARDS Jetpack, that will turn folks AWAY from Jetpack & for good reason.\n@Paxton\nHere’s your answer: https://wordpress.org/plugins/search/social+share/\n(My pick? = https://wordpress.org/plugins/social-warfare/ )\nAnd that answer to Paxton also goes to one of the main reasons that this will be a turn off to gain more Jetpack revenue and users.  There is simply no valid justification to monetize a feature which comes so freely available to everyone.\nJetpack needs to monetize something that you can NOT get anywhere else.  Take the reach and scope of Jetpack and monetize non-branded video CDN at a competitive rate, and then you’ve got a revenue generating product.\nBut social shares? Nope.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n doug triplett says: \n\nOctober 18, 2022 at 6:35 PM \n\n\n@ Paxton\ni really like social rocket. The free version has tons of options and should take care of most people.\nAs for this change, seems dumb to me. and to try to mil, people for a buck right now or 10 bucks at full price? Someone is not a marketing genius there.\nBesides, is the bloat of anything Jetpack worth the hassle? Kitchen sink plugins are stupid because of how they slow servers.\nIt seems to me that Automattic is looking for anyway to drag a dollar out of the community. They are directly competing with contributors.\nIve been using WP since the beginning and sometimes I want to look elsewhere. If Automattic continues to cannibalize the community, I expect viable alternatives will come sooner rather than later.\nLook at Elementor and the other page builders plus some of the hosting providers and you can see they are positioning themselves to fork WP and proceed as a unified product not part of the general WP community.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Paxton says: \n\nOctober 18, 2022 at 6:59 PM \n\n\nThank you  both for your suggestions.\nI feel like facebook and twitter both now are devaluing automated posts in user feeds from Jetpack. I suspect it is the same for other programmatic post-making solutions. So, yeah…  it’s a marginally useful feature and one that is totally random to pick to monetize.\nIt was really nice to set up for clients who have a social presence, but were unlikely to utilize them much. Letting wordpress drive content to those platforms made a lot of sense at the time. But, now.. I’m not so sure.\n\nLoading…\n\n\n\n\n\n\n\n\n\n doug triplett says: \n\nOctober 19, 2022 at 1:23 PM \n\n\nYou are correct about FB for sure. Autoposting is punished. Also, the autoposts will always have the link in the post, FB is punish9ing those as well. The link needs to be the first comment.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Sathya says: \n\nOctober 19, 2022 at 5:26 AM \n\n\nGOOD\nhttp://asus.laptopserviceschennai.com/\n\nLoading…\n\n\n\n\n\n\n\n\n\n Kingsley Felix says: \n\nOctober 19, 2022 at 7:08 AM \n\n\nThis same SOCIAL PLUGIN that can’t share to  LinkedIn company pages and is limited to just 1 facebook PAGE?\nlol\nwhat a joke.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Alex de Borba says: \n\nOctober 19, 2022 at 8:22 AM \n\n\nI must confess that we have never used Jetpack or any of its features.\nNonetheless, I can share that when it comes to sharing our Posts and Products, we do it automatically using Zapier connected to both WordPress/WooCommerce and share those when updated or newly published on our network (we run a multisite SaaS setup).\nCurrently, using this method, we publish to Facebook Page, LinkedIn Company Page, Twitter, and Pinterest, but we are also working to share automatically to Instagram.\nEverything published or updated also triggers a notice on assigned Slack channels for our staff to be in the loop.\nRegarding visitors sharing our content, we use Novashare, which allows them to share, as well as us, to track such shares. It is incredibly lightweight and powerful.\n\nLoading…\n\n\n\n\n\n\n\n\n\n doug triplett says: \n\nOctober 19, 2022 at 1:23 PM \n\n\nZapier is a far better solution in many cases.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Kristina says: \n\nOctober 19, 2022 at 6:05 PM \n\n\nI am part of the Jetpack team developing Jetpack Social and I want to give props to the author of this post. You did a great job describing what is going on with the product.\nI also want to clarify some points based on the comments. Jetpack Social is focused on auto-sharing your site content to social media. The social sharing buttons that are part of Jetpack aren’t part of Jetpack Social at this time. So readers of your posts can continue to share your content to social media as much as they’d like. There is no limit on that.\nLikewise, there is no limit on the number of social accounts you can connect to or the number of users that can use those connections. You can set it to automatically post an image and excerpt from your blog post on the social media platforms you choose on the schedule you choose.\nJetpack Social is available within the Jetpack plugin or as a standalone plugin. The standalone plugin doesn’t include any other Jetpack features. So if you’re not interested in Jetpack’s security or performance features, you can use the Jetpack Social plugin by itself.\nAs mentioned in the post, we’re working on some new features like the social image generator, additional social platforms, organic social posting that makes the post look native to the platform, video sharing, and more.  To keep up with what’s coming next, you can follow us on Facebook and Twitter.\nMy team is committed to bringing the social features you need to your WordPress dashboard and we’d love to hear from you. You can sign up for a user research interview here.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Paxton says: \n\nOctober 19, 2022 at 11:23 PM \n\n\nKristina, thank you for your thoughtful reply.  If I read the post correctly, if I have three social media accounts connected (in this use case let’s just say twitter), that will count as 3 of my 30 free limit,.\nI support two newspapers, both non-profits, both use jetpack to cross post to FB and twitter, both with 3 twitter accounts connected. By my estimation, they’ll be out of free posts within 1 to 1.5 weeks.\nI’m going to be perfectly honest, It’s not great news, in fact it kind of feels like a punishment for loyalty.  I understand the need to meet revenue targets and keep people employed. Just seems to me like there could be better targets to convert to revenue.  I mean, we’re already paying….\nGood luck and I hope you all find new success and  with this incredibly useful set of utilities. We’ll probably just start manually posting.  Meanwhile, I’m likely to recommend that we ride our our year and that we plan our egress from Jetpack as we really can’t afford surprises after so many years.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Kristina says: \n\nOctober 20, 2022 at 11:37 AM \n\n\nThanks, Paxton! That’s interesting that you support non-profit newspapers. We care very much about keeping a free version available to most casual users, and we carefully considered where to put the sharing limit. Most users only have 1 social connection, so 30 automated shares per month, roughly 1 post per day, is a lot for most folks. The highest number of free posts we found in any other offering was 10 per month. We are giving 3x that because we are committed to keeping a robust free version that meets the sharing volume needs of most sites.\nI understand if you’ll need to start sharing posts manually, but that’s a bummer! You mentioned that you’re already paying. If you already have the Jetpack Complete plan, there is no additional cost, as Jetpack Social is part of the Complete plan.\nIf you’re interested in talking with us and sharing how your clients use social media, we’d love to speak with you! I’ll try again to share my link to sign up for a user interview here: https://jetpackresearch.blog/.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Martin says: \n\nDecember 25, 2022 at 9:31 AM \n\n\nThe point is , this plugin isn’t that unique to charge $10 per month for it. Its just a poor marketing strategy to milk WordPress users.\nTo charge for security plugin, its fair but for social sharing??? that’s absurd\n\nLoading…\n\n\n\n\n\n\n\n\n\n Joe says: \n\nJanuary 14, 2023 at 7:01 PM \n\n\nRolling out payment before implementing new features was honestly one of the stupidest mistakes that the jetpack team has done.  This is a middle finger to your users.\nYou should have honestly charged for the new features (when they rolled out) yet keep the base unlimited auto-posting functionality free.\nWell, I am voting with my euro and canceling the subscriptions, and looking for another plug-in developer who actually offers more features now.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n DS says: \n\nNovember 2, 2022 at 11:39 AM \n\n\nAt what point will the current functionality that has been working for years get limited by the monthly posting cap? I need to know the timeline I have to move to a different solution and I figure anyone else impacted would want to know this as well. I do not see anything in my dashboard about limits right now (still using legacy “full” Jetpack plugin, this is the only feature I use in it).\n\nLoading…\n\n\n\n\n\n\n\n\n\n AstroNerdBoy says: \n\nJanuary 9, 2023 at 8:05 PM \n\n\nTL; DR: Jetpack demands your money, and you are cheapskates for not wanting to pay $120 for auto-posting that has been around for quite a while and doesn’t require any significant support.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Mfon Ekene says: \n\nOctober 21, 2022 at 7:14 PM \n\n\nWhy will anyone wanna keep using it when there are free alternatives? There are a lot of free options that are better for performance.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Vishwajeet Kumar says: \n\nOctober 25, 2022 at 12:51 AM \n\n\nI have used Jetpack’s free social share plugins. However, I found it limited and lacking customization features. I am using the Sassy Social share plugin. It’s the best and most free social share plugin.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Silver H says: \n\nDecember 26, 2022 at 10:36 PM \n\n\nI just realized Jetpack implemented this in December. As convenient as the service was, 30 shares per month won’t do us any good since we share to both Twitter and Facebook. Even at a post per day, we’ll run out of shares by the end of the month. We’re currently switching over to free plugins. It’s a lot more work to get up and running, but a feature as simple as share a post to social media at $120 per year/$10 per month is a bit much when it was free for years.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Abdulsalam Selim says: \n\nJanuary 13, 2023 at 12:15 PM \n\n\nJetpack really need a marketing genius, they have great tools but monetizing sharing tool in such way is out of it.\nThere are other amazing apps out there that can take care of post-sharing and auto posting comfortably.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou may also like\nTwitter Suspends WordPress.com’s Access to Twitter API, Breaking Jetpack Social SharingApril 4, 2023Jetpack Search Adds Free Tier and 3-Month Free TrialNovember 17, 2022Priced Out of API Access: Jetpack and WordPress.com Discontinue Support for Twitter Auto-SharingMay 1, 2023\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://wordpress.org/plugins/jetpack-social/",
        "https://jetpack.com/social/",
        "https://wptavern.com/automattic-acquires-social-image-generator-plugin-plans-to-integrate-with-jetpack",
        "https://github.com/Automattic/jetpack/issues/new?assignees=&labels=%5BType%5D+Feature&template=feature-request.yml&title=Feature+Request%3A",
        "https://wptavern.com/category/news",
        "https://wptavern.com/category/plugins",
        "https://wptavern.com/tag/jetpack",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month?share=twitter",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month?share=mastodon",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month?share=facebook",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month?share=telegram",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month?share=jetpack-whatsapp",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month?share=pocket",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20Jetpack%20Social%20Plugin%20Adds%20Paid%20Plan%2C%20Free%20Users%20Now%20Limited%20to%2030%20Shares%20per%20Month&body=https%3A%2F%2Fwptavern.com%2Fjetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month&share=email",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433904",
        "https://woocamp.com",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433905",
        "https://wordpress.org/plugins/search/social+share/",
        "https://wordpress.org/plugins/social-warfare/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433907",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433909",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433943",
        "http://asus.laptopserviceschennai.com/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433924",
        "http://asus.laptopserviceschennai.com/",
        "https://kraftysprouts.media/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433933",
        "https://www.atmostfear-entertainment.com/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433935",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433944",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433949",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433950",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-433969",
        "https://jetpackresearch.blog/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-435532",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-435912",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-434226",
        "https://anime.astronerdboy.com",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-435807",
        "https://www.makemoney.ng/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-434000",
        "https://webinfopond.com",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-434036",
        "https://www.dcgameblog.com",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-435555",
        "https://beeceenet.com.ng/",
        "https://wptavern.com/jetpack-social-plugin-adds-paid-plan-free-users-now-limited-to-30-shares-per-month#comment-435893",
        "https://wptavern.com/twitter-suspends-wordpress-coms-access-to-twitter-api-breaking-jetpack-social-sharing",
        "https://wptavern.com/twitter-suspends-wordpress-coms-access-to-twitter-api-breaking-jetpack-social-sharing",
        "https://wptavern.com/jetpack-search-adds-free-tier-and-3-month-free-trial",
        "https://wptavern.com/jetpack-search-adds-free-tier-and-3-month-free-trial",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing",
        "https://wptavern.com/priced-out-of-api-access-jetpack-and-wordpress-com-discontinue-support-for-twitter-auto-sharing",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge",
        "#",
        "#"
    ]
}