{
    "title": "Luke Reid - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\n\n\nLuke Reid\n\n \n\n\t\t\t\t\t\tLuke Reid (History, '04; Kinesiology, '09) is a content producer for University Communications.\t\t\t\t\t\n\n\t\t\t\t\t\tContact Luke Reid at \n\t\t\t\t\t\t\tlreid@csuchico.edu\t\t\t\t\t\t\n\n\n\n\n\n \nLife of Hard Work Pays Off for Agricultural Business Major \n\n\t\tZion Brigham says coming to Chico State: “felt like going from a black and white TV to full color.” He graduates in May with an agricultural business degree and a clear vision for what’s ahead.\t\n\n\n\n\n \nPitch-Perfect Wildcats \n\n\t\tThirteen sets of siblings have donned the cardinal and white of the Wildcats, and the men's soccer program’s legacy is becoming intergenerational.\t\n\n\n\n\n \nSoon-to-be Theatre Arts Graduate Has Played a Starring Role Offstage \n\n\t\tGaby Saxon has spent four years at Chico State telling outstanding stories, all while using her growing voice and passion for social justice to create one of the most compelling stories of all—her own! \t\n\n\n\n\n \nThree Imaginative Media Arts Alumni Making Exciting Moves \n\n\t\tKarsten Kaufmann’s dance moves became a viral sensation in 2015. Find out where he and collaborating media arts majors Sophie McGuirk and Michael Connell are today. Hint: They're still making amazing content!\n\t\n\n\n\n\n \nTitle IX at 50: Current Wildcat Calling Attention to Women Who Paved the Way \n\n\t\tThe legacy of Title IX at Chico State is filled with stories of inspiring women. Mia Mendoza knows many of them by heart after spending this year sharing them with Chico State’s student-athletes and fans to honor the 50th anniversary of the landmark legislation.\t\n\n\n\n\n \nFond Farewell: Business Professor Emeritus Casey Donoho \n\n\t\tBusiness Professor Emeritus Casey Donoho is remembered for his passion for ethics and his others-centered approach.\t\n\n\n\n\n \nSoccer Programs Win Big on Small Screen \n\n\t\tThe Chico State women's and men's soccer programs shine in episode four of The Rivalries, a documentary series produced for the LG Championships channel available to watch now. \t\n\n\n\n\n \nReligious studies alumna provides a ministry of presence \n\n\t\tOne of the crucial steps along Kelly Ann Nelson's path to being present with others in pain was the religious studies education she earned at Chico State.\t\n\n\n\n\n \nFond Farewell: Retired University Farm Mechanic Jerry Miguel \n\n\t\tJerry Miguel, University Farm mechanic for nearly 30 years, is remembered for all his tools—those he held in his hands, as well as his heart, spirit, and mind.\t\n\n\n\n\n \nIntroducing Delaney Sarantopulos: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tA \"roll-of-the-dice\" decision to attend Chico State came up aces for Delaney Sarantopulos and the University, which has benefited greatly from her service-based leadership.\t\n\n\n\n\n \nIntroducing Peyton Arnold: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tPeyton Arnold has studied the impacts of feeding cover crops to livestock and served as vice president of the Chico State Sheep Association, but she's most passionate about poultry. \t\n\n\n\n\n \nAux Talks Strikes a Chord for Connection \n\n\t\tSing. Laugh. Dance. Connect. Experience the power of the aux cord Thursday from 2–3 p.m. in Trinity Commons. It's Aux Talks and it's a whole lot of fun!\t\n\n\n\n\n \nIntroducing Manraj Singh Randhawa: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tNursing student Manraj Singh Randhawa has a grand vision for his life. The Yuba City Sikh community, the Chico State School of Nursing, and more, are reaping the benefits of that vision.\t\n\n\n\n\n \nDistinguished Alum, Scientist, and CEO Thomas Butler \n\n\t\tThomas Butler found his passion in a Chico State lab. Today, he's the CEO of a company creating medicines designed to attack cancer and diabetes. \t\n\n\n\n\n \nThe Birds Are Calling to You \n\n\t\tPssst. Pssst! The Bushtits and Spotted Towhees are trying to get your attention. Give it to them for a little while. You won't regret it.\t\n\n\n\n\n \nFond Farwell: Physical Education Professor Emeritus Betty Best \n\n\t\tAfter more than three decades of teaching and coaching, Betty Best is remembered by her students and peers as a gifted educator, loyal friend, and talented competitor.\t\n\n\n\n\n \n5 Questions with Author, Alum, and Superhero While he Sleeps, Narcippa Teague \n\n\t\tChico State graduate and former men's basketball player Narcippa Teague shares about his new children's book and new outlook on life.\t\n\n\n\n\n \n5 Questions with Alum and Marriage and Family Therapist Chris Park \n\n\t\tMarriage and family therapist Chris Park shares his appreciation for his Chico State education and provides a glimpse into his experiences as an MFT. \t\n\n\n\n\n \nStudent-Athlete Captures CalHOPE Courage Award \n\n\t\tGretta Kirkby, winner of the CalHOPE Courage Award, is using the opportunity to remind her peers to reach out for help if they need it. \t\n\n\n\n\n \nNew HR Specialist Advances Campus EDI Goals \n\n\t\tCollege opened Maximilian “Max” Cordeiro's world. He's working to create similar experiences for others as Chico State’s inaugural Human Resources EDI Specialist.\t\n\n\n\n\n \nBasket Brigade One of Many Opportunities To Volunteer This Month \n\n\t\tWednesday night's Basket Brigade is one of many opportunities to pitch in and make a difference in the weeks surrounding Thanksgiving.\t\n\n\n\n\n \nFond Farewell: Chico State Enterprises Grants and Contracts Analyst Tara Becraft \n\n\t\tKnown for her problem-solving, crafting, and kindness, Tara Becraft brought joy to those she worked with in Chico State Enterprises.\t\n\n\n\n\n \nFond Farewell: Biology Professor Emeritus Robert Thomas \n\n\t\tDr. Robert “Bob” Thomas was known as an excellent colleague, friend, teacher, and researcher.\t\n\n\n\n\n \nBaseball Voyage Marked by Strong Arm, Strong Voice \n\n\t\tLuke Barker’s focus has been on making it to the big leagues, but when he spotted some serious inequities, he decided to say something.\t\n\n\n\n\n \nSoccer Player Susanna Garcia Leads on the Pitch and in the Classroom \n\n\t\tAnd as she returns to lead the Wildcats in her fifth and final season, Sanna Garcia earned one of only nine All-America honors in the program's storied history.\t\n\n\n\n\n \nChico State Alum Barker is a Big Leaguer! \n\n\t\tFormer Chico State All-American baseball player Luke Barker has been called up to the major leagues by the Milwaukee Brewers.\t\n\n\n\n\n \nBasketball Player’s Success a Slam Dunk in Classroom and the Court \n\n\t\tThe most decorated student-athlete in Chico State’s men’s basketball history, Kevin Warren will graduate this spring with a master’s in communication studies.\t\n\n\n\n\n \nBasketball Star Makes a Difference On, Off the Court \n\n\t\tMalik Duffy has built himself into one of the top Division II men’s basketball players on the West Coast while also having a calming, supportive impact on his Wildcat peers.\t\n\n\n\n\n \nCrosby Captures 2 Medals in Tokyo and the Hearts of ‘Cats Back Home \n\n\t\tParalympian goes back-to-back bronze in the 100 meters and earns her first 400-meter podium.\t\n\n\n\n\n \nFormer Wildcat Golf Star Shines As Caddie on PGA Stage \n\n\t\tDuring the first few years of this millennium, there was no better golfer at the NCAA Division II level than J.J. Jakovac. Now he is earning a similar reputation as a professional caddie.\t\n\n\n\n\n \nBaseball Catcher Named CCAA Male Scholar-Athlete of the Year \n\n\t\tNo surprise to his faculty, accounting major Tyler Stofiel captured the conference's most prestigious academic award. \t\n\n\n\n\n \nStudent-Athletes Urge Peers to Scratch the Stigma Surrounding Mental Health \n\n\t\tChico State's Student-Athlete Advisory Committee created a resource page for Mental Health Awareness Month and kicked off a campaign aimed to end mental health stigma. #ScratchTheStigma\t\n\n\n\n\n \n‘Ain’t No Runner Like a Chico Runner’ \n\n\t\tThe Wildcats are one of only three schools to reach the NCAA Championships in each year of this century! Once again, both the women and men's teams placed in the top 10.\t\n\n\n\n\n \nWish granted; Smile cherished \n\n\t\tChico State student athletes partner with Make-A-Wish to send a 5-year-old boy to LEGOLAND.\n\n\t\n\n\n\n\n \nIt’s Wish Week at Chico State! \n\n\t\tStudent-Athlete Advisory Committee and Make A Wish granting local child's wish Saturday\t\n\n\n\n\n \n38 Special Athletes \n\n\t\tWildcat student athletes honored by CCAA for academic excellence\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "mailto:lreid@csuchico.edu",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/pitch-perfect-wildcats/",
        "https://today.csuchico.edu/gaby-saxon/",
        "https://today.csuchico.edu/three-imaginative-media-arts-alumni-making-exciting-moves/",
        "https://today.csuchico.edu/title-ix-at-50/",
        "https://today.csuchico.edu/fond-farewell-casey-donoho/",
        "https://today.csuchico.edu/soccer-programs-win-big-on-small-screen/",
        "https://today.csuchico.edu/religious-studies-alumna-provides-a-ministry-of-presence/",
        "https://today.csuchico.edu/fond-farewell-jerry-miguel/",
        "https://today.csuchico.edu/rawlins-delaney-sarantopulos/",
        "https://today.csuchico.edu/rawlins-peyton-arnold/",
        "https://today.csuchico.edu/aux-talks/",
        "https://today.csuchico.edu/rawlins-manraj-randhawa/",
        "https://today.csuchico.edu/distinguished-alum-thomas-butler/",
        "https://today.csuchico.edu/the-birds-are-calling-to-you/",
        "https://today.csuchico.edu/fond-farwell-physical-education-professor-emeritus-betty-best/",
        "https://today.csuchico.edu/5-questions-with-narcippa-teague/",
        "https://today.csuchico.edu/5-questions-chris-park/",
        "https://today.csuchico.edu/student-athlete-captures-calhope-courage-award/",
        "https://today.csuchico.edu/new-hr-specialist-advances-campus-edi-goals/",
        "https://today.csuchico.edu/basket-brigade/",
        "https://today.csuchico.edu/fond-farewell-chico-state-enterprises-grants-and-contracts-analyst-tara-becraft/",
        "https://today.csuchico.edu/fond-farewell-biology-professor-emeritus-robert-thomas/",
        "https://today.csuchico.edu/luke-barker-strong-voice/",
        "https://today.csuchico.edu/susanna-garcia/",
        "https://chicowildcats.com/news/2022/6/1/baseball-chico-state-alum-barker-is-a-big-leaguer.aspx",
        "https://today.csuchico.edu/kevin-warren/",
        "https://today.csuchico.edu/malik-duffy/",
        "https://chicowildcats.com/news/2021/9/9/womens-track-crosby-captures-two-medals-in-tokyo-and-the-hearts-of-the-wildcats-back-home.aspx",
        "https://today.csuchico.edu/jj-jakovac-pga-tour-caddy/",
        "https://today.csuchico.edu/stofiel-male-scholar-athlete-of-the-year/",
        "https://today.csuchico.edu/2020-campaign-against-mental-health-stigma/",
        "https://today.csuchico.edu/aint-no-runner/",
        "https://today.csuchico.edu/wish-granted-smile-cherished/",
        "https://today.csuchico.edu/its-wish-week-at-chico-state/",
        "https://today.csuchico.edu/38-special-athletes/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}