{
    "title": "FSE Program Testing Call #21: Front Page Fun – Make WordPress Test",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Test\n\n\nTriage & Testing Issues\nHandbook\nGlossary\n \n\n\n\nHide welcome box\n\n\n\n\nThe Test Team helps manage testing and triage across the WordPress ecosystem. They focus on user testing of the editing experience and WordPress dashboard, replicating and documenting bug reports, and supporting a culture of review and triage across the project.\nIf you’d like to help test Full Site Editing, please join the FSE Outreach Program. You can find current calls for testing for this program here and you can join the fun in #fse-outreach-experiment.\n\n\nThe team gathers in #core-test. Please drop by any time with questions or to help out.Login to Reply\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nannezazu\n\n9:54 pm on April 17, 2023 \n\n\n\nTags: fse-outreach-program ( 90 ), fse-testing-call ( 24 )   \n\t\t\t\t\n\nFSE Program Testing Call #21: Front Page Fun\n\n\nThis post is the twenty-first call for testing as part of the Full Site Editing Outreach Program. For more information about this experimental program, please review this FAQ for helpful details. To properly join the fun, please head to #fse-outreach-experiment in Make Slack for future testing announcements, helpful posts, and more will be shared there. \nOverview\nWhile the release of 6.2 brought loads of new features to the site editing experience, feature development has continued in the GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party, leaving us with the next lineup of cutting edge features to test and refine. This includes looping back on the new navigation section that was removed for WordPress 6.2. The aim of this call for testing is to both get feedback on what’s landed in 6.2 in the pursuit of continuous iteration and to dig into what’s being worked on for the remainder of phase 2 items including:\nPatterns in template creation.\nExperimental Grid Layout.\nAs always, these calls for testing will also explore current features that have been staples since the beginning of the introduction of the site editor, like the Navigation blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. or Template Part blocks. \nFraming\nYou run a site that captures “Daily Delights” about the power of everyday moments to create joy. You want to create a new front page of your site that’s more colorful to reflect the nature of your content. When you chose your theme, you knew it came with a few front page options thanks to patterns so you decided to check out what’s possible. Once you have a new front page option in place, you decide to make some additional changes to your template and navigation to better personalize this new experience of your site.\nTesting Instructions \nTo use a prebuilt test site: \nOpen this link only once: https://app.instawp.io/launch?t=fse-call-for-testing-21&d=v1 \nPlease do not repeatedly open this link as it creates a new site each time and there’s a limit of 50 sites that can be created. \nThis will launch a site for you to use for up to 24 hours. Select “Magic Login” to log in to the wp-admin dashboard. \nSave the link to your site so you can access it again during the test. \nTo set up your own test site: \nHave a test site using the latest version of WordPress. It’s important this is not a production/live site. \nInstall and activate the Twenty Twenty Three One by going to Appearances > Themes.\nInstall and activate Gutenberg 15.5.1. From there, head to Gutenberg > Experiments and turn on the Grid variation for Group block experiment.\nHead to Tools > Import and import this file to have access to the same content as above. From there, create a simple menu and add a few widgets. \nIf you have any issues with manual setup, just comment on the post or pingPing The act of sending a very small amount of data to an end point.  Ping is used in computer science to illicit a response from a target server to test it’s connection. Ping is also a term used by Slack users to @ someone or send them a direct message (DM). Users might say something along the lines of “Ping me when the meeting starts.” me (@annezazu) in WordPress.orgWordPress.org The community site where WordPress code is created and shared by the users. This is where you can download the source code for WordPress core, plugins and themes as well as the central location for community conversations and organization.  https://wordpress.org/ slackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/..\nCreate a new Front Page\nHead to Appearance > Editor and select Templates. Click through a few of the templates to get a feel for your site and notice how a preview is shown of each template when you do so. To go back to view all templates, select the > arrow. \nClick the + next to Templates in the dark gray sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme. and select “Front Page”. \nThis will open up a modal where you can choose between different patterns to begin building your template. Select the second pattern with various green colors depicted. This will bring you to the Front Page template with that pattern inserted automatically.\nUse the Grid layout\nUsing List View, select the second Group block that contains the Query LoopLoop The Loop is PHP code used by WordPress to display posts. Using The Loop, WordPress processes each post to be displayed on the current page, and formats it according to how it matches specified criteria within The Loop tags. Any HTML or PHP code in the Loop will be processed on each post. https://codex.wordpress.org/The_Loop. block. \nOpen the block settings and choose to transform it to a Grid layout. Here’s a visual.\nAfter doing so, under Layout in block settings, change around the values of MINIMUM COLUMN WIDTH until you like how it looks. \nUnderneath this Group block, add an additional Grid group block variation by either directly searching for “Grid” or adding a Group block and selecting the Grid variation.\nExplore using this block. This is intentionally an open ended item to encourage you to explore what this experimental block can do. For example, you could add a section of images or different sections of Headings and paragraph blocks grouped within a Grid block or a section of hashtags you want folks to use. Here’s an example of this last item.\nSave changes. \nCreate a new page (or pages) for navigation \nSelect the Navigation Block in your headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. and select the option to “Edit” converting your menu to individual blocks. \nAdd a new item to the menu by clicking the + button in the editor itself (not in the settings sidebar).\nInstead of adding a current page, search for “Inspiration” and notice the option to create a draft page with that title. Select that option.\nCreate as many draft pages as you’d like using the same process.\nAdd a search block to your menu and customize it.\nSave changes.\nManage your navigation and explore your pages\nSelect the WordPress icon to open up the dark gray sidebar and use the > arrows to go back to the overall Design section.\nNotice there is now a Navigation section. Select it and rearrange your menu items from there. \nSelect a page in your menu and notice that you can edit it directly either by clicking on the canvas or selecting the pencil icon in the sidebar. Make changes to this page and don’t save in the editor. \nInstead select the WordPress icon to open up the dark gray sidebar and notice a Save option in the sidebar itself. \nSelect the save option there and select Save again from the modal. \nRepeat this process with another page in your menu, saving where you’d like. \nWhen done, go back to wp-admin > Pages and publish your pages to ensure they appear correctly in the navigation of your site.\nWhat to notice:\nDid the experience crash at any point?\nDid the saving experience work properly? \nWhat did you find particularly confusing or frustrating about the experience?\nWhat did you especially enjoy or appreciate about the experience? \nWhat would have made this experience easier?\nDid you find that what you created matched what you saw on your site?\nDid it work using Keyboard only?\nDid it work using a screen reader?\nDid it work while using just a mobile device? Shout out to @nomadskateboarding for this addition!\nLeave Feedback by May 8th, 2023\n#fse-outreach-program, #fse-testing-callShare this:Click to share on Twitter (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to share on Pocket (Opens in new window)Login to Reply\n\n\n\n\n\n\n\n\n\n\n\n\nValerie Blackburn\n\n11:59 pm on April 20, 2023 \n\n\n\n\nDid the experience crash at any point? Only when installing The Blog Vault pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party initially to a site of my own where I thought I may stage the site. Then, I found an alternate method with the WP staging plugin.\nDid the saving experience work properly? It seemed to. Then when I viewed the site it didn’t reflect the changes. That’s when I decided to save the code for proof of the changes.\nWhat did you find particularly confusing or frustrating about the experience? How to differentiate between the staging site appearance and the original site.\nWhat did you especially enjoy or appreciate about the experience? Changing the theme and learning about the GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/ features.\nWhat would have made this experience easier? To have a set method of either cloning, duplicating or creating a test site.\nDid you find that what you created matched what you saw on your site? Yes, until saving it.\nDid it work using Keyboard only? Yes\nDid it work using a screen reader? Yes\nDid it work while using just a mobile device? Resizes to a smaller screen. A little too wide for a cell phone screen.\n\n\n\n\n\n\n\n\nValerie Blackburn\n\n1:59 pm on April 21, 2023 \n\n\n\n\nCorrection. Did the saving experience work properly? When I first viewed the changes I was not accurately viewing the  testing site. Yes, the changes were saved to the testing site.\n\n\n\n\n\n\n\n\nannezazu\n\n7:20 pm on April 22, 2023 \n\n\n\n\nHey @valmedia2023! Thanks so much for diving into this call for testing. You’ll get a badge on your profile as a thank you for your participation here.\nIt seemed to. Then when I viewed the site it didn’t reflect the changes. That’s when I decided to save the code for proof of the changes.\nCan you give specifics around what you changed and what didn’t appear on the front end? I can try to replicate and report an issue, if there’s indeed an underlying bug.\nFeel free to share more feedback you might have around the general experience following the steps above! Thanks so much.\n\n\n\n\n\n\n\n\n\n\nMárcio Duarte\n\n11:08 pm on April 24, 2023 \n\n\n\n\nHey, sharing here my experience and observations:\nFirst: the Instawp link was precious, and made everything work smoothly right away. The editor is becoming quite powerful, and I am increasingly enjoying the flexibility of working with blocks, layouts, patterns, and templates.\nDark gray sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme.:\nThe new Navigation section inside the dark gray sidebar is very welcome, but there’s a lot of fragmentation while editing menus in the blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. editor. The classic experience, where everything was centralized in a single screen, was superior in that regard, in my opinion.\nList view on mobile\nI miss the list view while editing on a mobile device as there’s no quick way to visualize the block structure without it. It is the most reliable and stable UIUI UI is an acronym for User Interface - the layout of the page the user interacts with. Think ‘how are they doing that’ and less about what they are doing. navigation point within the block editor, in my opinion.\nUI fragmentation:\nI still would have preferred a reduction in the amount of movement when editing items and blocks, and to centralize the functions of the UI, specially around the navigation area.\nGrid block:\nWhen I added images inside the grid and set their width to 100%, the images overflowed the container in the editor, but preserved the correct width on the front-end. The code there has a figure tag enclosing the img tag with max-width: 100%, which prevents the overflowing.\nI also missed an option to stack the grid cells after a certain point. Right now, putting more than 3 elements in a row gets really crowded on the mobile view. However, I understand that this is just the beginning.\nUsing it on mobile:\nIn the mobile view (Chrome Desktop and Android), the dark gray sidebar does not stay fixed and scrolls up, disappearing. I was expecting it to stay in place. Here’s a GIF demonstrating the issue.\nIn landscape mode (Chrome Android), it only scrolls if I click in a specific area, and it’s not obvious that it can scroll (GIF). It does not scroll at all in Chrome (mobile view).\nThat’s all for now, I hope it helps. Thank you for your excellent work!\n\n\n\n\n\n\n\n\nrobglidden\n\n8:49 pm on April 25, 2023 \n\n\n\n\n16. Instead of adding a current page, search for “Inspiration” and notice the option to create a draft page with that title. Select that option.\nIt doesn’t always display the full word “Inspiration” depending on how fast I type or pause while typing.  Sometimes “Inspira” or\n“Inspirati”.  Some sort of confused debouncing behavior.\n21. Notice there is now a Navigation section.\nWow that is confusing!  It wasn’t there before, was it, even though there was already a navigation blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. in the headerHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes.?  Not intuitive to me that it shows in the left sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme. only when modified, but not when not modified.\n22. Select a page in your menu and notice that you can edit it directly either by clicking on the canvas or selecting the pencil icon in the sidebar. Make changes to this page and don’t save in the editor. \nIt edits the page template, not the page content.  I assume that is what you mean it should do?\n\n\n\n\n\n\n\n\nPaal Joachim Romdahl\n\n2:31 pm on April 29, 2023 \n\n\n\n\nI am using an existing development siteDevelopment Site You can keep a copy of your live site in a separate environment. Maintaining a development site is a good practice that can let you make any changes and test them without affecting the live/production environment. with the imported content.\n5- Going to the Editor. For a short moment I see Styles, Templates and Template Parts. Suddenly a half second later I see Navigation at the top. It is distracting seeing 3 areas and then a moment later 4 areas. I have sometimes clicked almost immediately and then I have end up clicking into the wrong area.\n6-7 Click the + next to Templates and select “Front Page”.  A Choose a pattern modal is seen. I can choose a blog news front or a Start blank. I miss being able to place the cursor inside the pattern and scroll the pattern. I also miss having additional front page patterns to choose from. For instance what about a bunch of Color blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. hero sections on the front page that link to various pages?\nI selected the News pattern.\n8-10 I selected the Query LoopLoop The Loop is PHP code used by WordPress to display posts. Using The Loop, WordPress processes each post to be displayed on the current page, and formats it according to how it matches specified criteria within The Loop tags. Any HTML or PHP code in the Loop will be processed on each post. https://codex.wordpress.org/The_Loop. block. Switched to to Grid. Under Layout in the sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme. I changed it to 22 rem, so that it looked somewhat like what it did before. I changed it from rem to 90%.\n11-12\nI added a Group and selected Grid. Using Grid it makes me think of Columns and the Table block. It seems all three blocks are very much crossing over into each other. Using images it kinda turns into the Gallery block. Let’s say that I do add images and I want a HeaderHeader The header of your site is typically the first thing people will experience. The masthead or header art located across the top of your page is part of the look and feel of your website. It can influence a visitor’s opinion about your content and you/ your organization’s brand. It may also look different on different screen sizes. at the top but inside the Grid block. I would have to move the Header out of the Grid block and above the Grid to have a separate Header.\nThe Grid block is a very small beginning of something that can expand into something very useful. That can become a base for the Columns, Table and Gallery blocks. With each their own variation/unique features.\n16 and 17.\nWhat about making it easier to just create a new page?\nHere we need to write out the name and then get an option to create a draft page (can it be published along with no content in it?)\n\nAdding a red background to the Search block I was not able to see the red background color directly in the Nav bar.\n\n21- Rearranging the Navigation section.\nThe site already had a Navigation section and I wanted to rearrange the one I just created. But the Navigation section in the sidebar did not let me select which of the menus I wanted to adjust. It just took one of the oldest ones I had. I expected that somewhere perhaps on the bottom that I would be able to switch menus and even select which is primary and as well as other selections in how a specific menu is to be used.\nI found dragging to arrange the menu items as top or submenu were tricky. This can be improved. Starting to drag an item the item goes invisible and two icons show up during drag which I find confusing.\n22-I find it useful to be able to click either the pencil icon or directly into the canvas/document to edit a menu item. What I did find confusing was that when I selected to edit a page and it opened in the Site Editor I was not sure if I was editing the template or the page itself. It felt like somekind of hybrid not the page itself and not fully the site editor. As default view without clicking anything the sidebar has a Template tab with the default Template sidebar content. My conclusion from what I noticed opening an older page in the Navigation was that it by default opened the Page template. I know this aspect is being worked on here:\nSite Editor: Add ability to focus only on editing page content\nhttps://github.com/WordPress/gutenberg/pull/49980\n23-24\nWhen not saving inside the template unsaved changes are seen on the bottom of the left black sidebar.\n26\nI went and published the two pages I made. I notice these show up in the menu on the frontend.\nI still miss having a hint in the Navigation show which menu item is active. I also mentioned it in the #feature-website-navigation SlackSlack Slack is a Collaborative Group Chat Platform https://slack.com/. The WordPress community has its own Slack Channel at https://make.wordpress.org/chat/. channel. https://wordpress.slack.com/archives/C01KDAZJMQ9/p1682766864457519\nI do know there is an issue for it, but it has not yet been finished.\nI think that is it for this round of testing.\n\n\n\n\n\n\n\n\nPaal Joachim Romdahl\n\n8:53 am on April 30, 2023 \n\n\n\n\nI mentioned not being able to publish pages. The issue is here: https://github.com/WordPress/gutenberg/issues/49873\nRegarding other things around the Navigation blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience..\nClicking the + to add a menu item shows one drop down/modal.\nI see the Page Link, Custom Link, Spacer, Submenu, Social Icons and Site Logo.\nClicking an earlier link where I exited and where it says “Add link” in the menu. I see Recently updated (page) Below that is a Transform area listing Search, Social Icons, Site Logo and Page List.\nI find it confusing that the add a new menu item is different compared to Add a link option.\nI believe some rethinking is needed around adding a link to the Navigation block expanding on possibilities I can not place my finger on at the moment.\n\n\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \n\n\n\nPost navigation\n← Test Chat Summary: 11 April 2023 Table Leads Needed for WCEU 2023 Contributor Day →\n\n\n\n\n\n\n\nSearchTesting Plugins\n\nDesign Experiments\n\nGutenberg\n\nBeta Testing\n\nBeta Plugins\nEmail Updates\n\n\nSubscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSign me up!\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 36 other subscribers\t\t\t\t\n\nCategories\n\nCall for Testing\n\nCore E2E\n\nKibble\n\nMeetings\n\nNUX\n\nstatus\n\nSummary\n\nUsability Testing\n\nVisual Record\n\nWeek in Test\n\n\n\n\n\n\t\t\tTeam Pledges\n\t\t\n\n809 people have pledged time to contribute to Test Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2F2023%2F04%2F17%2Ffse-program-testing-call-21-front-page-fun%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/test/",
        "https://make.wordpress.org/test/handbook/triage/",
        "http://make.wordpress.org/test/handbook/",
        "https://make.wordpress.org/test/handbook/glossary/",
        "https://make.wordpress.org/test/handbook/full-site-editing-outreach-experiment/",
        "https://make.wordpress.org/test/tag/fse-testing-call/",
        "https://wordpress.slack.com/archives/C015GUFFC00",
        "https://wordpress.slack.com/messages/core-test/",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2Fwelcome%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/annezazu/",
        "https://make.wordpress.org/test/tag/fse-outreach-program/",
        "https://make.wordpress.org/test/tag/fse-testing-call/",
        "https://make.wordpress.org/core/2020/12/11/the-fse-outreach-program-is-officially-starting/",
        "https://make.wordpress.org/test/handbook/full-site-editing-outreach-experiment/faq-for-fse-outreach-experiment/",
        "https://wordpress.slack.com/archives/C015GUFFC00",
        "https://make.wordpress.org/chat/",
        "https://wordpress.org/gutenberg/",
        "https://make.wordpress.org/core/2023/03/14/fyi-navigation-section-of-new-site-editor-experienced-removed-for-6-2-rc-2/",
        "https://make.wordpress.org/core/2023/02/04/phase-2-finale/",
        "https://github.com/WordPress/gutenberg/pull/46248",
        "https://github.com/WordPress/gutenberg/pull/49018",
        "https://app.instawp.io/launch?t=fse-call-for-testing-21&d=v1",
        "https://drive.google.com/file/d/1G7M8X_UORA47PfZcNYVreF4MQi3Igf_B/view?usp=sharing",
        "https://profiles.wordpress.org/annezazu/",
        "https://wordpress.org/",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://wordpress.org/documentation/article/list-view/",
        "https://codex.wordpress.org/The_Loop",
        "https://cloudup.com/cYcO3hUTczr",
        "https://drive.google.com/file/d/18cOEkGdplett4d43PVhMhhp4Yq4R5k76/view?usp=sharing",
        "https://profiles.wordpress.org/nomadskateboarding/",
        "https://make.wordpress.org/test/tag/fse-outreach-program/",
        "https://make.wordpress.org/test/tag/fse-testing-call/",
        "https://make.wordpress.org/test/2023/04/17/fse-program-testing-call-21-front-page-fun/?share=twitter",
        "https://make.wordpress.org/test/2023/04/17/fse-program-testing-call-21-front-page-fun/?share=facebook",
        "https://make.wordpress.org/test/2023/04/17/fse-program-testing-call-21-front-page-fun/?share=linkedin",
        "https://make.wordpress.org/test/2023/04/17/fse-program-testing-call-21-front-page-fun/?share=pocket",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2F2023%2F04%2F17%2Ffse-program-testing-call-21-front-page-fun%2F%23respond&locale=en_US",
        "https://profiles.wordpress.org/valmedia2023/",
        "https://wordpress.org/gutenberg/",
        "https://profiles.wordpress.org/valmedia2023/",
        "https://profiles.wordpress.org/annezazu/",
        "https://profiles.wordpress.org/valmedia2023/",
        "https://profiles.wordpress.org/pagelab/",
        "https://dl.dropbox.com/s/5znuen3x25nhif1/dark-grey-sidebar.gif",
        "https://dl.dropboxusercontent.com/s/lb72bdx511qtcsg/dark-grey-sidebar-scroll.gif",
        "https://profiles.wordpress.org/robglidden/",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://codex.wordpress.org/The_Loop",
        "https://github.com/WordPress/gutenberg/pull/49980",
        "https://slack.com/",
        "https://make.wordpress.org/chat/",
        "https://wordpress.slack.com/archives/C01KDAZJMQ9/p1682766864457519",
        "https://profiles.wordpress.org/paaljoachim/",
        "https://github.com/WordPress/gutenberg/issues/49873",
        "/test/2023/04/17/fse-program-testing-call-21-front-page-fun/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Ftest%2F2023%2F04%2F17%2Ffse-program-testing-call-21-front-page-fun%2F&locale=en_US",
        "https://make.wordpress.org/test/2023/04/11/test-chat-summary-11-april-2023/",
        "https://make.wordpress.org/test/2023/04/24/table-leads-needed-for-wceu-2023-contributor-day/",
        "#",
        "https://github.com/WordPress/design-experiments/",
        "https://wordpress.org/plugins/gutenberg/",
        "https://wordpress.org/plugins/wordpress-beta-tester/",
        "https://wordpress.org/plugins/browse/beta/",
        "https://make.wordpress.org/test/category/call-for-testing/",
        "https://make.wordpress.org/test/category/core-e2e/",
        "https://make.wordpress.org/test/category/kibble/",
        "https://make.wordpress.org/test/category/meetings/",
        "https://make.wordpress.org/test/category/nux/",
        "https://make.wordpress.org/test/category/status/",
        "https://make.wordpress.org/test/category/summary/",
        "https://make.wordpress.org/test/category/usability-testing/",
        "https://make.wordpress.org/test/category/visual-record/",
        "https://make.wordpress.org/test/category/week-in-test/",
        "https://make.wordpress.org/test/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}