{
    "title": "Learning Communities | SDSU",
    "body": "\n\n\n\nSkip to content\n\n\n\n\nHousing and Residential Education\n\n\nopensearchsubmit\nMenu\n\n\n\nopenResources\nWhy Live On-Campus\nUniversity Residency Requirement\nImportant Dates\nHousing Over the Break\nVisits & Tours\nRates & Payments\nLicense Agreement\nPolicies & Procedures\nApply\nSummer Housing\nOff-Campus Housing\n\n\nopenCommunities\nExplore Communities\nLearning Communities\nSophomore QUEST\nSophomore Housing Lottery\n\n\nopenServices & Amenities\nExplore Services & Amenities\nMail & Packages\nService Requests\nRoom Switch Requests\nHealth & Safety Inspections\nSTAR Centers\nMeal Plans\n\n\nopenAbout\nOur Values\nDiversity, Equity & Inclusion \nConstruction, Renovation & Improvement Pojects\nCommunications\nSustainability\nConferences & Meetings\nREO Student Opportunities\nSupport Residential Students\nContact\n\n\nMove-out Spring 2023\nEarly Move-out\nCOVID-19\n\n\n\n\nopenQuick Links\n\nHousing Portal\nImportant Dates\nVisits & Tours\nRates & Payments\nLearning Communities\nSophomore Housing Lottery\nService Requests\nSDSU Dining\nApply\nContact\n\n\n\n\n\nopenColleges\n\nArts and Letters\nFowler College of Business\nEducation\nEngineering\nGraduate Studies\nHealth and Human Services\nSDSU Library\nProfessional Studies and Fine Arts\nSciences\nWeber Honors College\n\n\n\nopenOther Locations\n\nSDSU Georgia\nSDSU Global Campus\nSDSU Imperial Valley\nSDSU Mission Valley\n\n\n\n\n\nHousing and Residential Education\n\n\n\nyoutube\ntwitter\nfacebook\ninstagram\n\n\n\n\n\n\n\nIn this SectionHousing and Residential EducationCommunitiesCommunitiesExplore CommunitiesLearning CommunitiesSophomore QUESTSophomore Housing LotteryLearning Communities\n\n\nClick on the image above to download the Residential Learning Communities brochure.\n\nResidential Learning Communities (RLC)Residential Learning Communities (RLC) at San Diego State University provide first-year students with a unique opportunity to connect and learn, both inside and outside the classroom. In an RLC, students live alongside peers with shared academic or co-curricular interests and are enrolled in a connected set of academic courses to help produce smaller, more intentional communities that promote student success. Their education is supported by Residential Education staff through related social activities and one-on-one mentorship.Expand AllCollapse AllAdventures in Surfing and Sustainability\n\n\n\n\n\nAdventures in Surfing and Sustainability\n\n\n\n\nSan Diego is a Southern Californian surfing mecca. The Adventures in Surfing and Sustainability community is for any level of surfer and will get members stoked on surfing, its history and its transition to sustainability. Through hands-on experiences and lectures, students will learn about the threats to surfing culture and environments, San Diego's surf-driven culture of sustainability and how to be a part of the solution to global challenges. Students in this community are typically enrolled in PSFA 100 and University Seminar.\nBack to TopAPIDA Leadership, Identity, Scholarship and Togetherness (A-LIST) House\n\n\n\n\n\nAPIDA Leadership, Identity, Scholarship and Togetherness (A-LIST) House\n\n\n\n\nThe A-LIST House learning community is for students who have an interest in APIDA (Asian Pacific Islander Desi American) culture, history and activism. In order to dismantle the Model Minority Myth and reclaim what it means to achieve, this learning community will focus on APIDA Leadership, Identity, Scholarship and Togetherness (A-LIST). This is a safe space to pursue active development and engagement as an APIDA community. A-LIST members will gain the skills and knowledge necessary to successfully transition into college while celebrating and exploring APIDA heritages. Students in this community are typically enrolled in University Seminar. \nBack to TopBlack Excellence*\n\n\n\n\nBlack Excellence\n\n\n\nThe Black Excellence learning community provides a safe and affirming environment for African-American, African and/or Black freshman students. Members will have an opportunity to develop lifelong friendships, engage in educational and social programming that affirm and celebrate Afrikan culture and learn about campus resources and organizations. Students in this community are typically enrolled in AFRAS 170A and University Seminar.\n*Priority for this residential community will be given to students who have applied for programs or are involved in programs sponsored by the associated campus resource center. \nBack to TopBusiness\n\n\n\n\nBusiness \n\n\n\nThe Business learning community provides opportunities for students to explore innovation, creativity and character development in the business field with an emphasis on the development of business ethics and personal values. Students in this community are typically enrolled in Business Administration 100B and Economics 101.\nBack to TopDiscover San Diego State\n\n\n\n\nDiscover San Diego State \n\n\n\nThe Discover San Diego State community is designed to introduce students to the university and the San Diego area. Members have the opportunity to get tips on how to transition to a college and a new city. Students in this community are typically enrolled in University Seminar.\nBack to TopEmerging Leaders Program\n\n\n\n\nEmerging Leaders Program \n\n\n\nThe Emerging Leaders Program is an exciting and interactive learning experience that will introduce students to leadership development and the SDSU Leadership Minor. Students in this community are typically enrolled in the first course of the Leadership Minor, ARP 205 (Exploring Leadership) and ARP 296 (Introduction to Leadership). \nBack to TopFuture Education Professionals\n\n\n\n\nFuture Education Professionals \n\n\n\nIn the Future Education Professionals community, students will explore the fulfillment and opportunities available in educational careers. All majors are welcome. Students in this community are typically enrolled in University Seminar.\nBack to TopHealth & Healing Professions\n\n\n\n\nHealth & Healing Professions \n\n\n\nIn the Health & Healing Professions community, students interested in health or allied health professions will examine the role of healing, nutrition and wellness. Students will have networking opportunities in the fast-growing fields of health and healing. Students in this community are typically enrolled in Sociology 101 and University Seminar.\nBack to TopJournalism & Media Studies\n\n\n\n\nJournalism & Media Studies \n\n\n\nIn the Journalism & Media Studies community, students will learn about advertising, journalism, public relations and other professional media fields. Participants undertake activities and seminars focused on the media industry and get a broad look at the opportunities in these professional communication fields. Students in this community are typically enrolled in Journalism and Media Studies 200 and University Seminar.\nBack to TopJourney to Entrepreneurship\n\n\n\n\nJourney to Entrepreneurship \n\n\n\nThis interactive learning experience will provide insight into the world of entrepreneurship. Students will explore and learn key elements of starting a company and hear stories from entrepreneurship alumni. Students from all majors are welcome. Students in this community are typically enrolled in Business Administration 100B.\nBack to TopMen Engaging in Science & Technology (METS)\n\n\n\n\nMen Engaging in Science & Technology (METS) \n\n\n\nThe Men Engaging in Science & Technology (METS) community provides services and activities to help support men pursuing their studies in the sciences, technology, engineering and mathematics. Students in this community are typically enrolled in Political Science 102 and University Seminar.\nBack to TopMulticultural Learning Community (MLC)\n\n\n\n\nMulticultural Learning Community (MLC)  \n\n\n\nThe Multicultural Learning Community (MLC) is a diverse community of students from various backgrounds and identities. As members of the MLC, students will live in a welcoming, inclusive community committed to advancing justice, equity, diversity and inclusion. Through workshops and group discussions, students will explore their own identity in a safe and supportive learning environment. Students will also explore topics related to diversity such as race, ethnicity, gender, sexual orientation, ability and religion. The MLC will cultivate diverse student leaders who understand, respect and value differences between themselves and others. Students in the MLC will gain an expanded worldview that will advance their success at SDSU and beyond. Students in this community are typically enrolled in American Indian Studies 140 and University Seminar.\nBack to TopNuestra Casa*\n\n\n\n\nNuestra Casa\n\n\n\nThe Nuestra Casa learning community provides an exciting opportunity for Latinx students to explore and learn about identity, culture and racial justice issues. Through on-campus programming and off-campus activities, members will have the opportunity to develop lifelong friendships, while building a culturally-sustaining network of support and enrichment on campus and deep connections to San Diego’s historic Chicanx/Latinx community. Students will have access to a peer mentor support team and are typically enrolled in University Seminar and CCS 200 (equivalent to RWS 200) that center the cultural, social and academic needs of Latinx students.\n*Priority for this residential community will be given to students who have applied for programs or are involved in programs sponsored by the associated campus resource center.\nBack to TopNursing\n\n\n\n\nNursing\n\n\n\nThe Nursing community provides students with the opportunity to develop lifelong friendships and a strong social support system with classmates during their journey through the rigorous Nursing program. Students in this community will form study groups, attend workshops and network with upper-division Nursing students. Students in this community are enrolled in several science-intensive courses such as Microbiology, General Organic and Biological Chemistry and Human Anatomy.\nBack to TopPhysical Fitness (P-Fit)\n\n\n\n\nPhysical Fitness (P-Fit)\n\n\n\nThe Physical Fitness (P-Fit) community fosters wellness and healthy lifestyle choices for students interested in the fields of exercise, nutrition and physical activity. Students in this community are typically enrolled in University Seminar.\nBack to TopPre-Law Community\n\n\n\n\nPre-Law Community \n\n\n\nThe Pre-Law community provides services and activities to help support student success in pursuing a law career. Students will learn about university success and career options through guest speakers, on-campus visits and involvement with other students, faculty and staff. Students in this community are typically enrolled in Philosophy 102 and University Seminar.\nBack to TopPride House (LGBTQIA+)\n\n\n\n\n\nPride House (LGBTQIA+)\n\n\n\n\nThe Pride House community creates a safe and affirming environment for those within the LGBTQIA+ (lesbian, gay, bisexual, transgender, queer or questioning, intersex, asexual or ally) community. All sexual orientations and gender identities are welcome in this community. Students will participate in educational programming and leadership development activities that will enhance their understanding of how to impact positive change in the world. Students in this community are typically enrolled in University Seminar.\nBack to TopToltec House for Undeclared Majors\n\n\n\n\n\nToltec House for Undeclared Majors\n \n\n\n\nStudents in the Toltec House community will explore major and career options. Members develop a strong sense of identity and influence through academic and social programming. Students in this community are typically enrolled in ARP 205 (Exploring Leadership) and ARP 296 (Introduction to Leadership).  \nBack to TopVisual & Performing Arts\n\n\n\n\n\nVisual & Performing Arts\n\n\n\n\nStudents can express themselves creatively through music, dance, film making and many other art forms. This community will examine the distinctions amongst various modes of creative expression. Film screenings, guest artists and workshops will be offered. Students in this community are typically enrolled in Theatre 100 and University Seminar. \nBack to TopWeber Honors College\n\n\n\n\n\nWeber Honors College\n\n\n\n\nStudents interested in living in this community must first apply and be accepted to the Weber Honors College. Honors students living in this community share a commitment to achievement and enjoy an array of academic, co-curricular and experiential activities focused on deep engagement. All students in this community are required to enroll in HONOR 100 (Honor Seminar) in the fall semester.\nBack to TopWomen's & Gender Equity House (WAGE)\n\n\n\n\n\nWomen's & Gender Equity House (WAGE)\n\n\n\n\nThe Women's & Gender Equity (WAGE) House connects students who are interested in feminism, gender equity and social change. WAGE residents will explore contemporary women's issues through learning excursions, speakers and local advocacy efforts. Students of all gender identities are welcome in the WAGE House. Residents in this community are typically enrolled in Women's Studies and University Seminar. \nBack to TopWomen in Science and Engineering (WISE)\n\n\n\n\n\nWomen in Science and Engineering (WISE)\n\n\n\n\nWISE is a supportive community for women interested in careers in the sciences, technology, math and engineering. Students in this community are typically enrolled in Political Science 102 and University Seminar.\nBack to Top\nThematic Living Communities (TLC)Thematic Living Communities provide students with the opportunity to live with peers with common interests without paired academic courses. In a Thematic Living Community, students are likely to find a cohesive group of friends with whom they can participate in academic and social programs focused around their community theme.Expand AllCollapse AllAztec Engineering\n\n\n\n\nAztec Engineering\n\n\n\nThe Aztec Engineering program supports engineering students by housing them together for support and study group development.\nBack to TopExtended Quiet Study\n\n\n\n\nExtended Quiet Hours \n\n\n\nAvailable in various halls, these areas feature extended quiet study hours as determined by the residents. All residents and their guests are required to adhere to these policies.\nBack to TopReserve Officers' Training Corps (ROTC)\n\n\n\n\nReserve Officers' Training Corps (ROTC) \n\n\n\nThe Reserve Officers' Training Corps (ROTC) community supports students enrolled in SDSU's ROTC program. \nBack to TopSubstance Free*\n\n\n\n\nSubstance Free\n\n\n\nSubstance Free community members desire to live a well-balanced and fun way of life and are looking to share these values with other like-minded individuals. Students in this community pledge to live their lives free of alcohol, tobacco and other mind-altering substances both on and off-campus. All residents and their guests are required to adhere to these policies.\n*All SDSU residence halls comply with all state and federal regulations relating to the use of alcohol and other drugs.\nBack to Top\nLearning Community EnrollmentFirst-year students may apply for a learning community during Stage II of the license agreement process on the Housing Portal. Placement in a learning community is based on availability, and for that reason can not be guaranteed. By selecting one or multiple learning community interests, you are agreeing to be placed in that community and the classes associated with it (if applicable). Students will be notified of learning community placement, if any, in their July housing assignment email. \n\n\nGet in Touch\nContactTourApply\n\n\n\n\n\n\nyoutube\ntwitter\nfacebook\ninstagram\n\n\n\n\n619-594-5200\n               \t\t\t\t\t\t\t5500 Campanile Drive\n               \t\t\t\t\t\t\tSan Diego, CA 92182\n\nMaps\nParking\n\n\n\n\nCampus Directory\nEmployment\nMedia Relations\nCanvas\n\n\n\n\nGeneral Contact\nNetwork Status\nStrategic Plan\nNewsletter\n\n\n\n\n\n\nAccessibility\nDocument Readers\nDigital Privacy Statement\nCampus Safety Reports\nFeedback\n\n© 2023 San Diego State UniversityAll Rights ReservedLast Updated\nback to top\n\n\n\n\n\n\n\n\n\n\n\n\n\nLast Updated 7/1/22",
    "links": [
        "#main",
        "https://www.sdsu.edu/",
        "/",
        "/resources",
        "/resources/why",
        "/resources/requirement",
        "/resources/dates",
        "/resources/hob",
        "/resources/tours",
        "/resources/rates",
        "/resources/license-agreement",
        "/resources/policies",
        "/resources/apply",
        "/resources/summer",
        "/resources/off-campus",
        "/communities",
        "/communities",
        "/communities/learning-communities",
        "/communities/quest",
        "/communities/shl",
        "/services-amenities",
        "/services-amenities",
        "/services-amenities/mail",
        "/services-amenities/service",
        "/services-amenities/room-switch",
        "/services-amenities/health",
        "/services-amenities/star-center",
        "https://www.eatatsdsu.com/Meal-Plans",
        "/about",
        "/about/values",
        "/about/diversity",
        "/about/construction",
        "/about/communications",
        "/about/sustainability",
        "/about/conferences",
        "/about/reo-student-opportunities",
        "/about/support",
        "/about/contact",
        "/move-out",
        "/move-out/early-move-out",
        "/covid",
        "https://oncampusliving.sdsu.edu/StarRezPortalX/D63C6131/1/1/Home-Home",
        "/resources/dates",
        "/resources/tours",
        "/resources/rates",
        "/communities/learning-communities",
        "/communities/shl",
        "/services-amenities/service",
        "https://www.eatatsdsu.com/",
        "/resources/apply",
        "/about/contact",
        "https://cal.sdsu.edu/",
        "https://business.sdsu.edu/",
        "https://education.sdsu.edu/",
        "https://www.engineering.sdsu.edu/",
        "https://grad.sdsu.edu/",
        "https://chhs.sdsu.edu/",
        "https://library.sdsu.edu/",
        "https://psfa.sdsu.edu/",
        "https://sciences.sdsu.edu/",
        "https://honors.sdsu.edu/",
        "https://georgia.sdsu.edu/en",
        "https://ces.sdsu.edu/",
        "https://imperialvalley.sdsu.edu/",
        "https://missionvalley.sdsu.edu/",
        "/",
        "https://www.youtube.com/user/SDSUVideo",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "https://instagram.com/sandiegostateuniversity",
        "/",
        "https://housing.sdsu.edu/communities/",
        "/communities",
        "/communities/learning-communities",
        "/communities/quest",
        "/communities/shl",
        "/_resources/documents/residential_learning_community_brochure.pdf",
        "/about/contact.aspx",
        "/resources/tours.aspx",
        "/resources/apply.aspx",
        "https://www.sdsu.edu/",
        "https://www.youtube.com/user/SDSUVideo",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "https://instagram.com/sandiegostateuniversity",
        "tel:6195945200",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/campus/parkingtrans/permits",
        "https://directory.sdsu.edu/",
        "https://bfa.sdsu.edu/hr/jobs",
        "https://brand.sdsu.edu/stratcomm/media-relations",
        "https://canvas.sdsu.edu/",
        "https://www.sdsu.edu/contact/",
        "https://status.sdsu.edu/",
        "https://www.sdsu.edu/strategic-plan/",
        "https://www.sdsu.edu/newscenter-newsletter-signup.aspx",
        "https://accessibility.sdsu.edu/",
        "https://www.sdsu.edu/document-readers",
        "https://www.sdsu.edu/digital-privacy",
        "https://police.sdsu.edu/public-information/clery-act-compliance/annual-reports",
        "https://www.sdsu.edu/feedback",
        "https://a.cms.omniupdate.com/11/?skin=sdsu&account=prod&site=housing&action=de&path=/communities/learning-communities.pcf"
    ]
}