{
    "title": "Student Lands Athletic Training Internship With Arizona Diamondbacks | CSUF News",
    "body": "\n\n\nSkip to Content (Press Enter)\n\n\n\n\n\n\nCSUF News\n\n\n\nlock Portal Login\nGive\nSearch search\n\n\n\n\n\n\n\n\nMenu\n\n\nTopics\n\nCampus and Community\nArts\nBusiness and Economics\nCommunications\nEducation\nEngineering and Computer Science\nHealth and Human Development\nHumanities and Social Sciences\nNatural Sciences and Mathematics\nAthletics\nTopics A-Z\n\n\nCSUF In the News\nTitan Spotlight\nPeople & Voices\n\nFaculty and Staff\nStudents\nAlumni\nTitans of Academia\nTitans of Promise\nTitan Voices\nTitans of Tassel\n\n\nEvents\nResources\n\nE-Newsletter Subscription\nRSS Feeds\nPhotos\n\n\nFor Journalists\nPublications\n\n\n \n\n\n\n\nStudent Lands Athletic Training Internship With Arizona Diamondbacks\n April 17, 2023\n\nShare This:\n \n\n\n\n\n\n\nClass of 2023 graduate Sienna Baldwin will complete her master's degree in athletic training before joining the Arizona Diamondbacks as an athletic training intern this season.  \nSienna Baldwin’s fondest memories of baseball always go back to Dodger Stadium. She remembers growing up with the chorus of the home crowd, the glow of the lights against the city skyline and looking over to find her dad with the biggest smile on his face as the players took the field. \nWith a “family tradition” rooted in baseball, Baldwin’s passion for sports and physical activity led her to Cal State Fullerton where she will complete her master’s degree in athletic training this spring. \nThe Class of 2023 graduate will join the Arizona Diamondbacks in May as an athletic training intern — the first step toward her dream of becoming a certified MLB athletic trainer. \nChasing Dreams at Chase Field\nSienna Baldwin will start her athletic training internship with the Arizona Diamondbacks after graduation. \nFrom the graduation stage, Baldwin will pack up and move to Scottsdale, Arizona, where she will be working at the Diamondbacks’ rehabilitation center and learning from their professional athletic training staff.\nWorking one-on-one with major league ball players, Baldwin said she’ll be focused on injury prevention, rehabilitation and clinical evaluations. \nDuring home games, she’ll join the team at Chase Stadium to assist the staff with treatments and ensure that the players feel their best when they take the field. \n“The structure of the program ensures that I’ll be learning techniques and skills that are specific to baseball. They prepare interns for jobs in professional baseball, which is perfect for what I want to do,” said Baldwin. \nTitan Takes the Big Leagues\nWhen Baldwin began exploring graduate programs that would open big league doors, one name always came up – Jason Bennett, associate professor of kinesiology and director of CSUF’s athletic training program. \n“Everyone had good things to say about his work at CSUF,” she said. “When I interviewed for the program, it only took five minutes to realize I was in the right place.”\nThroughout her graduate education, Baldwin gained hands-on athletic training experience, working closely with the men’s basketball team last season and learning how to apply her skills in a competitive game setting.\n“It was the first time I experienced what it was like to work in an athletic training room with a Division 1 team,” said Baldwin. “The connections I’ve made and skills I’ve developed at CSUF are going to last me a lifetime.” \nClass of 2023 graduate Sienna Baldwin (left) worked with Kyle Burnett to assist the men’s basketball team. \n“During her immersive rotation with men’s basketball, she worked hard and gained the trust of the coaching staff and players. She was an integral part of the team’s success this season,” said Kyle Burnett, assistant athletics director of sports medicine. “She never wavered from the challenge and jumped on every opportunity to grow as a clinician.”\nWith professional athletic training experience in minor league baseball himself, Bennett added that he’s confident in Baldwin’s abilities and has no doubt that she will succeed in her role with the Arizona Diamondbacks.\n“Sienna has been a fantastic student in our program. She not only worked extremely hard in the classroom and in her clinical experiences, but she also was involved as a leader within our professional association,” said Bennett. “I’m sure her tenacity and leadership will be an extremely valuable asset in providing quality patient care.”\nMajor Plans to Work in Major League Baseball\nAt 4 years old, Baldwin already had a glove in her hand. Playing softball in the backyard with her mom, dad and older sister, sports have always been a huge part of her life. When asked why she chose baseball, she said it all goes back to Dodger Stadium. \n“Going to baseball games with my family over the years made me fall in love with the sport,” said Baldwin. “This career is a way for me to combine my passion for athletic training with my love for the game.” \nHer internship with the Diamondbacks will be the first step toward achieving her career goal of becoming a full-time athletic trainer for a MLB organization. Although she’s happy to work for any one of MLB’s 30 clubs, her dream is to return to Los Angeles to take the field with the team that reminds her of home. \n“Baseball isn’t just fun for me to watch anymore,” said Baldwin. “It’s fun for me to work with because I like the challenge of looking at different players’ physical routines and finding ways to help them get better.”\n\n\n\n\nRelated Stories\n\nFuture Athletic Trainer Takes the Field With Los Angeles RamsOne Pitch at a TimeTitan Athletic Trainers Join Olympians in Tokyo2016 Olympics: CSUF Alumna Makes Waves as Athletic Trainer \n\n\n\nTags\nEmpowermentHealth and Human DevelopmentOpportunityStudentsCareer ReadyCommencementKinesiology \n\n\n\n\n\n\n\nContact:\n\t\t\t\t\t\t\tTaylor Arrey\n\t\t\t\t\t\t\ttarrey@fullerton.edu\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nBrowse\n\nAll News\nTopics A-Z\nAthletics\n\n\n\nFollow Us\n\nFacebook\n\n\nTwitter\n\n\nLinkedIn\n\n\nInstagram\n\n\nYouTube\n\n\n\nAbout\n\nCSUF Facts\nContact Media Relations\nFind an Expert\nPrivacy Policy\n\n\n\nSubscribe / Download\n\nSubscribe to our eNewsletters\n\nSubmit a Story\nDo you have news you’d like to share with the campus?\nSubmit Your Story\n\n\n\n\n\n\n\n\n\n\nThis site is maintained by Strategic Communications.\n\t\t\t\t\t\t\tTo report problems or comments, please contact strategiccomm@fullerton.edu.\n\t\t\t\t\t\t\t© California State University, Fullerton. All Rights Reserved. \n\n\n\nWeb Accessibility\nLearn about web accessibility\nReport a web accessbility problem\nDownload Adobe Acrobat Reader\nMicrosoft Viewers\n\n\n\n\n\n\n\n\n\nSome page features may require javascript to run.\n\n",
    "links": [
        "#main-content",
        "http://fullerton.edu/",
        "https://news.fullerton.edu",
        "https://my.fullerton.edu/",
        "https://giving.fullerton.edu/",
        "javascript:void(0);",
        "https://news.fullerton.edu/campus-and-community/",
        "https://news.fullerton.edu/arts/",
        "https://news.fullerton.edu/business-and-economics/",
        "https://news.fullerton.edu/communications/",
        "https://news.fullerton.edu/education/",
        "https://news.fullerton.edu/engineering-and-computer-science/",
        "https://news.fullerton.edu/health-and-human-development/",
        "https://news.fullerton.edu/humanities-and-social-sciences/",
        "https://news.fullerton.edu/natural-sciences-and-mathematics/",
        "https://news.fullerton.edu/athletics/",
        "https://news.fullerton.edu/topics/",
        "http://news.fullerton.edu/csuf-in-the-news/",
        "https://news.fullerton.edu/spotlight",
        "javascript:void(0);",
        "https://news.fullerton.edu/faculty-and-staff/",
        "https://news.fullerton.edu/students/",
        "https://news.fullerton.edu/alumni/",
        "https://news.fullerton.edu/titans-of-academia/",
        "https://news.fullerton.edu/titans-of-promise/",
        "http://blog.fullerton.edu/",
        "https://news.fullerton.edu/titans-of-tassel/",
        "http://calendar.fullerton.edu/",
        "javascript:void(0);",
        "https://news.fullerton.edu/e-newsletter-subscription/",
        "https://news.fullerton.edu/rss-feeds/",
        "https://www.flickr.com/photos/csufnewsphotos",
        "https://news.fullerton.edu/press/",
        "https://news.fullerton.edu/publications/",
        "https://news.fullerton.edu/2023/01/future-athletic-trainer-takes-the-field-with-los-angeles-rams/",
        "https://titanmag.fullerton.edu/spring-2020/one-pitch-at-a-time/",
        "https://news.fullerton.edu/2023/01/future-athletic-trainer-takes-the-field-with-los-angeles-rams/",
        "https://titanmag.fullerton.edu/spring-2020/one-pitch-at-a-time/",
        "https://news.fullerton.edu/2021/07/titan-athletic-trainers-join-olympians-in-tokyo/",
        "https://news.fullerton.edu/2016/07/olympics-alumna-athletic-trainer/",
        "https://news.fullerton.edu/empowerment/",
        "https://news.fullerton.edu/health-and-human-development/",
        "https://news.fullerton.edu/opportunity/",
        "https://news.fullerton.edu/students/",
        "https://news.fullerton.edu/tag/career-ready/",
        "https://news.fullerton.edu/tag/commencement/",
        "https://news.fullerton.edu/tag/kinesiology/",
        "https://news.fullerton.edu/all-news/",
        "https://news.fullerton.edu/topics/",
        "https://news.fullerton.edu/athletics/",
        "http://www.facebook.com/csufofficial",
        "http://twitter.com/csuf",
        "http://www.linkedin.com/edu/california-state-university-fullerton-17827",
        "http://instagram.com/csufofficial",
        "http://www.youtube.com/user/CSUFullerton",
        "http://www.fullerton.edu/about/default.aspx#facts",
        "https://news.fullerton.edu/press/",
        "http://experts.fullerton.edu/",
        "http://www.fullerton.edu/it/iso/policy/OnlinePrivacy.php",
        "https://news.fullerton.edu/e-newsletter-subscription/",
        "https://ua.fullerton.edu/titans-spotlight/",
        "http://fullerton.edu",
        "mailto:strategiccomm@fullerton.edu",
        "http://fullerton.edu/ati",
        "http://www.fullerton.edu/reportati/",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/office.aspx"
    ]
}