{
    "title": "Student Health Center | CSUSB",
    "body": "\n\n\n\n\nSkip banner navigation\nSkip to main content\n\n\n\nClose Navigation Screen\n\n\n\n\n\n\n\n\n\nLogin to  myCoyote \n\n\n\nView the Campus  Directory \n\n\n\nCSUSB  Library \n\n\n\nCSUSB  Maps and Directions \n\n\n\nCSUSB  Palm Desert Campus \n\n\n\n Make a Gift to CSUSB \n\n\n\n\n\n\n\n\n\n\n\nCSUSB Admissions - Global Site Navigation \n\n\n                        \n             Admissions Overview - Global Site Navigation \n\n\n                        \n             Apply to CSUSB - Global Site Navigation \n\n\n                        \n             After I'm Admitted - Global Site Navigation \n\n\n                        \n             First-year Students - Global Site Navigation \n\n\n                        \n             Transfer - Global Site Navigation \n\n\n                        \n             International Students - Global Site Navigation \n\n\n                        \n             English Language Program - Global Site Navigation \n\n\n                        \n             Undocumented Student Center - Global Site Navigation \n\n\n                        \n             Osher Lifelong Learners - Global Site Navigation \n\n\n                        \n             Military Veterans/Dependents - Global Site Navigation \n\n\n                        \n             Financial Aid & Scholarships - Global Site Navigation \n\n\n                        \n             Student Financial Services - Global Site Navigation \n\n\n                        \n             Summer Session - Global Site Navigation \n\n\n\n\n                                \n                 Academics - Global Site Navigation \n\n\n                        \n             Academic Calendar - Global Site Navigation \n\n\n                        \n             Academic Advising  - Global Site Navigation \n\n\n                        \n             Degrees & Programs - Global Site Navigation \n\n\n                        \n             Colleges & Departments - Global Site Navigation \n\n\n                        \n             Course Catalog / Bulletin - Global Site Navigation \n\n\n                        \n             Class Schedule - Global Site Navigation \n\n\n                        \n             Online Programs - Global Site Navigation \n\n\n                        \n             Academic Success and Undergraduate Advising - Global Site Navigation \n\n\n                        \n             Graduate Studies - Global Site Navigation \n\n\n                        \n             Office of the Registrar - Global Site Navigation \n\n\n                        \n             Academic & Support Resources - Global Site Navigation \n\n\n                        \n             Academic Research - Global Site Navigation \n\n\n                        \n             Graduation Initiative 2025 - Global Site Navigation \n\n\n\n\n\nCSUSB Athletics               \n\n\n                            \n               Men's Sports             \n\n\n\nMen's Sports Baseball           \n\n\n\nMen's Sports Basketball           \n\n\n\nMen's Sports Golf           \n\n\n\nMen's Sports Soccer           \n\n\n\n\n                            \n               Women's Sports             \n\n\n\nWomen's Sports Softball           \n\n\n\nWomen's Sports Cheer & Dance           \n\n\n\nWomen's Sports Track & Field           \n\n\n\nWomen's Sports Cross Country           \n\n\n\nWomen's Sports Volleyball           \n\n\n\nWomen's Sports Soccer           \n\n\n\nWomen's Sports Basketball           \n\n\n\n\n\n\n                                \n                 Campus Life - Global Site Navigation \n\n\n                        \n             Events Calendar - Global Site Navigation \n\n\n                        \n             Get Involved - Global Site Navigation \n\n\n                        \n             Student Services - Global Site Navigation \n\n\n                        \n             Recreation & Wellness - Global Site Navigation \n\n\n                        \n             Student Health & Safety - Global Site Navigation \n\n\n                        \n             Housing & Dining - Global Site Navigation \n\n\n                        \n             Music & Arts - Global Site Navigation \n\n\n                        \n             Student Employment - Global Site Navigation \n\n\n                        \n             Campus Safety & Emergency Info - Global Site Navigation \n\n\n                        \n             Palm Desert Campus Life - Global Site Navigation \n\n\n\n\n                                \n                 About CSUSB - Global Site Navigation \n\n\n                        \n             Inside CSUSB - Global Site Navigation \n\n\n                        \n             COVID-19           \n\n\n                        \n             Campus Map - Global Site Navigation \n\n\n                        \n             President's Office - Global Site Navigation \n\n\n                        \n             Shared Governance - Global Site Navigation \n\n\n                        \n             Strategic Plan 2023-2028 - Global Site Navigation \n\n\n                        \n             Administrative Divisions - Global Site Navigation \n\n\n                        \n             Organizational Chart - Global Site Navigation \n\n\n                        \n             Strategic Communication - Global Site Navigation \n\n\n                        \n             Mission, Vision & Core Values - Global Site Navigation \n\n\n                        \n             Accreditation           \n\n\n                        \n             Assessment           \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSite Header Region\n\n\n\n\n\n\nCSUSB Home\n\n \n\n\n\nWe Define the Future\n\n \n\n\n\n\n\n\n\n\nLogin to  myCoyote \n\n\n\nView the Campus  Directory \n\n\n\nCSUSB  Library \n\n\n\nCSUSB  Maps and Directions \n\n\n\nCSUSB  Palm Desert Campus \n\n\n\n Make a Gift to CSUSB \n\n\n\n\n\n\n\n\nSearch CSUSB\n\n\nSearch CSUSB \n\n\n\n\n\n\n\nCSUSB Main Menu\n\n\n\n\n\n\nPage Header\n\n\n\n\n\n\n\n\nStudent Health Center\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      Page Menu\n      \n\n\n\n\n\n\n                                            \n                       Home                     \n\nExpand Menu Item                                             \n                       Home                     \n\n\n\n\n\n\n\n\n                                        \n                     Patient Portal                   \n\n\n                                        \n                     Appointments                   \n\n\n\n\n\n\n                                        \n                     Insurance / Eligibility                   \n\n\n\n\n\n\n                                        \n                     Meet Our Team                   \n\n\n\n\n\n\n\n\n                                        \n                     Immunizations                   \n\n\n                                        \n                     Emergencies & After Hours                   \n\n\n                                            \n                       Health Promotion                     \n\nExpand Menu Item                                             \n                       Health Promotion                     \n\n\n\n\n\n\n\n\n                                        \n                     Health  Promotion Appointments                   \n\n\n                                        \n                     Health Education Workshops                   \n\n\n                                        \n                     Health Education Videos and Resources                   \n\n\n                                        \n                     Meet the Staff                   \n\n\n\n\n\n\n                                        \n                     Peer Health Educators                   \n\n\n                                        \n                     Student Health Advisory Committee                   \n\n\n                                        \n                     CalFresh Program                   \n\n\n                                        \n                     Basic Needs                   \n\n\n\n\n\n\n\n\n                                        \n                     Health Services                   \n\n\n                                        \n                     Forms & Documents                   \n\n\n                                        \n                     Resources                   \n\n\n\n\n\n\n\n\n\nMain Content Region\n\n\n\nStudent Health Center\n\n\nLeft Content\n\n\nUpcoming Events\n\n\n\n\n\n\n\n May 2\n\n\nWounds de La Familia: Understanding and Healing From Intergenerational Trauma \n\n 12:00pm - 1:00pm\n In-Person: Room SB-306 (Social and Behavioral Sciences Building) live broadcast via Zoom\n\n\n\n\n\n\n\n\n\n\n May 3\n\n\nNarcan 101\n\n 11:00am - 12:00pm\n Zoom\n\n\n\n\n\n\n\n\n\n\n May 10\n\n\nMental Health Awareness Panel \n\n 12:00pm - 1:30pm\n Zoom\n\n\n\n\n\n\n\n\n\n\n\n\nBecause Coyotes Care\nWe're Tobacco Free @ CSUSB\nInterested in quitting? Call California Smoker's Helpline:\n1-800-No-Butts\nSmoke Free CSUSB\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudents who feel they are having a medical emergency should immediately call 911.\nIf you have an urgent health or psychiatric need, please go to urgent care or your nearest hospital emergency room. For locations, see the Emergencies and After-Hours information on this website.\nMedical Services\nThe Student Health Center is open and providing in-person and phone/virtual \"telehealth\" appointments. \nCall first to schedule an appointment at (909) 537-5241.\n\nFor the safety of all our visitors and our staff, if you are experiencing any of the following symptoms:\n\ncough/cold, sore throat, fever or a rash,\nor been in close contact with someone with a positive COVID test,\nor have tested positive within the last 5 days,\nor waiting for COVID test results;\n\nplease ask to speak to our medical staff at (909) 537-5241 before coming into the Student Health Center.\n \nImportant Notice:\nIf you are experiencing any respiratory illness symptoms, face coverings are required and should be worn while inside the Student Health Center.\n\nWhat to Expect When You Arrive\n\nBring your student ID and face covering to your appointment. Face coverings are required while inside the Student Health Center. If you do not have one, you will be provided with a face covering.\nYour appointment time is your check-in time; please plan to check in no later than your scheduled appointment time and, if possible, please check in online and complete any online forms before entering the building.\nThe Student Health Center is currently using two entrances for in-person appointments. \nA staff member will meet you at your appointment time at the main entrance. If you arrive and a staff member is not present, please call 909-537-5241 for notification of arrival.\nYou will be screened for your current temperature and other COVID-19 symptoms before entering. You will be asked to show your student ID and wear your face covering.\nWhen you enter the building, you will be directed to sanitize your hands and will be escorted to your exam room to wait for your nurse or provider.\nAt this time, the Student Health Center is limiting visitors to patients with an appointment only. Anyone who arrives with you for your appointment will be asked to wait outside the building until your appointment has been completed.\n\nThe Student Health Center staff is committed to serving our students and we welcome your calls at (909) 537-5241. Our hours of operation are  Monday - Wednesday from 8:00 a.m. - 5:00 p.m., and Thursday & Friday from 9:00 a.m. to 5:00 p.m..  We are closed Saturday, Sunday and all campus holidays.  You may also call (855) 262-5562 after-hours for our non-emergency nurse advice line.\nAccessing Pharmacy Services\nThe Student Health Center Pharmacy is open for prescription and over-the-counter medication pick up:\nMonday, Tuesday, and Wednesday 8:00 a.m. - 4:30 p.m., and Thursday & Friday 9:00 a.m. to 4:30 p.m.. \nIf you need a refill of an existing prescription, please request a prescription refill from the Pharmacy through Secure Message through the Patient Portal. If you are no longer in the area, your prescription can be transferred to an outside pharmacy.\nSome pharmacy services are available remotely by request:\n\nPrescription Consultation\nTransfer of Prescriptions\nRefill to Outside Pharmacy\n\t \n\nCOVID-19 Vaccination Requirement\nFor information regarding COVID-19, you are encouraged to visit the Centers for Disease Control and Prevention website and your County’s Department of Public Health websites for the most current information.\nThe California State University vaccine requirement that was updated on December 23, 2021 will apply to all faculty, students, and staff accessing either the San Bernardino or Palm Desert campuses, or doing university business off-site. This includes all University Auxiliary employees. All faculty, students, and staff are expected to be fully vaccinated, and boosted and to have completed their online self-certification before the start of the Fall semester 2022, or date of hire.\nTo complete the required vaccine self-certification or to document your exemption, students may do so in MyCoyote. Log into your MyCoyote account and click on the tile that states My Personal Information, once clicked scroll to the bottom and the Student COVID-19 Vaccine Self-Certification can be located there. Click and complete the form. The hold will be removed within 24hrs or less.   \nStudents who are fully vaccinated should complete their self-certification as soon as possible to avoid unnecessary COVID-19 testing.  \nMembers of the campus community who are not yet fully vaccinated should make an appointment for vaccination at https://myturn.ca.gov as soon as possible. The process to become fully vaccinated can take up to six weeks for the two-dose vaccine, and up to three weeks for the one-dose vaccine.\nCOVID-19 Immunization Appointments\nFor more information regarding COVID-19 immunization appointments for all counties in California please visit: COVID-19 immunization appointments. \nFor a complete list of vaccination locations, please visit the following county websites:\n\nSan Bernardino County\nRiverside County\n\nTo stay up to date with CSUSB’s COVID-19 resources and planning, please visit the CSUSB COVID-19 website.\n\nTo Clear Immunization Holds:\n(for COVID-19 vaccination certification, see previous section)\nImmunization records can only be accepted by mail or through the Patient Portal at this time.  We apologize for the inconvenience, we cannot accept records by fax or e-mail.  Federal regulations (HIPAA) prohibit accepting personal, confidential, medical, or immunization documentation through e-mail.\n\nCurrently enrolled students can upload your immunization records via the Patient Portal. (NOT FOR COVID-19 VACCINE VERIFICATION) Please navigate to the \"Downloadable Forms\" tabs, and then select \"Upload\" under the Immunization Records Section. \n\n\n \n\nOr send them by mail to:\n\n                         Attn:  Student Health Center, CSUSB\n                         5500 University Parkway\n                         San Bernardino, CA 92407\n\nPlease include your Coyote Identification Number (Coyote ID) with your records.\n\nHolds will be cleared once documentation has been received and approved.\nIf you need further assistance, please call:  (909) 537-5241.\n\nCOVID-19 Questions or for Support Regarding COVID-19\nThe California Department of Health Care Services (DHCS) has launched a free 24/7 Medi-Nurse advice line for COVID-19 symptoms, testing and treatment questions.  Please call:  (877) 409-9052.  This service is open to anyone who does not have insurance, or is a Medi-Cal beneficiary, but does not have a regular doctor or managed care plan to oversee their care.\nIf you are experiencing an increase in stress due to the Coronavirus, the CDC is offering support.  Please either call, text, or follow this link to connect with support to help manage stress and anxiety.\nCall:   1-800-985-5990\nText:   TalkWithUs to 66746\n \nSPANISH SPEAKERS:\nCall:   1-800-985-5990\nText:  HABLANOS to 66746\n \nThe San Bernardino County Department of Behavioral Health also is providing no-cost mental health support during the COVID-19 outbreak. To speak with specially trained staff who can listen and provide you with support and mental health resources, please call any of the numbers below. Calls are confidential and free of charge and they are available daily from 7:00 am to 10:00 pm.\n(909) 421-9233\n(909) 458-1517\n(760) 956-2345\n(Dial 7-1-1 for TTY users)\n \nThe Riverside County Department of Behavioral Health provides 24/7 Mental Health Urgent Care\nYou can also dial them directly for assistance:\nRiverside: (951) 509-2499\nPalm Springs: (442) 268-7000\nPerris: (951) 349-4195\nThe Riverside University Health System – Public Health and Behavioral Health have also provided a reference guide for Coping with Stress During Infectious Disease Outbreaks\n\n\n\n\n\nMission Statement\nThe CSUSB Student Health Center supports students' academic success by providing high quality accessible health and psychiatric care as well as health education and wellness services in a safe, confidential and compassionate environment.\nServices We Provide\nThe Student Health Center provides first aid and basic out-patient care services. We have a full time staff Monday through Friday to care for your needs. First aid is always available during clinic hours to anyone on campus. Please dial 911 for emergencies from anywhere on campus for assistance. We are staffed with Doctors, Physician Assistants, Nurse Practitioners, Nurses, Medical Assistants, and a Pharmacy. Our center has contracted with local lab and X-ray services for our students. Our psychiatric services are limited to psychiatric medication evaluation and management.  For counseling or therapy services please contact Counseling and Psychological Services. They also have a full time staff of Marriage and Family Therapists, Clinical Social Workers, Psychologists and supervised interns.\nHealth services are also offered at the CSUSB Palm Desert Campus in the R.D. and Joan Dale Hubbard Student Health and Psychological Counseling Center located in HS-119.\nAs an enrolled student at CSUSB, you pay a Student Health Fee and are eligible for health and counseling services at the Student Health Center and Counseling & Psychological Services office. Your Student Health Fee supports and finances the operation of the Health Center. Although basic health care is provided, treatment for major illnesses and injury (e.g., motor vehicle accidents), as well as certain conditions requiring a specialist or hospitalization, are beyond the scope of service. Students are referred to an outside provider for these illnesses or injuries and it is the student's responsibility to pay the costs associated with the referral. It is important to carry health insurance. Faculty and staff are not eligible for services except in case of emergency.\nPlease call ahead to schedule an appointment and with any inquiries you may have. There is no charge for routine office visits.\nTypical types of clinic services offered are listed below.  Some charges may apply.\n\nPhysicals: nursing, sports, teaching, pre-employment\nBirth control: pill, ring, implant, IUCs, depo\nEmergency contraception, Sexually Transmitted Infection testing, pap smears\nVaccines: Hepatitis B, MMR (Measles, Mumps, Rubella), TDAP (Tetanus, Diphtheria, and Pertussis), flu shots\nTB skin test: 2 appointments required\n\nPatient Rights & Responsibilities\nThe Student Health Center is committed to providing the best possible service to our students.  Please take a minute to become more familiar with your Patient Rights and Responsibilities.\nPrivacy Practices\nWe are committed to preserving the privacy of your personal health information.  The Student Health Center is a covered entity under the Health Insurance Portability and Accountability Act of 1996 (HIPAA).  HIPAA is United States legislation that provides data privacy and security provisions for safeguarding medical information.  We are required by Federal regulations and California law to protect the privacy of your medical information and to provide you with this notice:\nThis NOTICE OF PRIVACY PRACTICES describes how medical information about you may be used and disclosed and how you get access to this information.\nPlease read it carefully.\nConcerns or Comments\nStudent concerns may be addressed to: Beth Jaworski, Ph.D., Executive Director of Health, Counseling and Wellness, and sent via e-mail to:  Bjaworsk@csusb.edu. A suggestion box is available in the waiting room and the contents addressed per the Quality Improvement committee. A patient satisfaction survey is conducted annually. Trends are analyzed and adjustments made as needed. A patient may appeal to the Title IX director, University Ombuds Services, or the Associate Vice President of Student Affairs. This reporting policy is posted on the patient Rights and Responsibilities poster displayed in the Health Center.\nAccreditation\nOne of the most important things we do to earn your trust is to participate voluntarily in the quality assessment program of the Accreditation Association for Ambulatory Health Care (AAAHC). We have earned AAAHC Accreditation for over 25 years.  Our long-standing accreditation tells you that AAAHC's independent team of health care professionals has taken a close look at us and has found that we meet their rigorous, nationally recognized standards for quality health care services.\nMeasles\nTo learn more about the infection and how to avoid catching it, please follow the links and watch the videos below.\nThe single best way to prevent catching the measles is to get vaccinated. The vaccine is safe and effective.\n\nIf you have questions about the measles or the vaccine, make an appointment to be seen at the Student Health Center, and bring your vaccine record to that appointment or call 909-537-5241.\nWatch Measles Video in EnglishWatch Measles video in Spanish\nMeasles Infographic (English)                              \nMeasles Infographic (Spanish) \nHere's a link to a Measles fact sheet from the Center for Disease Control.\n\n\n\n\n\n\n\n\n\nRight Content\n\n\nContact Us\nHealth Appointment\nPatient Portal\nLog into Patient Portal to upload immunization records\n\n\nCoyote Connection\n\nContact Us\n\n\n\n\n\n\nStudent Health Center\n\n\n\nEmail asktheshc@csusb.edu\n\n\n\nPhone Number (909) 537-5241 \n\n\n\nLocation:HC-101\n\n\nOffice Hours\nMonday - Wednesday\n8:00 am - 5:00 pm \nThursday & Friday\n9:00 am - 5:00 pm\nLate Clinic: BY APPOINTMENT ONLY\nMonday & Wednesday\n5:00 pm - 6:00 pm\nSaturday, Sunday\nClosed\n\nPharmacy Hours\nMonday - Wednesday\n8:00 am - 4:30 pm\n\nThursday & Friday\n9:00 am - 4:30 pm\n\nCampus Police (24 Hours)\n(909) 537-7777 or dial 911 from any campus phone.\nHelp Line\n(Suicide/Crisis Hotline)\n(951) 686-4357 or\n(800) 784-2433\nAfter-Hours\nNurse Advice Line\nFoneMed  (855) 262-5562\nStudent identification number is required for services/Advice only, no appts.\n\n\n\n\n\n\n\n\n\nUniversity Resources\n\nUniversity Police\nTitle IX Office\nCAPS\nCARE Team\nExecutive Order 1096\n\n\n\n\n\n\n\n\n\n\nFooter Region\n\n\n\nCSUSB\n\n\nCalifornia State University, San Bernardino\n5500 University Parkway\nSan Bernardino, CA 92407\n+1 (909) 537-5000\n\n\n\n\n\nFollow Us\n\n\n\n\n\n CSUSB's Facebook\n\n\n\n\n\n CSUSB's Twitter\n\n\n\n\n\n CSUSB's YouTube\n\n\n\n\n\n CSUSB's Instagram\n\n\n\n\n\n CSUSB's LinkedIn\n\n\n\n\n\n CSUSB's Social Media\n\n\n\n\n\n\n\n\nAlso of InterestHealth PromotionHealth ServicesImmunizations \n\n\n\n\n\n\n\n\n\nColumn 1 \n\n\n\n\nLogin\n\n\n\n\nmyCoyote\n  Login\n\n\n\n\nCanvas\n\n\n\n\nStudent Email\n  Login\n\n\n\n\nFaculty & Staff Email\n  Login\n\n\n\n\nCSUSB  \nDrupal Login\n\n\n\n\n\n\nOf Interest to...\n\n\n\n\nFuture Students\n  Interests\n\n\n\n\nCurrent Students\n   Interests\n\n\n\n\nFaculty & Staff\n  Interests\n\n\n\n\nFull-Time Faculty\n  Interests\n\n\n\n\nPart-Time Faculty\n  Interests\n\n\n\n\nCommunity & Visitors\n  Interests\n\n\n\n\nAlumni & Friends\n  Interests\n\n\n\n\nUniversity Partners\n  Interests\n\n\n\n\nMilitary/Veterans\n  Interests\n\n\n\n\n\n\n\n\nColumn 2 \n\n\n\n\nEmployment\n\n\n\n\nCSUSB \nJob Listings\n - CSUSB\n\n\n\n\nFaculty Jobs\n  - CSUSB\n\n\n\n\nCareer Center\n  - CSUSB\n\n\n\n\nHuman Resources\n  - CSUSB\n\n\n\n\nStudent Employment\n  - CSUSB\n\n\n\n\n\n\nResources\n\n\n\n\nContact\n  CSUSB\n\n\n\n\nClery Act\n\n\n\n\nAnnual Safety Reports\n  - CSUSB\n\n\n\n\nTitle IX Notice\n  - CSUSB\n\n\n\n\nDisclosure of Consumer Information\n  - CSUSB\n\n\n\n\n\n\n\n\nColumn 3 \n\n\n\n\nCampus Services\n\n\n\n\nAcademic Advising\n  - CSUSB\n\n\n\n\nHousing & Residential Life\n  - CSUSB\n\n\n\n\nOmbuds Services\n  - CSUSB\n\n\n\n\nParking\n  - CSUSB\n\n\n\n\nPolice\n  - CSUSB\n\n\n\n\nPsychological Counseling\n  - CSUSB\n\n\n\n\nServices to Students with Disabilities\n  - CSUSB\n\n\n\n\nStudent Health Center\n  - CSUSB\n\n\n\n\nTechnology Support\n\n\n\n\nTranscripts\n  - CSUSB\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccessibility\n\n\n\n\nPrivacy and Security\n\n\n\n\nNon-Discrimination Notice\n\n\n\n\nWebsite Copyright/DMCA Policy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#page-header",
        "#main-content",
        "https://my.csusb.edu",
        "https://www.csusb.edu/campus-directory",
        "https://csusb.edu/library",
        "https://map.csusb.edu",
        "https://www.csusb.edu/pdc",
        "https://www.csusb.edu/advancement/development/how-give/make-a-gift",
        "https://www.csusb.edu/admissions",
        "https://www.csusb.edu/admissions-overview",
        "https://www.csusb.edu/admissions/apply-csusb",
        "https://www.csusb.edu/admissions/admitted-students/next-steps",
        "https://www.csusb.edu/admissions/apply-csusb/first-year-students",
        "https://www.csusb.edu/admissions/apply-csusb/transfer-students",
        "https://www.csusb.edu/international-education",
        "https://www.csusb.edu/international-education/programs/english-language-program",
        "https://www.csusb.edu/undocumented-student-success-center",
        "https://www.csusb.edu/olli",
        "https://www.csusb.edu/veterans",
        "https://www.csusb.edu/financial-aid",
        "https://www.csusb.edu/student-financial-services",
        "https://www.csusb.edu/summer",
        "https://www.csusb.edu/academics",
        "https://www.csusb.edu/academic-programs/academic-calendars",
        "https://www.csusb.edu/advising",
        "http://bulletin.csusb.edu/programs-az/",
        "https://www.csusb.edu/colleges-and-academic-departments",
        "https://bulletin.csusb.edu/",
        "https://www.csusb.edu/class-schedule",
        "https://www.csusb.edu/academics/online-programs-csusb",
        "/academic-success-and-undergraduate-advising",
        "https://www.csusb.edu/graduate-studies",
        "https://www.csusb.edu/registrar",
        "https://www.csusb.edu/academic-support-resources",
        "https://www.csusb.edu/academic-research",
        "https://www.csusb.edu/graduation-initiative-2025",
        "https://www.csusbathletics.com/",
        "https://www.csusbathletics.com/index.aspx?path=baseball",
        "https://www.csusbathletics.com/index.aspx?path=mbball",
        "https://www.csusbathletics.com/index.aspx?path=mgolf",
        "https://www.csusbathletics.com/index.aspx?path=msoc",
        "https://www.csusbathletics.com/index.aspx?path=softball",
        "https://www.csusbathletics.com/sports/2008/1/23/GEN_0123081553.aspx",
        "https://www.csusbathletics.com/index.aspx?path=wtrack",
        "https://www.csusbathletics.com/index.aspx?path=wcross",
        "https://www.csusbathletics.com/index.aspx?path=wvball",
        "https://www.csusbathletics.com/index.aspx?path=wsoc",
        "https://www.csusbathletics.com/index.aspx?path=wbball",
        "https://www.csusb.edu/campus-life",
        "https://www.csusb.edu/events",
        "https://www.csusb.edu/student-affairs/campus-programs-and-resources/getting-involved",
        "/student-affairs/leadership-team/assistant-vice-president-student-services",
        "https://www.csusb.edu/recreation-wellness",
        "https://www.csusb.edu/campus-life#student-health-and-safety",
        "https://www.csusb.edu/campus-life#housing-and-dining",
        "https://www.csusb.edu/campus-life#music-and-arts",
        "https://www.csusb.edu/human-resources/student-employment",
        "https://www.csusb.edu/advancement/strategic-communication/emergency-communication",
        "https://www.csusb.edu/pdc/student-life",
        "https://www.csusb.edu/about-csusb",
        "https://www.csusb.edu/inside",
        "https://www.csusb.edu/covid-19",
        "https://map.csusb.edu/",
        "https://www.csusb.edu/presidents-office",
        "https://www.csusb.edu/shared-governance",
        "https://www.csusb.edu/strategic-plan",
        "https://www.csusb.edu/administrative-divisions",
        "https://www.csusb.edu/sites/default/files/upload/file/University_Organization_Chart.pdf",
        "https://www.csusb.edu/advancement/strategic-communication",
        "https://www.csusb.edu/node/142646",
        "https://www.csusb.edu/academic-programs/accreditation/wasc-accreditation",
        "https://www.csusb.edu/assessment-capability-collaborative",
        "/",
        "https://my.csusb.edu",
        "https://www.csusb.edu/campus-directory",
        "https://csusb.edu/library",
        "https://map.csusb.edu",
        "https://www.csusb.edu/pdc",
        "https://www.csusb.edu/advancement/development/how-give/make-a-gift",
        "/student-health-center",
        "https://coyotehealth.csusb.edu/",
        "/student-health-center/appointments",
        "/student-health-center/insurance-eligibility",
        "/student-health-center/meet-our-team",
        "/student-health-center/immunizations",
        "/student-health-center/emergencies-after-hours",
        "/student-health-center/health-promotion",
        "/student-health-center/health-promotion/health-education-workshops",
        "/student-health-center/health-promotion/health-education-workshops",
        "/student-health-center/health-promotion/health-education-videos-and-resources",
        "/student-health-center/health-promotion/meet-staff",
        "/student-health-center/health-promotion/peer-health-educators",
        "/student-health-center/health-promotion/student-health-advisory-committee",
        "https://www.csusb.edu/basic-needs/food-security/calfresh",
        "https://www.csusb.edu/basic-needs",
        "/student-health-center/health-services",
        "/student-health-center/forms-documents",
        "/student-health-center/resources",
        "/event/563572",
        "/event/569412",
        "/event/563573",
        "https://www.csusb.edu/smoke-free-csusb",
        "https://www.csusb.edu/smoke-free-csusb",
        "https://coyotehealth.csusb.edu/",
        "https://www2.calstate.edu/csu-system/news/Pages/California-State-University-to-Implement-COVID-19-Vaccination-Requirement-for-Fall-2021-Term.aspx",
        "https://myturn.ca.gov",
        "https://myturn.ca.gov/",
        "https://www.rivcoph.org/COVID-19-Vaccine-with-Registration",
        "https://coyotehealthportal.csusb.edu/home.aspx",
        "https://www.dhcs.ca.gov/Pages/DHCS-COVID%E2%80%9119-Medi-Nurse-Line.aspx",
        "https://www.cdc.gov/mentalhealth/stress-coping/cope-with-stress/index.html",
        "http://wp.sbcounty.gov/dbh/",
        "/sites/default/files/DualProgramsRICrisisRCSU%283%29.pdf",
        "/sites/default/files/CoronavirusHelpSheet.pdf",
        "https://www.csusb.edu/student-health-center/health-services",
        "https://www.csusb.edu/caps",
        "https://www.csusb.edu/pdc/current-students/rd-joan-dale-hubbard-health-and-psychological-counseling-center",
        "/sites/default/files/PatientRightsandResponsibilities4.2021.pdf",
        "https://www.csusb.edu/sites/default/files/6.2.1CompleteNoticeofPrivacyPractices.pdf",
        "mailto:bjaworsk@csusb.edu",
        "https://youtu.be/g6nvByLwbjU",
        "https://youtu.be/fWCb5gDA30M",
        "/sites/default/files/upload/file/MeaslesAlternateIdeaFlyer-CSUSBFINAL%2006.05.pdf",
        "/sites/default/files/upload/file/MeaslesAlternateIdeaFlyerSpanish-CSUSBFINAL.pdf060519.pdf",
        "https://www.cdc.gov/measles/about/index.html",
        "https://www.csusb.edu/student-health-center/contact-us-form",
        "https://www.csusb.edu/student-health-center/appointments",
        "https://coyotehealth.csusb.edu/",
        "https://csusb.campuslabs.com/engage",
        "mailto:asktheshc@csusb.edu",
        "tel:+19095375241",
        "https://map.csusb.edu/?id=1850#!ref/HC",
        "http://police.csusb.edu/",
        "http://titleix.csusb.edu/",
        "https://www.csusb.edu/caps",
        "http://www.csusb.edu/care-team",
        "https://calstate.policystat.com/policy/8453514/latest/",
        "https://nces.ed.gov/collegenavigator/?q=cal+state+san+bernardino&s=all&id=110510",
        "tel:19095375000",
        "https://www.facebook.com/CSUSB",
        "https://www.twitter.com/csusbnews",
        "https://www.youtube.com/csusb",
        "https://instagram.com/csusb",
        "https://www.linkedin.com/school/california-state-university-san-bernardino/",
        "https://www.csusb.edu/advancement/strategic-communication/social-media-csusb",
        "https://www.csusb.edu/student-health-center/health-promotion",
        "https://www.csusb.edu/student-health-center/health-services",
        "https://www.csusb.edu/student-health-center/immunizations",
        "https://my.csusb.edu/",
        "https://csusb.instructure.com/login/saml",
        "http://mail.coyote.csusb.edu/",
        "http://mail.csusb.edu",
        "/cas",
        "https://www.csusb.edu/future-students",
        "https://www.csusb.edu/current-students",
        "https://www.csusb.edu/faculty-staff",
        "https://www.csusb.edu/faculty-resource-directory-ft",
        "https://www.csusb.edu/faculty-resource-directory-pt",
        "https://www.csusb.edu/community-visitors",
        "https://www.csusb.edu/alumni-friends",
        "https://www.csusb.edu/advancement/philanthropy/corporate-foundation-philanthropy",
        "https://www.csusb.edu/veterans",
        "https://www.csusb.edu/human-resources/talent-acquisition/job-opportunities",
        "https://careers.csusb.edu/en-us/filter/?job-mail-subscribe-privacy=agree&search-keyword=&category=unit%203%20-%20cfa%20-%20california%20faculty%20association",
        "https://www.csusb.edu/career-center",
        "https://www.csusb.edu/human-resources",
        "https://www.csusb.edu/human-resources/student-employment",
        "https://www.csusb.edu/about-csusb/contact-csusb",
        "https://www.csusb.edu/clery-act",
        "https://www.csusb.edu/sites/default/files/2022_CSUSB_Annual_Security_Report_0.pdf",
        "https://www.csusb.edu/institutional-equity-compliance/resources/title-ix-notice-non-discrimination-basis-gender-or-sex",
        "https://www.csusb.edu/registrar/disclosure-consumer-information",
        "https://www.csusb.edu/advising",
        "https://www.csusb.edu/housing",
        "https://www.csusb.edu/ombuds",
        "https://www.csusb.edu/parking",
        "https://www.csusb.edu/police",
        "https://www.csusb.edu/caps",
        "https://www.csusb.edu/ssd",
        "https://www.csusb.edu/student-health-center",
        "https://www.csusb.edu/its",
        "https://www.csusb.edu/registrar/records/request-csusb-transcript",
        "https://www.csusb.edu/ats/accessibility",
        "https://www.csusb.edu/about-csusb/privacy-and-security-notice",
        "https://www.csusb.edu/institutional-equity-compliance/resources/title-ix-notice-non-discrimination-basis-gender-or-sex",
        "https://www.csusb.edu/its/security/reporting/copyrightdmca-notice-and-procedure"
    ]
}