{
    "title": "Global Forum Kicks Off New Project to Mainstream Nature in Decision-Making | Natural Capital Project",
    "body": "\nSkip to content\nSkip to navigation\n\n\n\n\n\n\n\n GA4 Tag\n  \n\n\n\n\n\n\n\n\n\n\n\n   \n\n\n\nNatural Capital Project\n\n\n\n\n\n\n\n\n\n\n\n\n \n  Support Our Work\n\n  \nSearch form\n\nSearch \n\n\n\n\n\n \n\n\n\n Navigation menu    \n\n\nWho We Are NatCap Approach\nNatCap Partnership\nAt Stanford\nPeople\nOpen Positions\n\nResearch Science Innovation\nPublications\n\nImpact Sustainable Development\nSustainable Cities\nWhere We Work\nProjects\n\nInVEST Software Platform InVEST\nSoftware Support & Resources\nPartnership Software & Tools\n\nDiscover Virtual Training\nEvents\nNatCap World Viewer\nFAQs\n\nNews Recent News\nNewsletter\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n Global Forum Kicks Off New Project to Mainstream Nature in Decision-Making \n\n \n  Facebook\nLinkedIn\nTwitter\n \n\n\n\n \n  \nApr 25 2023 | Posted in: News ReleaseBy Elana KimbrellStanford’s Natural Capital Project and several multilateral development banks are collaborating to integrate nature’s value into policy and finance decisions in 15 pilot countries\nRepresentatives from 15 countries and 3 multilateral development banks convened at Stanford on April 17-19. Credit: Casey Valentine\nRight ImageA global forum hosted by Stanford’s Natural Capital Project brought representatives from 15 countries and three multilateral development banks (MDBs) to the Stanford campus on April 17 - 19. The event kicked off a project to significantly scale up a transformational way of thinking about and enhancing human development – through addressing the urgent crises of climate change and biodiversity loss. This approach, pioneered by the Natural Capital Project and its partners, quantifies and maps the values nature provides to people – such as clean air and water, fertile soil, rich ocean life, flood protection, heat protection, and carbon capture – allowing these services to be factored into land, water, and ocean use policies and investment decisions.\nTo facilitate more rapid uptake of these approaches, the Natural Capital Project, the Inter-American Development Bank, and the Asian Development Bank are working with 10 pilot countries (Armenia, Belize, Chile, China, Colombia, Cook Islands, Ecuador, the Philippines, Sri Lanka, and Uruguay) to support them in using natural capital information to design and inform policy and finance decisions. The project partners are also collaborating with the World Bank to share lessons from their Biodiversity, Ecosystems, and Landscape Assessment (BELA) initiative.\n“We are starting the engines of innovation,” said Mary Ruckelshaus, executive director of the Natural Capital Project. “The in-country experts at this event brought understanding of what is needed in their countries. They are the innovators and the visionaries. The MDBs can amplify and take these innovations to scale, by developing standard policy and finance processes to help countries achieve their goals and visions. And the Natural Capital Project and its partners have technical and policy expertise to craft the ‘how’ – how do we get there, and what lessons are emerging on what more is needed for policies and financial instruments to work.”\nAt the meeting, both country and MDB representatives shared experiences with different mechanisms for using natural capital information in policy and investments. These included Uruguay’s sustainability-linked bond, in which the bond’s interest rate is linked to compliance with its climate commitments in the Paris Agreement. Through the bond, private landowners have financial incentives to adjust grazing and land-use practices to both boost production and meet greenhouse gas emission targets, which are verified using natural capital accounting. “When it's a financial commitment, it becomes a strategic priority,” said Herman Kamil, director of debt management within Uruguay’s economics ministry.\nIn addition, bonds had previously been a matter solely for their finance ministry, but “this caused us to bring in other players who usually don’t work on bonds, from environment, agriculture, fisheries, energy, transportation, foreign affairs. All of a sudden our Whatsapp group was much bigger,” said Kamil.\n \n\n\nPanel of representatives from Asian Development Bank member countries. Credit: Casey Valentine.\nLeft ImageThis highlights a key element of both this event and the 15-month project: participation from innovative leaders across different government ministries, typically including environment and finance. This stemmed in part from a report the Natural Capital Project prepared for the Global Environment Facility in 2022 about the use of natural capital approaches, which noted the need for them to be taken up across all sectors of government. In some cases, the event at Stanford was the first time country representatives met their colleagues from other government departments.\nBeverly Wade, director of Belize’s Blue Bond & Finance Permanence Unit, who attended the meeting with her colleague Leroy Martinez from the finance ministry, said one of their challenges will be helping other parts of government understand how natural capital approaches can help them with their own mandates. This is despite Belize’s own success with a financial mechanism called a Blue Bond. In the single largest blue bond of its kind, they committed to protecting up to 30% of their ocean, and The Nature Conservancy worked with them to refinance $553 million of their debt. The funds from the refinancing went to an independent conservation fund. Wade said, “This meeting exposed us to how to leverage our success with blue bonds and expand on that through other non-traditional funding mechanisms, such as Uruguay’s sustainability bond.”\nChile shared a major step in the policy realm: their recent creation of a Natural Capital Committee housed within the office of the prime minister. Sofía Aroca from Chile’s finance ministry said, “This project will help us to accelerate our process… The ideas we heard from around the world really helped us imagine how to do this in our country.” Likewise, Cook Islands representatives Angelia Willams from the Ministry of Finance and Economic Management and Tohoa Puna from the National Environment Service found other countries’ approaches illuminating - and helped them understand how to talk about their existing work using the language of natural capital. “I was very interested in China’s GEP [Gross Ecosystem Product], although we are still in the very early stages of using natural capital information. Similarly, I was blown away by Belize. We could use their wins and make it fit our level,” said Williams.\nOver the next 15 months, the Natural Capital Project and the MDBs will work with the pilot countries to co-develop natural capital approaches that inform specific policy or finance decisions, and further develop capacity for using them. Looking ahead to broadening its application in other countries, the NatCap and MDB teams will create a standardized framework for informing science-policy processes, and customizable tools and training materials.\nThe Natural Capital Project’s key partners in this effort, the MDBs, have significantly ramped up their focus on nature-based solutions and natural capital approaches as core components of  human development. In a 2021 joint statement on Nature, People and Planet presented at the Glasgow climate summit, 10 MDBs united in stating, “progress on global sustainable development, climate and biodiversity goals cannot be achieved without addressing the direct and indirect drivers of nature loss and transforming the way in which we value, use, conserve and share the benefits from nature.” Both the Inter-American Development Bank and the Asian Development Bank have created “Natural Capital Labs” to accelerate and mainstream the use of natural capital approaches. \n\n\nChilean government representatives in conversation at the April 17-19 event. Credit: Casey Valentine.\nRight ImageFrom the three-day event at Stanford, “some frontier research needs have emerged,” said Ruckelshaus, particularly “how to add up the impact of all these innovations and interventions to find out what is really making a difference, and how to include and represent non-traditional knowledge and the cultural and spiritual value of ecosystems. This is the ‘heart’ part of why people care about nature and what motivates behavior.”\nIn her remarks, Gretchen Daily, Natural Capital Project co-founder, biology professor in Stanford’s School of Humanities & Sciences, and recent winner of the Ecological Society of America’s 2023 Eminent Ecologist Award, said: “A much deeper cultural shift is needed to achieve this transformation: a recognition of how interdependent we are across the regions of the world we represent, and how deeply interdependent we are with nature.”\nStay tuned for more on this project, which is funded in part by the Gordon and Betty Moore Foundation.\nWith its global hub at Stanford University, the Natural Capital Project is a collaboration among academic partners including the Chinese Academy of Sciences, the Royal Swedish Academy of Sciences, the Stockholm Resilience Centre, and the University of Minnesota together with core implementing partners including The Nature Conservancy and World Wildlife Fund. The Natural Capital Project works with public and private sector partners and communities across the globe to measure the value nature provides to people. Integrating that value into decision-making can improve human wellbeing by securing Earth’s life-support systems.\n \n\nResearch Area: Sustainable Development\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n  \n\n\n\nTwitter\n \n\n\n\nYouTube\n \n\n\n\nLinkedIn\n \n\n \n\n\n\n  \n​​Contact Us\nSupport Our Work\nDownload InVEST\nSubscribe to Newsletter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n© Stanford University, Stanford, California 94305.\n\n\n\n\n\n",
    "links": [
        "#main",
        "#main-nav",
        "http://www.stanford.edu",
        "/",
        "/",
        "https://give.stanford.edu/fund/?kwoDCFilter=KDC-48587A9&kwoDCPreselect=KDC-48587A9",
        "/who-we-are/natural-capital-project",
        "/who-we-are/natural-capital-project",
        "/who-we-are/partners",
        "/who-we-are/our-home-stanford-university",
        "/about/people",
        "/who-we-are/open-positions",
        "/research",
        "/research",
        "/publications",
        "https://naturalcapitalproject.stanford.edu/impact/where-we-work",
        "/sustainable-development",
        "/sustainable-livable-cities",
        "/impact/where-we-work",
        "/impact/projects",
        "/software/invest",
        "/software/invest",
        "/invest-software-platform/software-support-resources",
        "/software",
        "https://naturalcapitalproject.stanford.edu/node/21236",
        "/discover/virtual-training",
        "/discover/events",
        "/discover/natural-capital-world-viewer",
        "https://naturalcapitalproject.stanford.edu/node/16581",
        "/news",
        "/news",
        "/news/natcap-newsletter",
        "http://facebook.com/sharer.php?u=https%3A%2F%2Fnaturalcapitalproject.stanford.edu%2Fnews%2Fglobal-forum-kicks-new-project-mainstream-nature-decision-making&t=Global%20Forum%20Kicks%20Off%20New%20Project%20to%20Mainstream%20Nature%20in%20Decision-Making",
        "http://www.linkedin.com/shareArticle?url=https%3A%2F%2Fnaturalcapitalproject.stanford.edu%2Fnews%2Fglobal-forum-kicks-new-project-mainstream-nature-decision-making&mini=true&title=Global%20Forum%20Kicks%20Off%20New%20Project%20to%20Mainstream%20Nature%20in%20Decision-Making&ro=false&summary=&source=",
        "http://twitter.com/intent/tweet?url=https%3A%2F%2Fnaturalcapitalproject.stanford.edu%2Fnews%2Fglobal-forum-kicks-new-project-mainstream-nature-decision-making&text=Global%20Forum%20Kicks%20Off%20New%20Project%20to%20Mainstream%20Nature%20in%20Decision-Making&media= ",
        "https://naturalcapitalproject.stanford.edu/",
        "https://naturalcapitalproject.stanford.edu/software/invest",
        "https://www.iadb.org/en",
        "https://www.adb.org/",
        "https://www.iadb.org/en/news/uruguay-issues-global-sustainability-linked-bond-idb-support",
        "https://stapgef.org/sites/default/files/2022-06/Final%20Report%20-%20Natural%20Capital%20Approaches%20-%20June%202022%20FINAL.pdf",
        "https://www.nature.org/content/dam/tnc/nature/en/documents/TNC_FinancingNature_BlueBonds_ENGLISH.pdf",
        "https://naturalcapitalproject.stanford.edu/projects/gross-ecosystem-product-gep-beijing-china",
        "https://www.iadb.org/en/news/idb-leads-multilateral-development-banks-boost-nature-based-investments",
        "https://www.esa.org/blog/2023/04/12/esa-announces-recipients-of-2023-awards/",
        "https://www.moore.org/",
        "https://english.cas.cn/",
        "https://www.kva.se/en/",
        "https://www.stockholmresilience.org/",
        "https://environment.umn.edu/",
        "https://www.nature.org/en-us/",
        "https://www.worldwildlife.org/",
        "/sustainable-development",
        "https://twitter.com/NatCapProject",
        "https://www.youtube.com/channel/UCnKzGdbWAdfQuXclAIMBGjA",
        "https://www.linkedin.com/company/natural-capital-project",
        "https://naturalcapitalproject.stanford.edu/contact-us",
        "https://give.stanford.edu/fund/?kwoDCFilter=KDC-48587A9&kwoDCPreselect=KDC-48587A9",
        "https://naturalcapitalproject.sites.stanford.edu/software/invest",
        "https://naturalcapitalproject.stanford.edu/sign-our-newsletter",
        "http://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu/",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility/"
    ]
}