{
    "title": "Get Involved | Families",
    "body": "\n \n \n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nFamilies\n\n\nStanford University\n\n\n\n\n\n\n\n\n\n\n\n    Menu\n\n\n\n\n\nSearch form\nSearch term\n\n\n\n\n\nHome\nFAQ\nGet Involved\nHow Do I Pay?\nStay Informed\nTips\nVital Info\nLatest News\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nGet Involved\n\n \nNew Student Orientation and Family Weekend are generally among the events with specific programming for Stanford parents and guardians. The Stanford Parents’ Program and the Parents’ Club are among the organizations that give parents and guardians a chance to become more involved with the university.\nNew Student Orientation\nNew Student Orientation (NSO) is generally held in late September shortly before school begins. It includes events for parents and guardians, such as seminars and chances to meet university administrators. The pandemic changed plans last year.\nGenerally speaking, parents and guardians attending NSO are encouraged to wear comfortable clothing and shoes. Events involve much walking. Plus, although some residences have elevators, many do not. You may have to carry boxes of belongings up several flights of stairs. Temperatures are warm during the days–70s to 80s–and cool in the evenings–40s to 50s. All parent and guardian programming is scheduled for only the first day of NSO. Parents and families are asked to bid farewell to their child in the late afternoon at residence hall events.\nInformation on orientation is generally included in Approaching Stanford. A schedule of NSO events is generally provided to parents or guardians and students when they arrive. Advance reservations for hotel rooms in the Palo Alto area are strongly advised.\nFamily Weekend\nFamily Weekend is generally held the last full weekend in February. Family members are advised tp wear comfortable clothing and shoes. Activities tends to involve a great deal of walking. The Palo Alto area in the winter is cool–40s and 50s–and wet. Rain gear is advised. The fall issue of the Stanford Parents’ Newsletter will provide details.\nStanford Parent and Family Engagement\nThe Stanford Parents’ Program hosts receptions that bring university speakers to parents and guardians in their regions, organizes volunteers to help with events and fundraising and encourages parents and guardians to become part of the Stanford community. Visit the website.\nParents’ Club of Stanford University\nThe Parents’ Club builds community by supporting Stanford students and families. It is a not-for-profit organization that is separate from the university. Founded locally in 1924, the club today consists of parents and guardians from around the world. The club offers a range of programs that directly support students, provides information for parents and guardians via newsletters and general meetings, organizes social events and provides the university with volunteers at NSO, Family Weekend and Admit Weekend. Over the decades, the club has provided more than $1 million in scholarships for Stanford undergraduates.\nSignature programs include the Distinguished Speaker series, where a Stanford professor speaks on a topic of interest, the On-Campus Delivery service that enables loved ones to order bakery treats for delivery to their student’s dorm and the Entertainment Extravaganza! showcase of student performing groups that closes Family Weekend. All parents and guardians of Stanford students are welcome to join at stanfordparentsclub.org/join. Membership is free of charge.\n\n\nPublications, Web Sites and Other Resources\nThe Parents and Guardians Newsletter is electronically mailed during the academic year to parents or guardians of undergraduate students.\nParents or guardians with questions can call the Help Line at (650) 725-0649 or send e-mail to mykidis@stanford.edu.\nStanford, the university’s magazine, is sent to parents and guardians of matriculating undergraduates.\nFacebook users can become fans of Stanford to receive regular feeds of the most interesting news across campus. Twitter users can also receive instantly updated information.\nStanford Report, the university’s daily e-news source, is available online. You are encouraged to subscribe.\nUpdating Your Address\nTo update your address and/or telephone information with the university or to request that another person receive mailings, email mykidis@stanford.edu.\nWhen You Visit Stanford in the future\nThe pandemic has resulted in the closing of the Stanford campus except to selected faculty, staff and students. In the future if you visit, check out the visitor information site. It provides useful information about Stanford and the San Francisco Bay Area. Be sure to make travel arrangements early for special events because there are a limited number of hotels near the university.\nNew Student Orientation and Family Weekend provide parking. At other times, permits are required for campus lots when you visit. Visit Stanford Transportation for more.\n \n\n\n\nStanford + Parents/Guardians\n The student is at the center — and is the focus — of this important partnership.\n\nOur Policy\nProspective Parents\n\n\n  \n\nParents' Helpline\n\nmykidis@stanford.edu\n650-725-0649\n \n\n\n  \n\nIn an Emergency\n\nemergency.stanford.edu\n650-725-5555\n 844-ALERTSU (844-253-7878)  \n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University,  Stanford, California 94305.\n\n \n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/",
        "https://parents.stanford.edu/faq/",
        "https://parents.stanford.edu/get-involved/",
        "https://parents.stanford.edu/how-do-i-pay/",
        "https://parents.stanford.edu/stay-informed/",
        "https://parents.stanford.edu/tips/",
        "https://parents.stanford.edu/vital-information/",
        "https://parents.stanford.edu/newsletter/",
        "https://undergrad.stanford.edu/advising/freshman/new-student-orientation-nso/nso-parents-events",
        "http://parentsweekend.stanford.edu",
        "https://parentsweekend.stanford.edu/",
        "https://giving.stanford.edu/parents-families/",
        "https://giving.stanford.edu/parents-families/",
        "https://stanfordparentsclub.worldsecuresystems.com",
        "http://stanfordparentsclub.org/",
        "https://www.stanfordparentsclub.org/on-campus-delivery-mainpage.html",
        "http://stanfordparentsclub.org/join",
        "/newsletter",
        "mailto:mykidis@stanford.edu",
        "http://alumni.stanford.edu/get/page/magazine/home",
        "http://www.facebook.com/stanford",
        "http://twitter.com/#!/stanford",
        "http://news.stanford.edu/sr/",
        "mailto:mykidis@stanford.edu",
        "http://www.stanford.edu/dept/visitorinfo",
        "https://transportation.stanford.edu/",
        "/stanford-parents/",
        "http://www.stanford.edu/dept/uga/parents/",
        "mailto:mykidis@stanford.edu",
        "tel:16507250649",
        "http://emergency.stanford.edu/",
        "tel:16507255555",
        "tel:18442537878",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}