{
    "title": "Courses | Learn WordPress ",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tLearn\t\t\t\t\t\tWordPress\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\tTutorials\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tOnline Workshops\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tCourses\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tLesson Plans\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\tContribute\t\t\t\t\t\t\t\t\n\n\nSearch for:\n\n\n\n\n\t\t\tSearch\t\t\n\n\n\n\n\n\n\n\n\n\nLearn Home,  » Courses \n\n\n\n\nCourses \n\n\n\nWordPress provides limitless ways for people to craft and grow their online presence. The content in these courses is delivered in multiple formats, with a focus on text and video, working towards practical learning objectives to help you become a better WordPress developer, designer, user, and contributor.\n\n\n\n\t\t\tSearch Courses\t\t\n\n\n\nSearch Courses\n\n\n\n\n\n\n\n\nDeveloping with WordPress\n\n\nIntroduction to WordPress\n\n\nUsing the Site Editor\n\n\nContributing to WordPress\n\n\n\n\nDeveloping with WordPressWordPress opens up opportunities for developers to modify, extend, and experiment beyond its publishing capabilities. These courses will teach you the more technical aspects of working with WordPress, from theme development to building plugins and more.\n\n\n\n\nIntroduction to Block Development:  Build your first custom block\n\n\n\nLearn the basics of block development with this introductory course. This step-by-step guide will walk you through the process of building a custom block from start to finish.  \nThe course will guide you through the steps needed to build a practical example project that you can go on to use in your own sites. It will provide you with a solid foundation in developing custom blocks. The course will arm you with the essential concepts and knowledge, thereby giving you the confidence to work on your own projects.  \nWhat you will learn:\n\nSet up a development environment\nScaffold a block\nMake the block user configurable\nWork with various content using InnerBlocks\nAdd style variations\nAnd more….\n\n\n\n\n\n\nLessons:\n20\n\n\n\n\n\n\n\n\n\nUsing the WordPress Data Layer\n\n\n\nLet’s build a JavaScript application based on WordPress REST API\nIn this course, you will learn how to:\n\nFetch, filter, and display data\nUpdate, delete, and create new data records\nHandle errors gracefully\nLeverage the caching and concurrency behaviors of the data layer\n\n\n\n\n\n\nLessons:\n6\n\n\n\n\n\n\n\n\n\nA Developers Guide to Block Themes – Part 1\n\n\n\nLearn the fundamentals of block theme development in part 1 of the Developers Guide to Block Themes.\nThe course will guide you through the process of developing a block theme from scratch. It covers the fundamental elements of a block theme, teaching you the concepts via real world examples.\nWhat you will learn:\n\nThe minimum requirements of a block theme\nTurning design requirements into a theme.json file\nHow to utilize the Site Editor to build out your theme templates\nTaking the changes from the Site Editor and saving them as theme files\nCreating Custom Templates, Template Parts, and Variable Templates\n\n\n\n\n\n\nLessons:\n19\n\n\n\n\n\n\n\n\n\nA Developers Guide to Block Themes – Part 2\n\n\n\nLearn the how to develop block themes development in part 2 of the Developers Guide to Block Themes.\nThe course will continue on from what you learned in part 1, and covers more advanced block theme development tactics.\nWhat you will learn:\n\nAdding custom fonts to your block theme\nAdding custom functionality through block patterns\nCreating Global Styles variations\nMaking your block theme translation ready\nLocking down your theme settings and blocks\n\n\n\n\n\n\nLessons:\n21\n\n\n\n\n\n\n\n\n\nDevelop Your First Low-Code Block Theme\n\n\n\nHave you ever wanted to know how theme developers design themes? Have you ever wanted to design a theme of your very own from scratch? If so, you’ve come to the right place! Learn how to build a custom block theme using the WordPress site editor–and only a tiny bit of coding. We’ll show you how!\n\n\n\n\n\nLessons:\n23\n\n\n\n\n\n\n\n\n\nConverting a Shortcode to a Block\n\n\n\nAre you a WordPress plugin developer who wants to dive into developing blocks? Perhaps you have developed a shortcode that provides your users or customers with a specific piece of functionality, and you want to turn it into a block? In this course, you will explore the key knowledge you need to get started converting your shortcodes to blocks.\n\n\n\n\n\nLessons:\n5\n\n\n\n\n\nIntroduction to WordPressWordPress is a powerful content management system with a range of innovative features. In the following courses, you'll get an introduction to WordPress and learn everything you need to know to get going with your website. So whether you're a novice or simply want to know how to set up a new site, we have you covered.\n\n\n\n\nGetting Started With WordPress: Get Set Up\n\n\n\nAre you new to WordPress and don’t know where to begin? Then, you’re in the right place! \nIn this course, you’ll learn about the essential steps to get started with WordPress. We’ll walk you through hosting, domains, and everything in between, so you’re all set for your first time installing WordPress.\nThis course is right for you if:\n\n\nYou want to set up a simple website or blog\nYou are getting started for the first time with WordPress\nYou haven’t decided on a host yet (or don’t know what this is–yet!)\nYou haven’t picked a domain name yet (or don’t know what this is either)\n\n\n\n\n\n\n\nLessons:\n11\n\n\n\n\n\n\n\n\n\nGetting Started With WordPress: Get Familiar\n\n\n\nNow that you’ve installed WordPress, what’s next?\nIn this course for beginners, we’ll teach you all the basics of WordPress, so you’re ready to hit the ground running with your first site. You’ll learn:\n\n\nThe difference between when you should write a post vs. when you should write a page\nWordPress terminology like “slug”, “category” and “tag” \nHow to personalize your profile\nHow to use images to help search engines and people of all abilities find, list, and use your site\nHow to make the most out of WordPress through your dashboard\n\n\n\n\n\n\n\nLessons:\n18\n\n\n\n\n\nUsing the Site EditorIf you've ever wanted to edit all parts of your site easily, the Site Editor makes that possible. First launched in WordPress 5.9, the Site Editor includes features like templates, template parts, theme blocks, and more. The courses below will teach you all about using the Site Editor and its features to help you build your perfect site.\n\n\n\n\nPart 1: Simple Site Design with Full Site Editing\n\n\n\nDo you want to build a site on WordPress, but don’t know how to code? No problem.\nLearn how to create beautiful designs without code, thanks to full site editing (FSE)—a set of interconnected features that make WordPress powerful.\nWe’ll go through:\n\nThe benefits of full site editing when creating a new site\nHow to create a customized site design without any coding\n\n\n\n\n\n\n\nLessons:\n15\n\n\n\n\n\n\n\n\n\nPart 2: Personalized Site Design with Full Site Editing and Theme Blocks\n\n\n\nLet’s dive into theme blocks! Now that you know about full site editing, you can take advantage of your familiar experience with blocks to customize and build all parts of your site.\nIn this course, you’ll learn:\n\nWhat theme blocks are, along with their benefits\nHow to create a personalized site design using theme blocks\n\n\n\n\n\n\n\nLessons:\n7\n\n\n\n\n\n\n\n\n\nPart 3: Advanced Site Design with Full Site Editing: Site Editor, Templates and Template Parts\n\n\n\nLet’s explore how you can use templates and template parts to edit your entire site’s design.\nHere’s what you’ll learn by the end of this course:\n\nDifference between the Site Editor and Template Editor\n\nThe function of templates and template parts\n\nHow to confidently use the Site Editor and Template Editor\nHow to create a personalized site design using templates and template parts\n\n\n\n\n\n\nLessons:\n7\n\n\n\n\n\nContributing to WordPressWordPress is built and managed by a wide community of individuals from all over the world. These courses will help you find your feet in the project and help you get involved in the mission to democratize publishing.\n\n\n\n\nPolyglots Contributor Training\n\n\n\nTranslation is a great way to contribute to WordPress if you understand English and another language. This course will guide you through the process of becoming a knowledgeable Polyglots Team contributor.\n\n\n\n\n\nLessons:\n22\n\n\n\n\n\n\n\n\n\nIncident Response Team Training\n\n\n\nThis Incident Response Team Training Course addresses how WordPress contributors take and respond to code of conduct reports.\nThere are four modules in the course, which cover the following topics:\n\nIntroduction to the Incident Response Team\nOverview of Processes and Expectations of the Incident Response Team\nTaking Incident Reports\nResponding to Incident Reports\n\n\n\n\n\n\nLessons:\n41\n\n\n\n\n\n\n\n\n\nWordPress Meetup Organizer Training\n\n\n\nMeetup groups are locally-organized groups that get together for face-to-face or online events on a regular basis. Anything that brings together 2 or more people to share their WordPress experiences counts — there’s no minimum number of attendees or required format.\nThis course is required training for anyone wishing to become a WordPress meetup organizer.\n\n\n\n\n\nLessons:\n6\n\n\n\n\n\n\n\n\n\nWordCamp Mentor Training\n\n\n\nWordCamp mentors provide structured support and guidance to new WordCamp organizers. Any previous WordCamp lead organizer can apply to become a WordCamp mentor.\nThis course is required training for everyone who wishes to become a mentor.\n\n\n\n\n\nLessons:\n2\n\n\n\n\n\n\n\n\n\nBasic Principles of Conflict Resolution\n\n\n\nSome disagreements come from misunderstandings, while others come from unpleasant mistakes. No matter how it happens, it is never pleasant.\nThis course will help you to effectively navigate these types of conflicts when working in an open-source community like WordPress.\n\n\n\n\n\nLessons:\n4\n\n\n\n\n\n\n\n\n\nWriting in the WordPress Voice\n\n\n\nBecause the WordPress community is global, it’s important to remember that everyone has different circumstances, knowledge, and levels of experience. As a general rule, all written communication should be clear and friendly, with a tone that’s on the positive side of neutral.\nThis course is for all contributors, especially those who are publishing posts, facilitating meetings, or otherwise writing publicly on behalf of the WordPress project.\n\n\n\n\n\nLessons:\n2\n\n\n\n\n\n\n\n\n\nCommunity Meeting Etiquette\n\n\n\nWordPress community teams meet regularly to connect in real time. Teams should feel free to find what works for them, but there are guidelines to how these meetings should take place that are true for all teams.\nThis course looks at the different type of meetings that take place across the WordPress open-source project and how they should be conducted. It is useful training for anyone facilitating or engaging in contributor meetings.\n\n\n\n\n\nLessons:\n2\n\n\n\n\n\n\n\n\n\nOpen Source Basics and WordPress\n\n\n\nWordPress is open-source software. This has many implications and affects everything about how the software is built and the community is managed.\nThis course will look at broad open-source principles and how they apply to WordPress – these are essential principles for any new or seasoned contributor to understand.\n\n\n\n\n\nLessons:\n7\n\n\n\n\n\n\n\n\n\nWordPress Community Deputy Training\n\n\n\nCommunity Deputies are a team of people all over the world who review WordCamp and Meetup applications, interview lead organizers, and generally keep things moving at WordCamp Central. You can find out more about the deputy program here.\nThis course is required training for anyone wanting to join the Deputy program. It is also useful for anyone wanting to know more about how the Community Team works.\n\n\n\n\n\nLessons:\n17\n\n\n\n\n\n\n\n\n\nWordCamp Organizer Training\n\n\n\nWordCamps are casual, locally-organized conferences that focus on everything WordPress. Each WordCamp is different, reflecting the local WordPress community it represents, but usually a wide range of people from casual users to core developers participate, share ideas, and get to know each other.\nThis course is required training for all new WordCamp lead organizers, as well as being useful for anyone wanting to know more about how WordCamps work.\n\n\n\n\n\nLessons:\n34\n\n\n\n\n\n\n\n\n\nHow Decisions Are Made in the WordPress Project\n\n\n\nWordPress is built, maintained, and supported in a highly open and collaborative environment. This open collaboration can make leaders think that absolute consensus is required to make any decisions. Consensus is a valuable goal when everyone working toward a decision shares the same resources, information, and values. However, in large organizations sometimes decisions that do not please the majority will have to be made, due to legal requirements, logistical concerns, and other factors.\nThis course will help you learn how decisions are made in the WordPress project and empower you to get involved in decision-making discussions in any contributor team.\n\n\n\n\n\nLessons:\n5\n\n\n\n\n\n\n\n\n\nHave an idea for new content? Let us know!\n\n\n\t\t\tApply to present a tutorial\t\t\n\n\t\t\tSubmit a topic idea\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n",
    "links": [
        "#main",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Flearn.wordpress.org%2Fcourses%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/tutorials/",
        "https://learn.wordpress.org/online-workshops/",
        "https://learn.wordpress.org/courses/",
        "https://learn.wordpress.org/lesson-plans/",
        "https://learn.wordpress.org/contribute/",
        "https://learn.wordpress.org",
        "#developing-with-wordpress",
        "#introduction-to-wordpress",
        "#using-the-site-editor",
        "#contributing-to-wordpress",
        "https://learn.wordpress.org/course/introduction-to-block-development-build-your-first-custom-block/",
        "https://learn.wordpress.org/course/using-the-wordpress-data-layer/",
        "https://learn.wordpress.org/course/a-developers-guide-to-block-themes-part-1/",
        "https://learn.wordpress.org/course/a-developers-guide-to-block-themes-part-2/",
        "https://learn.wordpress.org/course/a-developers-guide-to-block-themes-part-1/",
        "https://learn.wordpress.org/course/develop-your-first-low-code-block-theme/",
        "https://learn.wordpress.org/course/converting-a-shortcode-to-a-block/",
        "https://learn.wordpress.org/course/getting-started-with-wordpress-get-setup/",
        "https://learn.wordpress.org/course/getting-started-with-wordpress-get-familiar/",
        "https://learn.wordpress.org/course/simple-site-design-with-full-site-editing/",
        "https://learn.wordpress.org/course/part-2-personalized-site-design-with-full-site-editing-and-theme-blocks/",
        "https://learn.wordpress.org/course/part-3-advanced-site-design-with-full-site-editing-site-editor-templates-and-template-parts/",
        "https://learn.wordpress.org/course/polyglots-contributor-training/",
        "https://make.wordpress.org/polyglots",
        "https://learn.wordpress.org/course/incident-response-team-training/",
        "https://learn.wordpress.org/course/wordpress-meetup-organizer-training/",
        "https://learn.wordpress.org/course/wordcamp-mentor-training/",
        "https://learn.wordpress.org/course/basic-principles-of-conflict-resolution/",
        "https://learn.wordpress.org/course/writing-in-the-wordpress-voice/",
        "https://learn.wordpress.org/course/community-meeting-etiquette/",
        "https://learn.wordpress.org/course/open-source-basics-and-wordpress/",
        "https://learn.wordpress.org/course/wordpress-community-deputy-training/",
        "https://make.wordpress.org/community/community-deputies/",
        "https://learn.wordpress.org/course/wordcamp-organizer-training/",
        "https://learn.wordpress.org/course/how-decisions-are-made-in-the-wordpress-project/",
        "https://learn.wordpress.org/tutorial-presenter-application/",
        "https://github.com/WordPress/Learn/issues/new?assignees=&labels=Awaiting+Triage%2C+Needs+Subject+Matter+Expert&template=topic-idea.md&title=Topic+Idea%3A+TOPIC+TITLE",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}