{
    "title": "What’s new in Gutenberg 15.6? (19 April) – Make WordPress Core",
    "body": "\nSkip to content\n\n\nLog InRegister \n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\n\n\n\nNewsDownload & ExtendGet WordPressThemesPatternsPluginsMobileHostingOpenverse ↗︎LearnLearn WordPressDocumentationForumsDevelopersWordPress.tv ↗︎CommunityMake WordPressPhoto DirectoryFive for the FutureWordCamp ↗︎Meetups ↗︎Job Board ↗︎AboutAbout WordPressShowcaseEnterpriseGutenberg ↗︎WordPress Swag Store ↗︎Get WordPress\n\n\n\n\n\n\n\n\n\n\n\nSearch in WordPress.org\n\n\n\n\n\n\n\n\n\n\t\tGet WordPress\t\n\n\nMenu\n\nMake WordPress Core\n\n\nTickets\nComponents\nHandbook\nBrowse Source\nTrac Timeline\nCreate a New Ticket\n \n\n\n\nHide welcome box\n\n\n\n\nWelcome!\nThe WordPress coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. development team builds WordPress! Follow this site for general updates, status reports, and the occasional code debate. There’s lots of ways to contribute:\nFound a bugbug A bug is an error or unexpected result. Performance improvements, code optimization, and are considered enhancements, not defects. After feature freeze, only bugs are dealt with, with regressions (adverse changes from the previous version) being the highest priority.? Create a ticket in the bug tracker.\nWant to contribute? Get started quickly with tickets marked as good first bugs for new contributors or join a bug scrub. There’s more on the reports page, like patches needing testing, and on feature projects page.\nOther questions? Here is a detailed handbook for contributors, complete with tutorials.\n\n\nCommunication\nCore uses Slack for real-time communication. Contributors live all over the world, so there are discussions happening at all hours of the day.\nCore development meetings are every Wednesday at 20:00 UTC in the #core channel on Slack. Anyone can join and participate or listen in!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nBirgit Pauli-Haack\n\n6:23 pm on April 19, 2023 \n\n\n\nTags: block-editor ( 80 ), core-editor ( 624 ), gutenberg ( 414 ), gutenberg-new ( 141 )   \n\t\t\t\t\n\nWhat’s new in Gutenberg 15.6? (19 April)\n\n\n“What’s new in GutenbergGutenberg The Gutenberg project is the new Editor Interface for WordPress. The editor improves the process and experience of creating new content, making writing rich content much simpler. It uses ‘blocks’ to add richness rather than shortcodes, custom HTML etc. https://wordpress.org/gutenberg/…” posts (labeled with the #gutenberg-new tag) are posted following every Gutenberg release on a biweekly basis, showcasing new features included in each release. As a reminder, here’s an overview of different ways to keep up with Gutenberg and the Site Editor project (formerly called Full Site Editing).\nGutenberg 15.6 has been released and is available for download! \nThe latest version of the Gutenberg pluginPlugin A plugin is a piece of software containing a group of functions that can be added to a WordPress website. They can extend functionality or add new features to your WordPress websites. WordPress plugins are written in the PHP programming language and integrate seamlessly with WordPress. These can be free in the WordPress.org Plugin Directory https://wordpress.org/plugins/ or can be cost-based plugin from a third-party includes small quality of life enhancements and many bugbug A bug is an error or unexpected result. Performance improvements, code optimization, and are considered enhancements, not defects. After feature freeze, only bugs are dealt with, with regressions (adverse changes from the previous version) being the highest priority. fixes. The new experimental Details blockBlock Block is the abstract term used to describe units of markup that, composed together, form the content or layout of a webpage using the WordPress editor. The idea combines concepts of what in the past may have achieved with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience. is introduced early for community feedback, and more presets come to coreCore Core is the set of software required to run WordPress. The Core Development Team builds WordPress. blocks for spacing and border controls. In the Site Editor, a theme’s style variations are now also available in the left sidebarSidebar A sidebar in WordPress is referred to a widget-ready area used by WordPress themes to display information that is not a part of the main content. It is not always a vertical column on the side. It can be a horizontal rectangle below or above the content area, footer, header, or any where in the theme. to enable faster updates. Gutenberg 15.6 includes a total of 112 PRs, authored by 45 contributors, 7 of which were new contributors! \nDetails block, experimental\nSpacer Block gets spacing presets\nStyle variations in browse mode\nOther notable highlights\nChangelog\nContributors\nDetails block, experimental\nOccasionally, you want to hide content until the reader is ready to receive it. This could be spoiler content in a movie review, the transcript of a podcast episode, or a video recording in a blogblog (versus network, site) post. With the new Details block, you can now publish hidden content that opens with a click on the arrow. It’s the first version of the block, and it is behind an experimental feature flag. To test this new functionality, visit Gutenberg → Experiments screen in the WordPress adminadmin (and super admin) and enable the Details block option. This block is still being worked on, and it might change before coming out of experiments. Feedback is encouraged.\nSpacer Block gets spacing presets\nSpacing presets were added to Dimension controls in WordPress 6.1 to make controlling space in a theme easier and provide a simplified user experience. This functionality also allows theme developers to employ fluid spacing. \nSince the introduction of spacing presets, it became clear from community feedback that spacing presets should also be available for the Height control in the Spacer block. This enhancementenhancement Enhancements are simple improvements to WordPress, such as the addition of a hook, a new feature, or an improvement to an existing feature. in 15.6 gives theme developers much more flexibility over how spacing is applied throughout a site and enables fluid Spacer blocks! \nHere’s a quick example of what fluid spacing presets might look like when defined in theme.jsonJSON JSON, or JavaScript Object Notation, is a minimal, readable format for structuring data. It is used primarily to transmit data between a server and web application, as an alternative to XML. using clamp(). You can learn more about fluid spacing and typography in the article Intrinsic design, theming, and rethinking how to design with WordPress over on the WordPress Developer Blog.\n{\n\t\"$schema\": \"https://schemas.wp.org/trunk/theme.json\",\n\t\"version\": 2,\n\t\"settings\": {\n\t\t\"spacing\": {\n\t\t\t\"spacingScale\": {\n\t\t\t\t\"steps\": 0\n\t\t\t},\n\t\t\t\"spacingSizes\": [\n\t\t\t\t{\n\t\t\t\t\t\"size\": \"clamp(1.5rem, 5vw, 2rem)\",\n\t\t\t\t\t\"slug\": \"30\",\n\t\t\t\t\t\"name\": \"1\"\n\t\t\t\t},\n\t\t\t\t{\n\t\t\t\t\t\"size\": \"clamp(1.8rem, 1.8rem + ((1vw - 0.48rem) * 2.885), 3rem)\",\n\t\t\t\t\t\"slug\": \"40\",\n\t\t\t\t\t\"name\": \"2\"\n\t\t\t\t},\n\t\t\t\t{\n\t\t\t\t\t\"size\": \"clamp(2.5rem, 8vw, 4.5rem)\",\n\t\t\t\t\t\"slug\": \"50\",\n\t\t\t\t\t\"name\": \"3\"\n\t\t\t\t}\n\t\t\t]\n\t\t}\n\t}\n}\nStyle variations in browse mode\nWith Gutenberg 15.6, the theme’s style variations are now accessible from the left menu in the Site Editor, together with templates, template parts, and navigation menuNavigation Menu A theme feature introduced with Version 3.0. WordPress includes an easy to use mechanism for giving various control options to get users to click from one place to another on a site. items. This change makes it easier to access style variations and pick your favorite. Clicking “Edit style” opens the editor with the Styles panel active, providing quick access to the additional style controls like typography and color.\nOther notable highlights\nWith 15.6, the Cover block includes all border-related design tools. This was a much-requested enhancement by theme developers, which reduces the need for custom block styling.  \nNow, when the Global Styles panel is open in the Site Editor, clicking on any block in the canvas will automatically open the design tools for the corresponding block in the Styles panel. This enhancement will help speed up your workflow and provide fast access to design tools.\nThree more visual inconsistencies were smoothened. The visualizer that shows padding and margin changes around blocks now works consistently for larger numbers. In the List View, you can now successfully drop blocks below a Group block, and the Drop Zone in the canvas now has smoother animation. \nChangelog\nEnhancements\nBlock Library\nA margin option is added to the Embedded preview block. (39384)\nAdd blockGap as a default control on Columns/Column blocks. (49526)\nAdd color tools to the Time to Read block. (49496)\nAdd spacing presets to the Spacer block. (44002)\nCover: Add border support using ResizableBox via BlockPopover. (41153)\nBlock Editor\nAdd support for hiding breadcrumbs in the Site Editor. (49518)\nHide page list on single page list menus. (48725)\nSmall improvements for the Document Overview labeling. (49555)\nAdd a rootClientId prop. (49475)\nGlobal Styles\nAdd styles section to the browse mode sidebar. (49014)\nShow child layout controls by default. (49389)\nComponents\nGlobal Styles: Link to the block type panel when selecting a block with Styles open. (49350)\nTreeSelect: Remove margin overrides and add new opt-in prop. (47515)\nUpdate media and video icons. (49523)\nAccessibilityAccessibility Accessibility (commonly shortened to a11y) refers to the design of products, devices, services, or environments for people with disabilities. The concept of accessible design ensures both “direct access” (i.e. unassisted) and “indirect access” meaning compatibility with a person’s assistive technology (for example, computer screen readers). (https://en.wikipedia.org/wiki/Accessibility)\nAdd missing focus style to start template options previews. (49334)\nConsistent labels for the WP logo and back links. (49659)\nExperiments\nAdd a command center to the site editor. (49330)\nAdd Details/summary block. (45055)\nBug Fixes\nBlock Library\nColumns: Prevent removal of locked columns from the column count change UIUI User interface. (49530)\nCover:\nFixed background causes image to be zoomed in on Safari browser on iPad. (48981)\nFix integration tests for ResizableBox via BlockPopover. (49497)\nMerge block and global styles. (49434)\n\nNavigation:\nFix exhaustive deps warning. (49291)\nFix fallback not rendering. (49576)\n\nImage block: Fix image size control percentage selection. (49628)\nPost Featured ImageFeatured image A featured image is the main image used on your blog archive page and is pulled when the post or page is shared on social media. The image can be used to display in widget areas on your site or in a summary list of posts.:\nDon’t display the scale control when the aspect ratio is original. (48894)\nShow all controls when in context without postId. (49609)\n\nPost ExcerptExcerpt An excerpt is the description of the blog post or page that will by default show on the blog archive page, in search results (SERPs), and on social media. With an SEO plugin, the excerpt may also be in that plugin’s metabox.: Ensure the postId from the block context is used to get_the_excerpt. (49495)\nShortcodeShortcode A shortcode is a placeholder used within a WordPress post, page, or widget to insert a form or function generated by a plugin in a specific location on your site.: Prevent external styling of editing UI. (49723)\nTime To Read: Fix untranslated on the front end. (49704)\nAvoid empty Gallery block error. (49557)\nSite Editor\nDecode the site title properly. (49685)\nShow UI to update custom links on the sidebar navigation. (48939)\nNavigate to editor when clicking Edit in a template part. (49604)\nUpdate the template title in the details panel. (49487)\nUse the keyboard shortcuts package for the command center. (49680)\nFix the site editor loading in multi-site installs. (49861)\nGlobal Styles\nBlock Level Settings: Remove WP filters in Gutenberg. (49598)\nBorder Panel: Move global styles forcing of split borders to relevant panel’s onChange. (49603)\nRemove the pointer cursor on the style variation preview. (49573)\nStyle Variation Picker: Restore pointer cursor when withHover is in use. (49596)\nBlock Editor\nDropZone: Smooth animation. (49517)\nList View: Allow dragging underneath collapsed non-empty container blocks. (49390)\nList View: Update drop indicator line to be 4px high with a white border. (49462)\nTweak remove block label to make it simpler. (49529)\nFix redirected links to user documents. (49537)\nMake InspectorControls tab labels translatable. (49665)\nUpdate redirected support link. (49533)\nReusable Block: RTL styles don’t get added to the wp-reusable-blocks stylesheet. (49632)\nFix padding and margin visualizer accuracy. (49422)\nLayout\nOnly show alignment info when parent layout is constrained. (49703)\nTry reducing the specificity of layout margin rules. (47858)\nPost Editor\nAllow root padding setting to affect padding of post title. (49460)\nTry fixing post editor layout for wide/full Post Content blocks. (49565)\nAllow horizontal scroll in panels in the post editor. (49611)\nComponents\nFix inbetween-inserter position in RTL languages. (49683)\nUpdate Edit icon to be more consistent with other icons. (49512)\nUpdate search icon to be optically more balanced. (49425)\nUpdate some icons to address aliasing on high-res screens. (49381)\nPerformance\nContinued the work refactor away from Lodash usages to reduce the build size(49725, 49724, 49638, 49654, 49639, 49637, 49727)\nDocumentation\nAdd section about integration testing to testing documentation. (49454)\nAdd some documentation about the Styles UI components. (49720)\nFix Create a Block Tutorial link on blocks package README.md. (49562)\nFix end-to-end command typos. (49669)\nFix line break issue in Schemas and Content Models section. (44768)\nFixes some typos. (49472)\ngetBlockOrder() – use core/block-editor instead of core/editor. (49474)\nFix Xcode spelling across the codebase. (49625)\nRemove the documentation for Playwright configuration override. (49660)\nStreamlining the New Release Issue Template. (49618)\nUpdate components package’s CHANGELOG. (49586)\nUpdate documentation for setGroupingBlockName. (49670)\nCode Quality\nComponents\nShip TypeScript types. (49229)\nSimplify CustomGradientPicker’s utility props. (49588)\nGlobal Styles\nRefactor the effects panel as a generic UI Styles component. (49571)\nRefactor the filters (duotone) panel as a generic UI Styles component. (49577)\nBlock Library\nAdd automated tests for Nav block editable list view. (49433)\nCover: Avoid adding empty background image URLURL A specific web address of a website or web page on the Internet, such as a website’s URL www.wordpress.org. (49477)\nRemove editor block styles leftovers. (49567)\nSite Editor\nRemove unused keyboard shortcut registration code. (49553)\nFix Site Editor isFeatureActive deprecation. (49545)\nTools\nTesting\nAdd tests for some of the drag and drop logic. (49631)\nAdds to gitignore a playwright.config.override.ts entry. (49329)\nCover block: Fix failing test. (49455)\nWorkflows: Run PHPPHP The web scripting language in which WordPress is primarily architected. WordPress requires PHP 5.6.20 or higher unit tests also against current WP – 1. (46983)\ne2e: Fix flaky columns test. (49676)\ntest: Add Writing Flow tests. (49352)\nBuild Tooling\nAdd workflow to check for expected wordpress/components CHANGELOG updates. (49443)\nDocgen: Replace line breaks with spaces and remove line-ending hyphens. (49635)\nConvert wp data controls to typescript. (49647)\nFirst time contributors\nThe following PRs were merged by first time contributors:\n@cawa-93: List View: Allow horizontal scroll in panels in the post editor. (49611)\n@DustyReagan: Cover Block: Fixed background causes image to be zoomed in on Safari browser on iPad. (48981)\n@eduwass: Docs: Fix end-to-end command typos. (49669)\n@HILAYTRIVEDI: A margin option is added to the Embeded preview block. (39384)\n@mokagio: Fix Xcode spelling across the codebase. (49625)\n@nefeline: Post excerpt > Ensure the postId from the block context is used to get_the_excerpt. (49495)\n@thealexandrelara: Docs: Fix Create a Block Tutorial link on blocks package README.md. (49562)\nContributors\nThe following contributors merged PRs in this release:\n@aaronrobertshaw @afercia @andrewserong @aristath @aurooba @brookewp @carolinan @cawa-93 @chad1008 @ciampo @dcalhoun @derekblank @draganescu @DustyReagan @eduwass @fluiddot @geriux @getdave @glendaviesnz @hellofromtonya @HILAYTRIVEDI @imanish003 @jameskoster @jasmussen @jhnstn @jorgefilipecosta @Mamaduka @mirka @mokagio @nefeline @noahtallen @ntsekouras @ockham @ramonjd @richtabor @ryanwelcher @SavPhill @scruffian @Soean @t-hamano @talldan @tellthemachines @thealexandrelara @tyxla @youknowriad\nProps to @ndiego for co-release leadRelease Lead The community member ultimately responsible for the Release., @joen for visuals assets @priethor, @rich, @annezazu for peer-review\n#block-editor, #core-editor, #gutenberg, #gutenberg-newShare this:TwitterFacebookLogin to Reply\n\n\n\n\n\n\n\nLeave a Reply Cancel replyYou must be logged in to post a comment. \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nPost navigation\n← Status update on the SQLite project Dev Chat Summary, April 19, 2023 →\n\n\n\n\n\n\n\n\nSearch\n\n\n\nEmail Updates\n\n\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\t\t\t\t\tJoin 5,560 other subscribers\t\t\t\t\n\nRecent UpdatesRecent CommentsNo RepliesRecent UpdatesRecent CommentsNo RepliesCurrent Release The current release in progress is WordPress 6.3.\nPlanned future releases are listed on the Project Roadmap.\nFeature projects not tied to specific releases can be found on the Features page.\n\nRegular ChatsNote: All chats happen on Slack.\n\n\n\nWeekly Developer Meetings: Wednesday 20:00 UTC in #core\n\n\nAbout the Dev Chat\n\n\nAgendas | Summaries\n\n\n\n\n\nAPAC Triage Sessions Tuesday 5:00 UTC alternating between #core and #core-editor\n\n\nJavaScript Weekly Chat Tuesday 14:00 UTC in #core-js\n\n\nPerformance Weekly Chat Tuesday 15:00 UTC in #core-performance\n\n\nMultisite Weekly Chat Tuesday 17:00 UTC in #core-multisite\n\n\nREST API Weekly Chat Thursday 18:00 UTC in #core-restapi\n\n\nEditor Weekly Chat Wednesday 14:00 UTC in #core-editor\n\n\nNew Contributors Chat Wednesday 19:00 UTC in #core\n\n\nImages/Media Weekly Chat Thursday 15:00 UTC in #core-media\n\n\nCSS Weekly Chat Thursday 21:00 UTC in #core-css\n\n\nCustomize Weekly Chat Monday 19:00 UTC in #core-customize\n\n\n\n\nSee all meetings → \nRecent Posts and Comments\n\n\n\t\t\tTeam Pledges\n\t\t\n\n1853 people have pledged time to contribute to Core Team efforts! When looking for help on a project or program, try starting by reaching out to them!\t\t\n\n\n\n\n\n\n\nAboutNewsHostingDonateSwag\nDocumentationDevelopersGet InvolvedLearn\nShowcasePluginsThemesPatterns\nWordCampWordPress.TVBuddyPressbbPress\nWordPress.comMattPrivacyPublic Code\n\n\n\n\n\n\n\nWordPress.org\n\n\n \n\n\n\n\nWordPress.org\n\n\n\n \n\n\n\nVisit our Facebook page\nVisit our Twitter account\nVisit our Instagram account\nVisit our LinkedIn account\n\n\n\n\n\n\n \n\n\n\n\nssearch\nccompose new post\nr reply\ne edit\nt go to top\nj go to the next post or comment\nk go to the previous post or comment\no toggle comment visibility\nesc cancel edit post or comment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\t\tPlease enable JavaScript to view this page properly.\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n",
    "links": [
        "#content",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F19%2Fwhats-new-in-gutenberg-15-6-19-april%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://wordpress.org/",
        "https://wordpress.org/news/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/mobile/",
        "https://wordpress.org/hosting/",
        "https://openverse.org/",
        "https://learn.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://wordpress.org/support/forums/",
        "https://developer.wordpress.org/",
        "https://wordpress.tv/",
        "https://make.wordpress.org/",
        "https://make.wordpress.org/",
        "https://wordpress.org/photos/",
        "https://wordpress.org/five-for-the-future/",
        "https://central.wordcamp.org/",
        "https://www.meetup.com/pro/wordpress/",
        "https://jobs.wordpress.net/",
        "https://wordpress.org/about/",
        "https://wordpress.org/about/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/enterprise/",
        "https://wordpress.org/gutenberg/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/download/",
        "https://wordpress.org/download/",
        "#",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/core/reports/",
        "https://make.wordpress.org/core/components/",
        "https://make.wordpress.org/core/handbook/",
        "https://core.trac.wordpress.org/browser",
        "https://core.trac.wordpress.org/timeline",
        "https://login.wordpress.org/?redirect_to=https://core.trac.wordpress.org/newticket",
        "https://wordpress.org/support/bb-login.php?redirect_to=https://core.trac.wordpress.org/newticket",
        "https://core.trac.wordpress.org/tickets/good-first-bugs",
        "https://make.wordpress.org/core/handbook/testing/bug-gardening/",
        "https://make.wordpress.org/core/reports/",
        "https://core.trac.wordpress.org/tickets/needs-testing",
        "https://make.wordpress.org/core/features/",
        "https://make.wordpress.org/core/handbook/",
        "https://make.wordpress.org/chat/",
        "http://time.is/2000_in_UTC",
        "https://wordpress.slack.com/messages/core/",
        "https://make.wordpress.org/chat/",
        "https://profiles.wordpress.org/bph/",
        "https://profiles.wordpress.org/bph/",
        "https://make.wordpress.org/core/tag/block-editor/",
        "https://make.wordpress.org/core/tag/core-editor/",
        "https://make.wordpress.org/core/tag/gutenberg/",
        "https://make.wordpress.org/core/tag/gutenberg-new/",
        "https://wordpress.org/gutenberg/",
        "https://make.wordpress.org/core/tag/gutenberg-new/",
        "https://make.wordpress.org/core/2020/05/20/ways-to-keep-up-with-full-site-editing-fse/",
        "https://make.wordpress.org/updates/2022/11/04/site-editor-a-more-user-friendly-name/",
        "https://wordpress.org/plugins/gutenberg/",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#details-block-experimental",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#spacer-block-gets-spacing-presets",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#style-variations-in-browse-mode",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#other-notable-highlights",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#changelog",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#contributors",
        "https://github.com/WordPress/gutenberg/pull/45055",
        "https://developer.wordpress.org/themes/advanced-topics/theme-json/#custom-spacing-sizes",
        "https://github.com/WordPress/gutenberg/pull/44002",
        "https://developer.wordpress.org/news/2023/02/intrinsic-design-theming-and-rethinking-how-to-design-with-wordpress/",
        "https://developer.wordpress.org/news/",
        "https://github.com/WordPress/gutenberg/pull/49014",
        "https://github.com/WordPress/gutenberg/pull/41153",
        "https://github.com/WordPress/gutenberg/pull/49350",
        "https://github.com/WordPress/gutenberg/pull/49422",
        "https://github.com/WordPress/gutenberg/pull/49390",
        "https://github.com/WordPress/gutenberg/pull/49517",
        "https://github.com/WordPress/gutenberg/pull/39384",
        "https://github.com/WordPress/gutenberg/pull/49526",
        "https://github.com/WordPress/gutenberg/pull/49496",
        "https://github.com/WordPress/gutenberg/pull/44002",
        "https://github.com/WordPress/gutenberg/pull/41153",
        "https://github.com/WordPress/gutenberg/pull/49518",
        "https://github.com/WordPress/gutenberg/pull/48725",
        "https://github.com/WordPress/gutenberg/pull/49555",
        "https://github.com/WordPress/gutenberg/pull/49475",
        "https://github.com/WordPress/gutenberg/pull/49014",
        "https://github.com/WordPress/gutenberg/pull/49389",
        "https://github.com/WordPress/gutenberg/pull/49350",
        "https://github.com/WordPress/gutenberg/pull/47515",
        "https://github.com/WordPress/gutenberg/pull/49523",
        "https://github.com/WordPress/gutenberg/pull/49334",
        "https://github.com/WordPress/gutenberg/pull/49659",
        "https://github.com/WordPress/gutenberg/pull/49330",
        "https://github.com/WordPress/gutenberg/pull/45055",
        "https://github.com/WordPress/gutenberg/pull/49530",
        "https://github.com/WordPress/gutenberg/pull/48981",
        "https://github.com/WordPress/gutenberg/pull/49497",
        "https://github.com/WordPress/gutenberg/pull/49434",
        "https://github.com/WordPress/gutenberg/pull/49291",
        "https://github.com/WordPress/gutenberg/pull/49576",
        "https://github.com/WordPress/gutenberg/pull/49628",
        "https://github.com/WordPress/gutenberg/pull/48894",
        "https://github.com/WordPress/gutenberg/pull/49609",
        "https://github.com/WordPress/gutenberg/pull/49495",
        "https://github.com/WordPress/gutenberg/pull/49723",
        "https://github.com/WordPress/gutenberg/pull/49704",
        "https://github.com/WordPress/gutenberg/pull/49557",
        "https://github.com/WordPress/gutenberg/pull/49685",
        "https://github.com/WordPress/gutenberg/pull/48939",
        "https://github.com/WordPress/gutenberg/pull/49604",
        "https://github.com/WordPress/gutenberg/pull/49487",
        "https://github.com/WordPress/gutenberg/pull/49680",
        "https://github.com/WordPress/gutenberg/pull/49861",
        "https://github.com/WordPress/gutenberg/pull/49598",
        "https://github.com/WordPress/gutenberg/pull/49603",
        "https://github.com/WordPress/gutenberg/pull/49573",
        "https://github.com/WordPress/gutenberg/pull/49596",
        "https://github.com/WordPress/gutenberg/pull/49517",
        "https://github.com/WordPress/gutenberg/pull/49390",
        "https://github.com/WordPress/gutenberg/pull/49462",
        "https://github.com/WordPress/gutenberg/pull/49529",
        "https://github.com/WordPress/gutenberg/pull/49537",
        "https://github.com/WordPress/gutenberg/pull/49665",
        "https://github.com/WordPress/gutenberg/pull/49533",
        "https://github.com/WordPress/gutenberg/pull/49632",
        "https://github.com/WordPress/gutenberg/pull/49422",
        "https://github.com/WordPress/gutenberg/pull/49703",
        "https://github.com/WordPress/gutenberg/pull/47858",
        "https://github.com/WordPress/gutenberg/pull/49460",
        "https://github.com/WordPress/gutenberg/pull/49565",
        "https://github.com/WordPress/gutenberg/pull/49611",
        "https://github.com/WordPress/gutenberg/pull/49683",
        "https://github.com/WordPress/gutenberg/pull/49512",
        "https://github.com/WordPress/gutenberg/pull/49425",
        "https://github.com/WordPress/gutenberg/pull/49381",
        "https://github.com/WordPress/gutenberg/pull/49725",
        "https://github.com/WordPress/gutenberg/pull/49724",
        "https://github.com/WordPress/gutenberg/pull/49638",
        "https://github.com/WordPress/gutenberg/pull/49654",
        "https://github.com/WordPress/gutenberg/pull/49639",
        "https://github.com/WordPress/gutenberg/pull/49637",
        "https://github.com/WordPress/gutenberg/pull/49727",
        "https://github.com/WordPress/gutenberg/pull/49454",
        "https://github.com/WordPress/gutenberg/pull/49720",
        "https://github.com/WordPress/gutenberg/pull/49562",
        "https://github.com/WordPress/gutenberg/pull/49669",
        "https://github.com/WordPress/gutenberg/pull/44768",
        "https://github.com/WordPress/gutenberg/pull/49472",
        "https://github.com/WordPress/gutenberg/pull/49474",
        "https://github.com/WordPress/gutenberg/pull/49625",
        "https://github.com/WordPress/gutenberg/pull/49660",
        "https://github.com/WordPress/gutenberg/pull/49618",
        "https://github.com/WordPress/gutenberg/pull/49586",
        "https://github.com/WordPress/gutenberg/pull/49670",
        "https://github.com/WordPress/gutenberg/pull/49229",
        "https://github.com/WordPress/gutenberg/pull/49588",
        "https://github.com/WordPress/gutenberg/pull/49571",
        "https://github.com/WordPress/gutenberg/pull/49577",
        "https://github.com/WordPress/gutenberg/pull/49433",
        "https://github.com/WordPress/gutenberg/pull/49477",
        "https://github.com/WordPress/gutenberg/pull/49567",
        "https://github.com/WordPress/gutenberg/pull/49553",
        "https://github.com/WordPress/gutenberg/pull/49545",
        "https://github.com/WordPress/gutenberg/pull/49631",
        "https://github.com/WordPress/gutenberg/pull/49329",
        "https://github.com/WordPress/gutenberg/pull/49455",
        "https://github.com/WordPress/gutenberg/pull/46983",
        "https://github.com/WordPress/gutenberg/pull/49676",
        "https://github.com/WordPress/gutenberg/pull/49352",
        "https://github.com/WordPress/gutenberg/pull/49443",
        "https://github.com/WordPress/gutenberg/pull/49635",
        "https://github.com/WordPress/gutenberg/pull/49647",
        "https://github.com/cawa-93",
        "https://github.com/WordPress/gutenberg/pull/49611",
        "https://github.com/DustyReagan",
        "https://github.com/WordPress/gutenberg/pull/48981",
        "https://github.com/eduwass",
        "https://github.com/WordPress/gutenberg/pull/49669",
        "https://github.com/HILAYTRIVEDI",
        "https://github.com/WordPress/gutenberg/pull/39384",
        "https://github.com/mokagio",
        "https://github.com/WordPress/gutenberg/pull/49625",
        "https://github.com/nefeline",
        "https://github.com/WordPress/gutenberg/pull/49495",
        "https://github.com/thealexandrelara",
        "https://github.com/WordPress/gutenberg/pull/49562",
        "https://github.com/aaronrobertshaw",
        "https://github.com/afercia",
        "https://github.com/andrewserong",
        "https://github.com/aristath",
        "https://github.com/aurooba",
        "https://github.com/brookewp",
        "https://github.com/carolinan",
        "https://github.com/cawa-93",
        "https://github.com/chad1008",
        "https://github.com/ciampo",
        "https://github.com/dcalhoun",
        "https://github.com/derekblank",
        "https://github.com/draganescu",
        "https://github.com/DustyReagan",
        "https://github.com/eduwass",
        "https://github.com/fluiddot",
        "https://github.com/geriux",
        "https://github.com/getdave",
        "https://github.com/glendaviesnz",
        "https://github.com/hellofromtonya",
        "https://github.com/HILAYTRIVEDI",
        "https://github.com/imanish003",
        "https://github.com/jameskoster",
        "https://github.com/jasmussen",
        "https://github.com/jhnstn",
        "https://github.com/jorgefilipecosta",
        "https://github.com/Mamaduka",
        "https://github.com/mirka",
        "https://github.com/mokagio",
        "https://github.com/nefeline",
        "https://github.com/noahtallen",
        "https://github.com/ntsekouras",
        "https://github.com/ockham",
        "https://github.com/ramonjd",
        "https://github.com/richtabor",
        "https://github.com/ryanwelcher",
        "https://github.com/SavPhill",
        "https://github.com/scruffian",
        "https://github.com/Soean",
        "https://github.com/t-hamano",
        "https://github.com/talldan",
        "https://github.com/tellthemachines",
        "https://github.com/thealexandrelara",
        "https://github.com/tyxla",
        "https://github.com/youknowriad",
        "https://profiles.wordpress.org/ndiego/",
        "https://profiles.wordpress.org/joen/",
        "https://profiles.wordpress.org/priethor/",
        "https://profiles.wordpress.org/rich/",
        "https://profiles.wordpress.org/annezazu/",
        "https://make.wordpress.org/core/tag/block-editor/",
        "https://make.wordpress.org/core/tag/core-editor/",
        "https://make.wordpress.org/core/tag/gutenberg/",
        "https://make.wordpress.org/core/tag/gutenberg-new/",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/?share=twitter",
        "https://make.wordpress.org/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/?share=facebook",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F19%2Fwhats-new-in-gutenberg-15-6-19-april%2F%23respond&locale=en_US",
        "/core/2023/04/19/whats-new-in-gutenberg-15-6-19-april/#respond",
        "https://login.wordpress.org/?redirect_to=https%3A%2F%2Fmake.wordpress.org%2Fcore%2F2023%2F04%2F19%2Fwhats-new-in-gutenberg-15-6-19-april%2F&locale=en_US",
        "https://akismet.com/privacy/",
        "https://make.wordpress.org/core/2023/04/19/status-update-on-the-sqlite-project/",
        "https://make.wordpress.org/core/2023/04/19/dev-chat-summary-april-19-2023/",
        "#",
        "https://make.wordpress.org/core/",
        "https://make.wordpress.org/core/?o2_recent_comments=1",
        "https://make.wordpress.org/core/?replies=none",
        "https://make.wordpress.org/core/6-3/",
        "https://wordpress.org/about/roadmap/",
        "https://make.wordpress.org/core/features/",
        "https://make.wordpress.org/chat/",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T2000",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "http://make.wordpress.org/core/weekly-developer-chats/",
        "http://make.wordpress.org/core/tag/agenda",
        "http://make.wordpress.org/core/tag/summary",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T0500",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "https://wordpress.slack.com/archives/C02QB2JS7",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1400",
        "https://wordpress.slack.com/archives/C5UNMSU4R",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1500",
        "https://wordpress.slack.com/archives/C02KGN5K076",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230502T1700",
        "https://wordpress.slack.com/archives/C03BVB47S",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T1800",
        "https://wordpress.slack.com/archives/C02RQC26G",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T1400",
        "https://wordpress.slack.com/archives/C02QB2JS7",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230503T1900",
        "https://wordpress.slack.com/archives/C02RQBWTW",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T1500",
        "https://wordpress.slack.com/archives/C02SX62S6",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230504T2100",
        "https://wordpress.slack.com/archives/CQ7V4966Q",
        "https://www.timeanddate.com/worldclock/fixedtime.html?iso=20230508T1900",
        "https://wordpress.slack.com/archives/C0381N237",
        "https://make.wordpress.org/meetings/",
        "https://make.wordpress.org/core/pledges/",
        "https://wordpress.org/about/",
        "https://wordpress.org/news/",
        "https://wordpress.org/hosting/",
        "https://wordpressfoundation.org/donate/",
        "https://mercantile.wordpress.org/",
        "https://wordpress.org/documentation/",
        "https://developer.wordpress.org/",
        "https://make.wordpress.org/",
        "https://learn.wordpress.org/",
        "https://wordpress.org/showcase/",
        "https://wordpress.org/plugins/",
        "https://wordpress.org/themes/",
        "https://wordpress.org/patterns/",
        "https://central.wordcamp.org/",
        "https://wordpress.tv/",
        "https://buddypress.org/",
        "https://bbpress.org/",
        "https://wordpress.com/?ref=wporg-footer",
        "https://ma.tt/",
        "https://wordpress.org/about/privacy/",
        "https://publiccode.eu/",
        "https://wordpress.org/",
        "https://wordpress.org/",
        "https://www.facebook.com/WordPress/",
        "https://twitter.com/WordPress",
        "https://www.instagram.com/wordpress/",
        "https://www.linkedin.com/company/wordpress"
    ]
}