{
    "title": "Graduate Admissions - California State University Fullerton - Acalog ACMS™",
    "body": "\n\n\nSkip to Content\n\n\n\n\n\n\n\n\n\n\n\n\n\n California State University, Fullerton\n\n\n\n\n\n\n\n\n\n\n\n\nCourse Descriptions\n\n\nDegree Programs\n\n\nGeneral Education\n\n\nUndergraduate Admissions\n\n\nGraduate Admissions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    This site is maintained by   Academic Programs.\n\n\n                    To report problems or comments with this site, please contact   catalog@fullerton.edu.   Privacy Policy.\n                    © California State University, Fullerton. All Rights Reserved.\n                \n\n                    CSUF is committed to ensuring equal accessibility to our users.\n                    Let us know about any accessibility problems you encounter using this website.\n                \n\n\n\n\n                Additional Resources\n            \n\n\n                    Saftey & Security\n                \n\n\nEmergency Information\n\n\nUniversity Police\n\n\nAnnual Security Report (Clery)\n\n\n\n\n\n                    CSUF Information\n                \n\n\nContacts & Addresses\n\n\nCampus A-Z Index\n\n\nCampus Map\n\n\nCSU - Office of the Chancellor\n\n\n\n\n\n                    Accessibility & Equity\n                \n\n\nTitle IX\n\n\nWeb Accessibilty - ATI\n\n\nReport an ATI Issue\n\n\nAdobe Reader\n\n\nMicrosoft Viewers\n\n\n\n\n\n\n\n\n\n   \n\tCalifornia State University Fullerton\n\n\n\n   \n\n\n\n\n \n\n \n\t\t\t\tApr 29, 2023\t\t\t\n\n \n\n\n\n\n2022-2023 University Catalog \n\n\n\n\n\n\n\nSelect a Catalog\n 2023-2024 University Catalog\n2022-2023 University Catalog [ARCHIVED CATALOG]\n2021-2022 University Catalog [ARCHIVED CATALOG]\n2020-2021 University Catalog [ARCHIVED CATALOG]\n2019-2020 University Catalog [ARCHIVED CATALOG]\n2018-2019 University Catalog [ARCHIVED CATALOG]\n2017-2018 University Catalog [ARCHIVED CATALOG]\n2016-2017 University Catalog [ARCHIVED CATALOG]\n2015-2016 University Catalog [ARCHIVED CATALOG]\n2013-2015 University Catalog [ARCHIVED CATALOG]\n2021-2022 Faculty Handbook [ARCHIVED CATALOG]\n2018-2019 Faculty Handbook [ARCHIVED CATALOG]\n2022-2023 Faculty Handbook\n\n\n\n  \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGlobal Search\n\n\n\n\n\n\n\n\nCatalog Search \n\nChoose Search Location\n\n\n\nSelect an option\nCourses\nPrograms\nColleges/Departments\nOther Content\nEntire Catalog\n\n\n\n\n\n\n\nSearch Keyword Field\n\n\n\n\nWhole Word/Phrase\n\n\n\n\n\t\t\t\t\tAdvanced Search\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCatalog Navigation\n\n\n\n\n  Catalog Home\n  President’s Message \n  Academic Calendar \n  The California State University \n  About the University \n  Administration \n \n  College of the Arts \n  College of Business and Economics \n  College of Communications \n  College of Education \n  College of Engineering and Computer Science \n  College of Health and Human Development \n  College of Humanities and Social Sciences \n  College of Natural Sciences and Mathematics \n \n  Degree Programs \n  Course Descriptions \n \n  University Requirements and Regulations \n  Graduate Regulations \n  Admissions \n  Academic Advising \n  Registration \n  Academic Departments and Programs \n  Special Academic Programs \n  Academic Affairs Support \n  Student Affairs Support \n  Information Technology \n \n  Faculty and Administration \n  Emeriti \n \n  Archived Catalogs \n\n\n\n\n\n\n\n\n\n\n\n\n   My Portfolio\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHELP\n2022-2023 University Catalog [ARCHIVED CATALOG] \n\t\t\t\t\t\t\t  Graduate Admissions\t\t\t\t\t\t\t  \nPrint-Friendly Page (opens a new window)\n\n\nFacebook this Page (opens a new window)\n\n\n\n\nTweet this Page (opens a new window)\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Responsibility\nApplication Procedures\nAdmission Procedures\n\n\n \n\n\n\n\nStudent Responsibility\nEach student has a responsibility to understand and apply the information within the University Catalog to ensure timely degree completion and compliance with all university policies. Students should direct specific questions to their graduate advisor or visit the Graduate Studies website for more information.   \nApplication Procedures\nApplicants for post-baccalaureate, certificate, credential, master’s or doctoral programs must submit an application by the program deadline on calstate.edu/apply. Each application requires a $70 nonrefundable application fee. Programs may require additional materials for admission. In some cases, application or testing requirements may be different from what is listed in the catalog. Please visit the program website to find the current admissions requirements and contact the graduate adviser for more information.\nApplication Deadlines\nThe application period for admission opens on October 1 for fall admission and August 1 for spring admission. Deadlines vary for individual programs based upon program cycles and capacities. Check the website of the specific program of interest for current deadline information.\nTranscripts\nOfficial transcripts from all colleges or universities previously attended must be submitted to CSUF. Transcripts that include transfer credit from a different institution is not sufficient evidence of coursework taken elsewhere. Transcripts should be sent directly to the university Admissions Office in a sealed envelope or electronically (preferable) by the college or university. Current CSUF students or alumni do not need to request official transcripts from CSUF. Once the university receives a student’s documents, they become official records of CSUF and cannot be returned or reissued. International transcripts must be accompanied by certified English translations. \nTests\nSome programs may require a standardized test, like the Graduate Record Examination (GRE) or the Graduate Management Admission Test (GMAT). Test requirements vary by program, please check the program requirements to determine if test scores are needed.\nEnglish Language Requirement\nAll graduate and post-baccalaureate applicants, regardless of citizenship, whose native language is not English and whose preparatory education was principally in a language other than English, must submit proof of English proficiency. Information about English proficiency requirements can be found on the  International Admissions website. The requirements may vary depending on the student’s program of interest.\nInternational Students\nSee procedures outlined in the international student portion of the Admissions  section of this catalog.\nSecond Master’s Degree or Concentration\nApplication for admission to graduate standing in a second degree program or concentration will be accepted only after the first degree has been awarded. Students can only complete one master’s degree at a time. Units used for the first degree or concentration may not be applied to the second. Students who have completed a master’s degree at CSUF in one concentration and wish to complete another concentration within the same degree program will not be awarded a second degree; instead, only a transcript notation will be added listing the completion of the second concentration. As such, second concentration students do not have to pay the graduation and diploma fee a second time.\nAdmission Procedures\nFollowing completion of application procedures and subsequent review of the student’s eligibility by the Admissions Office and appropriate academic unit, the student will be notified by the Admissions Office with an official admission decision. Written email notice from the Admissions Office is the only valid proof of admission. Academic advising prior to admission is tentative and should not be construed as granting official admission to a program or establishing requirements for the degree.\nAdmission to the Master’s Degree Programs\nThe minimum requirements for admission to graduate and post-baccalaureate studies at a CSU campus are in accordance with university regulations as well as Title 5, Chapter 1, Subchapter 3 of the California Code of Regulations. \nMaster’s students should: 1) have completed a four-year college course of study and hold an acceptable baccalaureate degree from an institution accredited by a regional accrediting association, or shall have completed equivalent academic preparation as determined by appropriate campus authorities; 2) be in good academic standing at the last college or university attended; 3) have earned a grade-point average of at least 2.5 on the last degree completed by the candidate or have attained a grade-point average of at least 2.5 (A=4.0) in the last 60 semester (90 quarter) units attempted; and 4) satisfactorily meet the professional, personal, scholastic and other standards for graduate study, including qualifying examinations, as appropriate to the program of study.\nAdmission to the Ed.D. Program\nMinimum requirements for admission to the Ed.D. program are: 1) an earned baccalaureate degree and master’s degree from an accredited institution or institutions of higher education; 2) good academic standing at the last institution of higher education attended; 3) a grade-point average minimum of 3.0 in upper-division and graduate study; 4) demonstrated sufficient preparation for, experience in and potential for educational leadership, including: successful experience in leadership in school, post-secondary or community contexts, or policy leadership; academic excellence; problem-solving ability; technological proficiency; interest in critically assessing current educational policies and practices; and interest in improving current educational policies and practices. Admission shall be granted on a competitive basis.\nAdmission to the DNP Program\nThe minimum requirements for admission to the DNP program are: 1) an earned baccalaureate degree and master’s degree from an accredited institution or institutions, the latter either in (a) nursing or a health-related field (i.e., public health or health administration) and national certification as an APRN (CNM, CNS, CRNA or NP) for preparation as clinicians, leaders or educators (direct care track), or in (b) nursing leadership or administration, nursing education or community health nursing for preparation as nurse educators or nurse leaders (indirect care track); 2) a grade-point average minimum of 3.5 (on a 4.0 scale) in all graduate coursework; 3) in good standing at the last institution of higher education attended; 4) current, unrestricted California RN licensure or eligibility and advanced practice national certification and national furnishing/prescriptive authority, if applicable. For additional admissions requirements, see CSUF’s School of Nursing website.\nAdmission Classification Categories\nStudents who meet the minimum requirements for graduate and post-baccalaureate studies may be considered for admission in one of the four following categories below:\nGraduate Classified - To pursue a graduate degree, applicants are required to fulfill all of the professional, personal, scholastic, and other standards, including qualifying examinations, prescribed by the campus. A student’s status is changed to classified standing when an official Study Plan has been approved by the associate vice president for academic programs (or designee). It is the student’s responsibility to initiate the request for classified standing by making an appointment with the departmental graduate adviser to develop a Study Plan.\nClassified standing is granted when: 1) all prerequisites have been satisfactorily completed; 2) the official Study Plan has been developed and signed by the graduate program adviser; and 3) the Study Plan is sent to the Office of Graduate Studies and approved by the associate vice president for academic programs (or designee).\nGraduate Conditionally Classified - Applicants may be admitted to a graduate degree program in this category if, in the opinion of appropriate campus authority, the applicant needs addition coursework or academic prepration.\nThis category applies to students with a graduate degree objective. To qualify for admission in conditionally classified standing, applicants must: 1) meet the general admission requirements; and 2) meet any additional requirements of the particular program, including a favorable recommendation from the academic unit.\nAn applicant who needs additional coursework or academic preparation may be considered for admission in conditionally classified standing with the approval and recommendation of the academic unit. A student admitted in conditionally classified standing may subsequently be granted classified standing in a graduate degree program if professional, personal, scholastic or other standards, including qualifying examinations are met.\nDetermination of additional coursework and adadmic preparation is made by the academic unit. For specific information on prerequisites to classified standing, refer to the graduate degree requirements described in the appropriate academic departmental section of this catalog. \nPost-Baccalaureate Classified  - Credential or certificate program students will be required to satisfy additional professional, personal, scholastic and other standards, including qualifying examinations, prescribed by the campus.\nTo qualify for admission, applicants must: 1) meet the general admissions requirements; and 2) satisfy any additional professional, personal, scholastic and other standards, including qualifying examinations. Refer to specific credential requirements under the Teaching Credentials  section or individual departmental websites.\nPost-Baccalaureate Unclassified - To enroll in undergraduate courses as preparation for advanced degree programs or to enroll in graduate courses for professional or personal growth, applicants must be admitted as post-baccalaureate unclassified students. By meeting the general requirements, applicants are eligible for admission as post-baccalaureate unclassified students. Admission in this status does not constitute admission to, or assurance of consideration for admission to, any graduate degree or credential program. \nNote: These and other CSU admission requirements are subject to change as policies are revised and laws are amended. The CSU website calstate.edu and the CSU admission portal calstate.edu/apply are good sources for the most up-to-date information.\n\n\n\n Back to Top | Print-Friendly Page (opens a new window)\n\n\nFacebook this Page (opens a new window)\n\n\n\n\nTweet this Page (opens a new window)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   \n\nAll catalogs © 2023 California State University Fullerton. Powered by the Acalog™ Academic Catalog Management System™ (ACMS™).\n\n\n\n\n",
    "links": [
        "#select_catalog",
        "https://www.fullerton.edu/",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9878",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9876",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9803",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9813",
        "https://catalog.fullerton.edu/content.php?catoid=75&navoid=9810",
        "https://www.fullerton.edu/academicprograms",
        "mailto:catalog@fullerton.edu",
        "https://www.fullerton.edu/it/iso/policy/OnlinePrivacy.php",
        "https://emergency.fullerton.edu/",
        "https://police.fullerton.edu/",
        "https://police.fullerton.edu/jeanneclery",
        "https://www.fullerton.edu/contact.aspx",
        "https://www.fullerton.edu/a-z.aspx",
        "https://www.fullerton.edu/campusmap",
        "https://www2.calstate.edu/",
        "https://www.fullerton.edu/titleix/",
        "https://www.fullerton.edu/ATI",
        "https://www.fullerton.edu/ati/reportati/",
        "https://get.adobe.com/reader/",
        "https://www.microsoft.com/en-us/download/office.aspx",
        "/search_advanced.php?catoid=75",
        "/index.php?catoid=75",
        "/content.php?catoid=75&navoid=9864",
        "/content.php?catoid=75&navoid=9793",
        "/content.php?catoid=75&navoid=9794",
        "/content.php?catoid=75&navoid=9796",
        "/content.php?catoid=75&navoid=9797",
        "/content.php?catoid=75&navoid=9868",
        "/content.php?catoid=75&navoid=9875",
        "/content.php?catoid=75&navoid=9869",
        "/content.php?catoid=75&navoid=9870",
        "/content.php?catoid=75&navoid=9871",
        "/content.php?catoid=75&navoid=9872",
        "/content.php?catoid=75&navoid=9873",
        "/content.php?catoid=75&navoid=9874",
        "/content.php?catoid=75&navoid=9876",
        "/content.php?catoid=75&navoid=9878",
        "/content.php?catoid=75&navoid=9866",
        "/content.php?catoid=75&navoid=9811",
        "/content.php?catoid=75&navoid=9813",
        "/content.php?catoid=75&navoid=9808",
        "/content.php?catoid=75&navoid=9867",
        "/content.php?catoid=75&navoid=9877",
        "/content.php?catoid=75&navoid=9882",
        "/content.php?catoid=75&navoid=9879",
        "/content.php?catoid=75&navoid=9880",
        "/content.php?catoid=75&navoid=9890",
        "/content.php?catoid=75&navoid=9795",
        "/content.php?catoid=75&navoid=9798",
        "http://www.fullerton.edu/catalog/archive",
        "/portfolio_nopop.php?catoid=75",
        "help.php?catoid=75",
        "/content.php?catoid=75&navoid=9810&print",
        "http://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9810&t=I am looking at the Graduate Admissions page at California State University Fullerton",
        "http://twitter.com/intent/tweet?u=u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9810&t=Check out this page at California State University Fullerton",
        "javascript:void(0)",
        "#student-responsibility",
        "#application-procedures",
        "#admission-procedures",
        "http://www.fullerton.edu/graduate",
        "http://www.calstate.edu/apply",
        "http://admissions.fullerton.edu/ProspectiveStudent/college_transcripts.php",
        "http://admissions.fullerton.edu/intl/master_grad.php",
        "content.php?catoid=75&navoid=9813",
        "content.php?catoid=75&navoid=9804",
        "http://www.calstate.edu",
        "http://www.calstate.edu/apply",
        "javascript:void(0);",
        "/content.php?catoid=75&navoid=9810&print",
        "http://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9810&t=I am looking at the Graduate Admissions page at California State University Fullerton",
        "http://twitter.com/intent/tweet?u=u=http%3A%2F%2Fcatalog.fullerton.edu%2Fcontent.php%3Fcatoid%3D75%26navoid%3D9810&t=Check out this page at California State University Fullerton",
        "javascript:void(0)",
        "/misc/catalog_list.php?catoid=75",
        "http://www.digarc.com"
    ]
}