{
    "title": "Chapman University Administrators Carry the Banner Of Leadership | Chapman Newsroom",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nFind information for\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\n\nDegrees\n\n                & Programs\nMaps &\n\n                Directions\nAll Directories\nNews\nEvents\n\nSocial\n\n\n\n\n\n\n\nfacebook\n\n\n\n\n\n\n\ntwitter\n\n\n\n\n\n\n\npinterest\n\n\n\n\n\n\n\ninstagram\n\n\n\n\n\n\n\n\n\nyoutube\n\n\n\n\n\n\n\nlinkedin\n\n\n\n\n\n\n\n\n\nsnapchat\n\n\n\n\n\n\n\ntumblr\n\n\n\n\n\n\n\nitunes\n\n\n\n\n\n\nSocial hub\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChapman University\n\n\n\n\n\n\n\n\nNewsroom\n\n\n\n\n\n\n\n\nTopics\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFind\n\n\n\n\n\n\n\n\n\n\nLog in\n\n\n\n\n\n\n\n\n\n\n                    Login\n\n                  \n\n\n\n\ncanva icon\n\n\nCanvas\n\n\n\n\n\n\n\n\n\n\n\n\n\nHandshake\n\n\n\n\n\n\n\n\nPanther Mail (students)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Center (student self-service)\n\n\n\n\n\nWorking@Chapman (faculty & staff) \n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n              Chapman University\n\n            \n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nChapman Newsroom\nMain Menu >\n\n\nTopics\n\n\nToggle\n\n\n\n\n\nAlumniArts & FilmBusiness & EconomyCampus & StudentsCollege KnowledgeCommunityCOVID-19Health & BehaviorHumanities & SocietyScience & EngineeringUniversity News\nOur VoicesCOVID-19 ResourcesMagazines\n\n\nToggle\n\n\n\n\n\nChapman MagazineChapman Forward\nPress Room \n\n\n\n\nMain Menu\n< Chapman Newsroom \n\n\n\nAbout\n\n\n\nToggle About\n\n\n\n\n\nMaps & Directions\nVisit Chapman\nDiscover Chapman\nFacts & Rankings\nLeadership\nCampus Services\nConnect\n\n\n\nAcademics\n\n\n\nToggle Academics\n\n\n\n\n\nDegrees & Programs\n\nSchools & Colleges\nAcademic Calendar\nFaculty Directory\nLibraries\nCourse Catalogs\nInternational Study\n\n\n\nAdmission\n\n\n\nToggle Admission\n\n\n\n\n\nUndergraduate Admission\n\nUndergraduate Application\nGraduate Admission\nGraduate Application\nAffordability\nFinancial\n\n                    Aid\n\n                    Calculator\nCampus Tours\n\n\n\nAlumni\n\n\n\nToggle Alumni\n\n\n\n\n\nEvents\nGet Involved\nCareer\n\n                    Support\n\n\nArts\n\nCampus Life\n\n\n\nToggle Campus Life\n\n\n\n\n\nAthletics\nDiversity & Inclusion\nEvents\nFish Interfaith\n\n                    Center\nHealth & Safety\nResidence\n\n                    Life\nStudent Life\n\n\n\nResearch\n\n\n\nToggle Research\n\n\n\n\n\nPre-Award\n\n                    Administration\nPost-Award\n\n                    Administration\nResearch Integrity\nInstitutes &\n\n                    Centers\nCenter for\n\n                    Undergraduate\n\n                    Excellence\nGraduate Research\n\n                    Support\n\n\n\nSupport\n\n\n\nToggle Support\n\n\n\n\n\nContact Development\nGet Involved\nAreas to\n\n                    Support\nAlumni Involvement\n\n\n\n\n\n\nFind information for...\n\n\n\nToggle Find Information By Audience\n\n\n\n\n\nProspective Students\nCurrent Students\nAlumni\nFaculty & Staff\nParents & Families\n\n\nDegrees & Programs\nMaps & Directions\nAll Directories\nNews\nEvents\nSocial\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare via Facebook Share via Twitter Share via Reddit Share via Pinterest Share via Email Share via LinkedIn \n Print Friendly\n\n\n\n\n\n\n Chapman senior leaders, from left,\nHelen Norris, Janine DuMontelle, Collette Creppell and Jamie Ceman extend Chapman’s impact and raise\nits profile on a national level.\n\n\n\n\nUniversity News \nChapman University Administrators Carry the Banner Of Leadership Global impact rises from actions close to home as a quartet of collaborative difference-makers share an unflagging commitment to innovation.\n Sari HarrarOctober 12, 202211 min read\n\n\nPop quiz! What do a Senate hearing on cybersecurity, an iconic Orange County citrus packing house, an exciting new nationwide survey and a high-profile appointment to a higher-education legal organization have in common?\nAnswer: They’re recent, notable examples of Chapman University’s national impact in the sphere of higher education administration – the running of a university and campus. And whether you measure the university’s national reach with data, media buzz or below-the-radar collaborations, the work of four women administrators and their teams at Chapman is shining a national spotlight on the university in surprisingly diverse and powerful ways.\nHere’s how these leaders are making a difference – and why they say it matters for Chapman and beyond.\n A Voice for Opportunity in Cybersecurity\nIn May 2022, Chapman’s chief information officer Helen Norris testified before the U.S. Senate Committee on Health, Education, Labor and Pensions as an expert witness on cybersecurity in higher ed. “The complexity of the work is enormous,” Norris told the senators and others at the hearing. “We are constantly dealing with new threats. We have ever-growing lakes of data with privacy implications that must be protected.”\n\nAs CIO at Chapman, Norris is responsible not just for the university’s ever-changing, multi-layered cybersecurity defense system but for all information technology.\n“A lot of my work is ensuring faculty and students have what they need to become superstars in their fields,” she says. “As the university has grown as a research institution, we’ve done a lot of work to provide resources such as high-performance computing and setting up easy and secure ways for faculty and students to store and share their work.” \nNorris led the stepped-up use of the learning management system Canvas during COVID and created a fund faculty and staff can use for pilot projects to test-drive additional Canvas features, including a tool called Name Coach that provides a pronunciation guide for users’ names.\nInclusivity is part of her mission.\n“It’s a great tool that helps people feel included a little bit more,” she notes.\nSince the Fowler School of Engineering received a gift of a powerful supercomputer from the innovative tech giant NVIDIA, Norris’ department is managing it in partnership with the school, NVIDIA and the community groups Trace3 and CEO Leadership Alliance of Orange County to support the talent and training of students throughout Orange County. A story with more details about the supercomputer is on Page 40.\nNorris and her team give back at a national level, too. She holds leadership positions on several cybersecurity and information technology boards, including a seat on the Dell Higher Education Advisory Board. She’s also chair of EDUCAUSE, the nation’s largest community of campus leaders advancing higher education through the use of information technology.\n“I have a strong network in the higher education IT community, and our department has a great reputation with vendors and colleagues across the country,” she says. “We share best practices in cybersecurity through EDUCAUSE, and sometimes we get to set the agenda with our partners. Colleges and universities need to collaborate for strong cybersecurity.”\nAbout Helen Norris\nPreviously: “I worked in computer programming for the U.S. Army in Frankfurt, Germany, after graduating from Trinity College in Ireland,” she says. “It’s important to take advantage of all sorts of work opportunities, including upward and lateral moves. That’s where you learn so much.”\nIt’s important to … “Encourage young women to pursue careers in STEM fields,” says Norris, who serves on the boards of advisors for the Southern California Society for Information Management and the EmpowHer Institute.\n Sharing Chapman’s Story on the Biggest Stage \nOn a Friday morning in mid-July, Jamie Ceman, vice president of Strategic Marketing and Communications at Chapman, got very good news.\n“We are always focused on bringing the Chapman story to life, telling people how special and unique this university is,” she says. “Today we received new research indicating that we’re moving the needle. The percentage of people across the U.S. who know about us has gone up. That’s not just students, alumni and our peer institutions but also the general public. That’s exciting.”\nHere was hard data showing that Chapman’s structured brand marketing campaign, launched in 2018, was succeeding. “If you don’t tell a consistent story,” Ceman says, “You get lost in the marketplace.”\nThe new national marketing survey found that participants’ knowledge about Chapman went beyond name recognition.\n“More people than ever know that we have an innovative campus, high-quality academics, a supportive and safe environment,” she says. “That’s important when recruiting students, staff and faculty. Our message is being heard.”\nIn 2022, Ceman was elected to serve on a prestigious committee of the Public Relations Society of America (PRSA) – Counselors to Higher Education Executive Committee. She was also honored as a national industry innovator in the Top Women Awards presented by PR News.  \n“When it comes to building a national reputation, it’s critical for Chapman leaders to participate at a national level,” she says. “It’s wonderful that Chapman can be a voice at the table determining how to elevate and support higher education communicators and their institutions.”\nCeman harnesses data to measure Chapman’s burgeoning reputation. She says that her team will use the latest survey results to launch a new campaign. But her role as the self-described megaphone for all things Chapman has meant everything from communicating with students, staff and faculty during the COVID epidemic, to devising student recruitment strategies, to developing and implementing a long-range marketing strategy.\nThere’s  no shortage of great things to promote.\n“Chapman is large enough to be a powerhouse school, nimble enough to move quickly and be responsive. Across the board, we’re doing unique things,” she says. “Research has become such a fundamental part of that. It enhances the student experience. Instead of coming to Chapman as an undergrad and doing a basic program, there’s a high likelihood of doing research with a faculty member. That changes your perspective.” \n About Jamie Ceman\nPreviously: “I started out in corporate marketing. It was really intense and I learned a lot, but ultimately it wasn’t satisfying,” Ceman says.\nIt’s important to … “Be working in higher education, as part of a mission-driven organization that’s changing people’s lives and the trajectory of the generations after them. That’s the feeling I want to have at the end of the day, every day.”  \n Putting Chapman Values into Practice\n“If there’s one thing that gives context to our work as attorneys in higher education, it’s that we’re generalists who do everything,” says Janine DuMontelle, vice president of legal affairs and general counsel at Chapman University. “Attorneys in private practice often specialize, but we practice in a broad number of fields. That makes Chapman a very exciting legal environment. It’s an innovative university. We’re always leaning forward into cutting-edge stuff.”\nDuMontelle’s knowledge, collegiality and enthusiasm for the many challenges of higher education law take her beyond her responsibilities as legal representative for a major university and head of a strong legal team. This year, the 5,000-plus members of the National Association of College & University Attorneys (NACUA) voted her in as chair of the prestigious organization’s Board of Directors. Her term began in late June.\n“The mission of NACUA is advancing the practice of higher education law, and there are lots of challenges on a national level in our field this coming year,” she says, citing the areas of health care, admissions, diversity and new Title IX regulations. “Any time an issue emerges, we are ready with high-quality responses from our best experts. On my way to the NACUA conference in June, I was reading 700 pages of proposed Title IX regulations (the landmark civil rights legislation that has opened doors to women and girls at all levels of education).”\nDuMontelle’s position also gives her, and Chapman, a platform for extending the university’s impact. For example, she will be speaking at the 53rd annual conference of the University Risk Management & Insurance Association on transformational strategies for managing risk associated with student health centers.\nDuMontelle also serves on the National Association of Independent Colleges and University’s Legal Services Review Panel. “On the NAICU panel, I get to weigh in on the amicus briefs that are being filed on behalf of our membership,” she says.\nThe work of  the two national groups has never been more important, she says. “With  so many developments, so many changes in higher education, you really need a collective community to be on top of it,” DuMontelle notes.\n“Regulations swing from one set of requirements to another, for example. Major court cases involving other universities or other areas of society also affect us all in higher education. The practice of law at colleges and universities has become more and more dynamic and changing.”\nAbout Janine DuMontelle\nPreviously: DuMontelle spent eight years serving in the administration of the College of Medicine at the University of California, Irvine, and five years preceding that as staff advisor to the City of Long Beach Civil Service Commission.\nIt’s important to … Mentor undergraduates who work in Chapman’s legal services office. “One of the things I have been promoting in my peer group is the use of undergraduate students in the legal office,” she says. “I have mentored students and have predominately hired first-generation students. I was a first-generation college student myself and am on the First-Generation Programs Advisory Board here at Chapman. One of the first students I hired is going to Yale Law School in the Fall. We are making a contribution to the development and success of our students.”  \n Honoring History as a Prelude to Making More\nFor Collette Creppell, it’s an inspiring opportunity to preserve historic local architecture in Old Towne Orange (and beyond) while reimagining a campus that fosters 21st-century learning and innovation.\nChapman’s vice president of Campus Planning and Design is forging partnerships between the university and significant California architectural firms that are shaping the national conversation about campus design.\nOne colorful illustration: Just two months before Creppell arrived at Chapman, the university announced it would take ownership of the imperiled, iconic Santa Monica mosaic “Pleasures Along the Beach” by artist Millard Sheets. Under her leadership, the university partnered with Los Angeles-based architectural design firm Johnston Marklee (JML) on plans to nearly triple the footprint of Chapman’s Hilbert Museum of California Art, incorporating Sheets’ sensual midcentury mural on a west-facing wall to capture golden late afternoon sunlight and make the well-known piece of public art visible from trains passing by and to commuters disembarking at nearby Orange station.\n“It will be an iconic new gateway to the campus and to our wonderful Old Towne Orange community, enhancing the visibility of Chapman University tremendously,” Creppell says. “Projects like this begin to enter the national conversation about architecture and campus design before they’re even completed, because of what they accomplish and because of the national reputation of the firms we’re working with.”\nCreppell has presented the story of the development of Chapman’s Swenson Family Hall of Engineering in the Keck Center for Science and Engineering at recent national meetings of the Society for College and University Planning and of the National Association of College and University Business Officers.\n“Interest in that project has been strong for years now, as people across the country talk about ways to design buildings that encourage collaboration and cross-pollination across disciplines,” she says. “It’s not often that universities can accomplish that, as Chapman has with Swenson, where faculty do not have traditional offices and where there’s a wide variety of collaborative spaces for designing and building.”\nAt a recent national conference of the Association of University Architects, there was great interest in Creppell’s presentation about Chapman’s new Sandi Simon Center for Dance at the Packing House[AD1] . housed in the historic Villa Park Orchards Packing Plant.\n“We’ve absolutely celebrated this historical, agricultural, industrial building by preserving the sawtooth roof and clerestory windows that let in northern light – which is natural light in its most wonderful form,” she says.\nDancers will practice and perform in high-ceilinged, broad spaces that spill out into a courtyard.\n“We have a beautiful historic building and a high-level dance department to put into the space,” she says. “Most university architects aren’t that lucky.”\nAbout Collette Creppell\nPreviously: Creppell benefited greatly from 10 years as university architect and director of campus planning for Tulane University in New Orleans, eight of them in post-Hurricane-Katrina campus rebuilding and renewal. “It was an opportunity to figure out what was new and important, rather than building back the way things were,” she says.\nIt’s important to … “Honor and celebrate history and community while embracing where we are now and where we’re going as a university,” Creppell says.\n \n \n \n \n \n\n\nAdministration campus planning Collette Creppell features helen norris information technology Jamie Ceman Janine DuMontelle legal affairs strategic marketing \n\n\n\n\n \n\nSari Harrar \n\n\n\n\n\n\n\n\n\n39th Chapman Athletics Night of Champions Hall of Fame Inductees\n\n\n\n\n\nThe Big Picture: How Data Science and Earth Observation Intersect to Study Climate Risks\n\n\n\n\n\n\n\nYou may also like\n\n\n\n\n\n\n\n\n\n\nChapman Family Donors Make a Collective Impact On Giving Day  Thanks to the enthusiasm of the Chapman Family, Chapman University’s fifth annual Giving Day was an unrivaled success. The 24-hour online fundraising event surpassed its goal of 1,000 donations on April 25, raising more...\n\n\nApril 28, 2023 Staci Dumoski\n\n \n\n\n\n\n\n\n\n\n\nPA Program Breaks Top 100 in First US News Ranking Chapman University’s physician assistant program broke the top 100 in its first-ever ranking in U.S. News & World Report’s Best Health Schools. The program was ranked No. 96, putting Chapman in the top third of...\n\n\nApril 25, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n\n\n\nArgyros School Climbs to No. 60 Chapman University’s Argyros School of Business and Economics rose to No. 60 in the new Best Business School rankings by U.S. News & World Report. It’s the school’s highest-ever position in rankings of business...\n\n\nApril 25, 2023 Joy Juedes\n\n \n\n\n\n\n\n\n Search\nNewsroom Topics\n\nArts & Film\nBusiness & Economy\nHealth & Behavior\nScience & Engineering\nAlumni\nCampus & Students\nCommunity\nHumanities & Society\nUniversity News\n\nSubscribe Sign up here to get updates on the latest Newroom stories.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmergency \n\nMedia ContactsCerise Valenzuela Metzger\n\nDirector of Public Relations\n(714) 289-3143 (office)\n(657) 390-6760  (cell)\ncmetzger@chapman.edu\n\nOffice of Public Relations\n\nPR@chapman.edu \n\nNewsroom SiteChapman Magazine\n\nChapman Forward\nCOVID-19 Resources\n\nChapman Site\nVisit Chapman\nView Tuition and Aid\nApply Now\nEmployment \n\nServices & PoliciesAccessibility Feedback \nWebsite Feedback \nDisability Services \nDirectory Emergency \nConsumer Disclosures \nPrivacy Policy Title IX \n\n\n\n\n\n© 2023 Chapman University           \n\n\n\n\n\n\nTopics\n\nAlumni\nArts & Film\nBusiness & Economy\nCampus & Students\nCollege Knowledge\nCommunity\nCOVID-19\nHealth & Behavior\nHumanities & Society\nScience & Engineering\nUniversity News\n\n\nOur Voices\nCOVID-19 Resources\nMagazines\n\nChapman Magazine\nChapman Forward\n\n\nPress Room\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#",
        "#",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "#",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://www.pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu/",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/edu/school?id=17838",
        "https://www.snapchat.com/add/chapmanu",
        "http://chapmanadmission.tumblr.com/",
        "http://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://social.chapman.edu/",
        "#",
        "https://www.chapman.edu/",
        "/",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "https://news.chapman.edu/wp-admin/ ",
        "https://canvas.chapman.edu",
        "https://chapman.joinhandshake.com/login/",
        "https://www.chapman.edu/campus-services/information-systems/services/email/panther-mail.aspx",
        "https://studentcenter.chapman.edu",
        "https://news.chapman.edu/work/",
        "/",
        "https://www.chapman.edu/",
        "#",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/",
        "#",
        "https://www.chapman.edu/about/index.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/discover/index.html",
        "https://www.chapman.edu/about/facts-and-rankings/index.aspx",
        "https://www.chapman.edu/about/our-family/leadership/index.aspx",
        "https://www.chapman.edu/campus-services/index.aspx",
        "/about/connect",
        "https://www.chapman.edu/academics/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/academics/schools-colleges.aspx",
        "https://www.chapman.edu/academics/academic-calendar.aspx",
        "https://www.chapman.edu/our-faculty/index.aspx",
        "https://www.chapman.edu/academics/libraries/index.aspx",
        "https://www.chapman.edu/academics/course-catalogs/index.aspx",
        "https://www.chapman.edu/international-studies/index.aspx",
        "https://www.chapman.edu/admission/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/index.aspx",
        "/admission/undergraduate/applynow",
        "https://www.chapman.edu/admission/graduate/index.aspx",
        "https://www.chapman.edu/admission/graduate/applynow.aspx",
        "https://www.chapman.edu/admission/undergraduate/afford.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/financial-aid/net-cost-calculator/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/visit.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/alumni/events/index.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/campus-services/career-professional-development/index.aspx",
        "https://www.chapman.edu/arts/index.aspx",
        "https://www.chapman.edu/campus-life/index.aspx",
        "https://www.chapman.edu/www.chapmanathletics.com/landing/index",
        "https://www.chapman.edu/diversity/index.aspx",
        "https://www.chapman.edu/events.chapman.edu/",
        "https://www.chapman.edu/campus-life/fish-interfaith-center/index.aspx",
        "https://www.chapman.edu/students/health-and-safety/index.aspx",
        "https://www.chapman.edu/students/services/housing-and-residence/index.aspx",
        "https://www.chapman.edu/students/life/index.aspx",
        "/research/",
        "https://www.chapman.edu/research/sponsored-projects-services/pre-award/index.aspx",
        "https://www.chapman.edu/research/sponsored-projects-services/post-award/index.aspx",
        "https://www.chapman.edu/research/integrity/index.aspx",
        "https://www.chapman.edu/research/institutes-and-centers/index.aspx",
        "https://www.chapman.edu/research/center-for-undergraduate-excellence/index.aspx",
        "https://www.chapman.edu/research/graduate-research/index.aspx",
        "https://www.chapman.edu/support-chapman/index.aspx",
        "https://www.chapman.edu/support-chapman/contact-us.aspx",
        "https://www.chapman.edu/support-chapman/get-involved.aspx",
        "https://www.chapman.edu/support-chapman/ways-to-give/areas-to-support.aspx",
        "https://www.chapman.edu/alumni/get-involved/index.aspx",
        "https://www.chapman.edu/audiences/index.aspx",
        "https://www.chapman.edu/future-students/index.aspx",
        "https://www.chapman.edu/students/index.aspx",
        "https://www.chapman.edu/alumni/index.aspx",
        "https://www.chapman.edu/faculty-staff/index.aspx",
        "https://www.chapman.edu/families/index.aspx",
        "https://www.chapman.edu/academics/degrees-and-programs.aspx",
        "https://www.chapman.edu/about/maps-directions/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "https://blogs.chapman.edu/",
        "https://events.chapman.edu/",
        "https://social.chapman.edu/",
        "#",
        "#",
        "#",
        "#",
        "mailto:?subject=Chapman%20University%20Administrators%20Carry%20the%20Banner%20Of%20Leadership&body=https%3A%2F%2Fnews.chapman.edu%2F2022%2F10%2F12%2Fchapman-university-administrators-carry-the-banner-of-leadership%2F",
        "#",
        "#",
        "https://news.chapman.edu/category/university-news/",
        "",
        "https://news.chapman.edu/tag/administration/",
        "https://news.chapman.edu/tag/campus-planning/",
        "https://news.chapman.edu/tag/collette-creppell/",
        "https://news.chapman.edu/tag/features/",
        "https://news.chapman.edu/tag/helen-norris/",
        "https://news.chapman.edu/tag/information-technology/",
        "https://news.chapman.edu/tag/jamie-ceman/",
        "https://news.chapman.edu/tag/janine-dumontelle/",
        "https://news.chapman.edu/tag/legal-affairs/",
        "https://news.chapman.edu/tag/strategic-marketing/",
        "",
        "https://news.chapman.edu/2022/10/17/39th-chapman-athletics-night-of-champions-hall-of-fame-inductees/",
        "https://news.chapman.edu/2022/10/10/the-big-picture-how-data-science-and-earth-observation-intersect-to-study-climate-risks/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/2023/04/28/chapman-family-donors-make-a-collective-impact-on-giving-day/",
        "https://news.chapman.edu/author/dumoski/",
        "https://news.chapman.edu/2023/04/25/pa-program-breaks-top-100-in-first-us-news-ranking/",
        "https://news.chapman.edu/2023/04/25/pa-program-breaks-top-100-in-first-us-news-ranking/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/2023/04/25/argyros-school-climbs-to-no-60/",
        "https://news.chapman.edu/author/juedeschapman-edu/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/university-news/",
        "/news-and-stories/sign-up-for-our-newsletter/",
        "https://www.chapman.edu/emergency/index.aspx",
        "tel:+1714-289-3143",
        "tel:+1657-390-6760",
        "mailto:cmetzger@chapman.edu",
        "mailto:PR@chapman.edu",
        "/magazine",
        "/forward",
        "/coronavirus/",
        "https://www.chapman.edu/about/visit/index.aspx",
        "https://www.chapman.edu/students/tuition-and-aid/index.aspx",
        "https://www.chapman.edu/admission/undergraduate/how-to-apply/index.aspx",
        "https://www.chapman.edu/faculty-staff/human-resources/jobs/index.aspx",
        "https://www.chapman.edu/accessibility/feedback-form.aspx",
        "https://www.chapman.edu/website-feedback-form.aspx",
        "https://www.chapman.edu/students/health-and-safety/disability-services/index.aspx",
        "https://www.chapman.edu/directory/index.aspx",
        "emergency/index.aspx",
        "https://www.chapman.edu/consumer-information-disclosures/index.aspx",
        "https://www.chapman.edu/campus-services/information-systems/policies-and-procedures/privacy-policy.aspx",
        "https://www.chapman.edu/students/health-and-safety/title-ix/index.aspx",
        "https://www.chapman.edu/",
        "https://www.facebook.com/ChapmanUniversity",
        "https://twitter.com/chapmanu",
        "https://pinterest.com/chapmanu/",
        "https://www.instagram.com/chapmanu",
        "https://www.youtube.com/user/ChapmanUniversity",
        "https://www.linkedin.com/company/10701?trk=tyah",
        "https://www.snapchat.com/add/chapmanu",
        "https://itunes.apple.com/us/institution/chapman-university/id430678922",
        "https://www.tiktok.com/@chapmanu",
        "#",
        "https://news.chapman.edu/category/alumni/",
        "https://news.chapman.edu/category/arts-film/",
        "https://news.chapman.edu/category/business-economy/",
        "https://news.chapman.edu/category/campus-students/",
        "https://news.chapman.edu/category/college-knowledge/",
        "https://news.chapman.edu/category/community/",
        "https://news.chapman.edu/category/covid-19/",
        "https://news.chapman.edu/category/health-behaivor/",
        "https://news.chapman.edu/category/humanities-society/",
        "https://news.chapman.edu/category/science-engineering/",
        "https://news.chapman.edu/category/university-news/",
        "https://news.chapman.edu/diversity-and-inclusion/",
        "https://cusafelyback.chapman.edu/",
        "#",
        "/magazine",
        "https://news.chapman.edu/forward/",
        "https://news.chapman.edu/press-room/"
    ]
}