{
    "title": "New school: Stanford Doerr School of Sustainability",
    "body": "\n\n\n\n \n \n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\nSearch form\n\n\n\nSearch term\n\n\n\n\n\n\nHome\nFind Stories\nFor Journalists\nContact\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 4, 2022 Stanford Doerr School of Sustainability, university’s first new school in 70 years, will accelerate solutions to global climate crisis Investments of $1.1 billion from John and Ann Doerr, along with gifts from other philanthropists, catalyze interdisciplinary efforts to tackle urgent climate and sustainability challenges facing people and ecosystems worldwide. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Amy Adams and Anneke Cole\n\nStanford’s first new school in 70 years will launch this fall as the Stanford Doerr School of Sustainability, recognizing a $1.1 billion gift from John and Ann Doerr, the largest in the university’s history. The commitment, together with gifts from other generous donors, will extend the university’s scholarship and dramatically amplify its impact in tackling the urgent climate and sustainability challenges facing all people. Arun Majumdar has been appointed as the school’s inaugural dean.\n\nAnn and John Doerr provided $1.1 billion to create the Stanford Doerr School of Sustainability, which will have a focus on tackling sustainability challenges facing people worldwide. (Image credit: Edward Caldwell)\n\nThe combined gifts, totaling $1.69 billion, will shepherd the creation of a new kind of school focused on cultivating deep knowledge and high-impact solutions to pressing planetary challenges. The school will have academic departments that advance subject understanding, interdisciplinary institutes that innovate across fields, and an accelerator focused on developing near-term policy and technology solutions. New faculty, new facilities, and a new institute will round out the school, bringing exceptional breadth and scale to the university’s work in addressing the future of the planet.\n“These gifts will help Stanford bring its full effort to bear on solving the most complex problems in climate and sustainability, and on training the next generation of students who are eager and driven to address these challenges,” said Stanford President Marc Tessier-Lavigne. “We have designed a school for the future combining knowledge generation and impact, building on the strong foundation established through Stanford’s history of scholarship in Stanford Earth and our other schools and interdisciplinary institutes. We are deeply grateful to John and Ann for partnering with us to realize the school’s mission, as well as to the other generous lead donors who are leveraging their resources to help us create a more livable future.”\n“Stanford is making a bold, actionable, and enduring commitment to tackle humanity’s greatest challenge, and we have deep conviction in its ambition and abilities,” said John and Ann Doerr. “We believe the Stanford Doerr School of Sustainability will be a model for the interdisciplinary collaboration required to solve this existential challenge – and set a new standard for scholarship in the 21st century. Today’s real and pressing challenges – not least, solving our climate crisis – require that knowledge be channeled toward the building of practical, implementable solutions. With a deep track record in groundbreaking scholarship and impact, and a critical mass of subject experts and innovators, Stanford is perfectly positioned to make a measurable difference in climate and sustainability challenges. This is the decisive decade, and we must act with full speed and scale.”\nAdditional philanthropic investments have been made by Jerry Yang, ’90, MS ’90, and Akiko Yamazaki, ’90; David, MS ’90, and Angela Filo, ’93; and other donors.\nA distinctive approach\nThe new school has been designed to power excellence in eight areas of scholarship that, together, are crucial for advancing the long-term prosperity of the planet: climate change, Earth and planetary sciences, energy technology, sustainable cities, the natural environment, food and water security, human society and behavior, and human health and the environment.\nBuilt for impact, the school will have a distinctive three-part structure that includes rigorous academic departments, interdisciplinary institutes, and an accelerator for technology and policy solutions.\n\nThe academic departments will launch with about 90 existing faculty from Stanford and add an additional 60 faculty over 10 years to provide strength and breadth across all eight areas of scholarship. Existing faculty will include those currently in the School of Earth, Energy, and Environmental Sciences (Stanford Earth), who will transition to the new school, as well as faculty from other schools. Early faculty hires will focus on energy, climate science, and sustainable development and environmental justice.\nThe interdisciplinary institutes bridge areas of scholarship across the university in service of knowledge acquisition and solutions development. The existing Stanford Woods Institute for the Environment and the Precourt Institute for Energy will become part of the school, joined by a new Institute for Sustainable Societies that adds critical new attention to issues of institutional and economic infrastructure, and the politics of transitioning to more sustainable ways of life.\nThe new Sustainability Accelerator will drive policy and technology solutions. It will help advance high-potential technologies by providing laboratories, tools, and domain expertise to help researchers refine and scale prototypes. The accelerator will also support interdisciplinary policy design and engagement with external stakeholders. Competitive grants given by the accelerator will help develop sustainability technologies, policies, and innovations, and emphasize measurable impacts through partnership with the external community, connecting directly to needs in government, industry, and other outside entities.\n\nThe school will also provide curriculum, research, training, and project-funding opportunities for students across campus, regardless of area of study. In addition, the new school will collaborate closely with the university’s leading professional schools to generate essential insights and solutions that can be rapidly deployed to mitigate and better respond to climate and sustainability challenges. Additional programs, including professional education, will help equip professionals to advance sustainable solutions in real-world contexts.\nThe choice of the word “Sustainability” in the school’s name signals the urgent need for scholarship and new, high-impact solutions to foster a sustainable future. The school will focus on three broad areas: Earth, Climate and Society. Its creation reflects the Stanford community’s deep ambition to lead in this domain, building on the university’s decades of foundational work. Hundreds of people in the Stanford community contributed ideas, participated in town halls, worked on committees, and responded to surveys that led to the creation of this school.\nThe people and programs in the new school will be brought together in a new Sustainability Commons, located on the west side of campus. The Commons will be anchored by two new flagship buildings that will follow Stanford’s history of creating sustainable, LEED Platinum certified buildings. The Commons will also include the existing Green Earth Sciences Research Building and the Jerry Yang and Akiko Yamazaki Environment and Energy Building (Y2E2). A promenade will connect the academic buildings, rooftop garden, and multiple outdoor gathering spaces.\n\nArun Majumdar, the Jay Precourt Professor, professor of mechanical engineering, and senior fellow and former co-director of the Precourt Institute for Energy, will be the inaugural dean of the Stanford Doerr School of Sustainability. (Image credit: Edward Caldwell)\n\nThe school will be led by inaugural dean Arun Majumdar, the Jay Precourt Professor, professor of mechanical engineering, senior fellow and former co-director of the Precourt Institute for Energy, and a senior fellow at the Hoover Institution, where he co-chairs the George Shultz Energy and Climate Task Force. Majumdar’s career has spanned academic research and experience in industry, national laboratories, and government, where he led efforts implementing energy technology initiatives that included being founding director of the Advanced Research Projects Agency – Energy (ARPA-E). Majumdar currently serves as chair of the advisory board to the U.S. Secretary of Energy.\n“The Stanford Doerr School of Sustainability will not only harness the intellectual horsepower of our students, faculty, and staff across our campus, but also partner with external organizations around the world to co-develop innovative solutions and identify new insights through research and education,” said Majumdar. “As is often said, we do not inherit the Earth from our ancestors, we borrow it from our children. We must create a future in which humans and nature thrive together.”\nA bold, actionable plan\nThe Doerrs’ gift will secure the school’s ability to make a measurable impact by increasing financial support for graduate students and postdoctoral fellows – tomorrow’s leading climate and sustainability scientists, entrepreneurs, policymakers, and advocates. Funding will also drive initiatives in essential areas of study including energy, behavior, and communications, and bring in new, expert faculty.\nJohn Doerr is an engineer, venture capitalist, chair of Kleiner Perkins, and author of bestsellers Measure What Matters and Speed & Scale: An Action Plan for Solving Our Climate Crisis Now. John serves entrepreneurs with ingenuity and optimism, helping them build bold teams and disruptive companies. As a pioneer of Silicon Valley’s cleantech movement, John has invested in zero-emissions technologies since 2006. At Stanford, he has been a guest speaker at the schools of Engineering, Business, and Law.\nAnn Doerr is chair of Khan Academy, former board member and current advisory board member of the Environmental Defense Fund, and former trustee of Rice University. At Stanford, she has served as a member of Stanford Medicine’s Cancer Council and Under One Umbrella Steering Committee. Together, the Doerrs have generously supported Stanford priorities including Stanford Medicine, Stanford Cancer Center, School of Engineering, Athletics, the Stanford Institute for Economic Policy Research, and Stanford Live.\nAmbitious hiring goals\nOne of the school’s first priorities will be hiring faculty, with plans to expand from about 90 faculty members in the founding units of the school to 150 faculty members in 10 years.\n\nJerry Yang and Akiko Yamazaki provided a foundational gift to hire new faculty focused on climate science, and sustainable development and environmental justice. (Image credit: Courtesy Jerry Yang and Akiko Yamazaki)\n\nA foundational gift from Yamazaki and Yang is launching the school’s search for its first cadre of new faculty focused on climate science, and sustainable development and environmental justice.\n“Growing our faculty is critical as we are creating wholly new departments, expanding areas of scholarship, and ensuring that diverse voices and experiences are informing our scholarship,” said Provost Persis Drell. “I’m tremendously grateful to Akiko and Jerry for enabling us to move quickly on our ambitious hiring goal, which will be essential to addressing the full gamut of climate and sustainability challenges.”\nWith this gift, Yamazaki and Yang are building on their longstanding support for environment and sustainability initiatives as some of Stanford’s most dedicated volunteers and philanthropists. Among their many volunteer roles, Yang became chair of the Stanford Board of Trustees in April 2021, and Yamazaki chaired the volunteer Sustainability Task Force in 2020-21. In 2007, the couple provided the lead gift to build the Jerry Yang and Akiko Yamazaki Environment and Energy Building (Y2E2), which helped to create the foundation for the new school.\n“The ability to attract, hire, and promote expert faculty is one of the superpowers of a school,” Yamazaki said. Yang added, “Akiko and I believe that the new school will be a magnet for scholars dedicated to sustaining our planet and human life.”\nA new kind of sustainability school\nUnderpinning the new school’s ability to fulfill its unique vision is a foundational, unrestricted gift from Angela and David Filo. These funds can contribute to any aspect of the school prioritized by the dean. In addition to faculty hires, educational programs, and ramping up the Sustainability Accelerator, the funds could support new initiatives within the Woods or Precourt institutes, or through the new Institute for Sustainable Societies.\n\nDavid and Angela Filo provided an unrestricted gift that can contribute to any aspect of the Stanford Doerr School of Sustainability prioritized by the dean. (Image credit: Courtesy David and Angela Filo)\n\n\n\n“David and I believe that by equipping the new school’s leaders with flexible support, we can accelerate progress on the challenging issues that need to be addressed to transition to a clean energy future,” Angela Filo said. “We believe the school will demonstrate how universities can create new knowledge and solutions to advance a more equitable, sustainable planet.”\n\n\nThe Filos are longtime supporters of Stanford. Their generosity has bolstered multiple corners of the university, with professorships in the Graduate School of Education and the School of Engineering, foundational support for the Stanford Interdisciplinary Graduate Fellowship program, and gifts for the Haas Center for Public Service and Stanford Athletics. Angela serves on the Board of Trustees of Stanford University and previously served on the Sustainability Task Force, the Undergraduate Cabinet, and other advisory committees. David is the co-founder of Yahoo!, Inc. Together, the Filos co-founded the Yellow Chair Foundation, a family foundation that gives grants in the areas of educational equity, climate change, civil liberties, and more.\n“Just as the world needs lots of different schools of medicine, the world is going to need lots of schools of sustainability,” said Kathryn “Kam” Moler, who served as transition dean of the new school. “The scale and urgency of the challenges we face are too great for a single institution to tackle. It will take all of us working together to solve urgent challenges. I’m so grateful to Angela and David for placing their trust in Stanford, and to all the lead donors for sharing our vision for this new kind of school.”\n\n\n\n\n\n\n\n\n\n\n\nMedia Contacts\nUniversity Communications, Stanford University: mediarelations@stanford.edu\n\n\n\nScience & Technology\nUniversity Affairs\nClimate Change\nOur Vision\nSustainability\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nScience & Technology\nA better, faster tool for saving water on farms\nA new tool for designing and managing irrigation for farms advances the implementation of smart agriculture, an approach that leverages data and modern technologies to boost crop yields while conserving natural resources.\n \n\n\n\n\n\n \nScience & Technology\nBanking on nature\nThe Natural Capital Project is working with development banks and 10 pilot countries to put the environment at the forefront of policy and investment decisions.\n \n\n\n\n\n\n \nLaw & Policy\nBeyond the room where it happened\nYou may have given little thought to the role Native Americans played in the creation of the U.S. Constitution. But SLS scholars argue that Native people profoundly shaped the conversation.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Report\nTo receive Stanford news daily,\nsubscribe to Stanford Report.\n\n\nFor Journalists\n\nPress Releases\nMedia Contacts\nStanford Experts\n\n\n\nSee Also\n\nContact Stanford News\nFaculty / Staff Resources \n\n\n\n\nEvents\n\nEvents calendar\n\n\n\nStanford News is a publication of Stanford University Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/find-stories/",
        "https://news.stanford.edu/for-journalists/",
        "https://news.stanford.edu/contact/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D43684",
        "https://sustainability.stanford.edu/",
        "https://news.stanford.edu/2022/05/04/arun-majumdar-named-inaugural-dean-stanford-doerr-school-sustainability/",
        "https://news.stanford.edu/wp-content/uploads/2022/05/Doerrs.jpg",
        "https://sustainabilityinitiative.stanford.edu/vision-impact/foundational-launch-partners",
        "https://earth.stanford.edu/",
        "https://woods.stanford.edu/",
        "https://energy.stanford.edu/",
        "https://news.stanford.edu/wp-content/uploads/2022/05/Majumdar_vertical.jpg",
        "https://profiles.stanford.edu/arun-majumdar",
        "https://news.stanford.edu/wp-content/uploads/2022/05/Akiko-Yamazaki-and-Jerry-Yang-v3b-2.png",
        "https://news.stanford.edu/wp-content/uploads/2022/05/Angela-and-David-Filo-v4.png",
        "https://profiles.stanford.edu/kathryn-moler",
        "mailto:mediarelations@stanford.edu",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/section/university-affairs/",
        "https://news.stanford.edu/topic/climate-change/",
        "https://news.stanford.edu/topic/our-vision/",
        "https://news.stanford.edu/topic/sustainability/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D43684",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://news.stanford.edu/section/science-technology/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://news.stanford.edu/section/law-policy/",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "/report/subscribe/",
        "/press-releases/",
        "/contact/media-contacts/",
        "/experts/",
        "/contact/",
        "http://ucomm.stanford.edu/facstaff/",
        "http://events.stanford.edu/",
        "https://ucomm.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}