{
    "title": "Stanford joins White House forum on sustainability - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nMarch 20, 2023 Stanford joins White House forum on sustainability Aurora Winslade, director of Stanford’s Office of Sustainability, discusses key takeaways from the event, how universities can partner with governments to meet sustainability goals, and how Stanford is becoming a greener campus. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Alex Kekauoha\n\nAs the global climate crisis worsens and the window to mitigate its harmful impacts narrows, institutions of higher education are vital to developing solutions, according to Aurora Winslade, director of Stanford’s Office of Sustainability.\n\nAurora Winslade is director of Stanford’s Office of Sustainability. (Image credit: Courtesy Aurora Winslade)\n\n“The climate challenge demands a comprehensive response that integrates policy, practice, and equity,” she said. “And universities play an important role in responding to the complex challenge it represents.”\nOn March 8 and 9, Winslade participated in the White House Forum on Campus and Community-Scale Climate Change Solutions in Washington, D.C., hosted by the White House Office of Science and Technology Policy and the University of Washington. The event convened representatives from universities across the nation for two days of panel talks and discussions to explore how to build on the sustainability work at universities, scale those solutions broadly, and leverage teaching, research, and government resources to meet climate agendas. The event covered many topics, such as modernizing transportation, decarbonizing campuses, and making colleges more climate resilient.\nIn this Q&A, Winslade discusses key takeaways from the event, how universities and governments partner on sustainability initiatives, and what Stanford is doing to become a greener campus.\n \nHow are colleges and universities uniquely positioned to tackle climate change?\nColleges and universities can often be more nimble in implementing goals and solutions, can serve as a balance to corporations and government, and are crucial in the formation of future leaders. Higher education can also pilot and then scale innovative solutions to the climate crisis by working to share and implement them in partnership with communities across the country.\nUniversities take cutting-edge research and technology and apply it to their campus as a test bed or living laboratory. At Stanford, we can maximize our resources and position the university as an influential entity to showcase how a climate solution is viable and scalable for the rest of the world.\nColleges and universities serve as a nexus-point for sharing information with regional and statewide actors on how to scale climate solutions, particularly since climate challenges and solutions are inherently place-based.\n \n\nThe White House Forum on Campus and Community-Scale Climate Change Solutions in Washington, D.C., convened representatives from university across the nation, including Stanford. (Image credit: Courtesy Aurora Winslade)\n\nHow do universities connect with governments and other organizations to address climate change?\nGovernments act as conveners through existing programs within federal agencies such as the Department of Energy, the National Science Foundation, and the U.S. Department of Agriculture. Several national professional organizations such as the Association for the Advancement of Sustainability in Higher Education act as clearinghouses, network builders, and strategic partners for higher education leaders implementing climate solutions on campus and in partnership with their local communities.\n \nCan you share a brief recap of the presentation you gave at the forum about some of Stanford’s campus sustainability accomplishments?\nIn my presentation, I discussed Stanford’s Sustainable Energy System Innovations (SESI) program that has transformed our energy system from a fossil fuel–based system to 100% renewable, grid-sourced electricity. Investments in SESI and ongoing energy-efficiency retrofits have reduced campus greenhouse gas emissions by nearly 80%.\nI also discussed the Stanford Doerr School of Sustainability’s Impact Accelerator, and how SDSS collaborates with Land, Buildings and Real Estate at Stanford. Together, they are accelerating the pace of innovation through projects such as the COOLER Research Program, the Codiga Resource Recovery Center, and the new Living Lab Fellowship Program launched by LBRE’s Office of Sustainability and the Bill Lane Center for the American West.\nIt’s also worth noting that over the past 21 years, conservation projects, implementation of SESI, retrofits, capital improvements, and behavior changes at Stanford have reduced potable water usage by 48%, or a reduction of 1.3 million gallons on an average day in 2021 compared to 2000.\n \nHow do Stanford’s sustainability efforts compare to those of other institutions?\nStanford is among 11 universities that have achieved Platinum status – the highest rating – on the STARS framework by the Association for the Advancement of Sustainability in Higher Education (AASHE). Stanford also performed well in AASHE’s 2022 Sustainability Campus Index, which recognizes top-performing colleges and universities overall by institution type and in 17 sustainability impact areas. Stanford ranked in the following categories: Diversity & Affordability – 1st; Energy – 2nd; Curriculum – 5th; Food & Dining – 5th; Doctoral Institutions (overall) – 7th; and Water – tied for 9th.\n \nWhat makes Stanford’s sustainability efforts unique among American universities?\nStanford is one of the largest residential campuses in the country and is one of the largest campuses based on contiguous land. Stanford also manages its own waste, energy, and water systems. This makes Stanford a great test bed for new ideas and innovation. It also has access to a wide range of experts and research through the new Doerr School of Sustainability, and additional institutes such as the R&DE Stanford Food Institute. These characteristics make Stanford great at accelerating solutions that can work at city and regional scales.\n \nAny final thoughts?\nThere is a tremendous amount of innovative work already underway around the nation. There are also many opportunities for higher education leaders, government agencies, and local communities to partner to scale and accelerate the pace and adoption of innovation.\n\nRead more about the White House Forum on Campus and Community-Scale Climate Change Solutions.\n\n\n\n\n\n\n\n\n\n\n\n\n\nQ&A\nStanford News\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D11488",
        "https://sustainable.stanford.edu/",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/03/Headshot-Aurora.jpg",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2023/03/Navy-Steps.jpg",
        "https://www.youtube.com/watch?v=g-OTeH_CPBY",
        "https://sustainability.stanford.edu/",
        "https://sustainability.stanford.edu/school/sustainability-accelerator",
        "https://lbre.stanford.edu/",
        "https://sustainable.stanford.edu/news/cooler-research-program",
        "https://cr2c.stanford.edu/",
        "https://sustainable.stanford.edu/take-action/fellowships",
        "https://west.stanford.edu/",
        "https://stars.aashe.org/",
        "https://www.aashe.org/wp-content/uploads/2022/09/SustainableCampusIndex-2022.pdf",
        "https://rde.stanford.edu/food-institute",
        "https://www.whitehouse.gov/ostp/news-updates/2023/03/15/readout-of-the-white-house-forum-on-campus-and-community-scale-climate-change-solutions/",
        "https://news.stanford.edu/report/content-partner/university-communications/qa/",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D11488",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}