{
    "title": "Student Life – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\n\t\t\t        Chico State\n\t\t\t    MenuShow search box.AboutAcademicsCost & AidAdmissionsStudent LifeAthleticsAlumniGiveApplyVisitRequest InfoCSU, ChicoCurrent page:  Student Life\n                        \n    \t\tStudent Life\n    \tWhatever your passion, the work you put in today decides tomorrow and Wildcats are more than just students—we're leaders who believe in service and community.You Belong HereWildcat student life is all about being active and engaged with each other, our campus, and the community. Student clubs and organizations, fraternities and sororities, volunteering, leadership opportunities, recreation—there’s something for everyone.Get InvolvedView Student Resources and ServicesA Great Place to LiveFrom our tree-filled campus to the charming downtown, you will fall in love with Chico. Make your home in one of our residence halls just steps from the classroom and enjoy top-notch dining and amenities.Tour University HousingStudents Are in ChargeThe Associated Students (AS) leads programs and services created by students for students. Run for student government, get a stress-relieving workout at the Wildcat Recreation Center, enjoy a concert in Trinity Commons—the AS offers it all!Explore the Associated StudentsSustainability TrailblazersIn addition to hosting the nation’s largest student-run sustainability conference, Wildcats are learning how to create resilient systems and leading the way with projects and programs that improve our campus.You Can Make a DifferenceCaring for others is in our DNA. Thousands of students volunteer 60,000+ hours annually through Community Action Volunteers in Education (CAVE), and many more give back through class projects and student groups.200+student organizations where you can nurture your passions and make lifelong friends Top-10school for year-long study abroad students90%of students live close enough to walk or bike to classAcademic SupportEveryone here is invested in your success. Academic advisors will help plan your general education while major advisors and college specialists ensure you graduate on time—not to mention free tutoring and career mentoring services.’Cats Got GameStudent-athletes in our 13 Division II programs have won more than twice as many regular-season crowns as any other California Collegiate Athletic Association school. From rugby to rowing teams, we have plenty of sports club offerings, too!We Want You to ThriveWe know students can only succeed in the classroom when they’re healthy, nourished, and supported. WellCat Services provides everything from counseling to health care, and student support programs like the Basic Needs Project can help you feel and do your best.Close-Knit CommunityOur small class sizes and friendly, outgoing nature ensure you get to know your professors and your classmates, forming lifelong friendships and a sense of connection wherever you go. We are a Wildcat family.Immersed in NatureBig Chico Creek runs through the heart of our park-like campus as well as nearby 3,670-acre Bidwell Park for plenty of opportunities to enjoy the outdoors. Try hiking, camping, river rafting, and more on student-led trips with Adventure Outings.Challenging the Status QuoWe are committed to improving equity, diversity, and inclusion on our campus and beyond. Through education, self-reflection, dialogue, and action, Wildcats will understand, challenge, and help end social injustices in the world.Take the Next StepsEnroll TodayRequest InformationSchedule a TourCall us Monday–Friday, 8 a.m.–5 p.m., to talk directly to an admissions expert. No automated voice messages—we promise!Office of Admissions:530-898-6322  |  info@csuchico.eduWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.MenuChico State HomeAboutAcademicsAdmissionsCost & AidStudent LifeAcademic DepartmentsAthleticsAlumniParentsChico FactsGiveResourcesQuicklinksCampus CalendarCampus SafetyJob OpportunitiesAccessibility Resource CenterAnnual Security Report (PDF)\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "index.shtml",
        "javascript:void(0)",
        "#task-nav",
        "about/index.shtml",
        "academics/index.shtml",
        "cost.shtml",
        "https://www.csuchico.edu/admissions/index.shtml",
        "student-life.shtml",
        "https://chicowildcats.com",
        "https://www.csuchico.edu/alumni/index.shtml",
        "https://www.csuchico.edu/give/index.shtml",
        "https://www.csuchico.edu/admissions/apply/index.shtml",
        "https://www.csuchico.edu/admissions/visit/index.shtml",
        "https://www.csuchico.edu/admissions/request-information.shtml",
        "https://www.csuchico.edu",
        "https://www.csuchico.edu/sll/",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://www.csuchico.edu/housing/",
        "https://as.csuchico.edu/index.php/wildcat-recreation-center-wrec/",
        "http://as.csuchico.edu",
        "https://www.csuchico.edu/sustainability",
        "https://as.csuchico.edu/index.php/volunteer-opportunities-cave/",
        "https://chicowildcats.com/",
        "https://www.csuchico.edu/recsports/index.shtml",
        "https://www.csuchico.edu/wellcat/index.shtml",
        "https://www.csuchico.edu/basic-needs/index.shtml",
        "https://as.csuchico.edu/index.php/adventure-outings/",
        "https://www.csuchico.edu/diversity/index.shtml",
        "https://www.csuchico.edu/admissions/already-applied/intent-to-enroll.shtml",
        "https://www.csuchico.edu/admissions/request-information.shtml",
        "https://www.csuchico.edu/admissions/visit/index.shtml",
        "tel:530-898-6322",
        "mailto:info@csuchico.edu",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "http://instagram.com/chicostate",
        "https://www.linkedin.com/edu/school?id=17823",
        "https://www.flickr.com/photos/chicostate",
        "https://www.youtube.com/user/ChicoStateChannel",
        "https://www.csuchico.edu",
        "about/index.shtml",
        "academics/index.shtml",
        "https://www.csuchico.edu/admissions/index.shtml",
        "cost.shtml",
        "student-life.shtml",
        "academics/academic-departments.shtml",
        "https://chicowildcats.com/",
        "https://www.csuchico.edu/alumni/index.shtml",
        "https://www.csuchico.edu/parents/index.shtml",
        "about/chico-facts.shtml",
        "https://www.csuchico.edu/giving/index.shtml",
        "audience-resources.shtml",
        "https://www.csuchico.edu/calendar/index.shtml",
        "https://www.csuchico.edu/campus-safety/index.shtml",
        "employment.shtml",
        "https://www.csuchico.edu/arc/index.shtml",
        "https://www.csuchico.edu/clery/_assets/documents/annual-security-report.pdf",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}