{
    "title": "Academic Affairs | California State University, Northridge",
    "body": "\n\n\n\n\n\n\nDivision of \nAcademic Affairs\n\n\n\n\nSkip to Content\n\n\n☰\nMobile menu\n\n\n\n\nUser menu\n\nSkip to ContentAccessibilityDirectoryCalendarA to ZWebmail\n\n \n\n\n\n\nEnter the terms you wish to search for. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Portal\n          \n\n\n\n            Webmail\n          \n\n\n\n            Directory\n          \n\n\n\n            Canvas\n          \n\n\n\n\nNavigation\n\nHomeOffice of the ProvostCollegesPrograms A-ZFaculty & StaffStudents\n\n\nAcademic Affairs\n\nHome\nOffice of the Provost\nColleges\nPrograms A-Z\nFaculty & Staff\nStudents\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n    Division of Academic Affairs  \n\n\n\n\n\n\n\n\n        More Links\n    \n\n\nMission Organizational Chart Academic Calendar \n\n\n\n\n\n\n\n\n\n\nWelcome to the Division of Academic Affairs\n\n\n\n\n\n\n\n\n\n\n\n\n NEWSSpring 2023 Health & SafetyThe Division of Academic Affairs is one of the largest units within the University and is under the guidance and leadership of the Provost and Vice President for Academic Affairs (the chief academic officer). All matters pertaining to the academic world of students and faculty-- programmatic and procedural -- fall under the Provost's purview. We are especially proud of the strength of our faculty and their commitment to student achievement; their scholarship, research, and publications in diverse undergraduate and graduate disciplines; and their service to the community of the San Fernando Valley.\n\n\n\nAdministrative Offices\n\n\n\n\n The Division is organized into colleges, with over fifty discipline-related departments, the University Library, academic support units, and central academic administrative offices. The Division also encompasses eight central academic administrative offices: Academic Resources and Planning, Educational Opportunity Program (EOP), Faculty Affairs, Graduate Studies, Institutional Research, Research and Sponsored Programs, Student Success, and Undergraduate Studies.Additionally, the following serve a major function and are academic support areas within the Division: Articulation, Accreditation, Academic Advising, the Learning Resource Center, the Center for Community Service Learning, University Assessment, the University Honors Program, and the University Catalog.\n \n\n    Academic Resources and Planning - Ms. Diane Stephens, Associate Vice President  \n\nAcademic Resources and Planning provides support for the comprehensive resource needs of Academic Affairs. The office personnel assist with the development and management of annual budgets, administrative and fiscal policies and procedures, and enrollment planning. The office manages discretionary funds for the division, monitors utilization of instructional equipment and technology funds, and reports on allocations, expenditures, and key fiscal performance indicators for the division.\n\n\n    Educational Opportunity Programs (EOP) - Ms. Shiva Parsa, Senior Director  \n\nEducational Opportunity Program (EOP) at California State University, Northridge has provided access and retention services to low-income and educationally disadvantaged college students since its legislated beginnings in 1969. In recent years, EOP has developed outreach efforts, a holistic admissions process and transitional Bridge Programs to help facilitate students’ adjustment to the university. (Bridge begins with intensive summer programs and continues through the students’ first academic year.) Continuing students benefit from services provided in EOP Satellites linked to their academic majors and process-based mentoring developed in collaboration with the EOP Faculty Mentor Program. All services provided by EOP are designed to interest and benefit the increasingly diverse university community.\n\n\n    Faculty Affairs - Dr. Diane Guido,  Associate Vice President  \n\nFaculty Affairs oversees the implementation of faculty personnel policies, including retention, tenure, promotion, and salary advancement. It also coordinates faculty hiring, offers retirement counseling, and investigates faculty grievances. In addition, it offers a variety of orientation programs and development activities for faculty and Department Chairs, including programs housed in the Center for Excellence in Learning and Teaching. It works closely with the Faculty Senate's Personnel Policy and Review Committee (PP&R) to maintain manuals on personnel policies and hiring practices, and coordinates training programs with the Center for Equity and Diversity.\n\n\n    Graduate Studies - Dr. Amy Levin, Assistant Vice President  \n\nGraduate Studies encompasses Graduate Evaluation Services and the Graduate Studies Committee. This office is responsible for all University policies on student formal programs, and student advisement for incoming students and students in the Interdisciplinary Studies program. It is also responsible for graduate student support programs.\n\n\n    Institutional Research - Dr. Janet Oh, Senior Director  \n\nInstitutional Research supports and collaborates with campus stakeholders in making data-informed decisions related to university priorities and strategic planning. In support of this mission, Institutional Research provides university data to meet reporting requirements, communicates relevant data to the campus community, offers data literacy training and education to university stakeholders, and supports university leadership by providing data and related analytic tools. \n\n\n    Research and Sponsored Programs - Dr. Christopher Sanford, Associate Vice President  \n\nResearch and Sponsored Programs is dedicated to promoting research by assisting faculty and staff in obtaining external research and creative activity support. \n\n    Student Success - Dr. Melanie Bocanegra, Associate Vice President  \n\nThe Office of Student Success facilitates CSUN Mission  by developing, implementing, and supporting innovative practices, policies and programming that promote student achievement, eliminate the opportunity gap, and encourage timely degree completion. \n\n\n    Undergraduate Studies - Dr. Deborah Cours, Interim Associate Vice President   \n\nUndergraduate Studies is responsible for undergraduate curriculum and policies at California State University, Northridge. The Associate Vice President for Undergraduate Studies oversees the activities of Admissions, Records and Articulation, policies regarding Academic Advisement, General Education Honors Program, Learning Resource Center, Online Instruction, PACE Program, Service Learning, Special Majors, University Assessment and the publication of the University catalog.\n\n\n\n\n\n\n\nContact\n Division of Academic Affairs18111 Nordhoff StreetNorthridge, CA 91330-8200(818) 677-2957FAX (818) 677-5530Email: academic.affairs@csun.eduDr. Meera KomarrajuProvost and Vice President for Academic AffairsMatthew Cahn, Ph.D.Vice Provost \n\n\n\nQuick Links\n Admissions & Records\n\n\n\n\n\n\n\n\n\n\n\n\n              Academic Affairs\n            © California State University, Northridge\n    \n18111 Nordhoff Street, Northridge, CA 91330\nPhone: (818) 677-1200\n    /\n    Contact Us\n\n\n\n\nAccessibility\nEmergency Information\nUniversity Policies & Procedures\n\n\n        Title IX\n\n\n\n\n\n\nTerms and Conditions for Use\nPrivacy Policy\nDocument Reader\n\n\n\n\nCalifornia State University\n\n\n\n\n\n\n",
    "links": [
        "/",
        "/academic-affairs",
        "#main-content",
        "#main-content",
        "https://www.csun.edu/accessibility",
        "http://www.csun.edu/peoplefinder",
        "http://www.csun.edu/calendar",
        "http://www.csun.edu/atoz/",
        "http://www.csun.edu/webmail",
        "https://auth.csun.edu/cas/login?service=https://mynorthridge.csun.edu/psp/PANRPRD/?cmd=login&languageCd=ENG",
        "http://www.csun.edu/webmail",
        "http://www.csun.edu/peoplefinder",
        "https://canvas.csun.edu/",
        "/academic-affairs",
        "/provost",
        "/academic-affairs/colleges",
        "https://www.csun.edu/academic/",
        "http://www.csun.edu/hr/",
        "http://www.csun.edu/prospectivestudents",
        "/academic-affairs",
        "/provost",
        "/academic-affairs/colleges",
        "https://www.csun.edu/academic/",
        "http://www.csun.edu/hr/",
        "http://www.csun.edu/prospectivestudents",
        "http://www.csun.edu/president/mission",
        "https://www.csun.edu/sites/default/files/AcadAffairsOrgChart12-8-2022.pdf",
        "http://www.csun.edu/faculty-affairs/calendar",
        "https://www.csun.edu/ua/email/NCpages/0112-Covid-Protocols-Employees.html",
        "http://www.csun.edu/academic-resources-planning",
        "http://www.csun.edu/csun-eop",
        "http://www.csun.edu/faculty-affairs",
        "https://www.csun.edu/research-graduate-studies/graduate-studies",
        "http://www.csun.edu/institutional-research",
        "https://www.csun.edu/research-sponsored-programs",
        "https://www.csun.edu/student-success",
        "https://www.csun.edu/president/mission",
        "http://www.csun.edu/undergraduate-studies",
        "mailto:academic.affairs@csun.edu",
        "http://www.csun.edu/admissions-records",
        "tel:+18186771200",
        "https://www.csun.edu/contact",
        "https://www.csun.edu/accessibility",
        "https://www.csun.edu/emergency/",
        "https://www.csun.edu/afvp/university-policies-procedures/",
        "https://www.csun.edu/eqd/title-ix-gender-equity-and-sexual-misconduct",
        "https://www.csun.edu/sites/default/files/900-12.pdf",
        "/it/privacy",
        "/it/document-viewers",
        "https://www.calstate.edu/"
    ]
}