{
    "title": "CAGD Student Models Success for Those Underserved in Her Field - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nCAGD Student Models Success for Those Underserved in Her Field\n\nNeesa Sonoquie\nApril 21, 2022\n\n\n\n\nJason Halley / University Photographer \n\n\n\t\t\tErika Muniz is an outstanding senior for the Computer Animation and Game Development Program (CAGD) who is first-generation student that comes from a family of immigrants, striving for profitable career in a largely male major, focused heavily on 3D modeling, photographed on Wednesday, March 30, 2022 in Chico, Calif.\n\n(Jason Halley/University Photographer/Chico State)\t\t\n\n\n\n\nAs a first-generation student in a close-knit immigrant family, Erika Muniz had been encouraged by her parents to choose a safe major that would secure a good job after graduation. Though she dreamed of being a video game programmer, she decided to study communications, which led to an interest in speech pathology and Chico State.\nAs her passion for technology still lingered, she switched her major to computer science during freshmen orientation.\nThen, while on a campus tour with her mom, Erika heard about the computer animation and game development (CAGD) program from a student tour guide. She changed majors that same day.\n“My mom wanted me to stick with computer science,” Muniz said. “She told me that it would offer more opportunities. But I was able to convince her in the moment to come with me to fill out a change of major form and get it submitted in time.”\nAs she dared to follow her dream, she fell in love with 3-D modeling, the construction of three-dimensional objects and structures using simulated software, and immersed herself in a field where individuals like herself have been historically underrepresented.\nAmong video game developers, about a quarter are women, and the combined stats for people of color are similar. Despite these numbers and caring concern from her family about choosing a major they were unfamiliar with, Muniz quickly earned a place for herself in the CAGD program.\n“It was hard to explain what I was studying to my family in Spanish, so I couldn’t show them that this could actually be a career,” she said. “But my mom was one of my biggest supporters, and I remember being so excited when I shared a picture of 3-D model I created of a shelf filled with groceries—she asked, ‘Where are you?’ because it looked so real.”\nMuniz excelled in her studies and design work, built a supportive, lasting community among her peers and professors, and she was hired to work as a grader and as an office assistant. Not surprisingly, she was nominated as an Outstanding Senior in the program, and she made the Dean’s list—which had been a personal goal—in her final semester.\nA “Poseidon Chariot” Muniz created for “The Adoni Invitational,” a Greek-themed chariot racing game. (Photo courtesy of Erika Muniz)\nAs one of only a few women in CAGD, Muniz found inspiration through conscientious, enthusiastic professors and students with similar backgrounds.\n“The professors never made me feel lesser or out of place, and I greatly appreciate that, since they were some of my biggest sources of motivation. The classroom posed some challenges, though—for one, people always assumed I was majoring in animation rather than game design, and I sometimes had to work harder to be heard when I took on leadership positions in class,” Muniz said.\nIt helped to have female role models to look up to, like Jennifer Underwood, she said, noting how much her professor inspired her and was a such a valuable resource.\n“Just seeing how she succeeded was enough to make me feel like I could too,” Muniz said.\nUnderwood is attuned to the unique challenges that historically underserved students face within the CAGD field, and she is honest about the road ahead.\n“I am one of the only women working in this program; that’s just kind of a product of how the industry is. You have to learn to navigate the waters, and really be passionate, hardworking, and resilient to succeed,” Underwood said.\nShe was continually impressed by Muniz’s creativity and dedication, and was confident she would succeed despite any obstacles she faced.\n“When you leave this program, you’re not done, you’re always learning, and she’s up for the challenge because she knows she will have to prove her skills,” said Underwood. “She’s very open to feedback and how to improve, and anytime she’s supposed to be somewhere, she’s there—Erika just has so many commendable qualities. She would be a wonderful leader and contributing member to anything that she gets involved in, quite honestly.”\nSince graduating in fall 2021, Muniz has been working hard to land her first job and trying to take her own advice to heart: “Don’t give up! You’re going to get a lot of ‘No’s,’ but one day you will get that ‘Yes.’”\nThis week, that yes, finally came, as she accepted a job as a Photoshop compositor with Halon Entertainment, a full-service visualization company based in Santa Monica.\n“When I graduated, I was able to show my family some of my final semester pieces, and they couldn’t believe what I’d created,” she said. “It’s so cute, because every time there’ll be an animated commercial on TV or something, my grandpa will always be like, ‘Can you make that?’”\nAs someone who grew up working in her family’s restaurant and who once struggled to envision herself in a professional field, Muniz still marvels a bit at her success.\n“My grandparents worked at the restaurant, my mom worked at the restaurant, and my dad works in construction,” she said. “But it was always their goal for us kids to go to college and have the opportunity to go further than they were able to. In my degree and my future job, I really wanted to do something that would make my family proud.”\nNow, she hopes to join the ranks of women making names for themselves in the game development industry, especially within 3-D modeling and the growing field of photogrammetry, the technique of taking photographs and then processing them into 3-D models using computer software. \n“As a person of color, I want to be able to share part of my culture, and identify with the characters and content I’m creating. It’s important for us to get out there, especially with games and representation, so we can properly create authentic experiences,” she said. “I wanted to be able to set a precedent of something great, to show that I could be successful, smart, and intelligent. Hopefully, other young women and people of color will be able to see themselves in our work and become inspired to join the field when they grow up. That would be incredible.”\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tNeesa Sonoquie\t\t\n\n\n\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/nsonoquie/",
        "https://today.csuchico.edu/outstanding-grad-erika-muniz/?share=facebook",
        "https://today.csuchico.edu/outstanding-grad-erika-muniz/?share=twitter",
        "https://today.csuchico.edu/outstanding-grad-erika-muniz/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20CAGD%20Student%20Models%20Success%20for%20Those%20Underserved%20in%20Her%20Field&body=https%3A%2F%2Ftoday.csuchico.edu%2Foutstanding-grad-erika-muniz%2F&share=email",
        "https://today.csuchico.edu/outstanding-grad-erika-muniz/#print",
        "#",
        "https://today.csuchico.edu/author/nsonoquie/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}