{
    "title": "Applying to UCI - UCI Graduate Division",
    "body": "\nSkip to the content\n\n\n\nUpdated COVID-19 Guidelines.\nPlease read for the latest updates on how we are keeping you safe. Your safety\n\n\n\n\n\ninfo for:Current Students\nProspective Students\nPostdocs\nAlumni & Friends\nFaculty & Staff\n \n\nNews\nEvents\n \n\n\n\nToggle search\n\n\n\n\n\n\nGiving\n \n\n\n\n\n\nSearch for:\n\n\nSearch\n\n\n\n\n\n\n\n\n\nUCI Graduate Division\n\n\n\n\n\n\n\n\n\nApply Now\nAdmissions\n\nApplying to UCI\nDegree Programs\nApplication Fee\nVirtual Open House\nInternational Students\nHousing\nFAQ\nFor Faculty & Staff\nPrivacy and Non-Discrimination\nTimeline for Preparation\nTips for Applying\n\n\nFunding\n\nCurrent Fellowships\nEmployment\nAcademic Student Employee\nResearch Assistantships\nChildbirth Accommodation & Childcare Reimbursement\nOther Resources\nTraining Grants\nFinancial Aid\nTax Information\nNRST Remission Program & Flexible Fund\n\n\nProfessional Development\n\nGraduate & Postdoctoral Scholar Resource Center\nOne-on-One Services\nCertificate Programs\nGrad Slam\nIndustry Partners\nCareer Explorations\nTeaching Internships\nCalifornia Community College Internship Program (CCCIP)\nCSU Pre-Professor Program (UCI-PREPP)\nProfessional Success and Campus Partners\n\n\nWell-Being\n\nCampus Resources\nOverview\nPeers Offering Wellness Education Resources (POWER)\nSpring Up\n\n\nDiversity, Equity & Inclusion\n\nDiversity\nCampus Student Services Centers\nGraduate Interconnect Program\nDECADE\nCampus Visits for Graduate Preparation Programs\nInternational Student Resources\nOther Diversity Graduate Prep Programs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu\n \n\n\n\n\nSearch for:\n\n\nSearch\n\n\n\n\n\n\nCurrent Students\nProspective Students\nPostdocs\nAlumni & Friends\nFaculty & Staff\n \n\n\nApply Now\nAdmissionsShow sub menu\n\nApplying to UCI\nDegree Programs\nApplication Fee\nVirtual Open House\nInternational Students\nHousing\nFAQ\nFor Faculty & Staff\nPrivacy and Non-Discrimination\nTimeline for Preparation\nTips for Applying\n\n\nFundingShow sub menu\n\nCurrent Fellowships\nEmployment\nAcademic Student Employee\nResearch Assistantships\nChildbirth Accommodation & Childcare Reimbursement\nOther Resources\nTraining Grants\nFinancial Aid\nTax Information\nNRST Remission Program & Flexible Fund\n\n\nProfessional DevelopmentShow sub menu\n\nGraduate & Postdoctoral Scholar Resource Center\nOne-on-One Services\nCertificate Programs\nGrad Slam\nIndustry Partners\nCareer Explorations\nTeaching Internships\nCalifornia Community College Internship Program (CCCIP)\nCSU Pre-Professor Program (UCI-PREPP)\nProfessional Success and Campus Partners\n\n\nWell-BeingShow sub menu\n\nCampus Resources\nOverview\nPeers Offering Wellness Education Resources (POWER)\nSpring Up\n\n\nDiversity, Equity & InclusionShow sub menu\n\nDiversity\nCampus Student Services Centers\nGraduate Interconnect Program\nDECADE\nCampus Visits for Graduate Preparation Programs\nInternational Student Resources\nOther Diversity Graduate Prep Programs\n\n\n\n\n\n\nNews\nEvents\nGiving\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApplying to UCI \n\n\n\n\n\n\n\n\n\n\n\n UC Irvine offers a wide variety of highly ranked academic and professional degree programs, and we encourage talented and forward-thinking student from across the country and around the world to apply. Choose from over 120 degree programs taught by world-renowned faculty. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Start Your Application                \n\n\n\n\n\n\n\n\n\n\n\n                    Check Application Status                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    English Language Proficiency                \n\n\n\n\n\n\n\n\n\n\n\n                    Letters of Recommendation                \n\n\n\n\n\n\n\n\n\n\n\n                    Transcripts                \n\n\n\n\n\n\n\n\n\n\n\n                    Supplemental Materials                \n\n\n\n\n\n\n\n\n\n\n\n                    Application Deadlines                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExplore Admissions\n\n\nApplying to UCI\nDegree Programs\nApplication Fee / Fee Waivers\nInternational Students\nHousing\nFAQ\nFor Faculty & Staff\nPrivacy and Non-Discrimination\nTimeline for Preparation\nTips for Applying\nCouncil of Graduate Schools\n\n\n\n\nSelect\nApplying to UCI\nDegree Programs\nApplication Fee / Fee Waivers\nInternational Students\nHousing\nFAQ\nFor Faculty & Staff\nPrivacy and Non-Discrimination\nTimeline for Preparation\nTips for Applying\nCouncil of Graduate Schools\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Choose UCI\n\n\nUCI is ranked the #1 best college in the nation according to Money magazine.\n\n\n\n\n\nInternational Students\n\n\nGraduate students from around the globe are coming to UC Irvine to discover new gateways to academic excellence.\n\n\n\n\n\nFinancial Support\n\n\nFunding packages for doctoral and MFA students may include various combinations of types of funding.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApplying to UCI \n\n\n\nSome UC Irvine programs may have admissions criteria, deadlines or requirements that differ from the general university requirements. You should always contact your desired program to ensure that you meet specific admission criteria and deadlines established by the program, and to find its specific admissions requirements. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMinimum Academic Requirements\n\n\n\n\n\nBachelor’s Degree\nHold a bachelor’s degree (or equivalent) from a recognized academic institution with degree standards equivalent to those of the University of California\n\n\n\n\n\nGRE Test Scores\nProvide official Standardized test scores (GRE) when applicable. The GRE test is required for most programs. Check the requirements of the specific program you're applying to below.\n\n\n\n\n\n3.0 GPA\nHave a minimum cumulative undergraduate GPA of 3.0\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow To Apply \n\n\n\nThese are required components of an application; please see below and follow the links for specific information. You must complete and submit your Application for Admission online. The following items are required to complete your application: \n\n\n\n\n\n\n\n\n\n\n\n\n\n                Choose a Degree Program            \n\nThe Degree Programs page provides information on specific graduate programs, including areas of study, degrees offered, program contact information, and application deadlines.  Please note that you cannot apply to different degree levels (Master's and PhD) for the same program. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Pay Your Application Fee            \n\nYour application cannot be reviewed until UCI has received your non-refundable application fee ($135 for U.S. Citizens and lawful U.S. Permanent Residents, and $155 for all other applicants).  \n\n\n\n\n\n\n\n\n\n\n\n\n\nOther Potential Requirements \n\n\n\n \n\n\n\n\n\n\nGREThe GRE test scores are required for some programs.  Please check with your program to verify if the GRE test is required.  We will accept the GRE General Test at home test version. To send an official GRE test score to UCI, please select institution code 4859. Click here to see list in expanded view.  \n\n\n\n \n\n\n\n Required ScoreThere is no minimum required GRE score. The results of this test represent only one of many factors reviewed in the admission decision. GRE Subject TestSeveral graduate programs (e.g., Chemistry) also require, or strongly recommend, that an applicant report the score of a GRE Subject Test in the respective discipline. Please check with your department to verify. Below is the program GRE requirement list. Validity Dates and TimingGRE test results are not valid for more than five years. Applicants should register for either the October or December test dates to ensure the timely receipt of their score results for admission consideration. At the time of test registration, students must notify the Educational Testing Service to report scores directly to UCI. Scores reported by a student cannot be accepted. For Further InformationInformation on the GRE may be obtained from the ETS/GRE website at ETS/GRE.Educational Testing Service (ETS),P.O. Box 6000Princeton, NJ 08541-6000;Telephone: (609) 771-7670. \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n\n\n\n\n\n\nEnglish Language Proficiency Requirements for Admission\n\nTOEFL or IELTS\nAll graduate applicants are required to demonstrate English proficiency for admissions consideration.  Applicants are waived from the English Language Proficiency requirement if they have earned an undergraduate or master’s degree from an institution at which English was the sole language of instruction according to the World Higher Education Database (WHED). Please see WHED’s instructions on how to search for your institution. If English is not the sole language of instruction listed or if no language is listed at all, the waiver does not apply and the applicant is required to take and pass an approved English proficiency test.  Approved tests and minimum scores are outlined in the next section.  \nPlease note: Test results that are two years old or older are not acceptable.\nIMPORTANT NOTE: If a student will be supported as a Teaching Assistant (TA) by their program, please read the English proficiency requirement policy for Teaching Assistantships. Some programs require students who have not earned an undergraduate degree from an institution at which English was the sole language of instruction according to WHED to demonstrate English language proficiency to serve as a TA when they apply to the program. Please check with the program(s) to which you intend to apply for individual requirements.\nTOEFL\nThe TOEFL is administered by the Educational Testing Service (ETS).\n\nPlease select institution code 4859 to have your official score sent to UCI. No department code is needed.\nWe only accept scores submitted electronically by ETS.\nTest results that are two years old or older are not acceptable.\nWe do not accept MyBest scores; you must submit all individual test scores.\nResults of institutional (non-ETS) administrations of the TOEFL are not acceptable.\nWe will accept the TOEFL iBT Special Home Edition test.  The same minimum score applies.\nWe do NOT accept the TOEFL ITP Plus test for China or the TOEFL Essentials test.\nFor more information, please visit their website at www.ets.org/toefl\n\nTOEFL Score Requirements for Admission Consideration:\n\nAn overall minimum score of 80 \n\nIELTS\nAs an alternative to the TOEFL, you may submit scores from the Academic Modules of the International English Language Testing System (IELTS).\n\nWe only accept scores submitted electronically by the IELTS test center. No paper Test Report Forms will be accepted.\nTest results that are two years old or older are not acceptable.\nWe will accept the IELTS Online and IELTS Indicator test.  The same minimum score applies.\nAn institutional code is NOT required. Please contact the test center directly where you took the IELTS test and request that your test scores be sent electronically using the IELTS system. All IELTS test centers worldwide are able to send scores electronically to our institution. \nFor more information, please visit their website at www.ielts.org\n\nIELTS Score Requirements for Admission Consideration:\n\nAn overall minimum score of 7 for admission, with a score of no less than 6 on any individual module.\n\nRemediation\nIf the head of a unit or appropriate delegate finds sufficient grounds to believe that any graduate student appointed as a Teaching Assistant or Teaching Associate does not have spoken English proficiency adequate for undergraduate instruction, they must require the student to undertake a remediation process, in consultation with the Program in Global Languages & Communication and approved by the student’s academic unit, prior to additional appointment as a Teaching Assistant or Teaching Associate. Such a determination should be made on the grounds of inadequate proficiency alone (as indicated in student evaluations, faculty observations, or the like). This remediation process will be required regardless of how the student was initially certified for oral English proficiency (that is, regardless of earning an undergraduate degree at an institution where English was the sole language of instruction or by achieving a passing score on one of the tests noted above).\nProcess for consulting with the Program in Global Languages and Communication regarding a remediation process for a Teaching Assistant or Teaching Associate: The graduate program requesting consultation regarding a remediation process for a Teaching Assistant or Teaching Associate who is believed to not have spoken English proficiency adequate for undergraduate instruction should email TOEP@uci.edu with the following information: (1) the student’s information (name, UCI ID number, email address), and (2) the contact information (email) of the delegate from the hiring department who is requesting the consultation and/or overseeing the remediation process for the student. The staff in the Program in Global Languages and Communication will then contact the student to set up an appointment during which the student will meet with an Academic Coordinator in the GLC Program who will review, discuss, and/or assess the student’s oral English proficiency. After meeting with the student, the GLC Program will provide a recommendation for a remediation plan to the delegate from the hiring department and the student’s home department/program.\n\n\n\n\n\n\n\nLetters of Recommendation\n\nYou are required to have three letters of recommendation submitted on your behalf. The letters should be submitted by instructors in a discipline related to your proposed field of study who are in a position to analyze your abilities and academic promise.  Access to Letters of RecommendationThe Family Educational Rights and Privacy Act (FERPA) of 1974 gives students (persons admitted and enrolled), the right to inspect letters of recommendation written in support of applications for admission. The law also permits students to waive that right if they choose, although such a waiver must be voluntary and cannot be a condition of admission, award, or employment.Waiving your right of access to the letters of recommendation is optional. However, the Admissions Committee cannot use letters of recommendation intended by the recommender to be confidential unless the applicant waives access by signing the Waiver of Access statement. The process for “waiving access” or “declining to waive access” is described below.Online SubmissionFor the ApplicantComplete the Letter of Recommendation section on the online application. This will allow you to enter in your recommenders’ names and e-mail addresses. An automated e-mail invitation will be sent to each of your recommenders. It is strongly recommended that you waive or decline to waive your rights of access to your letters of recommendation. After you have completed and submitted your application, you may continue to manage and monitor the status of their submission by logging into your online application and viewing the status page. Please note that you can submit the application prior to all your letters of recommendations are received, but check with your program to verify the deadline of when all the letters need to be received.The application will accept Interfolio.  If you need any support or have questions regarding Interfolio, please contact them directly at https://www.interfolio.com/contact/. We do not accept paper recommendation letters. Your recommenders must submit the letters via the recommendation form that is sent to them via email.For the RecommenderYour student will provide your contact information on their application which will generate an automated e-mail inviting you to log in and complete a recommendation form. Please follow the steps on the form and submit your recommendation for their application. The form will support document uploads or you may copy and paste the text of your letter.  We do not accept paper recommendation letters.\n\n\n\n\n\n\n\nTranscripts\n\nFor application review purposes only, scan and upload copies of transcripts for all institutions attended since high school. In the online application, you will be prompted to upload your scanned documents. Please upload both the front and back sides of the transcript. Uploaded transcripts should be recent and include the following: your name, dates of attendance, grades/marks received, credits and grading legend. UCI reserves the right to require official transcripts at any time during the admission process, and rescind any offer of admission made if discrepancies between uploaded and official transcript(s) are found. Official transcripts will be requested if and when you are admitted and decide to attend UCI. Do not send official transcripts until this time, unless you are requested to do so.\n\n\n\n\n\n\n\nSupplemental Materials\n\nSome programs require submission of additional materials; please contact your program of interest to determine if any additional materials are required.\n\n\n\n\n\n\n\nApplication Deadlines\n\nApplication deadlines differ by program, so please determine the deadline for your program by visiting your program of interest in the Degree Programs section of the website. You must supply a valid e-mail address that you will maintain at least 8 months after you apply. If you are admitted, you will be notified via this e-mail address.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer \n\n\n\nApplicants are expected to complete their UC application completely and accurately, and the truthfulness of that information is at the core of all admissions decisions. Falsified application information may include but is not limited to: making inaccurate statements on the application, withholding information requested on the application, giving false information, or submitting fraudulent or falsified documents in support of an admissions application.Proper submission of official materials is also of utmost importance. Letters of recommendation must be submitted by the letter writer; an applicant must not submit a letter of recommendation on behalf of the letter writer. In cases where an applicant has submitted incomplete or inaccurate information on their UCI application, or fraudulently submitted official application materials on behalf of another individual or institution, the matter will be reviewed as a case of falsification and will result in the cancellation of the application or the withdrawal of an admission offer.Please note that once submitted, your application materials will not, under any circumstances, be returned to you or forwarded to another entity on your behalf. After You’re AcceptedMake sure to check out our Admitted Students Checklists  \n\n\n\n\n\n\n\n\n\n\n\n\nLocation\nUniversity of California Irvine\nGraduate Division\n120 Aldrich Hall\nIrvine, CA 92697-3180\n949-824-4611\ngrad@uci.edu\nDirections to/maps of UCI Campus\n\n\n\nQuestions?\nGraduate Admissions and Application Questions\nContact Graduate Admissions\nSchool or Program Inquiries\nGraduate Degree Programs\nGeneral Forms\nForms and Applications\nGeneral Inquiries\nEmail us at grad@uci.edu\nCall 949-824-4611\n\n\n\nConnect with Us\n\n\n\n\nFind us on\nFacebook\n\n\n\nFind us on\nTwitter\n\n\n\nFind us on\nInstagram\n\n\n\nFind us on\nLinkedin\n\n\n\nFind us on\nYouTube\n\n\n\nFind us on\nFlickr\n\n\n\n\n\n\n\n\nContact Us Privacy Policy Non-Discrimination Policy ©2022 UC Regents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#site-content",
        "http://grad.uci.edu/well-being/campus-health-updates-covid-19/",
        "https://grad.uci.edu/current-students/student-resources/",
        "https://grad.uci.edu/prospective-students/why-choose-uci/",
        "https://grad.uci.edu/postdocs/information-for-postdocs/",
        "https://grad.uci.edu/alumni/alumni-friends/",
        "https://grad.uci.edu/admissions/for-faculty-staff/",
        "/news",
        "/events",
        "https://givingday.uci.edu/",
        "https://grad.uci.edu/",
        "https://apply.grad.uci.edu/apply/",
        "https://grad.uci.edu/admissions/applying-to-uci/",
        "https://grad.uci.edu/admissions/degree-programs/",
        "https://grad.uci.edu/admissions/application-fee-fee-waivers/",
        "https://grad.uci.edu/prospective-students/virtual-open-house/",
        "https://grad.uci.edu/admissions/information-for-international-applicants/",
        "https://grad.uci.edu/admissions/housing/",
        "https://grad.uci.edu/admissions/faq/",
        "https://grad.uci.edu/admissions/for-faculty-staff/",
        "https://grad.uci.edu/admissions/privacy-and-non-discrimination/",
        "https://grad.uci.edu/admissions/timeline-for-preparation/",
        "https://grad.uci.edu/admissions/tips-for-applying/",
        "https://grad.uci.edu/funding/current-fellowships/",
        "https://grad.uci.edu/funding/employment/",
        "https://grad.uci.edu/funding/teaching-assistantships/",
        "https://grad.uci.edu/funding/research-assistantships/",
        "https://grad.uci.edu/funding/childbirth-accommodation-childcare-reimbursement/",
        "https://grad.uci.edu/funding/other-resources/",
        "https://grad.uci.edu/funding/training-grants/",
        "https://grad.uci.edu/funding/financial-aid/",
        "https://grad.uci.edu/funding/tax-information/",
        "https://grad.uci.edu/funding/nrst-remission-program/",
        "https://grad.uci.edu/professional-development/graduate-and-postdoctoral-scholar-resource-center/",
        "https://grad.uci.edu/professional-development/one-on-one-services/",
        "https://grad.uci.edu/professional-development/certificate-programs/",
        "https://grad.uci.edu/professional-development/grad-slam/",
        "https://grad.uci.edu/professional-development/industry-partners/",
        "https://code.ics.uci.edu/",
        "https://grad.uci.edu/professional-development/teaching-internships/",
        "https://grad.uci.edu/professional-development/graduate-postdoctoral-scholar-resource-center/california-community-college-internship-program-cccip/",
        "https://grad.uci.edu/professional-development/graduate-and-postdoctoral-scholar-resource-center/csu-long-beach-pre-professor-program/",
        "https://grad.uci.edu/professional-development/graduate-and-postdoctoral-scholar-resource-center/professional-success/",
        "https://grad.uci.edu/well-being/well-being/campus-resources/",
        "https://grad.uci.edu/well-being/well-being/",
        "https://grad.uci.edu/well-being/well-being/peers-offering-wellness-education-resources-power/",
        "https://grad.uci.edu/well-being/well-being/spring-up/",
        "https://grad.uci.edu/diversity-equity-inclusion/diversity/",
        "https://grad.uci.edu/diversity-equity-inclusion/campus-student-services-centers/",
        "https://grad.uci.edu/diversity-equity-inclusion/graduate-interconnect-program/",
        "https://grad.uci.edu/diversity-equity-inclusion/decade/",
        "https://grad.uci.edu/diversity-equity-inclusion/campus-visits-for-graduate-preparation-programs/",
        "https://grad.uci.edu/current-students/international-students-resources/",
        "https://grad.uci.edu/prospective-students/graduate-preparation-programs/",
        "https://grad.uci.edu/current-students/student-resources/",
        "https://grad.uci.edu/prospective-students/why-choose-uci/",
        "https://grad.uci.edu/postdocs/information-for-postdocs/",
        "https://grad.uci.edu/alumni/alumni-friends/",
        "https://grad.uci.edu/admissions/for-faculty-staff/",
        "https://apply.grad.uci.edu/apply/",
        "https://grad.uci.edu/admissions/applying-to-uci/",
        "https://grad.uci.edu/admissions/degree-programs/",
        "https://grad.uci.edu/admissions/application-fee-fee-waivers/",
        "https://grad.uci.edu/prospective-students/virtual-open-house/",
        "https://grad.uci.edu/admissions/information-for-international-applicants/",
        "https://grad.uci.edu/admissions/housing/",
        "https://grad.uci.edu/admissions/faq/",
        "https://grad.uci.edu/admissions/for-faculty-staff/",
        "https://grad.uci.edu/admissions/privacy-and-non-discrimination/",
        "https://grad.uci.edu/admissions/timeline-for-preparation/",
        "https://grad.uci.edu/admissions/tips-for-applying/",
        "https://grad.uci.edu/funding/current-fellowships/",
        "https://grad.uci.edu/funding/employment/",
        "https://grad.uci.edu/funding/teaching-assistantships/",
        "https://grad.uci.edu/funding/research-assistantships/",
        "https://grad.uci.edu/funding/childbirth-accommodation-childcare-reimbursement/",
        "https://grad.uci.edu/funding/other-resources/",
        "https://grad.uci.edu/funding/training-grants/",
        "https://grad.uci.edu/funding/financial-aid/",
        "https://grad.uci.edu/funding/tax-information/",
        "https://grad.uci.edu/funding/nrst-remission-program/",
        "https://grad.uci.edu/professional-development/graduate-and-postdoctoral-scholar-resource-center/",
        "https://grad.uci.edu/professional-development/one-on-one-services/",
        "https://grad.uci.edu/professional-development/certificate-programs/",
        "https://grad.uci.edu/professional-development/grad-slam/",
        "https://grad.uci.edu/professional-development/industry-partners/",
        "https://code.ics.uci.edu/",
        "https://grad.uci.edu/professional-development/teaching-internships/",
        "https://grad.uci.edu/professional-development/graduate-postdoctoral-scholar-resource-center/california-community-college-internship-program-cccip/",
        "https://grad.uci.edu/professional-development/graduate-and-postdoctoral-scholar-resource-center/csu-long-beach-pre-professor-program/",
        "https://grad.uci.edu/professional-development/graduate-and-postdoctoral-scholar-resource-center/professional-success/",
        "https://grad.uci.edu/well-being/well-being/campus-resources/",
        "https://grad.uci.edu/well-being/well-being/",
        "https://grad.uci.edu/well-being/well-being/peers-offering-wellness-education-resources-power/",
        "https://grad.uci.edu/well-being/well-being/spring-up/",
        "https://grad.uci.edu/diversity-equity-inclusion/diversity/",
        "https://grad.uci.edu/diversity-equity-inclusion/campus-student-services-centers/",
        "https://grad.uci.edu/diversity-equity-inclusion/graduate-interconnect-program/",
        "https://grad.uci.edu/diversity-equity-inclusion/decade/",
        "https://grad.uci.edu/diversity-equity-inclusion/campus-visits-for-graduate-preparation-programs/",
        "https://grad.uci.edu/current-students/international-students-resources/",
        "https://grad.uci.edu/prospective-students/graduate-preparation-programs/",
        "/news",
        "/events",
        "https://givingday.uci.edu/",
        "https://apply.grad.uci.edu/apply",
        "http://apply.grad.uci.edu/status",
        "#ELP",
        "#ELP",
        "#ELP",
        "#ELP",
        "#ELP",
        "https://grad.uci.edu/admissions/applying-to-uci/",
        "https://grad.uci.edu/admissions/degree-programs/",
        "https://grad.uci.edu/admissions/application-fee-fee-waivers/",
        "https://grad.uci.edu/admissions/information-for-international-applicants/",
        "https://grad.uci.edu/admissions/housing/",
        "https://grad.uci.edu/admissions/faq/",
        "https://grad.uci.edu/admissions/for-faculty-staff/",
        "https://grad.uci.edu/admissions/privacy-and-non-discrimination/",
        "https://grad.uci.edu/admissions/timeline-for-preparation/",
        "https://grad.uci.edu/admissions/tips-for-applying/",
        "https://grad.uci.edu/admissions/councilofgraduateschools/",
        "https://grad.uci.edu/prospective-students/why-choose-uci/",
        "https://grad.uci.edu/prospective-students/why-choose-uci/",
        "https://grad.uci.edu/admissions/information-for-international-applicants/",
        "https://grad.uci.edu/admissions/information-for-international-applicants/",
        "https://grad.uci.edu/funding/current-fellowships/",
        "https://grad.uci.edu/funding/current-fellowships/",
        "https://grad.uci.edu/admissions/degree-programs/",
        "https://grad.uci.edu/admissions/application-fee-fee-waivers/",
        "https://grad.uci.edu/wp-content/uploads/2021/11/F22-Application-GRE-requirement.xlsx",
        "https://docs.google.com/spreadsheets/d/1fVi97K1Jdgw5EMRJ54Nmj7Z_NCYcJxTHwNimsT1uN6s/edit?usp=sharing",
        "http://www.ets.org/gre",
        "http://www.ets.org/gre",
        "",
        "http://whed.net/home.php",
        "https://www.whed.net/Contact.html",
        "https://grad.uci.edu/funding/teaching-assistantships/",
        "https://www.grad.uci.edu/academics/degree-programs/index.php",
        "http://www.ets.org/toefl/",
        "https://www.ets.org/toefl/test-takers/ibt/scores/",
        "http://www.ielts.org/",
        "http://www.ielts.org/",
        "mailto:TOEP@uci.edu",
        "",
        "https://www.grad.uci.edu/academics/degree-programs/index.php",
        "https://www.interfolio.com/contact/",
        "",
        "",
        "",
        "https://grad.uci.edu/admissions/degree-programs/",
        "https://grad.uci.edu/current-students/admitted-student-checklists/",
        "https://uci.edu/visit/maps.php",
        "https://apply.grad.uci.edu/register/contactform",
        "http://grad.uci.edu/admissions/degree-programs/",
        "http://grad.uci.edu/home-page/forms-and-applications/",
        "mailto:grad@uci.edu",
        "https://www.facebook.com/UCIrvineGD",
        "https://twitter.com/ucirvinegd",
        "https://www.instagram.com/ucirvinegd/",
        "https://www.linkedin.com/company/uc-irvine-graduate-division",
        "https://www.youtube.com/user/ucirvinegd",
        "https://www.flickr.com/photos/ucigd/",
        "/contact-us/",
        "http://grad.uci.edu/privacy",
        "https://grad.uci.edu/non-discrimination-policy/",
        "https://uci.edu/copyright/"
    ]
}