{
    "title": "Sisweb, the student information system on the web",
    "body": "\n\n\n\nStudent Information System (SISWEB)\n\n\n\n\nLogin to Schedule BuilderNew!\n\n\n\n\n\nRegistered students\nYou can use SISWEB to enroll in classes, adjust your class schedule, view and print your class schedule, print your unofficial academic \trecord, change your address, view your account, view your financial aid status, and much more.\nProspective Undergraduates\nCheck SISWEB for your application status using your Prospective Student UC Davis ID.\nProspective Graduates\nYou can apply for Graduate Studies or check the \u0003status of your application.\n\n\nRelated Links\n\nOffice of the University Registrar\nGraduate Studies\nUndergraduate Admissions\nGraduate Admissions\nFinancial Aid\nUC Davis Home\n\n\n\n\nRegister for classes using the new Schedule Builder tool!\nSchedule Builder is a new class planning and registration tool available in beta version, which you can use instead of SISWeb for spring quarter. It allows you to search for classes and register in one place. It’s also mobile friendly, so you can use it from a Web-enabled smartphone or tablet.The Office of the University Registrar wants to ensure that Schedule Builder meets your needs; we encourage you to try it, then tell us about your experience by using the “Feedback” button. After you use Schedule Builder, you will be able to view your class schedule in SISWeb as well. And if you’d prefer to register for classes the old way, you can still access SISWeb. SISWeb also remains available for other tasks, such as updating your address and phone number.\n                Try it today!\n\n\n\nSearch and register for classes\nCreate and save multiple schedules for the same quarter prior to your registration period\nCheck for registration holds and errors prior to your registration period  \nRegister for one class at a time or for all classes at once\nBeginning with Pass 2 registration, choose if you’d like to be added to the waitlist for classes that are full\nView your schedule in both list and calendar formats\nChange classes and sections without losing your existing registration\nView class details and critical class messages\n\n\n\n\n\n\nQuick Reminders\n\n                To access the SISWEB system you will need your UC Davis LoginID and corresponding password. Information on the campus computing account is available from Information and Educational Technology, which manages the accounts.\n\nThe SISWEB system is normally available 24 hours a day, except from midnight Friday through 10 a.m. Saturday.\nPLEASE REMEMBER, if you are using a public terminal, to exit/quit the browser when your are finished. This will help protect the security of your personal information.  Do not use the forward/back buttons on your browser unless specifically directed to.\n\n\n\nNeed Help?\n\nSISWEB Information\nContact the Office of the University Registrar\nContact Financial Aid\nContact Graduate Financial Aid\n\n\n\n\n\n\n",
    "links": [
        "https://my.ucdavis.edu/schedulebuilder/index.cfm?sb",
        "http://registrar.ucdavis.edu",
        "http://gradstudies.ucdavis.edu",
        "http://admissions.ucdavis.edu",
        "http://gradstudies.ucdavis.edu/prospective/apply_online.html",
        "http://financialaid.ucdavis.edu",
        "http://www.ucdavis.edu",
        "https://my.ucdavis.edu/schedulebuilder/index.cfm?sb",
        "http://computingaccounts.ucdavis.edu",
        "http://registrar.ucdavis.edu/registration/register/sisweb.cfm",
        "mailto:registrar@ucdavis.edu",
        "mailto:undergradfinaid@ucdavis.edu",
        "mailto:gradfinaid@ucdavis.edu"
    ]
}