{
    "title": "TikTok for Good",
    "body": "TikTokOur idea is simple...use TikTok to do good.TikTok wants to inspire and encourage a new generation to have a positive impact on the planet and those around them. Check out some organizations that have used TikTok to grow their audience, activate supporters, and raise awareness around specific causes.Contact usHere are a few ways TikTok can help you help the world.Account ManagementLet us help you tap into the potential of our talented TikTok creators. We will assist with best practices, manage relationships, and offer guidance every step of the way until you’ve reached your end goal.Advanced Analytics (Beta)Let’s drive real change together. Our data and insights will provide you with analytics about your account and your videos to see how your audience develops and how your videos perform over time.Promoted HashtagsIncrease awareness for your cause with a promoted hashtag. Millions of TikTok users can then create videos to that hashtag.Previous Campaigns#EduTokEduTok, TikTok's most popular challenge to date, encourages users to create educational and motivational content around a variety of themes.  As well as this in-app challenge, TikTok has launched a mentorship program with leading social enterprises Josh Talks and The/Nudge Foundation, which will reach 5000 young individuals across 6 Indian states with lower literacy rates. EduTok underlines TikTok's commitment to propelling India's creative economy and its contribution to the lives of digital natives.8.8M videos created48.1B video views#PetBffTikTok worked with animal shelters and animal welfare organizations worldwide in a global campaign to celebrate International Homeless Animals' Day 2019. For every video posted, TikTok donated $1 to its animal protection partners (up to a maximum of $175,000 USD). 490K videos created2.4B video views#ForClimateIn partnership with the International Federation of Red Cross and Red Crescent Societies, TikTok launched a global campaign to spread climate change awareness in over 100 markets. With special effects, filters and stickers, TikTok users shared knowledge about climate change, drew attention to the impacts of extreme weather, and urged people to better protect our planet.273K videos created384M video views#MyEarthHour2019Earth Hour, initiated by World Wildlife Fund, is the world’s largest collective environmental movement, which launches annual public celebrations in 3,500 cities across more than 170 countries. TikTok joined the 2019 Earth Hour campaign as a global partner of WWF, inviting users and celebrities around the world to support environmental protection.50K videos created100M video views4.5M in-app likes#DanceForChangeThe United Nation’s International Fund for Agricultural Development (IFAD) launched the world’s largest dance challenge to help people in rural areas of Africa and other developing countries. IFAD’s #DanceForChange TikTok’s videos were created by our users as a virtual petition to increase investment in sustainable agriculture.33K videos created81M video viewsLoad moreContactName OrganizationSelectSelectNon-profitGovernmental agencyAcademic institutionOtherEmail MessageSendDownload nowQR CODEScan QR code to download TikTokTikTokCompanyAbout TikTokNewsroomContactCareersByteDanceProgramsTikTok for GoodTikTok for DevelopersEffect HouseAdvertise on TikTokgettext(`web_menu_tiktok_rewards`,_ps_null_pe_,_is_null_ie_)TikTok BrowseTikTok EmbedsResourcesHelp CenterSafety CenterCreator PortalCommunity GuidelinesTransparencyAccessibilityLegalTerms of Service© 2023 TikTok",
    "links": [
        "https://www.tiktok.com/forgood",
        "https://www.tiktok.com/download-link/af/id835599320",
        "https://www.tiktok.com/download-link/af/com.zhiliaoapp.musically",
        "https://www.amazon.com/dp/B0117U0G3M/",
        "https://www.microsoft.com/store/apps/9NH2GPH4JZS4",
        "https://www.tiktok.com/about?lang=en",
        "https://newsroom.tiktok.com/en-us",
        "https://www.tiktok.com/about/contact?lang=en",
        "https://careers.tiktok.com",
        "https://www.bytedance.com",
        "https://www.tiktok.com/forgood?lang=en",
        "https://developers.tiktok.com/?refer=tiktok_web",
        "https://effecthouse.tiktok.com/?utm_source=tiktok_web_article",
        "https://www.tiktok.com/business/&attr_source=tt_official_site&attr_medium=tt_official_site_guidance",
        "https://www.tiktok.com/tiktok-rewards",
        "https://www.tiktok.com/browse",
        "https://www.tiktok.com/embed",
        "https://support.tiktok.com/en",
        "https://www.tiktok.com/safety?lang=en",
        "https://www.tiktok.com/creators/creator-portal/",
        "https://www.tiktok.com/community-guidelines?lang=en",
        "https://www.tiktok.com/transparency?lang=en",
        "https://www.tiktok.com/accessibility",
        "https://www.tiktok.com/legal/terms-of-service?lang=en"
    ]
}