{
    "title": "Nacin – WordPress Lead Developer",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tSkip to content\t\n\n\n\nNacin\nWordPress Lead Developer\nMenu and widgets\n\n\n\n\n\n\nAbout Me  Hi, I'm Andrew Nacin, a Lead Developer of WordPress, living in Washington, D.C., and previously working for the U.S. Digital Service at the White House. More...\n\nFind Me \n@nacin on Twitter\non WordPress.org\n\n \n\n\n\n\n\n\n\nSmarter algorithms, smarter defaults \n\nInstead of showing the user an alert that something might not work, maybe we can build a smarter algorithm. Instead of asking the user to make a choice up front, maybe we can set a smart default and see if there is high demand after launch for more customization.\n— Rebecca Rolfe on the Google Chrome team, interviewed in The Badass Women of Chrome’s Security Team in Refinery29.\n(More on making decisions, not options.)\n\n\nPosted on May 24, 2015May 24, 2015Tags decisions, design, WordPress \n\n\n\nI’ve joined the White House’s U.S. Digital Service \n\nThe need for effective government services is rising, while confidence in our ability to deliver them is dropping. More than ever, day-to-day interactions with government are powered by digital systems, and yet far too many Federal IT projects arrive late or over budget. Others are simply abandoned. These failures are often felt by those who count on it most — working class Americans and people who turn to government in a moment of need.\nThe U.S. Digital Service on whitehouse.gov\nWhen you’re presented with an opportunity to help transform how the federal government works for the American people, it’s really hard to say no.\nFor five years and counting, I’ve had the honor and privilege as a lead developer of WordPress to play a role in a large, incredible movement to democratize publishing. From my home in D.C., I’ve closely watched open data and open government efforts. I feel very strongly about an open, transparent, and efficient government — boosted in no small part by WordPress and open source.\nI’ve long admired a number of my new teammates, especially Erie Meyer, Gray Brooks, and Haley van Dyck, for years of tenacity and hard work trying to change government from the inside out. I’ve always felt I could be more effective helping government from the outside, by continuing to work on WordPress. After all, we’ve all heard horror stories of all sorts of red tape, from hiring to procurement and everything in between. And we’ve all heard how difficult government itself makes it to launch good government digital services. While many of us may have have wanted to help, few thought they could. Fewer knew how.\nBut then the U.S. Digital Service was formed, from the team that helped rescue healthcare.gov. It’s dedicated to tackling some of government’s most pressing problems, ones that directly affect millions of people’s lives. The formula is simple: take what helped turn around healthcare.gov and apply it to other high priority projects across government.\nIn this day and age, public policy must be backed by effective technology to succeed. The American people need our help and our government has asked us to serve, as doers and makers, creative thinkers, and specialized technologists dedicated to untangling, rewiring, and redesigning our government.\nIn January, I joined the U.S. Digital Service.\nWhen I was approached, I have to admit that I was nervous to step back from the day-to-day buzz of WordPress because I’ve invested so much. But the community stepped up, in most cases not even knowing about my life change. That’s the beauty of open source, and the fantastic WordPress community in particular. WordPress continues to play an important role in my life. With Matt Mullenweg’s support and encouragement, I’m taking time away from Audrey, where I’ve worked since 2010. I’m still actively involved in the project, just not full time.\nThe U.S. Digital Service is the real deal. I’ve been astounded by the impact we’ve already made. We’ve recruited some of the best and brightest. Don’t just take my word for it — do what you can to learn more about this movement and come help us make government better. If you haven’t seen the video below yet, take a look. (A few of you have noticed me in the background.)\nIt’s my nature to look for the hardest problems to solve. I like to take on big challenges and spend every ounce of energy working to solve them. I believe in what we’re doing here. The stakes are high. No matter the challenge, I know what we’re doing will change millions of lives.\nI thought I had made the most of my decade in D.C. I’ve witnessed a lot of history. I knew I’d have some great stories to tell my future kids and grandkids. I was there. I saw it. That was only the beginning.\n\n\n\nPosted on March 29, 2015July 1, 2016Tags government, U.S. Digital Service, WordPress8 Comments on I’ve joined the White House’s U.S. Digital Service \n\n\n\nYou can call it congestion or throttling. I call it unacceptable. \n\nI pay for 105 Mbps of downstream Internet from Comcast, and I get just 6 Mbps every evening.\nI’ve been running speed tests for weeks now. It looks like this every time:\n\n\n\n\n\n\t\t\t\tEvery day.\n\t\t\t\t\n\n\n\n\n\t\t\t\tEvery night.\n\t\t\t\t\n\nI put a sizable hole in my wallet every month for “Blast” internet. Comcast even upgraded “Blast” from 50 Mbps to 105 Mbps recently, but each evening, I might as well be using their 6 Mbps “Performance Starter.” When I actually want to use anything close to the speeds they charge me for, I can’t.\nPlease, Comcast, tell me how you’re going to blame Netflix for this one.\nPlease, Comcast, tell me again you can send a technician but only during business hours, when my Internet works fine.\nPlease, Comcast, tell me how you’re going to charge me more.\nPlease, Comcast, tell me how net neutrality would stifle “innovation” and discourage you from “investing” in infrastructure.\nAnd please, Comcast, tell me how that would be any different from the status quo.\n\n\nPosted on June 12, 2014June 12, 2014Tags net neutrality3 Comments on You can call it congestion or throttling. I call it unacceptable. \n\n\n\nSecurity is nuanced \n\nAs a software vendor, there are many reasons to prefer responsible disclosure of security issues. But the most important reason is also less obvious: vulnerability reports need to be correct.\nI’ve seen countless “full disclosure” reports that are wrong and invalid. Most of these could have been prevented by privately disclosing it to the vendor and allowing them the opportunity to respond.\nEveryone sees WordPress in the headlines, over and over again, but no one ever notices the “this report is invalid” response. We’ve prevented countless invalid reports from being published simply because they were disclosed to us first. This is better for the software’s users, who are otherwise left to scramble every time they see a report. They are not an expert, and often, neither is the reporter.\nThere’s another angle here, though: sometimes, the vulnerability report is correct, but incomplete. This too can send everyone scrambling, starting with the vendor who was not given the opportunity to straighten things out.\nWhen responsible disclosure works, it works really well. I offer Jetpack’s recent vulnerability as a recent case study. While this was discovered internally at Automattic, the effect is the same: they were able to quickly and thoroughly investigate the issues and follow through with a plan of action. During their investigation they learned the problem was far more severe than they originally identified, and that their initial proposed fix was incomplete.\nThere will always be individuals who want everything to be fully disclosed, and there are some great arguments for that. I’m not trying to sway you one way or the other. But if you’re trying to do the right thing — you’re doing full disclosure in the interest of users, possibly even providing a patch or steps to mitigate — working with the vendor is a good way to ensure you haven’t missed anything.\nI’m not sure how many times now I’ve responded to a mailing list saying, “well, this isn’t a vulnerability,” or “your proposed patch is incomplete,” or “your patch makes it worse.” Or when I don’t respond to the mailing list because my thought is This is worse than the reporter realizes.\nSecurity is nuanced.\nLast week, a security researcher disclosed some issues with WordPress. They stated that WordPress issues a cookie in plain HTTP that identifies the user. Correct. They also stated that this cookie does not expire when the user logs out. Also correct.\nShe went on to state that the cookie has a lifetime of 3 years, that it can be used to mess with the account’s two-factor authentication settings, and change their email and other settings. She followed that up with “have notified them and waited 24hrs for response, none yet. guessing it’s a wontfix for now, since their SSL support is patchy.”\nYes, absolutely, SSL support in WordPress is patchy. (Coincidentally, fixing all of this was already slated for the next major release.) While you can force SSL for the dashboard, we don’t have the concept of forcing SSL for the front-end of the site. So, that “logged in” cookie is issued over plain HTTP. It’s trivial in a plugin to force that cookie to be secure, but of course most users aren’t going to do that. Of course, most users also aren’t using SSL (sadly).\nWordPress also doesn’t have any concept of session management. The user is authenticated and a cookie is issued, but there’s no way for it to be automatically invalidated upon logout (without you changing your password). Changing this is a major architectural change we’ve been planning for some time. But this is also why cookies are designed with a limited expiration: just 48 hours, or 14 days if you click “Remember me.”\nBut the report was that it didn’t expire for three years, right? This is where it gets a bit weird. I’d love it if “Remember me” remembered you for 30, 90, or even 365 days, but WordPress will wait to make any changes until cookies can be invalidated. Some time ago, though, WordPress.com configured this cookie to last for three years.\nNormally, this wouldn’t be that bad. You see, the “logged in” cookie is relatively harmless. It allows presentational things like the toolbar, edit links in your theme, and such. But you can’t use it to manage your account, change your email, or do anything particularly crazy. In fact, WordPress issues a separate, secure “auth” cookie used for the “wp-admin” dashboard. It’s like Amazon knowing who you are after six months of not being on the site, but asking you to log in when you start to check out.\nOn WordPress.com, however, a lot of settings can be managed outside of the dashboard, on their “new dashboard,” at wordpress.com/settings/. As you might have guessed by now, they were not requiring the “auth” cookie on this page, only the “logged in” cookie. That is the true critical vulnerability here. A number of decisions came together to make a latent issue a very real one. The issue wasn’t reported like this because the reporter isn’t familiar with the intricacies of user authentication internals in WordPress, nor should anyone expect them to. Rather, an assumption was made it was a design decision that would probably just be a “wontfix” due to “patchy” SSL support.\nThe disclosure was well-intentioned, but because it happened within just 24 hours, Automattic wasn’t able to react quickly enough to identify the actual issue and request that it not be disclosed until they got a fix in place.\nI’m just trying to set the record straight on what happened, since I keep seeing confused tweets, blog posts, comments, and Facebook chatter. (Favorite Facebook comment, after I posted a brief explanation: “Did we just open all those nesting doll layers to discover the belly was empty?”) This situation probably could have been handled better by everyone involved, but that’s not really the point. The primary issue is now handled, and other issues are also being addressed. I don’t think this requires post-mortem blog posts with a side of FUD. I’m not looking for a debate on full disclosure versus responsible disclosure. And I certainly don’t think anyone should be questioning the researcher, who has spent years dedicating herself to making the Internet more secure.\nIn this case, WordPress.com the service was able to react quickly to mitigate this issue for all of its users. Of course, with software, holes can’t be closed so easily, and in this case, the situation was probably exacerbated by confusing WordPress.com the service with WordPress the software. That confusion is easy to understand, especially since some of these issues have roots in the core software.\nSecurity is nuanced.\nI’ve not linked to any previous posts because I don’t want this to be a criticism of any researcher or writer, but if you’re looking for background: 1 2 3. Also, related work for WordPress 4.0 is happening here.\n\n\nPosted on May 30, 2014May 30, 2014Tags security, WordPress5 Comments on Security is nuanced \n\n\n\nMy Talk Proposals for Open Source Bridge \n\nUpdate, April 29: I’m excited to share that both of these proposals were accepted. See you soon, Portland!\n\n \nI submitted two proposals to Open Source Bridge, an annual conference in Portland, Oregon, for “open source citizens.” The call for papers is now closed, but they let anyone leave comments on proposals that are private to the conference organizers. If you have any feedback on these, or have seen me speak before, it would be awesome if you could leave a comment. Here they are:\nExtreme Software Portability as an Art Form\nWriting portable software is hard. Throw in thousands of bad and worse shared hosting configurations, a decade of technical debt, the need to cater to a sprawling ecosystem, and PHP — and you have WordPress. We’ve found breaking changes harm our community and unfairly punish our users, so we don’t make them. But that doesn’t mean we don’t innovate or evolve — we’re just forced to get really clever. And it works, with adoption continuing to soar.\nTrust, Community, and Automatic Updates\nWordPress shipped in October what is perhaps its most polarizing feature ever — automatic updates in the background of self-hosted web software, on by default and no easy way to turn it off. In most open source communities, this would be cause for open revolt. Learn how through trust, communication, and a steadfast commitment to its philosophies, the WordPress core team convinced a skeptical community to go along, even if it meant users giving up some control.\nWordPress contributors Mel Choyce and Aaron Jorbin also both submitted proposals: My Journey into Open Source Design and Modernizing a Stagnant Toolbox.\n\n\nPosted on April 15, 2014April 29, 2014Tags Open Source Bridge, speaking, WordPress1 Comment on My Talk Proposals for Open Source Bridge \n\n\nPosts navigation\nPage 1\nPage 2\n…\nPage 17\nNext page\n\n\n\n\n\n\n\n\t\t\t\tProudly powered by WordPress\t\t\t\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://nacin.com/",
        "https://www.usds.gov/",
        "/about/",
        "http://twitter.com/nacin",
        "http://profiles.wordpress.org/nacin",
        "https://nacin.com/2015/05/24/smart-algorithms-defaults/",
        "http://www.rebeccarolfe.com/",
        "http://www.refinery29.com/female-white-hat-hackers-google-chrome",
        "http://nacin.com/2011/12/18/in-open-source-learn-to-decide/",
        "http://nacin.com/2013/07/01/firefox-makes-a-decision-removes-an-option/",
        "https://nacin.com/2015/05/24/smart-algorithms-defaults/",
        "https://nacin.com/tag/decisions/",
        "https://nacin.com/tag/design/",
        "https://nacin.com/tag/wordpress/",
        "https://nacin.com/2015/03/29/us-digital-service/",
        "https://www.whitehouse.gov/digital/united-states-digital-service/story",
        "http://www.data.gov/",
        "https://m.whitehouse.gov/blog/2014/06/02/ostp-s-own-open-government-plan",
        "http://nacin.com/2014/03/24/an-hour-to-make-government-better/",
        "http://www.nextgov.com/cio-briefing/2015/03/meet-digital-service-guru-whos-helping-new-recruits-navigate-federal-bureaucracy/107148/",
        "http://apieconomist.com/blog/2013/4/10/6h6gntzp6twfuw4zwrzu0j43u0o80p",
        "http://fcw.com/articles/2014/12/02/getting-started-at-usds.aspx",
        "http://wired.com/2014/08/healthcare-gov/",
        "http://playbook.cio.gov",
        "https://www.usds.gov/",
        "http://ma.tt/",
        "https://www.whitehouse.gov/blog/2015/03/19/president-obama-names-david-recordon-director-white-house-information-technology",
        "http://www.washingtonpost.com/blogs/the-switch/wp/2014/09/04/white-house-names-googles-megan-smith-the-next-chief-technology-officer-of-the-united-states/",
        "https://www.whitehouse.gov/blog/2014/08/20/day-one-mikey-dickerson-us-digital-service-administrator",
        "https://www.whitehouse.gov/blog/2015/02/18/white-house-names-dr-dj-patil-first-us-chief-data-scientist",
        "https://www.whitehouse.gov/blog/2015/02/05/next-us-chief-information-officer",
        "https://medium.com/@USDigitalService/why-i-joined-the-u-s-digital-service-24c6682afce2?source=latest",
        "https://medium.com/@USDigitalService/mikey-dickerson-to-sxsw-why-we-need-you-in-government-f31dab3263a0",
        "http://www.usds.gov/",
        "https://nacin.com/2015/03/29/us-digital-service/",
        "https://nacin.com/tag/government/",
        "https://nacin.com/tag/u-s-digital-service/",
        "https://nacin.com/tag/wordpress/",
        "https://nacin.com/2015/03/29/us-digital-service/#comments",
        "https://nacin.com/2014/06/12/comcast/",
        "https://nacin.com/2014/06/12/comcast/day/",
        "https://nacin.com/2014/06/12/comcast/night/",
        "http://www.vox.com/2014/6/5/5783554/yes-poor-netflix-performance-is-verizons-fault",
        "https://nacin.com/2014/06/12/comcast/",
        "https://nacin.com/tag/net-neutrality/",
        "https://nacin.com/2014/06/12/comcast/#comments",
        "https://nacin.com/2014/05/30/security-is-nuanced/",
        "http://jetpack.me/2014/04/10/jetpack-security-update/",
        "https://zyan.scripts.mit.edu/blog/wordpress-fail/",
        "http://arstechnica.com/security/2014/05/unsafe-cookies-leave-wordpress-accounts-open-to-hijacking-2-factor-bypass/",
        "http://wptavern.com/wordpress-com-security-vulnerability-stirs-debate-over-responsible-disclosure",
        "https://core.trac.wordpress.org/query?milestone=4.0&component=Security",
        "https://nacin.com/2014/05/30/security-is-nuanced/",
        "https://nacin.com/tag/security/",
        "https://nacin.com/tag/wordpress/",
        "https://nacin.com/2014/05/30/security-is-nuanced/#comments",
        "https://nacin.com/2014/04/15/my-talk-proposals-for-open-source-bridge/",
        "http://opensourcebridge.org/",
        "http://opensourcebridge.org/proposals/1413",
        "http://opensourcebridge.org/proposals/1419",
        "http://opensourcebridge.org/proposals/1315",
        "http://opensourcebridge.org/proposals/1312",
        "https://nacin.com/2014/04/15/my-talk-proposals-for-open-source-bridge/",
        "https://nacin.com/tag/open-source-bridge/",
        "https://nacin.com/tag/speaking/",
        "https://nacin.com/tag/wordpress/",
        "https://nacin.com/2014/04/15/my-talk-proposals-for-open-source-bridge/#comments",
        "https://nacin.com/page/2/",
        "https://nacin.com/page/17/",
        "https://nacin.com/page/2/",
        "https://wordpress.org/"
    ]
}