{
    "title": "About Stanford Report - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\nAbout Stanford Report \n\nStanford Report is published by University Communications. It is the university’s portal for Stanford community news, including messages from university leadership, news about campus life and university affairs, policy updates, new research, upcoming events, and more. Stanford Report’s mission is to communicate the key information that faculty, staff, and students need to thrive in their roles at Stanford, while also delivering feature content that connects them to the university and its vision to ensure equity and inclusion, create a future where humans and nature thrive, explore the boundaries of knowledge, accelerate the application of new knowledge, and prepare students for lives of active citizenship.\nThe Stanford Report newsletter\n\n\nAdvertise in Stanford Report\nThe Stanford community, including schools, departments, and related programs, can advertise in the daily Stanford Report newsletter to faculty, staff, and postdocs. Spots are available for purchase with a PTA on a first-come, first-served basis. The editors reserve the right to determine each ad’s placement. Learn more about advertising.\n\nStanford Report is a curated email newsletter that draws from the news published on the Stanford Report website and includes stories from Stanford News as well as content published by schools, departments, and units campus-wide. There are currently three versions of Stanford Report, each containing differentiated content based on audience research conducted by University Communications:\n\nA daily version sent to faculty, staff, and postdocs contains news about university affairs, campus life, and research.\nA twice-weekly version sent to graduate and undergraduate students during the academic year features information about opportunities, resources, deadlines, and policies that affect students.\nA daily version sent to our extended community (non-stanford.edu) subscribers – including parents, prospective students, members of the media, and opinion leaders outside the university – features news about research, institutional news that impacts the world beyond Stanford, and stories about Stanford’s engagement with the local community.\n\nMore sources for Stanford news\nStanford News: Part of the Office of University Communications, Stanford News assists reporters and disseminates much of the university’s research and scholarship news, helps publicize and handle media relations for major events, provides media training for key faculty and administrators, and serves as a liaison between scholars and media outlets.\nEvents Calendar: Explore lectures, performances, and exhibitions taking place on campus. Campus organizations can request an account to post events.\nStanford Mobile App: The official mobile app of Stanford University has dining options, events, news, maps, transit information, and more for students, staff, faculty, alumni, parents, and friends.\nFollow Stanford on social media:\n\nInstagram\nFacebook\nTwitter\nLinkedIn\nYouTube\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "https://srads.stanford.edu/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/",
        "https://events.stanford.edu/",
        "https://events.stanford.edu/signup",
        "https://uit.stanford.edu/stanford-mobile",
        "https://www.instagram.com/stanford/",
        "http://facebook.com/stanford",
        "http://twitter.com/stanford",
        "https://www.linkedin.com/school/stanford-university",
        "http://youtube.com/stanford",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}