{
    "title": "Life of Hard Work Pays Off for Agricultural Business Major - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nLife of Hard Work Pays Off for Agricultural Business Major\n\nLuke Reid\nMay 1, 2023\n\n\n\n\n(Matthew Bates / University Photographer) \n\n\n\nAt a very early age Zion Brigham learned how to squeeze every minute out of a day.\nHis family’s crop-dusting business operated six days a week, making Saturdays the lone opportunity to go on adventures together.\n“We would pile in the car at 2 a.m. and drive to a place like Joshua Tree National Park,” Brigham said. “We’d get there, do a hike, and then get back in the car to drive home because my dad would have to fly early the next morning.”\nThey called these excursions Brigham Road Trips, and together, they hit every national park on the west coast at least once.\nThe life of the Brigham’s revolved around these escapades and the family business. While Zion was never interested in flying, he did his part to help out, getting up before dawn and working until dusk. He also raised sheep and tended to the family bulls.\n“I was always involved with something. I never had downtime,” he says.\nThis trend continued in college. At Chico State, Brigham has carried a full load, excelling academically, all while competing in national agriculture competitions and working full time as an assistant store manager at Tractor Supply Company. Prior to this, Brigham attended Merced Community College by day while working the night shift at a quarry.\n“I’m used to the overload,” he said. “It’s going to be kind of weird graduating and only working next year.”\nBrigham plans to continue working at Tractor Supply next year while his girlfriend completes her degree. But make no mistake—this studious, methodical planner has big plans beyond that.\nFirst, he’d like to work for the US Department of Agriculture Foreign Agricultural Service (FAS) for a variety of reasons.\n\n“I tell people that when I came to Chico it felt like going from a black and white TV to full color. The professors at Chico State really want to be involved and that’s such a cool part of being here.”\n Zion Brigham\n“It would be a great opportunity to gain some additional experience and work for a really cool organization. They might put you in Argentina, Vietnam, or wherever they have agricultural trade,” Brigham explained. “You’re talking to farmers, working with them, getting data for them, and helping them establish connections to the United States. That’s where the data analysis becomes important, when doing trade negotiations.”\nThinking even longer term, he’d like to get a master’s degree, a PhD, and eventually become a college professor.\nBrigham admits that his busy schedule has kept him from experiencing some of the special parts of Chico, including its outdoor and social scene. But he has taken full advantage of every opportunity the agricultural business department has to offer.\n“I tell people that when I came to Chico it felt like going from a black and white TV to full color,” Brigham said. “The professors at Chico State really want to be involved and that’s such a cool part of being here.”\nBrigham was part of Chico State’s winning team—both regionally and nationally—at the USDA Foreign Agricultural Service Agricultural Export Market Challenge in March of 2022. He teamed up with Kurt Sheppard and Erin Hartley to strategize the best foreign market to implement a fictitious product called “Clean Burp” into.\nIt was after that experience that Brigham set his sights on working for FAS.\n“We made a lot of connections,” Brigham said. “It opened up my eyes to the great career opportunities that the FAS offers, and personally, it has changed my career plan for the better.”\nNow a senior, ready to graduate in May, he is poised to get a first taste of downtime.\nWith it, he hopes to use some well-deserved days off to check a few more National Parks off the list, on his quest to visit each one.\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tLuke Reid\t\t\n\n\n\t\tLuke Reid (History, '04; Kinesiology, '09) is a content producer for University Communications.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/lreid/",
        "https://today.csuchico.edu/zion-brigham/?share=facebook",
        "https://today.csuchico.edu/zion-brigham/?share=twitter",
        "https://today.csuchico.edu/zion-brigham/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Life%20of%20Hard%20Work%20Pays%20Off%20for%20Agricultural%20Business%20Major&body=https%3A%2F%2Ftoday.csuchico.edu%2Fzion-brigham%2F&share=email",
        "https://today.csuchico.edu/zion-brigham/#print",
        "#",
        "https://today.csuchico.edu/author/lreid/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}