{
    "title": "Topic: What is the most important thing BuddyPress is missing? · BuddyPress.org",
    "body": "\n\nSkip to:\nContent\nPages\nCategories\nSearch\nTop\nBottom\n\n\n\n\n\n\nAbout\nDocumentation\nGet Involved\nNews\nSupport\nDownload\n \nBuddyPress.org\n\n\n\n\n\nWhat is the most important thing BuddyPress is missing?\n\n\n\n\n\nMathieu VietModerator\n@imath\n7 months ago\n\n\nHello everyone,\nLet’s talk about us, BuddyPress!\n\nWe’d love to have your opinions about this simple question. Thanks in advance for your feedbacks & feel free to share this topic with all the people you know are using BuddyPress or used to 🙏.\n\n\n\n\n\n\nViewing 25 replies - 1 through 25 (of 45 total)\n1\n2\n→\n\n\n\n\n\nMuhittinParticipant\n@muhittinsahilli\n7 months ago\n\n\nModern UI/UX, Follow Feature,\n\n\n\n\n\nJohn James JacobyKeymaster\n@johnjamesjacoby\n7 months ago\n\n\nDeep admin integration for all core components and logged-in Members – show me my activity in my User Profile, etc…\nA default set of universally wrappable theme-side template parts for one-line-of-code integration into any WordPress theme/builder/blocks, that ultimately outputs what equates to a self-hosted Tumblr clone.\n\n\n\n\n\nok2netParticipant\n@ok2net\n7 months ago\n\n\nGood day. Thank you for your hard work and the will to the future. About what is missing in my opinion. You correctly wrote that now social communities are retreating, rather payment-related and other details are coming. I would make some kind of connection with Woocommerce as much as possible, perhaps I would add the function of paid participation, paid subscriptions and everything like that. It seems to me that the audience earning with your plugin is much more willing to pay and it is growing.\n\n\n\n\n\nMathieu VietModerator\n@imath\n7 months ago\n\n\nHi  @ok2net  @muhittinsahilli &  @johnjamesjacoby 😉\nThanks a lot for your feedbacks 😍. Very interesting ideas!! I’ll add the « spam protection » one I received on Twitter to the list.\nJust like John who gave the right example as a Project Lead, I’ll share my ideas 😁.\nA first category of ideas is about getting more hands to help us build great things:\n– A BuddyPress annual meeting like a BuddyCamp but online to welcome everyone on earth: a « World-BuddyCamp »\n– As BuddyPress is more than just a plugin, we should probably have more « official » teams to compliment the BP Core one: Support, Theme, Docs, REST API, Marketing (?), …\n– The BuddyPress.org network to host developer/contributors docs & Core development updates.\n– A great BP Standalone theme for the BuddyPress.org site as well as a replacement for the BP Default theme.\n– Providing recommanded Addons to help new users choose the right BP plugins for their need.\nÀ second category of ideas is about code:\n– making BP Rewrites the default URL parser,\n– going even more granular than we are, moving optional components as BuddyPress add-ons: this would probably help us to improve each feature and Core/Members with the basic features a user can expect from a community feature software.\n– Blocks to standardize ways to share media/rich tools into activity streams, private conversations and why not Template pack & themes.\n– Of course BP Attachments, user generated media to share with the BP community as well as giving WordPress Admins a new source for their editorial content.\n– Private conversations revamped looking more like private chats / slack exploring WebRTC or Server-Sent Events.\nAnd finally I invite  @dcavins,  @espellcaste,  @boonebgorges,  @djpaul,  @r-a-y,  @mercime and all the members of the team to follow  @johnjamesjacoby example! Let’s all share what we think BuddyPress is missing 😇\n\n\n\n\n\nrivers1844Participant\n@riversdale1844\n7 months ago\n\n\nHello\nThank you for your work and for asking.\nI have installed and uninstalled the plugin a few times. My problem was conflict with other plugins say membership plugins that play a critical role on our site. But, I also wanted greater customization.  – What do I mean by that? Shortcodes, feature activation choice – for example: I may only want to use certain aspects of BuddPress and NOT the whole pack. I may like the messaging and docs for example. Having the ability to ACTIVATE the sections I need with say a check box would be excellent. Then for these sections I could use shortcodes on pages to add only those sections to the page I created. This gives me more flexibility for designing my site how I prefer, not the other way around. So any user could design their site with the entire system of buddy press how they prefer – rather than how it is with links and sub links etc.\nThe other challenge I had, was it competed and dominated any other profile plugins and I would have to work hard to prevent that. But if it is flexible and unassuming, I think people would appreciate the flexibility. \nDesign it where it is okay – if a user just use one section and all other features can be activated or deactivated – I think that is a big plus.\nIf you consider this and add it – allow it to ONLY create pages for the features selected and activated, so it reduce the excess files. So page creation happen ONLY after the desired sections are activated\n\n\n\n\n\nrivers1844Participant\n@riversdale1844\n7 months ago\n\n\nIf I may be BOLD to add also – not just text chat, but also Video chat – with screenshare. The sky is the limit right? \n\n\n\n\n\nRenato AlvesParticipant\n@espellcaste\n7 months ago\n\n\nBefore diving into technical or feature suggestions since as a developer I’m automatically wired to go via that route, I thought about asking non-technical people about the product, BuddyPress, itself.\nI recently participated in the WordCamp US and had the chance of talking to a few people, besides conversations I had online (Slack, etc). I think the overall feedback I gathered is that BuddyPress needs to find its product-market fit.\n## Product-market Fit\nThe overall argument is that BuddyPress made sense when it was created because organizations needed a unique social network. Nowadays this is easily solvable with other tools that weren’t available at the time like Slack, Discord, Telegram, Facebook Groups, etc.\nIt’s much easier now to create social communities/networks using those tools than using BuddyPress. So as a project, we are not only competing against other open source projects but also with big companies which provide a solution to this problem in a much better way.\nSo far, all the conversation I’ve read about this issue sort of understands this new reality but the solutions presented miss this important point. So finding a new “place” for BuddyPress in this new scenario might actually be the most important thing we can do and that will define how we spend our resources going forward.\n## BuddyPress’ problems\n### Complexity\nBefore I became a BuddyPress contributor, I used to build small communities for clients. One of the first things I noticed about this niche was that all communities were the same but different. There was always a small tweak or a small feature on top of an existing component needed. BuddyPress was perfect for business. Clients didn’t know how to do it, so they hired me to build or extend it for them.\nEven to this day, I still think BuddyPress suffers from this “problem”. If you are not a developer, BP is too hard to change. In BuddyPress’ marketing, it sells itself as flexible software, which is, but only if you are a developer extending or building something on top of it. Not to the regular users that install or try to use it.\nI think this is an area where other tools thrive in comparison. People don’t usually build social networks with BuddyPress because it is open source. That also includes WordPress. They use WordPress because it is easy, a good solution for a problem at hand: “how do I make my own dam website?”. \nQuoting feedback I got recently:\nEvery good product is a tool that helps people execute their creative vision, saves them time on boring tasks, or entertains in some way.\nOn top of that, BuddyPress is still considered expensive to many, be that due to the need to hire developers, to buy themes and plugins to accomplish their creative vision.\n### Feature Set\nI think BuddyPress has a strong foundation of features to create a social community. But as mentioned before, users are trying to execute this creative vision, so there is always something more needed.\nThis is an area where BuddyPress lacks as a project and in extensions (plugins that add features to BuddyPress) as well.\nThe most emblematic examples are the Follow Feature and the Media component. The first one because it is so basic in the land of social networks. And the latter in the lands of Instagram and photo apps. But the core BuddyPress plugin lacks both.\nOn top of that, features/components are pretty hard to integrate or extend as mentioned. Whereas other tools, provide an almost seamless experience, a rich set of features in a Jetpack-like style where you only need the click of a button to get something working and showing in the default theme. \n### Conservatism\nHere speaking as a contributor and observer of both WordPress and BuddyPress. \nBuddyPress is still too conservative when it comes to changes or new features, however small they are. There seems to be a philosophy or approach that it’s practiced not against change but I’d argue that it is an almost “orthodoxical” concern to changes and new features which in my opinion is impeding the project to evolve. \nA recent example was the introduction of PHPCS support which to me it would be considered a no-brainer but that it took more time to convince than I anticipated or expected.\nAnd this is also an overall theme with BuddyPress. I see a willingness of the project to experiment and a desire to evolve but we still move at a very slow pace (even in the heyday of the project).\nThere is a “desire” to change and evolve but over years I also see a hesitation which “drags” the project a little bit.\n### Low number of contributors\nBuddyPress has been suffering from a low number of contributors in recent years. The reasons for that could be varied. It is also not clear if that’s actually a big problem for the project. I’d argue that it is not that big.\nBut it is clear that identifying what’s turning possible contributors away is a very good first step. And what we can do to revert that.\n## Finally, some suggestions for the project\n### Decide on a product market fit\nThis should have a high priority. Whatever we decide here will dictate how resources will be spent. What features will be built. What areas will have the most attention. IMO, this might be the most consequential decision for the future of the project.\n### Improve the feature set\nAs mentioned previously, basic features of a social network are still missing in BuddyPress. Privacy, social networking, and following features are all missing. In the past, the argument I’ve always heard/read was that those features were better off served by plugins. Whereas users would be more likely to expect them inside the core plugin.\nSo I think BuddyPress needs a more complete set of social networking features. And that those features should be more integrated with each other and other parts of the site.\nh3. Improve the project’s marketing\nI think we need to do a better job of marketing what we offer. Not only look and feel but also of presenting information to the user.\n– \nThat’s it! Not a lot of suggestions but I’m purposefully not adding technical suggestions to the project because I feel this is secondary. As long as we do not get into a new product market fit, we might not be addressing the real issue of the project.\n=)\n\n\n\n\n\nPaul GibbsKeymaster\n@djpaul\n7 months ago\n\n\nThe problem with asking contributors who put so much time into a project in its early days, is that those people often have rose-tinted glasses and inaccurate memories of what worked well and what didn’t, and what they wished they could have done differently. 🤩\nBuddyPress at the start was “Facebook in a box”, and broadly remains the same today. Facebook, on the other hand, has changed dramatically. \nIf it were down to me, I am not sure if I would replace BuddyPress’ systems while building new things and break backwards compatibility on purpose, or decide to keep legacy BuddyPress secure, and have current generation contributors start on a new plugin.\nVery few websites stay up as long as BuddyPress is old, so I think in reality, the impact of starting from a clean slate is all about attracting new users, rather than worrying about trying to get old sites to migrate (any old site isn’t going to change dramatically). You’d still have the same challenge – attracting new users! (You could build a migration script in due course). \nI believe the actual question is, what does a self-hosted social network look like *today* (and what kind?), and where might it go in the future? Build toward that aggressively, and be bold and remove things that aren’t in that vision.\nFor me, my next would focus around concepts from Discord, Slack, TikTok, Instagram. \n\n\n\n\n\nuser4forumParticipant\n@user4forum\n7 months ago\n\n\nJust my opinion and just an AI translation:\nWhere are the sticking points?\nBP core:\nAfter 9 months with BP and several free BP plugins, there are still a lot of questions. Group handling and invitation are too complex and partly illogical. (Example: Group Owner is allowed to remove himself and then the administrator has to ‘intervene’). Furthermore, internal e-mail, where you have to select users based on their usernames (@…). Also not visually appealing and sometimes rather confusing in use. Other BP features (sorting/displaying members within groups!) that don’t work even on a WP default theme (Twenty Twenty-Two). Just annoying!\nIn principle, the core plugin provides too little (in terms of functionality). Best example: Blogging and media. Something that defines WP at its core. In addition to two larger commercial “BP providers” and some ancient plugins in the WP repo, the selection and comparability is difficult if you want to use them for specific rights and groups. I understand that you want to offer an open and expandable system, but something “more” would be desirable or necessary.\nBP mailing list:\nHardly any actions, but many (trivial) questions and no answers. On the other hand, technically interesting answers are often 10 years or more in the past (and unfortunately still up-to-date in principle), but where there is no attempt to test them in a current BP version.\nToDo (Plugins into Core):\nDirectory: Very important! Of course you can use “BP Custom Fields” but there’s no option to do a filter search, based on different fields to exclude displaying other profiles – or I just can’t find the options. Tried “BP Profile Search”\nWhy not just embed a few components “more tightly” into the core, why not simply take over the source code of others who simply “copy” BP themselves without returning anything to the community? There was an interesting discussion about this recently on another platform site.\nWishes:\n– Rights management for pages/posts or for individual BP components (either private/public or at user level) – e.g. “User Access Manager”\n– E-mail communication between each other without having to use the real e-mail address and being able to leave the borders of BP – e.g. “BP Reply By Email”\nIt’s a pity, but currently STILL not enough for uncomplicated use and sometimes stopped in development. In addition, commercial providers who copy BP as well as other WP Social Media Group solutions that are more complete and appear more self-contained.\nTo name a few plugins that could be partially included:\nTheme: BuddyX (free)\nBP 11 (dev) &\nBP Attachments (dev) (what does it do? Substitution of BuddyDrive?)\n– bbPress (smarter integration)\n– BP Profile Search (no filter options found)\n– BP Reply By Email (should be core as option)\n– BuddyDrive (should be Core)\n– Buddpress Docs\n– BuddyPress Xprofile Custom Field Types (should be core)\n– BuddyPress Xprofile Conditional Fields (should be core)\n– Rendez Vous (should be core as option)\n– “BuddyPress XY Blog” (should be core)\n– “BuddyPress XY Search”\n\n\n\n\n\nMathieu VietModerator\n@imath\n7 months ago\n\n\nHi  @djpaul thanks a lot for sharing your thoughts 😍. It’s true BuddyPress backward compatibility is preventing us to do breaking changes. I thought using a plugin to try to migrate to Rewrite API would help make the transition. Problem is not much plugin developers are testing it and we’re stuck.\nAlthough a bit « radical », I like the idea of restarting from another plugin, it’s probably something we should consider: I agree it’s the safest way to avoid being stuck by backward compat and still have an old plugin for old users and plugin developers 😇.\nI’ll be a bit provocative 😁. I’m wondering since Plugin developers never show up to contribute or test BuddyPress: is maintaining backward compatibility worth the pain?\nOr is the fact we’re maintaining this backward compatibility is the reason why plugin developers are not very involved in contributing to BuddyPress ?\nIt’s a very tough choice to make as we’ve all put a lot of ourselves into the « old » plugin. \n\n\n\n\n\nMathieu VietModerator\n@imath\n7 months ago\n\n\nHi & thanks a lot for your feedback  @user4forum\nIt’s funny you’re talking about BP Reply by email, as I’ve contributed for comment reply by email for WordPress a while ago and it stayed in the void! See https://core.trac.wordpress.org/ticket/52283\nI guess we could use some code of it for BuddyPress 😅.\nAbout BuddyDrive and Rendez-vous, I was their first contributor so I know them pretty well 😀. Some ideas I had when building BuddyDrive came back lately while working on BP Attachments.\nMore than being in BP Core, I believe users are expecting plugins to be maintained and we think moving them to BP Core will make this goal satisfied. I’m more interested in a BP Core restricted to the minimum and every other optional components to be packaged into BP Addons we can install and activate separately.\n\n\n\n\n\nDavid BissetParticipant\n@dimensionmedia\n7 months ago\n\n\nI might be too close to BuddyPress since using it since the 0.1 days (yes, that version is right). I do agree more with the comments so far about the “product fit” and some of that “vibe” feels like some people talking about where WordPress itself (which BP relies on) although I feel WordPress still fills many holes and has a long life to it. But there are two factors I consider to be competitors that offer attractive, “modern/hip”, and easier (in same cases) solutions:\n– TikTok, Instagram, etc. social networks – the trend of posting content OUTSIDE your site and not truly 100% owning it. These are the “Wix” and “Medium” versions that WordPress exists with. They are easier to setup and the social mass effect can’t be beat. It would be neat though to have a BP-lite that could setup a TikTok like video sharing network (perhaps that could intergrate with 3rd parties). I’m not sure if there’s a “build this feature and it will help big” here, since if a user or client wants to use them you can’t stop them. But appeal maybe to the niche (which BuddyPress has always done well) and the customizers out there that maybe want something like them, or something that has a slimed down feature set with an attractive new theme/look.\n– BuddyBoss. Surprised this hasn’t been brought up. Look at what they are doing in terms of features. The past few freelance projects that the cilents could have used BuddyPress on for new projects, they went and paid for BuddyBoss. My observations has been because of the (1) marketing, (2) features, and (3) continued support (the mobile app also maybe played a part although I’ve heard disappointing experiences about that). I know some don’t like BuddyBoss because they’ve forked BP and (as far as I know) really haven’t contributed anything back (GPL, open source, etc.) But if you’re looking for features, look at what this for-profit company is doing (big and small) because logically they are likely listening to their base and current customers and their actions and focus might be some input.\nI do support a BuddyCamp (I used to have a BuddyCamp Miami way back… in 2010 I think?).\nSome good BuddyPress plugins have been difficult to recommend because of their maintenance or lack thereof, with no fault to the authors. But BuddyPress always needs SOME plugins when being used for projects. Might be also nice for other plugin companies (say Yoast?) to promote their BuddyPress support.\nI would love to see a new theme but not sure yet what direction to offer further $0.02 on that.\nNo real comments from a coding perspective – there are developers here with more experience in that. A “BuddyPress lite” plugin if you’re talking about “restarting from another plugin” might be worth some discussion. Imagine just spending 5 minutes with a few clicks and you have your own private, secure social network just for your friends/family. Simple. Easy. Modern looking, works with modern tech, etc.\n\n\n\n\n\nsunsetcowboyParticipant\n@sunsetcowboy\n7 months ago\n\n\nOn a personal note, one thing I would like to see on BuddyPress is a complete Groups hierarchy with (multiple) parents, siblings and child groups. I reckon this would open a whole new market for things like geneology (big business).\nAlso I think you should take a good look at the rival product BuddyBoss, which, feature wise, is ahead of Buddypress in so many ways. A good media integration for example is a must have, likewise a file download system. BP could have the edge on its rival though, simply because the latter concentrates on Premium features.\nJust my 2 cents\n\n\n\n\n\nMathieu VietModerator\n@imath\n7 months ago\n\n\nHi  @dimensionmedia &  @sunsetcowboy\nThanks a lot for your very interesting feedbacks 😍. \nI think we’ve deliberately avoid the buddyboss subject because it has been talked a lot here https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward and we end up talking more about this fork than BuddyPress 😇.\nI believe we shouldn’t try to do features the same way they’re doing. We need to lead by example, to innovate, to carry on being good citizens of the open source and being supportive about WordPress choices (eg: going into blocks as much as we can).\nI don’t think « customers » are into the BuddyPress « targets ». We want to provide totally free, open source & secure community features to WordPress sites and every human being. We’re trying to make wise & « general interest » oriented choices.\nWe have a very important advantage : we are into the WordPress Official Plugins directory, we should really use this advantage and split BuddyPress into smaller parts as it will always be easier to install Addons hosted on the WordPress Plugins directory.\nThe « lite » featured Buddypress idea is very interesting, it could be BP Core + BP Members, the only 2 required components.\nAnd David, we really need to organize this « Buddy-World-Camp » 🙌😅. We also need to get together 😍\n\n\n\n\n\nDavid BissetParticipant\n@dimensionmedia\n7 months ago\n\n\nThanks for the reply  @imath. I was simply implying to look and see what they are doing – SOME of what they are doing I think fits into general interest (look at how they deal with media). They are doing research and it would be foolish to ignore some parts, even if it in the end it leads to ways we can mold it more toward BuddyPress thinking. \nSometimes you can lead my example, other times you can lead by taking something and making it better in some way.\nThere’s a balance with addons – too many and a user can get overwhelmed with choices and research but overall I lean toward simple as possible. Perhaps it’s something that is simple for a niche purpuse that uses BuddyPress “under the hood”. It’s not a great example but thinking about “how can I spin up a special kind of to-do app that I can add my friends and share and collab with, while still owning my data, control, etc”. Thought of this today while my kid was showing me what she does in Notion today.\nOk, so if the WordPress repo is our advantage – then how do we use that advantage? how do we stand out (from member sites and other social plugins)? how do we feature BB plugins that are trust worthy and maintainable that avoid people having to dive into thousands of plugins in this “important advantage”? Good questions, looking forward to hearing more from people about them. \nI don’t believe BuddyPress is missing THAT many features. Part of this is also changing with the times. Which means maybe thinking a little differently – even if it’s me thinking differently from how I look at BuddyPress when I started with it so many years ago. ☮️\n\n\n\n\n\nMathieu VietModerator\n@imath\n7 months ago\n\n\nYou’re welcome  @dimensionmedia. No worries I understood your point 😁. I won’t talk more about this subject here and focus on BuddyPress instead. You made a very good point about the WordPress Plugins directory:\nOk, so if the WordPress repo is our advantage – then how do we use that advantage? how do we stand out (from member sites and other social plugins)? how do we feature BB plugins that are trust worthy and maintainable that avoid people having to dive into thousands of plugins in this “important advantage”? Good questions, looking forward to hearing more from people about them.\nYou’re right, I believe we can try to help Users with this kind of shortcuts:\n\nBut we’d need more contributors to test/review BuddyPress plugins, which is maybe a too big dream I’m doing, I agree 😇\nWhat I was meaning, was: It’s possible to transform optional components into plugins and preserve the current user experience and only install what they need, thanks to the WordPress.org API.\nAnother advantage of being into WordPress.org plugins directory are updates (semi or fully automatic). The Plugin team is also doing a great job to eventually “suspend” plugins in case of security issues or wrong behaviors.\n\n\n\n\n\nDavid BissetParticipant\n@dimensionmedia\n7 months ago\n\n\nI think it’s worth considering turning optional components into plugins as long as discovery and onboarding are done REAL well. The plugin directory is definitely a way, but i’ve seen companies do one-click installs from inside the settings screens of the plugins themselves.\nAlso another subject – how often do we (the collective we) feature prominent, large, special, or niche BuddyPress powered sites? If developers see potential that might get them more involved in testing, etc. Problem is how to discover or find them on a constant basis. This goes back to a mention of mine of “marketing” earlier.\n\n\n\n\n\nhellojesseParticipant\n@egyptimhotep\n6 months, 3 weeks ago\n\n\nThe reason why developers prefer different platform is because doing new type of theme based on js framework and not on general wp template files and learn new js framework require a lot of time.\nAnother reason is lack of ducumentation for developers and code examples. Codex must be improved.\nIf Woocommerce has theme storefront for using features of woo and has also open source woocommerce mobile app, bouddypress can have the same. Dedicated theme wich gonna be very easily customized with blocks and template tags. Source code for customizing buddypress mobile app.\nI love 💕 buddypress.\n\n\n\n\n\nstaionParticipant\n@staion\n6 months, 3 weeks ago\n\n\nThe most important thing BuddyPress is missing is social engagement. BuddyPress lacks a lot of features that makes a social network. Likes / Reactions, media posting, hashtags, user activity as main activity page, suggestions like who to befriend and what groups to join, and many more.\nYes, these features are present with the help of other BuddyPress plugins, but why? Why not make them part of the core? These are generic social networking features that all other social platforms have.\nOr at least make them add-ons. The theme is my last suggestion. Make a simple theme for BP so that developers can modify it as they please. Install the theme when BP is installed. Or maybe suggest to install the theme after.\n\n\n\n\n\nDr md shahriar kabirParticipant\n@shahriar83\n6 months, 2 weeks ago\n\n\nActivity edit, reaction, share, chat, live, video conversation, short videos become more popular during COVID19 LOCKDOWN. \n\n\n\n\n\nDr md shahriar kabirParticipant\n@shahriar83\n6 months, 2 weeks ago\n\n\nDuring office work in lockdown of covid, buddypress not give proper support. In modern time there have revolutionary change in social media. Reaction, activities variation,etc. Suddenly chating programmes become more popular than email & social media post. WhatsApp, instagram, Twitter, tiktok give some extra experience than buddypress. In present time facebook, instagram, WhatsApp try to make many change to stay stable. Youtube start short video after popularity of tiktak. We should depend on many more plugins for design the buddypress based community. So reduce dependency on them. Without theme you should develop moser buddypress template, which is suitable for modern time in all device. Hashtags also.\n\n\n\n\n\nUnsal KorkmazParticipant\n@unsalkorkmaz\n6 months, 2 weeks ago\n\n\nMobile app.\nBrowser only websites are dying, slowly. Can you imagine discord, telegram etc without a mobile app?\nI am working on a wordpress theme that focuses on being a bridge for headless wordpress + https://quasar.dev\nI believe BuddyPress can be ground breaking for any mobile app that built with WordPress.\n\n\n\n\n\nosmor1Participant\n@osmor1\n6 months, 2 weeks ago\n\n\nI need a “Temporal Latest Activity and Profile Activity Feed” for Buddypress plugin. For now Buddypress Activity public Feed is so annoying with so many activities. We need to manage activities on public Feed and Profile Feed for a month, a week, a day or less.\nTemporal Latest Activity Feed. Please.  @imath\n\n\n\n\n\nJKDuckParticipant\n@jkduck\n6 months, 2 weeks ago\n\n\nWhat I am missing most as as a new user of buddy press:\n–> an easy way to create a registration page and user profiles (including  fields required to apply for user regsitration)\n\n\n\n\n\nosmor1Participant\n@osmor1\n6 months, 2 weeks ago\n\n\nI need a voice call like Facebook messenger or Whatsapp. I want my users can make calls to whoever they want to.  @imath\n\n\n\n\n\n\nViewing 25 replies - 1 through 25 (of 45 total)\n1\n2\n→\n\n\n\n\nThe topic ‘What is the most important thing BuddyPress is missing?’ is closed to new replies.\n\n\n\n\n\n\n\n\nTopic Info\n\nIn: Requests & Feedback\n46 replies\n25 participants\nLast reply from: Mathieu Viet\nLast activity: 5 months, 1 week ago\n\n\n\nTopic TagscontributeFeedback \n\n\nReply Search\nSearch for:\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tSee also:\t\t\t\t\tWordPress.org •\n\t\t\t\t\tbbPress.org •\n\t\t\t\t\tBuddyPress.org •\n\t\t\t\t\tMatt •\n\t\t\t\t\tBlog RSS\n\n\n\n\nFollow BuddyPress on Twitter •\n\t\t\t\t\tGPL •\n\t\t\t\t\tContact Us •\n\t\t\t\t\tPrivacy •\n\t\t\t\t\tTerms of Service\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to toolbar\n\nWordPress.orgAbout WordPressDocumentationSupport ForumsFeedbackDeveloper TracDeveloper BlogbbPress.orgAbout bbPressDocumentationSupport ForumsFeedbackDeveloper TracDeveloper BlogBuddyPress.orgAbout BuddyPressDocumentationSupport ForumsFeedbackDeveloper TracDeveloper BlogBuddyPress.orgLog inAnonymousAnonymousNot Logged InRegisterLog In \n\n",
    "links": [
        "#content",
        "#pages",
        "#categories",
        "#search",
        "#top",
        "#bottom",
        "#",
        "https://buddypress.org/about/",
        "https://codex.buddypress.org/",
        "https://codex.buddypress.org/participate-and-contribute/",
        "https://buddypress.org/blog/",
        "https://buddypress.org/support/",
        "https://buddypress.org/download/",
        "https://buddypress.org",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/",
        "https://buddypress.org/2022/09/lets-talk-about-us-buddypress/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/page/2/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/page/2/",
        "https://buddypress.org/members/muhittinsahilli/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326384",
        "https://buddypress.org/members/johnjamesjacoby/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326385",
        "https://buddypress.org/members/ok2net/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326386",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326402",
        "https://buddypress.org/members/ok2net/",
        "https://buddypress.org/members/muhittinsahilli/",
        "https://buddypress.org/members/johnjamesjacoby/",
        "https://buddypress.org/members/dcavins/",
        "https://buddypress.org/members/espellcaste/",
        "https://buddypress.org/members/boonebgorges/",
        "https://buddypress.org/members/djpaul/",
        "https://buddypress.org/members/r-a-y/",
        "https://buddypress.org/members/mercime/",
        "https://buddypress.org/members/johnjamesjacoby/",
        "https://buddypress.org/members/riversdale1844/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326406",
        "https://buddypress.org/members/riversdale1844/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326407",
        "https://buddypress.org/members/espellcaste/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326420",
        "https://buddypress.org/members/djpaul/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326447",
        "https://buddypress.org/members/user4forum/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326448",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326457",
        "https://buddypress.org/members/djpaul/",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326458",
        "https://buddypress.org/members/user4forum/",
        "https://core.trac.wordpress.org/ticket/52283",
        "https://buddypress.org/members/dimensionmedia/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326475",
        "https://buddypress.org/members/sunsetcowboy/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326477",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326479",
        "https://buddypress.org/members/dimensionmedia/",
        "https://buddypress.org/members/sunsetcowboy/",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward",
        "https://buddypress.org/members/dimensionmedia/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326481",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326482",
        "https://buddypress.org/members/dimensionmedia/",
        "https://buddypress.org/members/dimensionmedia/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326483",
        "https://buddypress.org/members/egyptimhotep/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326550",
        "https://buddypress.org/members/staion/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326552",
        "https://buddypress.org/members/shahriar83/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326617",
        "https://buddypress.org/members/shahriar83/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326618",
        "https://buddypress.org/members/unsalkorkmaz/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326622",
        "https://quasar.dev",
        "https://buddypress.org/members/osmor1/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326642",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/members/jkduck/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/#post-326647",
        "https://buddypress.org/members/osmor1/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/page/2/#post-326653",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/page/2/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/page/2/",
        "https://buddypress.org/support/forum/feedback/",
        "https://buddypress.org/members/imath/",
        "https://buddypress.org/support/topic/what-is-the-most-important-thing-buddypress-is-missing/page/2/#post-327252",
        "https://buddypress.org/support/tag/contribute/",
        "https://buddypress.org/support/tag/feedback/",
        "https://wordpress.org",
        "https://bbpress.org",
        "https://buddypress.org",
        "https://ma.tt",
        "https://buddypress.org/feed/",
        "https://twitter.com/buddypressdev",
        "https://buddypress.org/about/gpl/",
        "https://buddypress.org/contact/",
        "https://wordpress.org/about/privacy/",
        "https://buddypress.org/terms/",
        "#wp-toolbar",
        "https://wordpress.org",
        "https://wordpress.org",
        "https://wordpress.org/about/",
        "https://codex.wordpress.org/",
        "https://wordpress.org/support/",
        "https://wordpress.org/support/forum/requests-and-feedback",
        "https://core.trac.wordpress.org",
        "https://make.wordpress.org",
        "https://bbpress.org",
        "https://bbpress.org/about/",
        "https://codex.bbpress.org/",
        "https://bbpress.org/forums/",
        "https://bbpress.org/forums/forum/requests-and-feedback",
        "https://bbpress.trac.wordpress.org",
        "https://bbpdevel.wordpress.com",
        "https://buddypress.org",
        "https://buddypress.org/about/",
        "https://codex.buddypress.org/",
        "https://buddypress.org/support/",
        "https://buddypress.org/support/forum/feedback/",
        "https://buddypress.trac.wordpress.org",
        "https://bpdevel.wordpress.com",
        "https://buddypress.org",
        "https://login.wordpress.org/?from=buddypress.org&redirect_to=https%3A%2F%2Fbuddypress.org%2Fsupport%2Ftopic%2Fwhat-is-the-most-important-thing-buddypress-is-missing%2F&locale=en_US",
        "https://login.wordpress.org/?from=buddypress.org&redirect_to=https%3A%2F%2Fbuddypress.org%2Fsupport%2Ftopic%2Fwhat-is-the-most-important-thing-buddypress-is-missing%2F&locale=en_US",
        "https://login.wordpress.org/?from=buddypress.org&redirect_to=https%3A%2F%2Fbuddypress.org%2Fsupport%2Ftopic%2Fwhat-is-the-most-important-thing-buddypress-is-missing%2F&locale=en_US",
        "https://login.wordpress.org/register?locale=en_US",
        "https://login.wordpress.org/?from=buddypress.org&redirect_to=https%3A%2F%2Fbuddypress.org%2Fsupport%2Ftopic%2Fwhat-is-the-most-important-thing-buddypress-is-missing%2F&locale=en_US"
    ]
}