{
    "title": "Advising @ SDSU | Faculty Advancement and Student Success | SDSU",
    "body": "\n\n\n\n\nskip to main content\nClose Menu\n\n\n\n\n\n\n\nSan Diego State University\n\n\nFaculty Advancementand Student Success\n\n\n\n\n\n\n\nInformation\n\nFuture Students\nCurrent Students\nFaculty/Staff\nAlumni\n\n\nDisability Services\nCampus Directory\nGive\n\nIntroduction\nGiving Priorities\nWays to Give\nPlanned Giving\nGive Now\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\nFaculty Advancement and Student Success\nAdvising\n\n\n\n\nMajor Advisor Directory\nSeeing an Advisor\nSDSU Navigate\n\n\n\n\n\nStudent Academic Success\n\n\n\n\nCalifornia Promise\nReenrollment\nFirst-Gen Student Success\nHonors Council and University Honors Societies\nIS3D\nNational Scholarships & Fellowships\nStudent Organizations\nSupplemental Instruction\nTransfer Student Success\nUndeclared Students\n\n\n\n\n\nUndergraduate Studies\n\n\n\n\nUndergraduate Studies Home\n\n\n\n\n\nWeber Honors College\n\n\n\n\nWeber Honors College\n\n\n\n\n\nResources\n\n\n\n\nOur Mission\nMeet the FASS Staff\nMath\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSan Diego State University\n\nFaculty Advancementand Student Success\n\n\nMenu\n\n\n\n\n\n\n\n\n\n\nNavigate this Section \n\n\n\n\n\n\n\n\nFaculty Advancement and Student Success\n\nAD-101, AD-201, AD-220\nMonday - Friday8:00AM-4:30PM\n(619)-594-5842\n[email protected]\n\n\n\n\nadvisING @ SDSU \n \nNEWLY ADMITTED STUDENTS\nYou've been admitted but aren't yet registered for courses.\n\n\n\nGeneral Questions\n\n\n\nIf you are a newly admitted student who has not yet registered for classes, please\n                                    contact New Student & Parent Programs (NSPP) if you have questions or concerns.\n\nPhone: 619-594-1509\nEmail: [email protected]\nWebsite: nspp.sdsu.edu/orientation\n\n\n\n\n\n\n\nEarly Advising: After Intent-to-Enroll to New Student Orientation (NSO)\n[April to July]\n\n\n\n\n\nFirst-year students may have the opportunity to meet with a Coordinated Care Advisor (hosted virtually) to get support with fall course registration, SDSU Navigate, pre-orientation\n                                       modules and to ask preliminary questions before NSO in July.\nIf you have questions about attending summer school, you may contact your college\n                                       directly:\n                                       \n                                        \n\n\nArts & Letters:\n\n\nhttps://cal.sdsu.edu/academics/student-success \n\n\n\n\nBusiness:\n\n\nhttps://business.sdsu.edu/undergrad/advising\n\n\n\n\nEducation:\n\n\nhttps://education.sdsu.edu/oss\n\n\n\n\nEngineering:\n\n\nhttps://csse.sdsu.edu/\n\n\n\n\nProfessinal Studies & Fine Arts:\n\n\nhttps://studentsuccess.sdsu.edu/major_advisor_directory\n\n\n\n\nSciences:\n\n\n[email protected] or virtual front desk open M-F 9-4pm https://cossuccess.sdsu.edu/ \n\n\n\n\nUndeclared: \n\n\n [email protected]\n\n\n\n\n\n\n\n\n\n\nAdvising @ New Student Orientation (NSO) \n[July]\n\n\n\n\nNSO will continue to support new student’s course registration and/or finalizing their\n                                    fall schedule. Coordinated Care Advisors, Major Advisors, Assistant Deans and SDSU\n                                    Ambassadors will support first-year and transfer students, so that when they leave\n                                    NSO, they have a full course load.  \nFor information: https://nspp.sdsu.edu/orientation\n\n\n\n\n \nPRE-MAJOR ACADEMIC ADVISING | COORDINATED CARE ADVISING\nYou are a first or second year undergraduate student with less than 60 units.\n \nAll first and second year students at SDSU are assigned a Coordinated Care Advisor\n                        (CCA) to support students' successful and smooth transition to the university. Note: \n\nFor all first-year students, the CCA should be the main and first point of contact\n                           for advising support.\nStudents should reach out to their CCA whenever they have questions.\nCCAs use an advising curriculum that guides students through their first two years\n                           at SDSU. \nCCAs work with the student to develop a degree graduation plan, learn to navigate\n                           university resources, procedures, and academic advising tools. \nCCAs proactively reach out to their assigned students to schedule academic advising\n                           meetings throughout the year.\nCCAs DO NOT advise students about which courses to take to satisfy major requirements.\n\n\n\n\nIs my Coordinated Care Advisor (CCA) the same as my Major Advisor?\n\n\nNo. The Coordinated Care Advisor (CCA) and Major Advisor are two distinct types of\n                                 advisor. Sometimes, your Major Advisor might also be your Cooridnated Care Advisor\n                                 (CCA), but not usually.\n\n\n\n\nHow do I know who my Coordinated Care Advisor (CCA) is?\n\n\n\n\nEvery SDSU student has a personalized Your Success Team -- a list of advisors and\n                                       other support staff -- on that list, you will see your CCA identified.\nLog in to SDSU Navigate using your SDSU ID.\nOn your home screen (in the bottom right side) you will see the list -- Your Success\n                                       Team. Tip: you can email them by clicking the envelope icon near their name (see image\n                                       below).\n\n\n\n\n\n\n\nHow do I schedule with my Coordinated Care Advisor (CCA)?\n\n\n\n\nAccess the Student Resources section of the SDSU Navigate website to learn how to use SDSU Navigate to schedule\n                                       appointments, and more.\nSchedule in SDSU Navigate using the service: \"Coordinated Care Advising\"\n\n\n\n\n\n\nWho do I see if I know I want to change my major?\n\n\n\n\nFamiliarize yourself with the Registrar's instructions for students wanting to change their major. \nWhen making appointments in SDSU Navigate to a change your major, be sure to schedule\n                                       your appointment using the follow service: \"Major/Minor Exploration or Change.\"\n\n\n\n\n\n \nMAJOR ADVISING \nYou are a third year undergraduate student (or beyond) or you have 60+ units.\n \nThe Major Advisor is a professional staff or faculty advisor who:\n\nProvides guidance specific to your major of record and graduation requirements, including:\n                           Academic plan/map; Course, schedule and elective planning; Academic/personal challenges\n                           (see for referral); Course substitution process; Degree Evaluation review; Graduation\n                           process; Letter of support; Planning for graduate studies\nHelps guide you in selecting courses, planning and scheduling your major preparation\n                           and upper division major courses, and assistance with creating an academic plan to\n                           support your progress towards graduation. Only Major Advisors are authorized to provide advice on classes to take to satisfy\n                              major requirements. \nAnswers questions regarding career opportunities and graduate studies in your major\n                           field; Academic plan/map; Course/schedule/elective planning; Academic/personal challenges\n                           (see for referral); Course substitution process; Degree Evaluation review; Graduation\n                           process; Letter of support; Planning for graduate studies.\n\nNOTE: Not all major advisors are available during the summer months. If your major advisor\n                        is unavailable during the summer months, email [email protected] for the proper advising referral.  \n\n\n\nHow do I know who my Major Advisor is?\n\n\n\n\nEvery SDSU student has a personalized Your Success Team -- a list of advisors and other support staff -- on that list, you will see your\n                                       CCA identified.\nLog in to SDSU Navigate using your SDSU ID.\nOn your home screen (in the bottom right side) you will see the list -- Your Success Team. Tip: you can email them by clicking the envelope icon near their name (see image\n                                       below).  \nThe Major Advisor Directory is an additional online resource that lists all Major Advisors on campus. \n\n \n\n\n\n\n\nHow do I schedule an appointment with my Major Advisor?\n\n\n\n\nAccess the Student Resources section of the SDSU Navigate website to learn how to use SDSU Navigate to schedule\n                                       appointments, and more.\nSchedule in SDSU Navigate using the service: \"Major Advising\"\n\n\n\n\n\n \nOTHER ADVISING & SUPPORT\n\n\n\n\nCollege Success Center | Student Success Advisor\n\n\n\n\nSDSU Navigate Service(s): \"General/Academic Advising\" and sometimes \"Major Advising,\"\n                                       \"Minor Advising\" or \"Major/Minor Exploration/Change.\"\nCollege Success Centers are hubs for advising and other support, but not all colleges\n                                    have them. In a center, Major, Minor, CCA, and Peer Advisors may all offer support\n                                    for student enrolled in that college, and sometimes the center offers general/academic\n                                    advising from Student Success Advisors. \n\n\nCollege of Arts and Letters Success Center\n\n\nCollege of Sciences Success Center\n\n\n\n\nCollege of Education Success Center\n\n\nFowler College of Business Success Center\n\n\n\n\nCollege of Engineering Success Center (CSSE)\n\n\n \n\n\n\n\n\n\n\n\nGeneral/Academic Advisors  \n(e.g. EOP, Honors, special programs. pre-major peer advising)\n\n\n\n\nSDSU Navigate Service: \"General/Academic Advising\"\nYou may see additional people listed in Your Success Team. These advisors can typically\n                                    advise you about graduation and general education (GE) requirements, university policies,\n                                    and programatic requirements and policies. General/academic advisors help with:\n\nCourse/schedule planning\nDegree Evaluation review\nGeneral Education (GE) and university graduation requirements\nCourse substitution process\nLetter of support (some)\nAcademic/personal challenge (for referral)\nPeer or premajor advising\n\nNote: General/academic advisors or Student Succes Advisors cannot advise on major requirement course selection.\nGeneral/academic advisors include, but are not limited to, the following:\n\nEOP Counselors: EOP Counselors provide academic, career, and personal counseling as well as facilitate\n                                       academic success and personal development. Please visit the EOP Counselors contact\n                                       information page for more information on how to connect with your EOP Counselor.\nSpecial Programs Advisors (e.g. Compact Scholars, Cultural Resource Centers)\nPremajor or Peer Advisors (e.g. College of Engineering)\nWeber Honors College Advisors: The Weber Honors College program is a unique minor, comprising an interdisciplinary\n                                       curriculum made up of small, discussion-based seminars and innovative teaching techniques\n                                       to promote engagement in the subject area, preparing students for high-impact educational\n                                       experiences. If you have elected to participate in the Weber Honors College program,\n                                       you will work directly with the Weber Honors College Advisor.\nPreprofessional Advisors: Preprofessional advisors are available for students pursuing a preprofessional career\n                                       (pre-medical, pre-law, etc.) and planning to attend professional schools. SDSU provides\n                                       pre-professional advising for the following programs:\n\n\n\n\nPreaudiology\nPredental\nPrelaw\nPremedical\nPreoccupational Therapy\nPreoptometry\nPrepharmacy\n\n\n\n\nPrephysical Therapy\nPrephysician Assistant\nPrepodiatric Medicine\nPresocial Work\nPre-Speech-Language Pathology\nPreveterinary \n\n\n\n\n\n\n\n\nMinor Advisor\n\n\n\nSDSU Navigate Service: \"Minor Advising\"\nA professional staff or faculty advisor who provides guidance about courses and requirements\n                                    specific to your minor of record.\n \n\n\n\n\n\nAssistant Dean\n\n\n\nSDSU Navigate Service: \"Asssitant Dean Support\"\nA professional staff member who supervises Major Advisors and helps with the most\n                                    complicated questions, like: \n\nAcademic/personal challenge\nAcademic probation/disqualification\nPetitions, for example: add/drop after deadline, change to CR/NC after deadline, leave\n                                       of absence, retroactive withdrawal\nStudent grievances\nEngagement/leadership opportunities\n\n\n\nCollege of Arts and LettersAileen Taylor-Grant[email protected]  \nCollege of EducationDr. Patricia Lozada-Santone[email protected] \nCollege of EngineeringTheresa Garcia[email protected] \nCollege of Health and Human ServicesJason Ramirez[email protected] \n\n\nCollege of Professional Studies and Fine ArtsLanie Lockwood[email protected] \nCollege of SciencesEstralita Martin[email protected] \nDivision of Faculty Advancement and Student Success (IS3D/Undeclared)Michelle Lopez[email protected] \nFowler College of Business (Acting)Patricia van Damme[email protected] \n\n\n \n\n\n\n\n\nCareer Counselor\n\n\n\nSDSU Navigate Service: \"Career & Internships Advising\"\nCareer & Internships Advisors in your college and/or Career Services are trained to help you explore and plan for career and internship opportunities. SDSU\n                                    Career Services uses HANDSHAKE to help students and alumni connect with opportunities. This online career development\n                                    management system includes:\n\nThousands of Job and Internship listings\nResume, cover letter and transcript upload, storage, and submission\nOn-campus interview scheduling, workshops and employer information sessions\nScheduling one-on-one appointments with SDSU Career Counselors\nRegistering for SDSU Career Fairs\n\n\n\n\n\n\nEvaluations Unit (Office of the Registrar)\n\n\n\nThe evaluators in the Office of the Registrar provide support for complex student\n                                    advising scenarios including: \n\nGraduation requirements\nTransfer credit \nGuidance and direction on how and when to apply to graduate\nReadmission to the University\n\nStudents may be refered to an evaluator by their advisor.\n\n\n\n\n\nGraduate Program Advisor\n\n\nGraduate Program Advisors are professional and faculty advisors located in the colleges.\n                                 For more information about graduate student support please visit the webpage for current graduate students. A list of current Graduate Program Advisors and their contact information is also available on the College of Graduate Studies\n                                 website.\n\n\n\n\nInternational Student Advisor\n\n\nInternational Student Advisors work in the International Student Center (ISC), part of the International Affairs Complex at SDSU. These advisors support the success\n                                 of international students study at SDSU. In addition to general advising, these advisors\n                                 offer support to students in issues specific to international students -- immigration\n                                 policies, visas, living in the United States, and more.\n\n\n\n\nStudy Abroad Advisor\n\n\n\nSDSU Navigate Service: \"Study Abroad Advising\"\nStudy Abroad Advisors may be associated with your college and/or the Global Education Office, and are trained to help you explore and plan global education experiences. If your\n                                    major requires an international experience or study abroad requirement to graduate,\n                                    or if you have goals to study abroad to participate in high impact experiences, you\n                                    can connect with these advisors to begin the process of exploring and plan your global\n                                    education options. \nStudy Abroad Advisors work with the Evaluations Office to help students understand\n                                    how studying abroad will impact their transfer credit and progress toward graduation.\n\n\n\n\n\nSupport Services\n\n\n\nThe division of Student Affairs and Campus Diversity offers student support services\n                                    to suppport student health and well-being, students with varying abilities,  those\n                                    enrolled in special programs, or students seeking personal and career counseling. \nBelow is a list of additional support services to promote and support student academic\n                                    success.\n\n\nOFFICE\n\n\nLOCATION\n\n\nCONTACT \n\n\n\n\nCounseling & Psychological Services (C&PS)\n\n\nCalpulli Center 4401\n\n\n(619) 594-5220\n\n\n\n\nEconomic Crisis Response Team (ECRT) \n\n\n \n\n\n[email protected] \n\n\n\n\nStudent Ability Success Center (SASC)\n\n\nCalpulli Center 3100\n\n\n(619) 594-6473\n\n\n\n\nWell-Being & Health Promotion\n\n\nCalpulli Center 3100\n\n\n(619)-594-4133\n\n\n\n\n\n\nSTILL NOT SURE WHERE TO GO? \nIf you need help finding an advisor or other form of support, you can visit the Student Success Hub or the Student Success Help Desk -- or email [email protected].\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFaculty Advancement and Student Success\n\t\t\t\t\t\t\tAD-101, AD-201, AD-220 \n\t\t\t\t\t\t\t5500 Campanile Drive\n\t\t\t\t\t\t\tSan Diego, CA 92182-1623\n\t\t\t\t\t\t\tEmail: [email protected]\n\t\t\t\t\t\t\tOffice: 619-594-5842\n\t\t\t\t\t\t\tFax: 619-594-2049\n\n\n\n\n\n\nA-Z Index\nCampus Directory\nMaps\nParking\n\n\n\n\nEmployment\nMedia Relations\nGive to SDSU\nWebPortal\n\n\n\n\nNetwork Status\nEmergency\nContact SDSU\nFASS Directory\n\n\n\n\n\n\n\n\n\nCopyright © 2022 San Diego State University\n\n\nAccessibility\nSDSU Digital Privacy Statement\nFeedback\n\n\nLast Update: July 18, 2016\nDocument Readers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLast Updated 3/13/23",
    "links": [
        "#maincontent",
        "#",
        "https://www.sdsu.edu/",
        "https://studentsuccess.sdsu.edu",
        "#",
        "https://admissions.sdsu.edu/",
        "https://newscenter.sdsu.edu/home/currentstudents.aspx",
        "https://www.sdsu.edu/faculty-staff",
        "http://www.sdsualumni.org/",
        "https://newscenter.sdsu.edu/student_affairs/sds/",
        "https://directory.sdsu.edu/",
        "#",
        "https://studentsuccess.sdsu.edu/giving",
        "https://studentsuccess.sdsu.edu/giving/giving-priorities",
        "https://studentsuccess.sdsu.edu/giving/ways-to-give",
        "https://studentsuccess.sdsu.edu/giving/planned-giving",
        "http://campaign.sdsu.edu/DAESA",
        "https://studentsuccess.sdsu.edu",
        "#",
        "https://studentsuccess.sdsu.edu/major_advisor_directory",
        "https://studentsuccess.sdsu.edu/seeing_an_advisor",
        "https://studentsuccess.sdsu.edu/navigate-sdsu",
        "#",
        "https://californiapromise.sdsu.edu",
        "https://studentsuccess.sdsu.edu/reenrollment",
        "https://first-gen-at.sdsu.edu",
        "https://honorscouncil.sdsu.edu",
        "https://is3d.sdsu.edu",
        "https://onsf.sdsu.edu",
        "https://studentsuccess.sdsu.edu/student-organizations",
        "https://studentsuccess.sdsu.edu/supplemental-instruction",
        "https://studentsuccess.sdsu.edu/transfer",
        "https://undeclared.sdsu.edu",
        "#",
        "https://studentsuccess.sdsu.edu/undergraduate-studies",
        "#",
        "https://honors.sdsu.edu",
        "#",
        "https://studentsuccess.sdsu.edu/fass_mission_and_objectives",
        "https://studentsuccess.sdsu.edu/directory",
        "https://math.sdsu.edu/courses/calculus",
        "https://www.sdsu.edu/",
        "https://studentsuccess.sdsu.edu",
        "#siteNavigation",
        "https://map.concept3d.com/?id=801#!m/147058",
        "tel:(619)-594-5842",
        "/cdn-cgi/l/email-protection#c7b4b3b2a3a2a9b3b4b2a4a4a2b4b487b4a3b4b2e9a2a3b2",
        "#collapsed20e209_1",
        "/619-594-1509",
        "/cdn-cgi/l/email-protection#aec1dcc7cbc0dacfdac7c1c0eeddcadddb80cbcadb",
        "https://nspp.sdsu.edu/orientation",
        "#collapsed20e209_2",
        "https://cal.sdsu.edu/academics/student-success",
        "https://business.sdsu.edu/undergrad/advising",
        "https://education.sdsu.edu/oss",
        "https://csse.sdsu.edu/",
        "/major_advisor_directory",
        "/cdn-cgi/l/email-protection#295a4a404c474a4c5a075a5d5c4d4c475d5a5c4a4a4c5a5a695a4d5a5c074c4d5c",
        "https://cossuccess.sdsu.edu/",
        "/cdn-cgi/l/email-protection#2e5d5a5b4a4b405a5d5b4d4d4b5d5d6e5d4a5d5b004b4a5b",
        "#collapsed20e209_3",
        "https://nspp.sdsu.edu/orientation",
        "#collapsed20e515_1",
        "#collapsed20e515_2",
        "https://sdsu.campus.eab.com/",
        "#collapsed20e515_3",
        "/navigate-sdsu/info_for_students",
        "#collapsed20e515_4",
        "https://registrar.sdsu.edu/students/academic_resources/change_declare_major",
        "/cdn-cgi/l/email-protection#6211161706070c161117010107111122110611174c070617",
        "#major",
        "https://sdsu.campus.eab.com/",
        "/major_advisor_directory",
        "#collapsed20e681_2",
        "/navigate-sdsu/info_for_students",
        "#collapsed20e789_1",
        "https://cal.sdsu.edu/academics/student-success",
        "https://cossuccess.sdsu.edu/",
        "https://education.sdsu.edu/oss",
        "https://business.sdsu.edu/undergrad/advising",
        "https://csse.sdsu.edu/",
        "#collapsed20e789_2",
        "https://slhs.sdsu.edu/student-resources/advising/advisors/",
        "https://hpao.sdsu.edu/",
        "https://politicalscience.sdsu.edu/undergraduate/pre-law",
        "https://hpao.sdsu.edu/",
        "https://hpao.sdsu.edu/",
        "https://hpao.sdsu.edu/",
        "https://hpao.sdsu.edu/",
        "https://ens.sdsu.edu/student-resources/advising/meet-your-advisor/",
        "https://hpao.sdsu.edu/",
        "https://hpao.sdsu.edu/",
        "https://socialwork.sdsu.edu/student-resources/advising/meet-your-advisor/",
        "https://slhs.sdsu.edu/student-resources/advising/advisors/",
        "https://hpao.sdsu.edu/",
        "#collapsed20e789_3",
        "#collapsed20e789_4",
        "/cdn-cgi/l/email-protection#234257425a4f4c514451424d5763504750560d464756",
        "/cdn-cgi/l/email-protection#7d0d1112071c191c0e3d0e190e0853181908",
        "/cdn-cgi/l/email-protection#3743505645545e56774453444219525342",
        "/cdn-cgi/l/email-protection#f49e8695999d86918eb487908781da919081",
        "/cdn-cgi/l/email-protection#2d4c41424e465a42426d5e495e5803484958",
        "/cdn-cgi/l/email-protection#b5d0c6d8d4c7c1dcdbf5c6d1c6c09bd0d1c0",
        "/cdn-cgi/l/email-protection#1e7372716e7b645e6d7a6d6b307b7a6b",
        "/cdn-cgi/l/email-protection#077771666963666a6a477463747229626372",
        "#collapsed20e789_5",
        "https://sacd.sdsu.edu/career",
        "https://sacd.sdsu.edu/career/students/job-search-resources/handshake",
        "#collapsed20e789_6",
        "#collapsed20e789_7",
        "https://grad.sdsu.edu/current_grad_students",
        "https://grad.sdsu.edu/current_grad_students/advisor_list",
        "#collapsed20e789_8",
        "https://newscenter.sdsu.edu/student_affairs/isc/internationalstudents.aspx",
        "#collapsed20e789_9",
        "https://newscenter.sdsu.edu/student_affairs/isc/studyabroad.aspx",
        "#collapsed20e789_10",
        "https://sa.sdsu.edu/cps",
        "/(619)%20594-5220",
        "https://sacd.sdsu.edu/ecrt",
        "/cdn-cgi/l/email-protection#4e2b2d3c3a0e3d2a3d3b602b2a3b",
        "https://go.sdsu.edu/student_affairs/sds/",
        "/(619)%20594-6473",
        "https://sacd.sdsu.edu/health-promotion",
        "/(619)-594-4133",
        "/",
        "/help_desk",
        "/cdn-cgi/l/email-protection#f281868796979c8681879191978181b281968187dc979687",
        "https://www.sdsu.edu/",
        "/cdn-cgi/l/email-protection#4b383f3e2f2e253f383e28282e38380b382f383e652e2f3e",
        "tel:619-594-5842",
        "https://www.sdsu.edu/departments",
        "https://directory.sdsu.edu/",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/campus/parkingtrans",
        "https://bfa.sdsu.edu/hr/jobs",
        "https://brand.sdsu.edu/stratcomm/media-relations",
        "https://give.sdsu.edu/",
        "https://sunspot.sdsu.edu/pls/webapp/web_menu.login",
        "https://status.sdsu.edu/",
        "https://bfa.sdsu.edu/safety/emergency/emerprep",
        "https://www.sdsu.edu/contact",
        "https://studentsuccess.sdsu.edu/directory",
        "https://accessibility.sdsu.edu/",
        "https://www.sdsu.edu/digital-privacy",
        "https://www.sdsu.edu/feedback?utm_source=studentsuccess&utm_medium=web&utm_campaign=analytics",
        "https://www.sdsu.edu/document-readers",
        "https://a.cms.omniupdate.com/11/?skin=sdsu&account=dus&site=aesa&action=de&path=/seeing_an_advisor.pcf"
    ]
}