{
    "title": "Crossed Paths Lead Back to Chico - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nCrossed Paths Lead Back to Chico\n\nSean Murphy\nApril 28, 2023\n\n\n\n\n(Photo courtesy of Suzy McCreary) \n\n\n\nChico State has been a second home to countless families who’ve shared and cherished the Wildcat experience. For these families—and more than 177,000 alumni—Chico State is not just a university or campus. It is the branches of the family tree. This is one of six profiles of families who are rooted in their Wildcat connection.\nSuzy McCarthy and Paul McCreary first met as fellow recreation administration majors, meeting within their tight-knit cohort through classes, projects, and events. But when Paul one day gifted Suzy with a coffee before an 8 a.m. class in the spring semester of their senior year in 1992, she felt a new kindness behind it.\n“I had noticed and admired Paul, he was a standout in the recreation department,” Suzy said. “It was exciting to be the object of his affection.”\nThis shared moment marked the beginning of their shared story. They started dating, graduated from Chico State that spring, got married in 1994, and moved to Concord.\nThe two began working in their chosen fields—Paul as a recreation coordinator for the city of Walnut Creek and Suzy managing youth services activities for the Town of Danville Parks and Rec Department. After 20 years of working his way up the ladder with the City of Dublin recreation department, including five years as director, Paul ended his career as the general manager of the Hayward Area Recreation District.\nSuzy said that upon graduating from Chico State, the pair were work-ready and possessed the skills to hit the ground running in the workforce.\n“We had the organizational and the personal skills—I felt very prepared to go out and do what I needed to do to get a job,” she said. “Going to Chico State not only helped me with a career, but it also helped me understand being part of a community and using those skills to gather people and enhance the community that you live in.”\nIn 1997 the McCrearys’ daughter, Joy, was born, followed by their son, Matt, in 2000. Suzy noted that with her and Paul’s positions, their children grew up with a deep appreciation for the outdoors as well as a holistic view of recreation.\n“It’s not just about being active and going outside, but my kids also have an understanding of how parks are built, what goes into a park, and what’s happening in a city,” she said. “We talked about how a community gets put together and how parks make life better.”\nWhen it came time for Joy to choose a college, she took to heart what her parents had shared about their experiences at Chico State and within their major.\n“I grew up just knowing I was going to Chico State,” said Joy. “Everything they told me about Chico, the friends who became family, how my mom used to ride her bike everywhere—that was something I really wanted to do. They talked so highly of their professors and the cool things they got to do in class.”\nShe eventually followed in her parents’ footsteps, attending Chico State and majoring in parks and natural resource management in the Department of Recreation, Hospitality, and Parks Management.\nThe mother-daughter bond grew ever stronger—“my mom lived in Whitney Hall, I lived in Whitney Hall,” said Joy—and, like her mother, Joy cherished her time at Chico State, both inside and outside of the classroom. Fueled by her love of the outdoors, she worked for Adventure Outings (AO).\n“AO is a definitely a huge part of my time there,” said Joy, who is currently a ski instructor living in Steamboat Springs, Colorado. “The skills I learned through all of the trainings helped develop me into who I am today.”\nAfter living in San Ramon for 20 years, Suzy and Paul realized their life dream and moved back to Chico in time for Joy’s graduation from Chico State in 2020. That summer, however, Paul was diagnosed with esophageal cancer, requiring chemotherapy and surgery to remove a tumor. Despite his sickness, Paul served on numerous boards, including Chico State’s University Foundation Audit Committee.\nLooking back on their time at Chico State, then eventually moving back to Chico, fills Suzy with gratitude.\n“Our time at Chico State meant so much to us. It was the start of our lives together and became a family tradition,” she said. “I’m so thankful to be living in Chico now and I cherish the memories Paul and I made here.”\nOn December 13, 2021, Paul passed away at the age of 51. Before his passing, however, Paul and Suzy established the McCreary Family Foundation Endowment in honor of Paul’s mother, Fran, a former schoolteacher. The endowment is presented annually to a student from a rural area who intends to go into teaching or a recreation field, putting into practice what Paul believed benefited his community—a gesture of kindness and giving back.\n“He wanted other people to be able to find their path like he did and for them to be supported in that,” Joy said. “To have gotten so much from his school, he felt it was only right to give back.”\nIn January 2023, Ernesto Gonzalez became the first recipient of the McCreary Family Foundation Endowment. This spring, Gonzalez (Agricultural Science and Education, ’20) will earn his single subject credential in agriculture from Chico State.\nGonzalez, who also has a master’s degree in student affairs administration from Michigan State University in 2022, is currently a student teacher at Hilmar High School and said while the scholarship certainly helped pay for gas and car maintenance thanks to his 40-minute work commute every day, he treasures the idea that he is now mentioned alongside the McCreary family.\n“I’m honored to be a part of this tradition and now this legacy of a family that has been so impactful to Chico, especially being at the end of my educational career,” said Gonzalez, who starts a teaching job in the fall, 10 minutes from his family. “I feel seen and acknowledged for all the hard work I’ve been putting in these past seven years, so to get this opportunity and reward nearing the end of my educational career feels really validating.”\nWith her daughter thriving in Colorado and her son graduating this spring in Oregon, Suzy is grateful for her return to Chico. She maintains friendships she made during her years at Chico State—connections which sustained her while Paul was sick. And she keeps herself plenty busy, running outdoor classrooms at Big Chico Creek Ecological Reserve, volunteering as a coach for Girls on the Run North State, and Reading Pals at Shasta Elementary School.\n“It’s so meaningful when you can give back to the community—it seems like you’re being selfless, but it’s so selfish, I get so much from it,” she said. “There are opportunities to be involved with the community, and Chico definitely has a lot of those, I’m grateful for that.”\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tSean Murphy\t\t\n\n\n\t\tSean Murphy (English, ’97) is the Media Relations Coordinator at Chico State. When he's not writing press releases and pitching story ideas to the media or fielding media inquiries, he's writing about human interest stories, sports, the outdoors and the remarkable students, staff and faculty at Chico State.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/samurphy/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://today.csuchico.edu/mccreary-family/?share=facebook",
        "https://today.csuchico.edu/mccreary-family/?share=twitter",
        "https://today.csuchico.edu/mccreary-family/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Crossed%20Paths%20Lead%20Back%20to%20Chico&body=https%3A%2F%2Ftoday.csuchico.edu%2Fmccreary-family%2F&share=email",
        "https://today.csuchico.edu/mccreary-family/#print",
        "#",
        "https://today.csuchico.edu/author/samurphy/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}