{
    "title": "Launching a WordPress Product in Public: Session 11 • Post Status",
    "body": "\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nAboutExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\nAccount\n Login\n\n\n\n\nSearch\n\n\n\n\n\nJoin\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nHome / Post Status Podcasts / Draft / Launching a WordPress Product in Public: Session 11\nByCory Miller \nPosted onApril 27, 2023April 27, 2023 \n\n\n\nBusiness Draft Launching a WordPress Product in Public Planet Post Status Podcasts WP Products \n\n\n\nFrom practicing mindfulness to the evolution of WordPress, Corey Maass and Cory Miller cover a wide variety of topics in this episode as they continue the development of their new WordPress plugin, Crop.Express. \n\nEstimated Reading Time:  48 minutes\n\n\nTranscript ↓\nIn this episode, Corey Maass and Cory Miller move from personal to professional. They offer impactful transparency, from discussing the importance of website speed, user experience, and SEO to practicing mindfulness and finding balance. They share insights on optimizing WordPress websites for performance, including hosting, caching, and image optimization tips. They also discuss the role of content in driving traffic and engagement, as well as strategies for leveraging social media to grow an online presence.\nTop Takeaways:\n\nImposter Syndrome. Imposter syndrome is very common among people who work in tech, and it’s important to acknowledge it and understand that it’s okay to feel this way. It’s helpful to talk to others about your feelings and to remind yourself of your accomplishments and skills. It’s important not to compare yourself to others and focus on your progress and growth. Seeking support from a therapist or coach can be very helpful in managing imposter syndrome.\nSlow Hustle. Take a more intentional, thoughtful, and sustainable approach to work and life. Instead of constantly hustling and working long hours, “slow hustle” focuses on balancing work and rest, taking breaks, and being intentional about your work. Finding a pace that works for you helps in avoiding burnout. “Slow hustle” can help you find more fulfillment and purpose in your work and can be beneficial for long-term success.\nPersonal Brand. Building a personal brand can help in various aspects of life. Establish your personal brand by identifying and highlighting your unique skills and strengths, being authentic and consistent, and cultivating relationships. Use social media and online platforms to share your expertise and connect with potential clients or collaborators. Continually invest in your personal and professional development, whether through learning new skills, attending conferences, or seeking mentorship or coaching. Remember the importance of maintaining a positive and professional online presence and reputation, as this can greatly impact your personal brand and career success.\n\n\n\n\n🔗 Mentioned in the show:\n\nCrop.Express\nCrop.Express\nApple\nWordPress\nSquareSpace\nMedium\nSubstack\nGhost\nMatt Mullenweg \nChris Coyier\nJeff Bezos\nMark Zuckerberg \nTim Ferriss\nMarie Forleo \nGary Vaynerchuk \nCasey Neistat \nBen Thompson \nPeter Thiel \n\n🐦 You can follow Post Status and our guests on Twitter:\n\nCorey Maass\nCory Miller (CEO, Post Status)\nOlivia Bisset (Intern, Post Status)\n\nThe Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧\nTranscript\nSession 11 Corey & Cory Launch a WordPress Product Live\nCory Miller: [00:00:00] Um, we are on session 11, and this is gonna be a fun one. We’re kind of in rebooting. Last week we talked about, um, blew out the vision and see all the options. And then, um, got some good stuff there. And now I think next step is, um, drum roll. Taking a lane.  \nCorey Maass: Yes. Uh, you know, when in, when in, we are a startup, right? \u2028\nLike we, we ride razor scooters around our office. Uh, we have a kegerator in our co-working space. String lights. We have string lights, like all the cool kids. Um, we are pivoting. Pivoting is what you do. Oh, there you go.  \u2028\nCory Miller: Um, I think we talked about, uh, Silicon Valley on H B O [00:01:00] and uh, I actually had a yellow Ford Escape. \u2028\nI was driving. It was my commuter car. And uh, it was funny, my team was making fun of me about it cuz uh, ATO, Avi  \u2028\nCorey Maass: Aviato. \u2028\nWell, so yeah, the, I think, and I think last time we summarized a bit about how we’ve arrived here, where the idea came from. Um, and so I, I have a couple of updates that I could start with. Um, the first is, I. Released, uh, an update of Crop Express, um, the, our, our legacy product, um, and or our lead gen product or what have you, um, that now has, uh, there was a, I had not successfully, correctly [00:02:00] implemented the constraints. \u2028\nSize constraints. And so that is fixed. Um, and it also now has the, our updated readme that you and I put together from the last call or the call before. Um, and so to me, I want to add one more feature that we had talked about, which was basically a, a, um, power user bypass. Because I even at one point I was like, oh, I, you know, I need an, uh, a circle image cropped, let me quick use my own tool. \u2028\nAnd I went in and it like, you know what it output was, I don’t remember. 2000 or something. And I was like, wait, this isn’t, this isn’t what I want. Like, I want to be able to say, you know, real quick, like we talked about, use it anywhere. Like, just make it a thousand, you know? And so I’m gonna add, um, a simple dropdown. \u2028\nI think what I [00:03:00] wanna do is, Like, first of all, it doesn’t tell you anywhere in the cropper what it, what size it’s gonna output it at. Um, uh, you know, you’ve potentially set that in the setting screen, but you haven’t, you don’t know when you’re actually cropping. And so I want to add that. And then what I think I’m gonna do is add it as a dropdown. \u2028\nSo it’s like this, you know, based on your settings, this is going to export as 2000 by 2000 or a thousand by a thousand or whatever. But in the dropdown I’ll have essentially like two x, three x four x, you know, 0.75 x 0.5 x. So it’ll be, you know, in the dropdown it’s like, this is going to export at 2000, but from the dropdown you can say 1000 and then bang, um, or something like that. \u2028\nSo it’s just real simple. And then, um, and then if we want to, we can, you know, or total customize and put in, [00:04:00] you can put in. Whatever crazy numbers you want, but the idea of being, you know, quick and easy, you can do something slightly different or proportionately different, logically different.  \u2028\nCory Miller: Hey, gimme one second. \u2028\nI forgot to do this. \u2028\nCorey Maass: Sorry. So we start over? Yeah, no, it’s fine. Um, yeah, so often awesome  \u2028\nCory Miller: confirmation cuz like, you value the product that you built, we did together, right? Um, enough to go, I’m using it, I want to keep using it. And I think that’s invaluable from a product perspective. Like mm-hmm you what, what’s there and want to make it, hone it for your own thing, which I think is such a great origin for any product. \u2028\nCorey Maass: Well, and the whole eat your own dog food kind of situation of like, you know, I don’t want to open Photoshop and add a circle and da da. Like, this should just be easy. Yeah. Um, so, um, with [00:05:00] that, the other, the other thing I wanna do, but I is of lower importance at the moment is to redo Crop Express the website so that it, um, has all the new features and is set up the way we want it. \u2028\nBut I think that’ll be a, a weekend hackathon slightly down the road since we are deemphasizing this, the website of it, implementation of it is further deemphasized. Um, so that’s that. And then, um, let me actually share my screen. \u2028\nShare. You see that? All right? Yeah. Okay, so, um, so as we talked about, I had gone somewhat far down the path of, uh, building a plugin that works against, uh, [00:06:00] screenshot Express, which is the screenshot SAS service, a API that I built. Um, so you’ll see reference to social images, which was just sort of the project name, um, that I started with. \u2028\nUm, but I’m, I’m so, um, me and my crazy colors, oops, sorry about the dogs. Um, me and my crazy eighties colors. Um, there’s screenshot express, so I’m actually pretty, um, pleased with myself, uh, with the implementation that I built initially. So, um, So here’s what we have so far, essentially is, um, by activating this, it, it should throw you to a welcome screen. \u2028\nIt currently doesn’t, um, but it has this very cool, like the colors of the app. Um, and so you can either sign up for an account or you can log in. Um, [00:07:00] so naturally I’m going to just log in. Um, hopefully you can’t see my passwords.  \u2028\nCory Miller: Um, \u2028\nCorey Maass: it signs you in. Um, it shows you what active licenses you have. If you have one already, um, you hit select and then great. It’s all saved. So that’s the onboarding. And obviously like that’s purely technical, but that’s, you know, all the steps involved with connecting yourself to the screenshot express service. \u2028\nUm, and so obviously up for much debate between the two of us, like how we wanna, what we want to call it, how much we wanna obfuscate that we’re actually using screenshot express, behind the scenes, all that stuff. But at least technically there it is. Um, and then, um, I ripped [00:08:00] out some of the stuff that I had, um, but I think you can, we can sort of illustrate at least the, what we’ve got in mind here. \u2028\nUm, and this is where I, I wanted to start talking through with you. Um, A first imagined workflow, right? So that in my mind, here’s how this works, right? So you’re like, I write a blog post and array block editor. Um, and then presumably you’d save draft or you’d publish, but let’s just publish for the sake of it, right? \u2028\nUm, and then you’re like, okay, now I want to promote my blog post. Um, oh, let me add a featured image, upload a file, um, testing nice pretty [00:09:00] landscape set featured image update. I don’t, this might work. This might not work. But anyway, um, so it’s like you’ve got a published blog post and then you say to yourself, okay, now I want to create. \u2028\nImages for sharing this to on Twitter and Facebook. Um, and so what I have so far in here, I have to go start, uh, whoops. Open. \u2028\nIt’s always fun doing it. Live tech demo. N p m, \u2028\nno, of course this will work. \u2028\nCory Miller: I’m trying to write some notes too when we get there. Um, \u2028\nCorey Maass: oh. \u2028\nOkay, not you. Next. CSS js. [00:10:00] Oh, welcome. Okay. Why are you not just working? \u2028\nCory Miller: This is real life. Does this sound good?  \u2028\nCorey Maass: Um, \u2028\nit is real, real life social images. I am in the right place. Um, I have the stuff that I was deleting. Uh, it’s not admin, its build. \u2028\nI dunno. This should just work. \u2028\nCory Miller: Um, while you’re doing that, I’m. I’m thinking about what you’d want in the end product. Mm-hmm. The basic. Mm-hmm. \u2028\nCorey Maass: So plugin. Oh, I didn’t activate the plugin. Oh no, I did. It’s there. [00:11:00] Um, oh gosh. I don’t know. Okay, so whatever. Um, but the idea is, um, wait, I really wanted to show this to you. I frame, \u2028\nCory Miller: go ahead. You, you keep looking. \u2028\nCorey Maass: Oh, that’s what it was. I totally changed this. I totally changed this. Okay, so, um, so there’s no currently no menu item, but, um, because what I had changed was started doing it all in React and JavaScript, but I was like, you know what, let’s just do this in, in an easier way. So like that, that whole welcome screen is actually like, you’re actually hitting a button in the page, reloads. \u2028\nAnd it’s not the like cool Ajay way to do it, but who cares? It works. So, um, so let’s see. We do actually build, Hey there. It’s, so the idea being that, you know, somewhere on this screen you’re like, okay, it’s. [00:12:00] Ready to go or you know, here’s my blog post. There’s a big button somewhere. Or I had had it up here in the menu item that was like, you know, social images. \u2028\nSo it’s like, okay, you’re ready to go now build your social images so it takes you to a screen, um, where something like this, right, like this is a dashboard. Um, so we can actually create these things. Um, Instagram card. Right. So like you’ve got things that you’re building and the idea being that you’re choosing a channel, which is what’s, so channel being Twitter, Facebook, something like that. \u2028\nObviously we will introduce custom ones, but this is what defines the size, right? So like if it’s Twitter, 1300 by 900, no, 1600 by 900, if it’s Instagram, 10 80 by 10 80. Um, and then we’ve also got templates. And so right now I think I [00:13:00] only have, uh, like a simple. Simple one implemented. Um, but the idea is you then it takes you to an edit screen, right? \u2028\nSo we are on, here’s my blog post. Um, and I need to, I need a name for what these are called. I don’t know what they’re called. Um, but you’ve got, um, you know, the template that you’ve started with, um, and you should be able to change this as you go. It’s like, oh, right, I’m no, I actually want this for Facebook or whatever. \u2028\nRight? And the template is, um, again, your starting point, but you’ve got the idea of being that you then got whatever’s customizable is this is your preview on the right. So again, here’s my blog post that was pulled in from the blog post, right? If you want the featured image as the background. Well, I didn’t implement that, so that’s not showing, but that’s what would show, you know, in the background. \u2028\nWhat I do have implemented is, um, if you wanted to show the ti the. The date of the post. [00:14:00] Yeah. Um, right. If you wanted to add a background color, let’s just make it red, right? So pretend your, you know, your featured image isn’t there. You can change the font. Um, you can change the size, right? So basically, like, based off of a template you would customize, um, what this looks like. \u2028\nSo, you know, this is obviously not an accurate representation cuz we’re saying it’s Instagram, but pretend it’s Twitter, it’s the right proportions. You’ve got it customized on the right and then you, and then you’d hit a button that says print essentially, you know, stamp it, create it. Whatever that looks like. \u2028\nAnd then, um, you can go back to your dashboard and we would have the preview of it, um, as it was created. And so then here, or any, anywhere there’s a button that says download, you know, if it’s Twitter, then you’ve got a share directly to Twitter button, upload it to [00:15:00] Buffer kind of thing. \u2028\nCool. \u2028\nSo that’s the very clunky version. But you know, again, the, the, the walkthrough that I’m starting to picture is you create a, um, anything you create in here in WordPress, a post, a page, you then have a button that says, okay, use data from this to populate a template. So it’s the page title, copy excerpt. Um, You know, featured image, and then you bang through a bunch of templates, you’re like, oh, there’s a, the simple template that has the title on the bottom and the featured image is a background. \u2028\nYou’ve got the card template that’s got the featured image above and the title below. You’ve got the, um, the Post Status template that, you know, you automatically inserts your logo on the left and your featured image on the right [00:16:00] with a title down below. You’ve got the whatev, what’s the other one we looked at? \u2028\nUm, Freemeus template, that’s got the flip art, you know, featured image on the right and the title on the left, and lots of white space, whatever, whatever. Um, you know, and you and each one, I guess I’m picturing, have you used, um, migrate DB Pro from Delicious Brains years ago? Yeah. Um, So they’ve got this real, you know, if you’re, um, so it’s, you know, migrating data from one site to another. \u2028\nSo you go in and you say, start a new migration, and you plug in the credentials and you plug in your settings. And so you, at any point you can say, go do the migration, push the data, pull the data, um, or you can save this as a template so that you can, you know, go in regularly and say, pull in the data from the site, pull in the data, you know, it’s a new day. \u2028\nPull in the n the fresh data. And so I’m picturing that kind of flow where, [00:17:00] um, you know, if, if all you need is, um, if all you need is a Twitter image, then click, click, click and you’ve got one. Um, but you know, while you’re in here, if you’ve got all this configured, there’s a button that says Save this, you know, as a template for every post. \u2028\nAnd so then the next time you come in here, you know, uh, create a thing from scratch or load your. You know, send it to Corey’s Twitter template, bang. And it, but again, it pulls in that post data populates your template. So it’s like your, your Post Status template where it’s like you’d set it up once with a logo on the left and your featured image on the right, you’d hit save. \u2028\nThis is the Post Status, um, you know, person profile template. And then every time you just come in, drag that down and it automatically throw it on the screen. You could tweak it a little if you needed to, if the title was too long or something, and then hit print and then you’ve got that image. \u2028\nCool.  \u2028\nCory Miller: [00:18:00] So yeah, from a workflow standpoint, I think that’s very, uh, understandable. But this is around like a broader question that leads back to that, um, like the open graph and things like that. So, you know, when you paste the link into Slack or you paste it into Facebook or whatever that is, Um, it’s pulling some data back from the website,  \u2028\nCorey Maass: Correct . \u2028\nMost of it populated by something like Yost. Okay.  \u2028\nCory Miller: So how does Slack, Facebook, different things know which particular image? Like when you create a post and then you put that image in there, there’s multiple options and dimensions with the channels and stuff. So is that stored somewhere on the backend? \u2028\nLike if we, if someone goes, okay, I want it, LinkedIn, Twitter, Facebook, how would that [00:19:00] automatically recognize in those platforms?  \u2028\nCorey Maass: Or does it Right? Um, yeah, we’d have to look into that. Like I know that I’ve, I’ve played with another tool before that generated an open graph image for your blog post. Um, and. \u2028\nThey, I don’t remember if it worked or not. I feel like it didn’t work the way I wanted it to, but it, um, it hooked into Yost. So if you had Yost running, you didn’t have to say, generate an image and then download an image and then upload an image into Yost. There was a way that it was like that image was saved to the media library. \u2028\nAnd then, um, and then Yost, there was a hook somewhere, I’m sure in Yost, cuz they’re real good about that. That said, for the social image point at this one. Or maybe they, they, you know, maybe they updated the metadata, the Yost metadata or something like that. But, [00:20:00] um, but yeah, that’s, it’s like I, you know, this is this, like what I just showed is broadly the. \u2028\nUm, how we generate images, right? But I think like one of the onboarding things, kind of like Yost walks you through site basics, right? Like we would have some sort of onboarding as part, you know, connect to, to screenshot express. But then like, what do you want to buy? What do, what do you want your defaults to be? \u2028\nCreate? And it’s honestly like, it would be a great, um, user onboarding because it’s like, okay, we’re gonna create, you know, every website full stop needs a default o OG open graph image. So let’s show you our little template builder and you’re gonna build your first template. You know, that’s your default website homepage, open graph image. \u2028\nDone, saved. [00:21:00] And then you can also save this as the default template that’ll get used for every post. But instead of pulling in the name of your website, it’ll pull in the name of your post done. And so if you check a box, um, then every post you create, you know, we can have it. Whenever you somehow indicate that you’ve published, you’re ready, then it’ll automatically create that open graph image by default. \u2028\nUm, and or, you know, any of these things we can get. I ideally you’d get to a point where, um, you know, you publish a post, you click, okay, I’m ready to promote it. There’s a good word. Like the next stage after creating a thing, a post, a page is to promote it, market it, whatever. You know, click a click here to generate all of the images you’ve already set up or add new ones or if, you know, if you wanna do it manually every time you can. \u2028\nBut we could, we could automate a lot of that stuff so that it’s, you [00:22:00] know, cuz it, yeah, once you get down the road aways, it’s like the clients that I have that are publishing articles, you know, once or twice a day, presumably they, they might, they would spot check these things, these images created, but, um, but the likely the idea, ideally the, you know, they would click a button and an OG image would be created. \u2028\nAnd also like, if they open that dashboard screen, then it’s just like, download your Twitter image, download your, or click here to, to download all of them as a zip to then send to the social media manager or something like that.  \u2028\nCory Miller: So the reason I was asking is related back to workflow too. So you go, like, you, you hit on it. \u2028\nWhere I was thinking there is like, there’s a, there’s a site specific open graph thing that just gets populated and then each post has, uh, a nuance of [00:23:00] that kind. I mean, we’re kind of thinking like a thumbnail in a sense, but like for the social images, um, and back down the workflow, I almost go like, again, not knowing the technical part of this, but I go from a workflow standpoint. \u2028\nYou created your blog post, you start your build thing and like you don’t even select a channel. It’s like here’s all like here’s LinkedIn, here’s Twitter, here’s Facebook. Yes, here’s Google things. And they’re already there and generated not even if you’re gonna like repost on LinkedIn or. Share, but like they’re already generated because maybe somebody does share your image on LinkedIn, not you. \u2028\nRight. And you want that to show up nicely. Yeah. Um, so that was just my thought is like, first I go, oh, that’s cool. He is already thought through all the channels, but then I was like, workflow wise, I just want ’em built for me. And maybe I’m editing some of those.  \u2028\nCorey Maass: Yeah. We, [00:24:00] you know, I think we define some friendly default and in an onboarding or a setup, we say, you know, by default we are creating, you know, Facebook being Facebook, they didn’t name it anything. \u2028\nThey named it Open graph. Twitter came along second, so they have to call it a Twitter card. Um, They’ll be out of business soon. So it doesn’t really matter. But, um, but it’s like, you know, in the onboarding, we’ll say like, by default, do you want to j Auto generate Facebook, Twitter, LinkedIn, Instagram for each thing you create, yes or no, just toggle using a default, a sensible default. \u2028\nAnd then you can customize that template.  \u2028\nCory Miller: So I think about this with our Slack community because it comes in and like, it never looks the way we wanted to, and I just go, okay, [00:25:00] we can talk about the user options at some point, but I go, I would want every channel, uh, reasonable channel created because you don’t know if someone’s gonna put that into Slack or something else. \u2028\nCorey Maass: True, true, true.  \u2028\nCory Miller: For the most popular networks. So like, even if you’re not using it, you think about your visitors and you go, it want, you want it to show up nice and, and look nice. Um, so that was my, that’s my thinking when I saw that is like, no matter what, this comes back to open graph, like how it, we create those and then they get tagged appropriately with open graph in, in that post. \u2028\nUm, I think would be an excellent work focus. Then we could say for the product standpoint, it generates this on, you know, automatically for all the, so that your site looks professional, right? Any, you know, any edge case that’s gonna happen. You’ve made in the design, you know, [00:26:00] automation almost, and then post by post, they can, they can edit this, but I like that mindset because then we can say, I was, I was looking up open graph, um, as you were talking just to kind of understand that more. \u2028\nAnd, um, I saw some, some little sample images that came in. I thought, okay, there’s some cool ideas here. Um, what we’re doing. If, if we look at the bigger view and this, I’m, I’m really, this is tied back down to this workflow. What we’re trying to accomplish is, uh, an easy way to demonstrate an image or some concept of, this is my website where I have done this thing for you. \u2028\nIt’s like a presentation. And, um, some of the images, I was like, oh, there’s so cool design ideas. But you think about it like, we’ll go way back to product mockups and like iPhone mockups. You know how they always tilt [00:27:00] ’em. Mm-hmm. And I think we’re trying to do here, the essence of it is we have a website we do a lot of content for. \u2028\nAnd when we present that in the social channels or wherever it is, we want people to know this is an entity, this is a brand thing. Like, it’s as silly as the little iPhone mockup when it, you know, or remember those 3D book covers. It’s that 3d. Same. Oh yes. Yeah, yeah, yeah. It’s all 3D book covers you created, you know, 3D book cover of any PDF you had. \u2028\nIt’s like almost in that sense. This is a website called Post or whatever. And you know, let me show you this real quick, \u2028\nbut see, like this right here. See how it’s got the little top shadow? Yep. I’m not saying that’s how we do it design wise, but the intention is like these little dots are kind of a signal of this is a website, this is, you know, even, even some of the [00:28:00] updates, like I guess that’s Facebook, but you’re like, those are some interesting design thoughts for the templates. \u2028\nMm-hmm. But see, that kind of thinking is you just made me professional on things I hadn’t even thought about. Yeah. Because you get to the other side and you see. Um, just like when we went live on Goda or YouTube, it’s got the default old Post Status logo and you’re like, what you really want is some semblance of branding for the website. \u2028\nMm-hmm. And the content. So like this one right here kind of speaks more to the idea of what I’m talking about is like, that could be a template. Like we could  \u2028\nCorey Maass: Right. Well search for right where you are, search for open graph image template, like in, in, in the Google box at the top, like, uh, image template. \u2028\nShould get a bunch of stuff about [00:29:00] tags, \u2028\nbut nothing too compelling. But yeah, I, I love what, where you’re going. Like we could.  \u2028\nCory Miller: Like this right here is, you know, there’s just a frame, like the image. Mm-hmm. I was thinking of it as like, I don’t know, but there’s a frame to the image we create. It’s kind of like displaying, this is on my website. This is Phil website, and I’m presenting it to you where like, you know, this, I mean, even the Facebook thing, this is kind of ubiquitous with like, there’s a name, there’s a logo. \u2028\nYep. There’s a, there’s something here. There’s an image like this, this template format. It’s pretty standard. People get that. Yep. But even if you did something like logo, something like to give it a fill of this is on the web or something. Yeah, well, like the browser bar kind of thing, I guess.  \u2028\nCorey Maass: Well, [00:30:00] and, and, and you can, I mean, my, my intention is I. \u2028\nLike, I don’t want to, I don’t want to compete with Canva, and I don’t want to get into that technical, I don’t wanna go that deep. Um, at least for a long time. We can’t of like drag and drop, but we can. But I’ve made it very, very easy to create templates. Um, and, um, and the intent is to use the, um, you know, uh, who does it, WooCommerce or, um, E D D or, um, any number of the big plugins. \u2028\nYou can, you can copy a template out of a plugin, put it in your theme, and then it’ll get incorporated into the plugin. So it’s like, you know, VVA from FIUs is like, Nope, none of these templates do what I need. Um, you know, let me create my own. And so he is, he’s got a little, his little robot that’s, you know, pointing at. \u2028\nAt a browser that has a screenshot of the [00:31:00] website built in, just like you said, um, or the little, you know, avatar of, of the author with their little byline, um, already built in. And, um, and incorporate those into, you know, every template that you, uh, that you create. And subsequently every screenshot of every or every social image that you create for anything. \u2028\nCory Miller: I’m on this because we’ve been, like, I was just telling you I was at trying to do a frame for this, but I go, that’s really what we’re capturing. When you create a piece of do something, you, you package it up with a frame and then like, I’m just roughing this out cause I don’t have like any InDesign skills, but you go, there’s a frame up here that shows like, \u2028\nKind of to, to this or this one using that. And then this is just the bar [00:32:00] that says this is a package thing. Then maybe, you know, \u2028\nI’m only diving into this cause I really think it, this could be really simple formula to start that would mm-hmm. Really greatly enhance anything I’ve done. Um, okay. So site logo. Yep. Name, you know, that kind of goes up there and then, \u2028\nand then down here. \u2028\nWe know this be meta description maybe, or something like that. Or, uh, excerpt.  \u2028\nCorey Maass: Excerpt. Yep. \u2028\nCory Miller: But like, if you think about that from the, just these elements for a second, right? Like, we packaged that up in a way that fills like this or mm-hmm. Like, don’t, we’re not in the Canva game. I mean, maybe you go do that or [00:33:00] maybe you just put it in the stock image. \u2028\nBut that goes here, we pull this from , pull that from . There’s a link in there. You’ve got some simple branding. Oops. \u2028\nI’m trying to find the image to copy it. Cause I. \u2028\nLike that’s up here \u2028\nand everybody gets to see my awesome. \u2028\nBut yeah, like in this, we’d only have to generate something like this. Like I could think we could get this lightly styled. Very right, very lightly styled. Pull in their logo name, have the big image here, and like I think that, \u2028\nI mean, gosh, that right there, Corey. Is a significant enhancement to anything most people are doing. It’s not custom, like, like these we’re seeing here where [00:34:00] someone, you know, has a full-time team doing this kind of stuff, but like, then we let them be creative with their own images. Hey, we’re not in that game. \u2028\nWe’re in this game of packaging this content. \u2028\nAnd I mean, it’s like, you know, the, the Facebook one is the, this is the frame up here. That’s just the image. And this is just the title tag, headline, and description. Yep. That right there would significantly professionalize what we’re doing, you know? Mm-hmm. Uh, and then we’d have to stylize the, uh, generic one. \u2028\nCorey Maass: Yep. And that’s what I was trying to illustrate with like, so what you’d saw on the right of my little demo is, you know, the, the title of the blog post featured image in the back. So that’s like, that’s one, that’s one template. Right. And this kind of [00:35:00] thing would be another, or wrapped in a browser. Um, a fake browser would be another. \u2028\nAnd you know, so it’s, and if they’re simple to create, mostly done in, um, c s s, then it’s just a matter of somebody, me or you, or both of us, like essentially cranking these out. I mean, we don’t, we don’t want to overwhelm. The point is not to have a gajillion templates, at least not to start with, but a few sensible defaults that, like you said, give gives everybody their initial leg up. \u2028\nSo like right out of the box, you’ve got a sensible default, something to work with. \u2028\nCory Miller: Sorry, I can’t help myself. \u2028\nBy the way, the circle logo, you can create with Crop Express. \u2028\nCorey Maass: Give your big image of background color. \u2028\nCory Miller: When we first started doing that, I couldn’t remember how to do that. \u2028\n[00:36:00] Yep, there you go. \u2028\nI mean, even if you took the frame off. \u2028\nWe probably want to play with these and see how they looked in the different social platforms, but,  \u2028\nCorey Maass: right. Well, and that’s, and that’s the, the joy of this. So it’s, you know, so there’s, right now, like I just looked, LinkedIn uses, um, Facebook’s OG image, um, Instagram you can’t import. And so outta the box, we’re only talking about two. \u2028\nWe’re talking about Facebook’s OG image and Twitter card image. So whatever their specs are. Um, and again, because it’s, we’re screenshotting, H T M L, it’s responsive. And so presumably you can use the same mo the same template. Yeah. You know, for both. And it’s like, okay, well no, I, I don’t want, I don’t want the, the Corey template. \u2028\nI want the Corey. [00:37:00] Template. It doesn’t work. Our names are the same. I don’t want the, the Corey template, I want the Miller template. And that one’s got a black background. You know, it’s black on white, so it’s like your themes on the right there, it’s like one is black on white, one is white on black, one is gray with, you know, little colors on it. \u2028\nUm, and so you’re like, that’s what all of my images look like for every post I create. It automatically creates a, um, Facebook or an OG image and a Twitter image. Um, as soon as I hit publish or even before, if I click a button and say, generate based on what’s, you know, the information that’s here. Um, and then like you said, as soon as somebody shares it, drops it into Slack, um, shares it via Twitter, Facebook, whatever, like, it’ll, it’ll pull in those, the image you want that’s been generated that is more than just your featured image. \u2028\nAnd then, yeah, we get into this kind of stuff where it’s like, [00:38:00] what are all of the d you know, these, this is where I guess the channels thing comes in, right? Like, so a channel could not only be, um, you know, technically, like Instagram is a, is a channel, but Instagram has stories which are a vertical 16 by nine to traditional Instagram, which is square. \u2028\nUm, you know, you can, you can share horizontal, vertical, or square on Twitter, LinkedIn Carousel is gonna have their own thing. Um, you know, what’s, what’s the optimal, you’re in Google Slides, what’s the optimal Google slide? Size and shape, like, so we can. Basically that’s where we once, once we have the, the way to present templates, we can go crazy creating templates for every single channel and every, every scenario. \u2028\nYeah,  \u2028\nCory Miller: I was just [00:39:00] thinking too, the option where you don’t have an image, but it creates one, an open graph type image for you. Mm-hmm. And what you want.  \u2028\nCorey Maass: Um, \u2028\nwell, and this is where we, um, um, we had talked about too, like, uh, you could have a template that looks at the content of the story for anything that’s in a block quote and pulls out the first block quote or pulls out every block quote and, and generates an image for each of those quotes. So now you’ve got. \u2028\nIf you’ve got three block quotes, you’ve now got three images that are all sized and stylized for Twitter. And so then you say, okay, post this one today, this one tomorrow, and this one on Thursday \u2028\nCory Miller: capture. This is just me capturing this. \u2028\nLike yeah. Even if it hadn’t open quote, like you don’t really have an image, but you have a powerful quote in [00:40:00] here. CSS can use some brain, like whatever your default site right is. Yeah.  \u2028\nCorey Maass: Then it pull. I love that. You know, some basic styling. It’s pulling in your, I mean, Mo um, WordPress Customizer has a place for a logo so we can reach for it there, and otherwise we can say, specify a logo to use across all your templates. \u2028\nUm, And it’ll auto-populate. And then you can obviously drill down and, and customize each one as you, as you mess with it. Um, oras or mess with it as much as you want to. \u2028\nAnd so, um, so backing up, up, up, I’m creating a system for customizing a couple of templates to start with manually. And your, [00:41:00] let’s start with featured image kind of comment here to me, which I’m, I’m a hundred percent on board with, is the ability to set one of those essentially as a default so that it’s auto-generated so that the moment you hit publish your story has a handsome OG image. \u2028\nAnd we’ll see about hooking that into Yost or what have you. And then we can continue to take it further. Cuz it’s like, yeah, let’s, let’s at least cover the basics base. Let’s cover the bases. Me and my sports metaphors. You’re that guy. Um, let’s at least do the basic of generating an an OG image, um, which is for better or worse, is the couple of other plug-ins or products that I’ve seen. \u2028\nThat’s where they start. Um, but they also end there. So it’s like, great, let’s take it further than that of generating a Twitter card [00:42:00] image, but then also any other image you want. The, the workflow will start to get a little clunky because you are going to have to do something with those images. Upload them to buffer or. \u2028\nUpload them manually to Twitter or whatever, but at least those images exist, at least based off of, um, WordPress post data and a template. A template or templates that you’ve presumably built once and then said, save you can, the next time you publish a post, you hit, generate all these images, download a zip, and then you’re not, you don’t have to go to Canva and you don’t have to tweak, tweak, tweak or copy, you know, duplicate, duplicate, duplicate, and tweak and insert your own data and stuff. \u2028\nThey’re just, they’re just there. Yeah.  \u2028\nCory Miller: Well, like, uh, sorry, I, I was thinking too, here, here’s where I’m going with this too, is [00:43:00] I would imagine if we can create a, you know, my site, let’s say has 500 posts on there with no social images. Ooh. See where I’m going? Yeah. Install and it gives you a base, nicely styled, professional enough thing that can go backwards. \u2028\nYep. Oh, now you’ve just made shit ton of work. Extremely easy and increased their professionalism. So what I was just doing was thinking about the Sitewide thing. It’s like it’s just a simple business card, you know? Yep. Here’s the logo, here’s the site, here’s our tagline. Like that might be it. Yep. Just what we’ve done, but we’ve hundred Xed this thing that exists that, you know, you go to all these sites and you’re like, God, they’ve got a whole team doing this stuff. \u2028\nMm-hmm. We just hadn’t gone, boom, there’s  \u2028\nCorey Maass: value, man. Oh, huge. And that’s [00:44:00] like, that to me is, um, Uh, another Delicious Brain’s product, the Offload s3. Um, and the free version lets you start today. The pro version among other things, lets you go, go back and essentially catch up.  \u2028\nCory Miller: See, and that’s killer. I mean, imagine all these, okay, now we’ve hit our huge value prop because imagine all the WordPress website maintenance companies that go, by the way, we noticed your, your site is just not displaying too professionally. \u2028\nWe’re gonna install this and click it and it’s done. Yep. Holy shit.  \u2028\nCorey Maass: I mean, and even, even taking that a little further, like if I’m. Excuse me, I’m the agency. I come in or I’m the developer. I come in, I’m like, you know, yeah, I’m, I’m building this thing for [00:45:00] you, but, um, we’re updating this thing for you. But like you said, I’ve noticed that, you know, a lot of these old pages don’t have these images, whatever. \u2028\nUm, I come in and I set styles. It’s like, what’s, what’s, like you said, what’s your logo? What’s your, um, brand colors? What’s your, you know, and so then it’s um, it’s all on brand too. \u2028\nCory Miller: It’s all on brand. And then like I meant any B2B site, so when it shows up, they might go \u2028\nlike right there. They put incredible fingertip address. Like all the addresses. I mean, this is just nothing but a business card for your website, right? I’m gonna capture that for marketing. \u2028\nCorey Maass: Um, and then, and then [00:46:00] WooCommerce, right? So, so every, every product you already have on your website, it just goes back through and, and populates and you know it, like we’ve said pre in a, in a previous call, um, you know, product image, bullet points. You probably don’t wanna do price, but you know, if you’ve got an if, if each of your products has bullet points or has reviews. \u2028\nSo picture of image. Title of em or title of product, sorry, picture of product, title of product, 400 reviews, five stars and an excerpt. This widget is the best widget, you know, \u2028\nwhat do you do? What do you see? If[00:47:00]  \u2028\nI go to Amazon, I want share this backpack, copy link. I go over to Post Status. I can find Corey. I say, this is the backpack I’m looking at. \u2028\nWhat does it do? What does it do? Apparently nothing. \u2028\nIt just takes something to populate. \u2028\nNothing. I feel like maybe slack’s being slow or something. Oops. \u2028\nOkay. So do you wanna share your window or all? No, I don’t have anything to share. I was just seeing, I, I went and grabbed a URL from Amazon and pasted it into Post Status. Um, To you to see what it would populate with, but it [00:48:00] didn’t actually populate anything. \u2028\nCory Miller: Um, you know, a basic business card for your website basically is what we’re doing. And then the on top of that is, you know, something like this, \u2028\nCorey Maass: right? Yeah, exactly. And that’s what I mean by like, so part of the onboarding, which I think would be great cuz it helps people get set up is, you know, upload a logo or specify where a logo is. I mean, Yost does the same thing. Um, and, and so you, you, it’ll, it’ll give you the data points that it’ll give us the data, give the plugin the data points that it needs to build a sensible default. \u2028\nAnd, and so much. And then that’s your starting point for, you know, every time you wanna share, share a post, you know, start here. Well, no, this one actually [00:49:00] has a, a featured image. Let’s put that in. Or, you know, if it’s a, uh, you know, this is your business card for your website, but then, you know, it’s a woo commerce shop, so you actually want products. \u2028\nSo it’s like, then you’d say, okay, we’ll copy this, this business card template, but then, you know, add, show the featured image or something \u2028\nand doing,  \u2028\nCory Miller: I mean, doing that, cross the website, um, huge, like 10 times better than what you have. A hundred times better than you have just with some basic, like I’m talk I, when I did the Google search with the business card, I said, simple, modern business card. That’s your favicon, or you upload your own little image. \u2028\nYou got, that’s your site title, that’s your site tagline. Maybe that’s edible. And then you add in your little information. I mean,  \u2028\nCorey Maass: yeah. [00:50:00] Yeah. And, and the default, you know, is all of these sites will go and grab, you know, ideally there’s an OG image, and so you are creating one in Canva and reimporting it, um, or you, um, or it’s trying to grab the first image on the page. \u2028\nSo usually that’s the featured image. It’s like, like we said, you know what, what kind of started this whole conversation a month ago now between you and I is the, like, better than a featured image put, put some bullet points on it, put the title, put the, you know, um, whatever, whatever, whatever other data points you can add so that when they share it, it’s not just an image. \u2028\nAn abstract image. Oh, it’s a widget. It’s like, oh no, it’s a widget that has these benefits. Buy it on this website.  \u2028\nCory Miller: So an over graph question is, we we’re talking about generating the HTML snapshot and then making it, or [00:51:00] across the site, but we do have the h html sitting there too. Mm-hmm. I don’t know how Op grf does that, but, but for what looks like, it seems like it’s an image, but I mean, we still have the H M L code code rendered somewhere. \u2028\nYep. Okay. So this right here. Oh, I just wanted to go down there to see. Okay. There’s something here. Basically the value prop is overnight flesh out in a more professional manner. Your open graph, social distributions, I mean, I’d go back to something like this if I don’t have a featured image, which I don’t on most of my blog posts, and, um, it’ll just pull a simple image that looks a little, it’s a treatment. \u2028\nLike we’ve been talking about the images. What are you truly trying to do is just show its image. [00:52:00] And if you set your defaults, like having, you know, you’re like, whatever, you’re, were yellow or were orange. So \u2028\nwe probably don’t wanna do that, but, um Right. You know, right there. Mm-hmm. You just made something a little nicer.  \u2028\nCorey Maass: Yeah. Or your, you know, logo. Logo in the top right. Or, um, you know, if there isn’t a featured or, you know, and so if there’s a featured image, it shows up. If there isn’t, you have at least got your logo. \u2028\nUm, you know, and or the option to, um, We could even have an option that says like, if you don’t have a featured image, just do a big old logo. \u2028\nCory Miller: Yeah. Like, uh, you know, the ultimate guide to social images, you knows the headline, \u2028\n[00:53:00] you know, there’s that option and stuff like that. Anyway, I think there’s a lot here. All that to say Yep. That with the premise of open, we know it is open graph, but it’s probably not the marking side, but it’s like, um, instantly create a more professional open graph presence for your entire site. \u2028\nSomething better, like these will be images too. And so like, so in that if programmatically we could say that. It’ll pull your featured image into these, you know, spots and we’re saving that image that automatically puts an image back into that post, right? Mm-hmm.  \u2028\nCorey Maass: Oh yeah, we could do that. So use this as featured image gen generate better image replaced featured image. \u2028\nCory Miller: I mean, it’s kinda like the 3D book cover. Those were just generated cuz it was all digital assets. So they wanted a visual way to [00:54:00] do that in the same sample, doing that  \u2028\nCorey Maass: software too. Remember they start, they would show a box like you’d buy at Staples, but you couldn’t actually walk into Staples and buy it. \u2028\nAlbum covers T-shirts. Yeah. I mean there’s, and, and there’s good examples online. There’s lots of little apps now that, um, you can build, um, Build the screenshots or take, take a screenshot and it puts it in a browser and puts it at a tilt, like you said. Um, like we’d have to play with all that. But, um, put it in a browser wrapper, put it on an iPhone, have somebody smiling and holding it on their iPhone. \u2028\nYou know, um, yeah. All those things. Like we can, again, once, once we’ve got the template builder, essentially then our imagination, as long as we can do it in H T M L, then we can create a template that does that and people can build their own too, which is what I really like. Cuz you’re, [00:55:00] you’re gonna have nerds like me who will look at, um, look at a couple of hours simple templates and go, oh, cool. \u2028\nLet me, let me go build my own specific to my website, my own branding, or, you know, I. Yeah, because, and then we created Marketplace and people could sell the templates and take, get a commission. We’ll go crazy baby.  \u2028\nCory Miller: Yeah. I was just trying to skip this out of, okay, the, this all seems valuable to people, uh, to me, and I think it would be, should be to other people. \u2028\nAnd then, like you said, it, well, I mean, one is creating an open graph image for each post. Um, sitewide in each post, what we have here. I didn’t, you know, there’s another benefit that we talked about. It’s like, well, like for my site would instantly get a bunch of thumbnails or, you know, the book [00:56:00] cover type treatment. \u2028\nUm, then you’ve just told the search engines, I’ve got new image content. Mm. You’ve, you’ve made an update to existing posts, you know? Yep. So, That’s my, maybe part three or something, but, or I don’t even know. But, um, I just see that value going. Oh. Cuz you can show, people are tired of seeing, you know, crap. \u2028\nYou know, you’re doing all this content work, but you’re tired of seeing the social distribution, open graph stuff look like crap. This solves that problem with a click. Yep. So that’s why I wanted to go down this of like, where, I mean, this right here, there’s a pot of gold here. I mean, if you don’t, if you have great content in the past, but you don’t really have a lot of the strong image stuff, then use, use these two. \u2028\nYep. You know, like the table of contents [00:57:00] plug in. Mm-hmm. It’ll auto generate something and then, you know, you click, click that’s made, it’ll pull it and then you go, yeah, sa saved whatever it is. And then now you’ve added an image. Image search is what we talked about last time. Image search to a blog post with a little bit of, with some automation here. \u2028\nThat’s really cool. Um, yeah. \u2028\nWith, you know, not a, doesn’t seem like a ton of work for the user side. Um, maybe there’s a, you know, an option here per post, which is use the excerpt, use the first block quote, find the H two s, the list or something, you know what I mean? Mm-hmm. And then you just, cuz I was trying to think from em, image’s, search for a [00:58:00] second, you go, um, that’s another way to get search engine traffic and visibility for your brand. \u2028\nI mean, summarize it. Look, this is, we had this conversation a couple weeks ago. Summarize your content with this kind of \u2028\nCorey Maass: Yeah. The tldr. Yeah.  \u2028\nCory Miller: So for the template engine, I wanted to get all this cuz it’s like, well these are all the ingredients that we could potentially want. So that, you know, when you start building it, like, okay, I need to, maybe for an image you can, \u2028\nuh, you know, pull, pull H two s, you know. Mm-hmm. Pull the first block, quote and that auto populates in here. \u2028\nOkay. Thank you for going all the way down there. Now back to this. Does this give some more fleshed out detail to the [00:59:00] template workflow? The. Workflow conversation.  \u2028\nCorey Maass: Yeah, I’m trying to think of where to start. Um, I think that the workflow that I’m working on still, still works. I think we start with posts, um, and then we can implement like the sitewide version using whatever we’ve defined. \u2028\nCuz it’s like, to me, the post paradigm is ex the example that we will then implement everywhere. Um, so we can basically take whatever little builder I design and stick it back in the welcome. So it’s like, you know, okay, connect to your, connect your account, let’s create your site business card. Do you wanna then use this for all all posts? \u2028\nDo you wanna then. You know, generate, [01:00:00] generate business cards for each post retroactively. And then do you wanna get into social images? This is kind of cool cuz it’s like, we’re not even, in my mind it was, it was about social. Um, like I said, I’d even, you know, the sort of code name for this project for me was social images. \u2028\nIt’s like I’m, I’m writing a post and then I’m generating an image for Twitter or Facebook, et cetera. But we’re now talking about like, there’s so much other value before we even get to social. Technically. I mean, it’s all technically social cuz it’s about if you’re sharing a post, um, than it, than it pulls in the, the featured image or what the OG image. \u2028\nBut, um, that’s all, it’s, it’s great cuz it’s all, you’re covering your bases of incoming traffic and then you can go do your outbound marketing. \u2028\nThe shields are up and then you fire the torpedoes. Yeah.  \u2028\nCory Miller: It seems [01:01:00] like, okay. Start with the sidewalk, like you said. And there’s an option just to make that at the beginning, to make that if no social link or something is there, use this option, then you’ve professionalized your site. Um, then you could do the per post \u2028\nYeah. Option.  \u2028\nCorey Maass: And then give us all your money if you want to go to do the past ones and or the Woo commerce add-on and or. A hundred other things. We haven’t, you know, the, the marketing kit generator. So it automatically spits out Facebook, LinkedIn, Instagram, you know, one click generate, one click download, upload it to buffer, you know, buffer integration, um, or whatever, whatever you use to, [01:02:00] to schedule your social posts. \u2028\nCory Miller: Yeah, all those are even before getting to the post, you could say like this, just generate it through everything on the site. So there is an open graph. Mm-hmm. Image. Then when you want to tweak per post product page, whatever that is, there’s maybe in post tweaking options where we can say, update from generic, there’s a fallback to the site wide, and then as you want, you come in here and then we could look at which ones we do. \u2028\nWe do first.  \u2028\nCorey Maass: Yep. But I like the idea of a sensible default. I was like, I’m, I’m picturing again, like one of my sites, client sites is a magazine that’s been online for 12 years. So m half the half the posts, um, um, so many of the posts have images, random sizes and things like that. [01:03:00] Um, but they’ve all at least got a title and an image and a publish date. \u2028\nSome of that’s not true, but you know, like you could say, okay, so if somebody for whatever reason, shares a post from 10 years ago, it still looks basically good. Better than it, than, than it looks now where it’s just a random featured image. \u2028\nCory Miller: See, I mean, Okay, so in that you go, here’s this one for just the site. And then when you go to post, you’re like, maybe it’s some treatment like this. Like if there’s a featured image, don’t do the generic pull in featured image. Yep. And God, I gotta believe Corey, that the premise is if you can just make your site look professional with a click, and I think that [01:04:00] this, this right here would be the way to start. \u2028\nYeah. Like a default, A default image with an option to apply to. \u2028\nAnd then, you know, if there’s a featured image in that post, go ahead and create a thumb, you know, a featured image thing. God. Right. So with that, my hypothesis would be \u2028\nstart here with, and if we can get the applied to all posts that’s worth a hundred dollars, like instantly, think about how long you’d have to go to update every post. But in one click you could essentially set a very nice, we’d have to land the design, you know, just a really nice modern looking design, but like in one click that’s not worth a hundred dollars, update your open graph. \u2028\nRight. [01:05:00] With, and even here, we’ve said if, if, if a post, if post has featured image, you know, use it with X template. Mm-hmm. If you got that out, like for, for right now, my, my value pro for Post Status would be Yeah. You know? Right. Yeah. Um, then if we wanted to going forward, we could, we could look at for Post Status as a client. \u2028\nOkay. Now, ongoing, um, when V2 hits, you know, select an image right there in the post block quote,  \u2028\nCorey Maass: uh, freeform. Yeah. I’m picturing, um, a screen. It’s like if we, if we can, you know, we’re, we’re totally blue, blue skying here. It’s like, but it’s, you know, generate image. I wanna generate a bunch of images. [01:06:00] A screen opens up that says, um, looks like it has a featured image. \u2028\nLooks like it has a couple of images in line, so check, check, check. So that’s three. Looks like it has block quotes, you know, two block quotes. Do you want to use them? I’ll you say this one and not this one, you know? And so it’s like, now generate, and that’s fi you know, it just spits out five, five different images and you go, oh yeah, I like this one and this one, you know, that they, it, it fits together well. \u2028\nUm, you know, but I think we can, \u2028\nwith some degree of reliability, we can, we can, we can at least try to pull stuff out. Like we featured Image for sure. Title for sure. Excerpt for sure. Um, I like your idea of, of essentially looking at H two s, um, creating an outline. And so, you know, they could just say, yep, that outline works, that’s accurate or it’s not. \u2028\nUm, block quotes are easy cuz they’re surrounded by, if they’re done right, they’re H T M L, you know, [01:07:00] it’s an actual block quote tag. Um, and so they can, they can basically just, you know, we say, here’s your template. And then here’s all the elements from the page that we’ve detected, and you can add your own too, you know, now click a button to sort of put them together. \u2028\nMan, I really,  \u2028\nCory Miller: I really like this. I feel, I feel, when we talked about crop express, it was a thing, a utility thing. We thought we needed. We know we needed, and we think hypothesis. Everybody probably needs this mostly, and thi but that was a very tiny detail in a process, right? We just got in a workflow process. \u2028\nWe just got to a whole site value prop. Um, like just, just right here, [01:08:00] right now, my question would be, do we, do you. We’re doing this from a SaaS that you’ve already built in the, in the back. Like it has to take the information, send it over, snapshot it, send it back, right. It’s almost a blend. Like the plugin in some sense might be some of the design stuff, but it’s a plugin with a SaaS component to it. \u2028\nRight. Um, I don’t know if that makes it easier, harder, whatever,  \u2028\nCorey Maass: but, right. Well, I mean my, yeah, my, the way I’d set this stuff up originally was I was like, you know, there’s an API over there that obviously your average person doesn’t know about, but you can put any product you want in front of it. And like, I’m basically just running like a water company, electric company utility. \u2028\nLike, I don’t care if you’re running a blender or an air conditioner, I’m just selling you electricity. [01:09:00] So my intention originally was, To just, I, you know, here’s this thing, it generates screenshots and then build all these little apps in front of it, or you can build your own. Um, and I just charge for screen, you know, per screenshot. \u2028\nUm, \u2028\ntrying to think of, I mean, so it’s like you look at, um, awesome motives. Optin Monster comes to mind. You know, they are a SaaS that technically works without the WordPress plugin, but it’s really 99% designed to run with the WordPress plugin, um, for WordPress. And so you pay for a number of impressions or a number of campaigns or, I don’t remember what, what it is, but it’s something like that. \u2028\nSo I think we would definitely want to. We’ll have to think about that, right? Because it’s like the number of, if we [01:10:00] go with my model, it’s very abstracted. Um, you know, it’s per image generated, but you don’t want somebody to sit there and go, oh, well, if I generate one more picture, you know, or if I tweak it and then regenerate and tweak it and regenerate, like, Ooh, did I spend it an eighth of a penny? \u2028\nLike, you don’t want people worrying about that. So, um, you know, some, some general, but I, again, I, I control the, the water supply. Um, so we can do it in a way that. You know, you get, you get a thousand images or it’s per post or per channels, or like, we can do something that makes a lot more sense for the end user or makes sense to the end user without being as technical as, you know, per image generated May, and maybe that is what we want. \u2028\nI don’t know, but we can, we can kind of do what we want. Um, the, the downside is, I don’t have a lot of information yet [01:11:00] about how much it actually costs, um, per, because I’ve, I’ve generated images for myself in a small quantity, you know, but at scale, I don’t know yet.  \u2028\nCory Miller: Well, could we, could we, and I think we should use Post Status, uh, for sure. \u2028\nYeah, that’s wide open. There’s no worries there. And I can, I’ll give you a discount Post Status can pay for that, but I go, I. I want this on Post Status. Um, right. Then we go like, look what we did, we just overnight with one click essentially, um, created here, here’s what I don’t know from the technical side. \u2028\nSo like if we said just you create in there one time the open graph image. Okay. Go back for the entire site, it comes back. This is the default. That’s one image. Right? Right now I don’t know what the option for like [01:12:00] just that default business card image here. That’s one image. Yep. The setting could be, um, you know, apply this one image across site. \u2028\nI. I mean, that’s just saying programmatically in WordPress, that one image in your image library right now attaches No, the default open group across the database. Am I on track there?  \u2028\nCorey Maass: Correct. Because yeah, if we do it, um, so that the image comes back and you are hosting it, what do we care? So it, it, we have to pay for a few CPU cycles. \u2028\nThat’s it.  \u2028\nCory Miller: So there’s that without getting pricing or whatever, but I just go that, yeah, I would, I want that today from post tennis. I want. Okay. Yeah. [01:13:00] Then we, we could say, we could use Post Status with, I don’t know, thousands of articles, but, um, okay. Take most of these, a lot of these posts probably have a featured image in it on our site. \u2028\nYep. And then run that. I would pay the bill post us would pay the bill for that. Now create and just see what kind of thing we’re looking sure at. You’ve got a third here. I added though, is like, it’s one thing to do the feature, just an open graph image, but that’s not saying crop it for Twitter, Facebook. \u2028\nSo each post can have five different images. Right.  \u2028\nCorey Maass: And that’s, and that’s where it, it gets, I think it, it, it may get tricky for the end user to understand cuz also they’re like, okay, I’ve generated images. If I share my page, I see one of those images. But where it lives [01:14:00] somewhere in the media library. But you’re also showing me these, these other thumbnails. \u2028\nOne’s a square that says Instagram under it, but it’s not on Instagram. Like, what, what do I do with this? You know? And so like, what, that might be a little tricky. Um, that’s not what you’re talking about, but that’s, but to me that’s, you know, that’s the bigger product that we’re talking about is like, I, I kind of like the phrase of like media kit generator, where it’s like for each post create five different images and they, and download them as a zip. \u2028\nAnd so you get a zip file that, um, you know, or I mean, we can have a page click here to open your media kit for this post and you see all those images and there’s a download button or again, a share out button or what have you. Um, but yeah, each, each post, that’s, that’s the thing right? Is um, As it’s exponential. \u2028\nSo it’s per post, or it’s, or it’s each [01:15:00] post. And then however many you want per post. And if, and if each post you wanna have, and this is, this is probably not a retroactive thing, um, but it’s like I write a post today. I want Twitter, Facebook, Instagram. I want three different versions. Say they’re three block quotes. \u2028\nSo Facebook times three, Twitter times three, Instagram times three, you know, same, same treatment, but block quote, block quote, block quote. And so I’m like, okay, because I wanna schedule this to go to tweet today, tomorrow, and the next day. Like that’s a proper marketing campaign around a post, a new post. \u2028\nBut that’s nine social images. Plus open graph. So that’s 10 per post. And that’s where it starts to get exponential, you know? Um, not a bad thing. I mean, and these aren’t expensive cuz [01:16:00] we’re, we’re using, you know, cloud computing as you’d expect. But that’s where it’s, it might get complicated. Like we need to think about like per channel or per variation, or maybe it just is per image generated per post, or maybe it’s just per, it is per, you know, it’s like okay, every, every post is, you know, uh, 10 cents and you get 10 images per post. \u2028\nCuz I, I, I can’t imagine that we’re paying a penny per image at the end of the day. Especially if we push it all back to their media library. We’re not hosting it, so it doesn’t, it shouldn’t cost us anything to ho you know, to ongoing disk space. At some point, we’ll, we’ll delete old images that aren’t getting used or something, but, you know, we say, But how, how you bill for 10 cents. \u2028\nCuz also there’s this, like, one of the things that I wanted to do when I created Screenshot Express initially, I just, I like the [01:17:00] idea, you know, as we’ve talked about in, um, previous sessions, we don’t, we don’t need this. And so we don’t need, you know, this is, this is fun for us, this is a pursuit for us, but it’s not, you know, do or die. \u2028\nAnd so it’s like, I want to, I want to take every opportunity to like play with conventions. And so part of the thing that, you know, always bugs me about various services, there’s is there’s Ford developers, there’s the pay per cycle, pay per whatever. Um, And then there’s the other ones that are like, you pay a hundred dollars and you get a hundred things, and if you then need 101, we mark, we bump you up to the next payment tier. \u2028\nUm, and that bothers me because it’s like, well, I, what if I only use 80, then I just gave you money, or the price per thing went up. Um, but the inverse, especially for a lot of non-technical people or in a lot of non-business [01:18:00] thinking people is like, gulp, I don’t want to pay a dollar per thing because what if somebody hacks my site and uses us out a thousand things that just cost me a thousand dollars. \u2028\nUm, and so somewhere in the middle is this like, you know, pay for blocks or, um, you know, like there’s some friendly way to Yeah. Um, have variable pricing without it, with, you know, with sanity checks or something like that. So I. And I’m, I’m, I’m way overthinking it. The truth is, is we’re gonna end up just charging $99, you know, for a thousand images per, per month. \u2028\nAnd, and we can, we can kind of gauge that when we set it up, we’re like, oh, it looks like you have a thousand blog posts, and so we’re gonna put you in the thousand dollars tier or whatever, you know, whatever. It’s,  \u2028\nCory Miller: um, so it, it, it, it occurs to me for a second just to tuck this through because [01:19:00] No, that’s, you’re not overthinking that. \u2028\nI think you’re making sure if you play this out, what that looks like and there’s some decisions to be made, which are good. I think so. But like, okay. There’s functionality probably, like I can go to Canva and create an open one, default open graph image. Now applying that across my site is functionality. \u2028\nI don’t know if it exists. Or if it does, right?  \u2028\nCorey Maass: Like you’d need something like, you’d need something like Yost, but you are, you’re, you’re plugging in one image. Yeah. Maybe technically two. I think they give you Facebook and Twitter, \u2028\nbut that’s definitely, that’s the easy free onboarding for sure. Yeah. And then I, I honestly think that we, we build this, we run it against Post Status. We run it against my client’s site. We look at the bills, and two things are gonna [01:20:00] happen. One, we’re gonna know what our costs are, and two, we will have the experience of using it and go, oh, if, if I didn’t know better, I would expect to pay for this, this way. \u2028\nAnd just, you know, and ju it’ll just be like, oh, right, it should be 20 bucks. Month, build monthly.  \u2028\nCory Miller: Now, as I, as I thought about that, I don’t, I don’t know, I’ll have to go back to Yos, but I go the ability to take any image I have, whether OMG does this or not, but apply it across the site. And it’s probably not one, it’s three. \u2028\nLike we’re talking about, it’s Google showing up, it’s Facebook, Twitter, you know, so there’s, there’s four images to say or something. Now two and I, huh? \u2028\nCorey Maass: There really is only two cuz every, I’m I, as far as I know, everybody [01:21:00] uses open graph image. Twitter’s the only one that’s broken away. Uh oh. Like I just Googled, you know, uh, LinkedIn open graph. \u2028\nAnd the article that comes up says, make your website shareable on LinkedIn. And it says below are the OG tags. And it’s just, Facebook’s OG tags. So LinkedIn just uses, use it, not just, but LinkedIn uses the same as Facebook.  \u2028\nCory Miller: Okay. Then let me, here’s what I’m thinking. This could just, this functionality No, no. \u2028\nCreate an image, but just a plug in type functionality of see this image, apply it, cross the site to blogs, to everything on my site so that it’s my reference sensation of my site. If it doesn’t have other, other things that feels like that could be a [01:22:00] free, free option. A hundred percent. And that’s valuable to, um, just going, yeah, I went to Camba, I got all my outputs, I wanna put ’em in and I just wanna say, apply that to my site so that instantly everything looks better if it’s generic. \u2028\nOkay. But that’s like probably a free option for us. Now where I go value though, is right here of I value all of my posts. Not having the generic, but having a minimal treatment. Generat an image for that post that has, if it has a featured image, put a featured image over here. Right. Something like that. \u2028\nSee, that’s interesting to me. I think that’s what we should play with and figure out that. Mm-hmm. Because I go, I want that today and if it costs me $500, I’d do it. Hmm. If, if basic like, think about doing that [01:23:00] from cama, it’s gonna take you a month. Oh yeah. Uploading, creating images, downloading and all this stuff. \u2028\nBut that’s worth easily $500 for me today of any post on the site has this kind of image treatment with a click. And it’s in the appropriate image graph now. Just told Google and my media library is under these pages or new images. I’ve just updated my content. \u2028\nYep. Like now I’m kind of thinking Corey, like that’s some version of, this is actually B one that’s free, but, but this could be, you know, a small, I’m guessing small free plugin. Upload your image. It’s applied generically through your site with some real simple, you know, business card template, but this, or use cam [01:24:00] and just put it up there. \u2028\nThis is powerful to me because I go every,  \u2028\nCorey Maass: it’s a huge time saver. That’s the, yeah. Time and money, right is, yeah. Like you said, we’re, we’re, if you’re auto generating, And especially if you’re auto generating in bulk. Yeah. Okay, let’s sign off. I’ll go build it. Okay. I’ll have it to you in 15 minutes. Just kidding. \u2028\nDo you have an auto generate button for that? Yeah, it’s called chat. G p t.  \u2028\nCory Miller: Uh, yeah. Hey, that’s valuable. Um, what do I need to be thinking about for that? Because I’m trying to put, I have the post that it’s head on, but like, okay. What would I want is to be able to go through auto generate headline, an expert excerpt. \u2028\nIf it has a featured image, put it on there [01:25:00] for each post and be at in my media library attached to my post. \u2028\nI mean, that’s, that’s a lot of value. Am I missing something here? Like I go mm-hmm. Something with a button click. You could pretty much create new images packaged, um, in a way. And then telling Google in the net social networks, this now exists for this piece of content. \u2028\nI’m having a hard time saying, why wouldn’t I want that right now? Like I’ve right for some money, I’ve instantly updated and created new content for every post on my site. \u2028\nAnd there’s. I know themes used the featured image, but we, we’d wanna be careful replacing the featured image. But you go like, a lot of the themes have those, well, like the Frames blog have those little, well, you know, [01:26:00] a lot of sites don’t even have that.  \u2028\nCorey Maass: The hero. Yep.  \u2028\nCory Miller: The hero, the thumbnail, whatever that is. \u2028\nWhere it’s like in the category archive, you’ve instantly shown a nice basic modern design treatment with your colors and for everything.  \u2028\nCorey Maass: Yep. Yeah. And it, I mean, and, and we’d have a button that says, um, you know, swap for featured image. Like we’ve taken your featured image, we’ve put some text over it, you know, if you like this, make your featured image better. \u2028\nSo then it just one in, one out. We’re not gonna delete your featured image cuz you could regenerate, want to regenerate the image again or something. But it would, yeah, like, so we’ll give you that option. Like you probably don’t want to do it by default. Um, but, so yeah, I, for now, let’s, let’s wrap up for today. \u2028\nCory Miller: Okay. Yeah. Sorry, I, we went over. \u2028\nCorey Maass: No, it’s fine. [01:27:00] Um, you saw my note. I put a couple of things in Slack. \u2028\nSorry, I was in Never Neverland. I like it when you’re in Never Neverland.  \u2028\nCory Miller: Yes. We should get that. Um,  \u2028\nCorey Maass: cool. Um, but I think, yeah, I think at this point, like I’m pretty close to something that does something and, and let’s have that something, that Alpha version run against. I mean, let’s, let’s get, create a Post Status staging or something. \u2028\nUm, but see what it, you know, Let’s watch it run because there’s other technical things. I wanna see, like we said, pricing. I wanna see how long it takes, you know, stuff like that. So let’s, let’s get into, let’s, let’s solve the problem for one and for 10 and for a hundred. And then, [01:28:00] you know, start to, and we’ll continue to talk about the actual product and we’ll just, and, you know, we’re designing a really nice engine. \u2028\nLet’s, we’ll also talk about what the car looks like and then we can drop the engine in the car.  \u2028\nCory Miller: So there’s 6,800 posts in, in Post says blog post only. Okay.  \u2028\nCorey Maass: That would be perfect. That’s a great number. \u2028\nCory Miller: That would be \u2028\nokay. Okay, I’ll, I’ll, I’ll be thinking about what the card I wanted to look like, but I think it’s title featured image, the standard branding.  \u2028\nCorey Maass: Um, and yeah, and like I said, I mean, we’re, we’re, I’ve, I’ve already, I have, I couldn’t show you, but I have two, you know, two very basic templates started. They are so easy to create. \u2028\nWe can, we can create 10, you know, in an hour. Just going, [01:29:00] oh, put this here, here, here. Cool. That’s one. Put this here, here, here. Background image two, you know, cuz I’ve, I’ve, for better or worse, like, I went down the rabbit hole of abstracting a lot of this stuff out. So we can just say, I want a color, you know, I want background color, I want text color, I want, so it’s just color, color, color, color. \u2028\nFont, font, font, font, on and on. So, We can, we can even sit down, like once we have one basic thing that we know is running, working, then you and I could, you know, have one of these calls where we just knock together 10 different templates. Okay?  \u2028\nCory Miller: Okay. Thanks man. I lost track of time. Thanks for going  \u2028\nCorey Maass: over. No, it’s fine. \u2028\nUm, but yeah, so stay on for a minute. Okay. Session 11. End.\n\n\n\n\n\n\t\t\tPost Tags:\t\t\n#Accessibility#ACF#Adobe#Agency#Agency Owners#Altis DXP#Apple#Automattic#B2B#Black Friday#Block Editor#Blocks#Blogging#Bob Dunn#Burnout#Chris Coyier#Clarity#Cloudways#CMS#community#Content#Cory Miller#CSS#CSS-Tricks#Customizer#Cyber Monday#Dan Knauss#Delicious Brains#Digital Ocean#Discussion#Documentation#DXP#Elementary#Email#Enterprise#Extension#Featured Image#Figma#Founders#Freelance#Freemius#Ghost#GitHub#GoDaddy#Gravity Forms#Gulp#Gutenberg#Headless#Health#Hiring#Hosting#HTML#huddles#Human Made#Iconic#Illustrator#Imposter Syndrome#Inclusion#Integrations#Interviews#JavaScript#Jeff Bezos#Jetpack#Jobs#JSON#LMS#Magento#maintenance#Marketing#Matt Cromwell#Matt Mullenweg#Membership#Mental Health#Migrate#Mobile#MOZ#Multisite#Nathan Ingram#New York Times#Newsletter#Nexcess#Ninja Forms#Page Builder#Pagely#Partnerships#Performance#Perspectives#PHP#Plugins#Pressable#Pricing#Professional Development#Publishing#React#SaaS#Scale#SEO#Shopify#Sketch#Social Networks#Square#Static#Substack#Testing#Themes#TikTok#tutorials#UX#WebP#WooCommerce#WordCamp#WordPress VIP#WordPress.org#WP Engine#WPEngine#www.youtube.com#Yoast \n\n\n\n\n\nPost navigation\nPrevious\nPreviousMember Spotlight: Matt LaueNextContinue\nTalking With Valet’s Ceo Kimberly Lipari About The Changing Value Of Websites To Organizations-Post Status Draft\n\n\n\n\n\nSimilar Posts \n\n\n\n\n\n\n\n\nHosting \n\nWeekend edition\nByBrian Krogsgard \nOctober 4, 2015 \n\n\n\nFriday was a bit slow so I figured I’d wait for a weekend edition. We’re going to pack it all into one Note. Jetpack had two vulnerabilities: one in the contact form (technically explained by Sucuri) and one limited to specific hosting configurations. They also showed off their new plugin browser I mentioned last week….\n\n\n\n\n\n\t\t\t\tRead More Weekend editionContinue\n \n\n\n\n\n\n\n\n\n\nBen Gillbanks built a new plugin…\nByDan Knauss \nMay 5, 2021 \n\n\n\nBen Gillbanks built a new plugin called Translate Words — it’s a simple and quick “change text/translate plugin” that works both on the WordPress front-end and admin area. I like the simple UI. It appears to be good for simple use cases with not-so-many changes. There’s an interesting discussion on Twitter about it and some…\n\n\n\n\n\n\t\t\t\tRead More Ben Gillbanks built a new plugin…Continue\n \n\n\n\n\n\n\n\n\n\nI enjoyed a post about how…\nByBrian Krogsgard \nApril 25, 2017 \n\n\n\nI enjoyed a post about how The New York Times handled unprecedented traffic during the electron night in the US last year. The Times encountered an, “8,371 percent increase in the number of people visiting the site simultaneously.” Today, they are moving to Amazon Web Services and Google’s cloud platform.\n\n\n\n\n\n\t\t\t\tRead More I enjoyed a post about how…Continue\n \n\n\n\n\n\n\n\n\n\nIf you use WooCommerce, your site…\nByBrian Krogsgard \nNovember 16, 2018 \n\n\n\nIf you use WooCommerce, your site needs to be running WooCommerce 3.5.1 when you upgrade to WordPress 5.0 to avoid “breaking changes!” Woo has been sending out emails with information about the need to upgrade to its users.\n\n\n\n\n\n\t\t\t\tRead More If you use WooCommerce, your site…Continue\n \n\n\n\n\n\n\n\n\n\nAs a developer, it’s important to…\nByBrian Krogsgard \nAugust 3, 2016 \n\n\n\nAs a developer, it’s important to not limit yourself to a particular set of tools. The same goes for programming languages. Jeremy Pry goes into this further on the WebDevStudios blog. Jeremy points out that learning another language beyond PHP allows you to think differently, add more tools to your toolbox, and you get a chance…\n\n\n\n\n\n\t\t\t\tRead More As a developer, it’s important to…Continue\n \n\n\n\n\n\n\n\n\n\n\n\nWordPress News \n\nWordCamp San Francisco 2014 announced\nByBrian Krogsgard \nDecember 18, 2013January 31, 2015 \n\n\n\nWith perhaps the earliest announcement I’ve seen for a WordCamp, WordCamp San Francisco 2014 has been announced to occur October 24th – 26th. It appears the contributor day is going to flip this year, and be before WordCamp instead of after. I really like that idea. Go ahead and mark your calendars for the best…\n\n\n\n\n\n\t\t\t\tRead More WordCamp San Francisco 2014 announcedContinue\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment *Name *\nEmail *\nWebsite\n Save my name, email, and website in this browser for the next time I comment.\n \n\nΔ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\n\n\n\n\n\nPost Status is proudly supported by great partners\nPagelyGravity FormsElementorA2 HostingPressable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\nTwitter\nYouTube\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© Post Status, 2023 | Made with WordPress | Privacy Policy | Website Terms\n \n\n\n\n\n\n\n\n\n\n\nScroll to top\nScroll to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAboutExpand child menuExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand child menuExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand child menuExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand child menuExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand child menuExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu Close\n \n\n\n\n\nSearch for:\n\n\n\nSearch\n \n\n\n",
    "links": [
        "#main",
        "https://poststatus.com/",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner",
        "https://poststatus.com/login",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/",
        "https://poststatus.com/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/podcast/draft/",
        "https://corymiller.com",
        "https://corymiller.com",
        "https://poststatus.com/wordpress/business/",
        "https://poststatus.com/podcast/draft/",
        "https://poststatus.com/podcast/draft/launching-a-wordpress-product-in-public/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/wordpress/business/wp-products/",
        "https://twitter.com/coreymaass",
        "https://twitter.com/corymiller303",
        "https://crop.express/",
        "#h-transcript",
        "https://twitter.com/coreymaass",
        "https://twitter.com/corymiller303",
        "https://crop.express/",
        "https://crop.express/",
        "http://www.apple.com/",
        "https://wordpress.com/",
        "https://www.squarespace.com/",
        "https://medium.com/",
        "https://substack.com/",
        "https://ghost.org/",
        "https://twitter.com/photomatt",
        "https://twitter.com/chriscoyier?lang=en",
        "https://twitter.com/jeffbezos?lang=en",
        "https://twitter.com/finkd?lang=en",
        "https://twitter.com/tferriss",
        "https://twitter.com/marieforleo",
        "https://twitter.com/garyvee",
        "https://twitter.com/Casey",
        "https://twitter.com/benthompson",
        "https://twitter.com/peterthiel?lang=en",
        "https://twitter.com/coreymaass",
        "https://twitter.com/corymiller303",
        "https://twitter.com/post_status",
        "https://twitter.com/lemonadecode",
        "https://twitter.com/post_status",
        "https://poststatus.com/category/post-status-podcasts/",
        "https://itunes.apple.com/us/podcast/post-status-draft-wordpress/id976403008",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5zaW1wbGVjYXN0LmNvbS8ySkU5c2M4UA",
        "https://www.youtube.com/c/PostStatus",
        "http://www.stitcher.com/podcast/krogsgard/post-status-draft-wordpress-podcast",
        "https://wordpress-post-status-draft-podcast.simplecast.com/",
        "https://feeds.simplecast.com/2JE9sc8P",
        "https://poststatus.com/tag/accessibility/",
        "https://poststatus.com/tag/acf/",
        "https://poststatus.com/tag/adobe/",
        "https://poststatus.com/tag/agency/",
        "https://poststatus.com/tag/agency-owners/",
        "https://poststatus.com/tag/altis-dxp/",
        "https://poststatus.com/tag/apple/",
        "https://poststatus.com/tag/automattic/",
        "https://poststatus.com/tag/b2b/",
        "https://poststatus.com/tag/black-friday/",
        "https://poststatus.com/tag/block-editor/",
        "https://poststatus.com/tag/blocks/",
        "https://poststatus.com/tag/blogging/",
        "https://poststatus.com/tag/bob-dunn/",
        "https://poststatus.com/tag/burnout/",
        "https://poststatus.com/tag/chris-coyier/",
        "https://poststatus.com/tag/clarity/",
        "https://poststatus.com/tag/cloudways/",
        "https://poststatus.com/tag/cms/",
        "https://poststatus.com/tag/community/",
        "https://poststatus.com/tag/content/",
        "https://poststatus.com/tag/cory-miller/",
        "https://poststatus.com/tag/css/",
        "https://poststatus.com/tag/css-tricks/",
        "https://poststatus.com/tag/customizer/",
        "https://poststatus.com/tag/cyber-monday/",
        "https://poststatus.com/tag/dan-knauss/",
        "https://poststatus.com/tag/delicious-brains/",
        "https://poststatus.com/tag/digital-ocean/",
        "https://poststatus.com/tag/discussion/",
        "https://poststatus.com/tag/documentation/",
        "https://poststatus.com/tag/dxp/",
        "https://poststatus.com/tag/elementary/",
        "https://poststatus.com/tag/email/",
        "https://poststatus.com/tag/enterprise/",
        "https://poststatus.com/tag/extensions/",
        "https://poststatus.com/tag/featured-images/",
        "https://poststatus.com/tag/figma/",
        "https://poststatus.com/tag/founders/",
        "https://poststatus.com/tag/freelance/",
        "https://poststatus.com/tag/freemius/",
        "https://poststatus.com/tag/ghost/",
        "https://poststatus.com/tag/github/",
        "https://poststatus.com/tag/godaddy/",
        "https://poststatus.com/tag/gravity-forms/",
        "https://poststatus.com/tag/gulp/",
        "https://poststatus.com/tag/gutenberg/",
        "https://poststatus.com/tag/headless/",
        "https://poststatus.com/tag/health/",
        "https://poststatus.com/tag/hiring/",
        "https://poststatus.com/tag/hosting/",
        "https://poststatus.com/tag/html/",
        "https://poststatus.com/tag/huddles/",
        "https://poststatus.com/tag/human-made/",
        "https://poststatus.com/tag/iconic/",
        "https://poststatus.com/tag/illustrator/",
        "https://poststatus.com/tag/imposter-syndrome/",
        "https://poststatus.com/tag/inclusion/",
        "https://poststatus.com/tag/integrations/",
        "https://poststatus.com/tag/interviews/",
        "https://poststatus.com/tag/javascript/",
        "https://poststatus.com/tag/jeff-bezos/",
        "https://poststatus.com/tag/jetpack/",
        "https://poststatus.com/tag/jobs/",
        "https://poststatus.com/tag/json/",
        "https://poststatus.com/tag/lms/",
        "https://poststatus.com/tag/magento/",
        "https://poststatus.com/tag/maintenance/",
        "https://poststatus.com/tag/marketing/",
        "https://poststatus.com/tag/matt-cromwell/",
        "https://poststatus.com/tag/matt-mullenweg/",
        "https://poststatus.com/tag/membership/",
        "https://poststatus.com/tag/mental-health/",
        "https://poststatus.com/tag/migrate/",
        "https://poststatus.com/tag/mobile/",
        "https://poststatus.com/tag/moz/",
        "https://poststatus.com/tag/multisite/",
        "https://poststatus.com/tag/nathan-ingram/",
        "https://poststatus.com/tag/new-york-times/",
        "https://poststatus.com/tag/newsletter/",
        "https://poststatus.com/tag/nexcess/",
        "https://poststatus.com/tag/ninja-forms/",
        "https://poststatus.com/tag/page-builder/",
        "https://poststatus.com/tag/pagely/",
        "https://poststatus.com/tag/partnerships/",
        "https://poststatus.com/tag/performance/",
        "https://poststatus.com/tag/perspectives/",
        "https://poststatus.com/tag/php/",
        "https://poststatus.com/tag/plugins/",
        "https://poststatus.com/tag/pressable/",
        "https://poststatus.com/tag/pricing/",
        "https://poststatus.com/tag/professional-development/",
        "https://poststatus.com/tag/publishing/",
        "https://poststatus.com/tag/react/",
        "https://poststatus.com/tag/saas/",
        "https://poststatus.com/tag/scale/",
        "https://poststatus.com/tag/seo/",
        "https://poststatus.com/tag/shopify/",
        "https://poststatus.com/tag/sketch/",
        "https://poststatus.com/tag/social-networks/",
        "https://poststatus.com/tag/square/",
        "https://poststatus.com/tag/static/",
        "https://poststatus.com/tag/substack/",
        "https://poststatus.com/tag/testing/",
        "https://poststatus.com/tag/themes/",
        "https://poststatus.com/tag/tiktok/",
        "https://poststatus.com/tag/tutorials/",
        "https://poststatus.com/tag/ux/",
        "https://poststatus.com/tag/webp/",
        "https://poststatus.com/tag/woocommerce/",
        "https://poststatus.com/tag/wordcamp/",
        "https://poststatus.com/tag/wordpress-vip/",
        "https://poststatus.com/tag/wordpress-org/",
        "https://poststatus.com/tag/wp-engine/",
        "https://poststatus.com/tag/wpengine/",
        "https://poststatus.com/tag/www-youtube-com/",
        "https://poststatus.com/tag/yoast/",
        "https://poststatus.com/member-spotlight-matt-laue/",
        "https://poststatus.com/talking-with-valets-ceo-kimberly-lipari-about-the-changing-value-of-websites-to-organizations-post-status-draft/",
        "https://poststatus.com/wordpress/tech/hosting/",
        "https://poststatus.com/weekend-edition/",
        "https://poststatus.com",
        "https://poststatus.com/weekend-edition/",
        "https://poststatus.com/ben-gillbanks-built-a-new-plugin/",
        "http://dan.knauss.ca",
        "https://poststatus.com/ben-gillbanks-built-a-new-plugin/",
        "https://poststatus.com/i-enjoyed-a-post-about-how/",
        "https://poststatus.com",
        "https://poststatus.com/i-enjoyed-a-post-about-how/",
        "https://poststatus.com/if-you-use-woocommerce-your-site/",
        "https://poststatus.com",
        "https://poststatus.com/if-you-use-woocommerce-your-site/",
        "https://poststatus.com/as-a-developer-its-important-to/",
        "https://poststatus.com",
        "https://poststatus.com/as-a-developer-its-important-to/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/wordcamp-san-francisco-2014-announced/",
        "https://poststatus.com",
        "https://poststatus.com/wordcamp-san-francisco-2014-announced/",
        "/launching-a-wordpress-product-in-public-session-11/#respond",
        "https://akismet.com/privacy/",
        "https://poststat.us/pagely",
        "https://poststat.us/gravity-forms",
        "https://poststat.us/elementor",
        "https://poststat.us/a2-hosting",
        "https://poststat.us/pressable",
        "https://www.facebook.com/poststatusblog",
        "https://twitter.com/post_status",
        "https://www.youtube.com/c/PostStatus",
        "https://poststatus.com/privacy-policy",
        "https://poststatus.com/website-terms",
        "#wrapper",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner"
    ]
}