{
    "title": "Students Travel, Grow, and Build Friendships Through Speech and Debate Team - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nStudents Travel, Grow, and Build Friendships Through Speech and Debate Team\n\nCourtney Coleman\nApril 25, 2023\n\n\n\n\n(Matt Bates/ University Photographer) \n\n\n\nMarcus Peoples and Marin Spalding have different preferences when it comes to speech and debate. While Peoples shines in performance and writing, Spalding thrives on the debate side of forensics. But both agree the Chico State Speech and Debate Team has given them space and opportunities to hone their skills, travel, and form lasting friendships.  \nAt Chico State, the speech and debate team doubles as a club and a course—it is an instructional related activity (IRA) offered through the communications studies program. The team, which competes in tournaments against other two- and four-year schools, offers competition in cross-examination, team policy debate, and individual events. For its members, it also offers countless benefits outside of tournaments.\nPeoples, a first-year student and communication studies major, said one of his favorite aspects of being on the forensics team is traveling for competitions. Visiting Point Loma Nazarene University in San Diego, which rests on a cliff overlooking the ocean, and the team’s recent trip to Japan, are two competitions that stood out.\nThe communal aspect of the team has also allowed Peoples to build his confidence and step out of his comfort zone, he said.\nMarcus Peoples delivers a speech during class rehearsal. \n“It’s nice knowing that the people who are older than me are also there to help me,” Peoples said. “It’s really like one big family on the speech and debate team.”\nSpalding, a senior political science major, has been a part of the Chico State team since 2021. Like Peoples, seeing new places and gaining new perspectives are major highlights and key reasons she believes team members form strong friendships.\n“You start to rely on one another and for support,” she said.\nSpalding got her first taste of speech and debate at Solano Community College. At a tournament, she met Chico State’s former forensics director, who put the University on her radar as a transfer school. Now, as a graduating senior approaching Commencement, she says that enrolling at Chico State was the best decision she could have made.\nOriginally a psychology major, Spalding switched gears after the pandemic left her wanting more face-to-face interactions. She changed her major to political science and found solace in the communal environment speech and debate provided.\n“I want to do constitutional law, which involves a lot of interpretation,” she said. “I want to possibly make a political run in the future, so I feel that all the skills I’ve learned—like research and taking a deep dive on an issue or a concept, while writing speeches—will help me succeed in law school.”\nMarin Spalding during class rehearsal. \nPeoples said he is drawn to writing and performing speeches.\n“Public speaking is a bit like going on a roller coaster,” Peoples said. “It’s a thrill. I gotta get everybody’s attention. When I’m speaking about something I’m passionate about, that’s when my personality really comes out.”\nBoth Spalding and Peoples have experience with extemporaneous speech, where speakers are assigned a subject—like the decriminalization of marijuana—and a position. They are then given 30 minutes to research history, differing perspectives, or whatever else may help them defend their position.\n“It’s a lot of Googling bits and pieces, finding sources, and just grabbing as many things as you can,” Peoples said.\nPeoples is currently working on a speech to share at the team’s annual Speech Night, where team members perform some of their work from the semester with the public. He describes his performance as a poem discussing “Black speech.”\n“I have six distinct characters,” he said. “You hear a grandmother talking to her granddaughter about everything, like the past and what’s happening now…Then I’ll eventually go to a protester who is advocating for how their Black speech is being cut off and how they have to speak ‘white.’ Then finally, I have a guy writing a love story to Black speech, talking about how lovely it is.”\nPeoples describes Black speech as what is more commonly known as slang, but defends that it is a valid form of communication.\n“It’s not wrong to say specific words or sentences differently, or to pronounce words differently,” he said. “There could be two different phonetic versions of a word, but they both are the same. They’re both valid.”\nPeoples looks forward to participating in speech and debate next semester to continue improving his public speaking skills and to have more opportunities to share differing perspectives. Spalding is looking more toward the future as she nears graduation.\nThe speech and debate team in rehearsal. \n“I might try to go farther south,” she shares. “There’s an American Civil Liberties Union (ACLU) branch in Southern California in the Los Angeles area. LA is the perfect location for constitutional law as a lot of constitutional lawyers work for organizations such as the ACLU.”\nAs both students move towards different futures, they can both look back on their experience with speech and debate and agree the friendships they built are what stand out most. \n“The friends I made in speech and debate kind of became like a family,” Spalding said. “If I’m having a tough time, they’re there to help me and pull me out of it. They are people that I want in my life and just want to have them there to cheer me on for whatever I accomplish next.”\n*All photos Matt Bates / University Photographer\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tCourtney Coleman\t\t\n\n\n\t\tCourtney Coleman is the Communications Specialist for the College of Communication and Education. She has a passion for storytelling and is particularly drawn to activism, art, and sharing unique perspectives.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/courtney-coleman/",
        "https://today.csuchico.edu/friendships-through-speech-debate/?share=facebook",
        "https://today.csuchico.edu/friendships-through-speech-debate/?share=twitter",
        "https://today.csuchico.edu/friendships-through-speech-debate/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Students%20Travel%2C%20Grow%2C%20and%20Build%20Friendships%20Through%20Speech%20and%20Debate%20Team&body=https%3A%2F%2Ftoday.csuchico.edu%2Ffriendships-through-speech-debate%2F&share=email",
        "https://today.csuchico.edu/friendships-through-speech-debate/#print",
        "#",
        "https://today.csuchico.edu/author/courtney-coleman/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}