{
    "title": "\n\tMore than Learning to Walk Backward | NewsCenter | SDSU\n",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKeyword Search\n\n\n\n\n\n\n\n\nCampus Directory\nMaps\nJobs at SDSU\n\n\n\n\n\nTOPICS OF INTERESTHow to become an Aztec\nHow to become a mentor\nNeed an intern?\nCampus Events Calendar\nTake a campus tour\nUse the library's resources\nSDSU NewsCenter\nSexual Assault Resouces\nSmoke Free SDSU\nStudent Enrollment Characteristics\nSDSU By the Numbers 1897  Founded 34,000 Students (Fall 2019)3,076 Students Studying Abroad (2017-18)400,000+ Alumni3.77 Average Incoming High School GPA93,704 Total Applications for Fall 202010,300 Graduates (Spring 2019)   \n\n\n\n\n\n\n\n\nKeyword Search\n\n\n\n\n\n\n\n\nCampus Directory\nMaps\nJobs at SDSU\n\n\n\n\nTopics of InterestHow to become an Aztec\nHow to become a mentor\nNeed an intern?\nCampus Events Calendar\nTake a campus tour\nUse the library's resources\nSDSU NewsCenter\nSexual Assault Resouces\nSmoke Free SDSU\nStudent Enrollment Characteristics\nSDSU By the Numbers 1897  Founded 34,000 Students (Fall 2019)3,076 Students Studying Abroad (2017-18)400,000+ Alumni3.77 Average Incoming High School GPA93,704 Total Applications for Fall 202010,300 Graduates (Spring 2019)   \n\n\n\n\n\n\n\n\nMonday, May 1, 2023\n    \n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReturn to home\n\n\n\n\nAssociated Students\n\n\n\n\n\n\n\nSDSU Ambassadors are photographed walking along Centennial Walkway. (SDSU)\n\n \n\n\n\nTuesday, April 18, 2023\n\n\nMore than Learning to Walk Backward\n\n\nSDSU Ambassadors Cram to Provide Tours, Experiences Relevant to Diverse Audiences\n\n\n                            By Aaron Burgin\n\n \n\n\n\nStory Keywords: Associated Students\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nPlease enter your info below\n\n                                                Your name\n                                            \n\n\n                                                   \n                                                \n\n\n                                                Your Email address\n                                            \n\n\n                                                   \n                                                 \n                                                \n\n\n                                                Recipient Email Address\n                                            \n\n\n                                                   \n                                                 \n                                                \n\n\n                                                 \n                                            \n\n\n\n\n\n\n\n                                                 \n                                            \n\n\n\n\n\n\n\n\n\nTweet\n\n\nFor many first-time visitors to San Diego State University, their welcome to campus comes from a student in an SDSU polo shirt or T-shirt along with a warm smile and an informative guided tour. They are SDSU Ambassadors, the university’s official student representatives and orientation leaders.  Ambassadors apply for the position and train with the Ambassador staff. They learn to conduct their tours walking backward. They also work at campus events, including Explore SDSU, New Student and Family Convocation, Welcome Week, Aztec Nights, Homecoming, Family Weekend, athletic events and Commencement. They’re also involved in extensive community service work with local elementary schools and not-for-profit organizations. Francisco Velazquez, director of New Student and Parent Programs, which oversees the Ambassador program, said staff looks for students who display strong leadership qualities, enthusiasm, professionalism, an interest in wanting to get involved and a passion for SDSU, as well as a diverse group of students.   As one of the first official campus representatives to connect with new students and their families, the 80-100 ambassadors (depending on the year) help ensure students' transition to university life is as smooth as possible — a role ambassadors cherish.  “I joined the SDSU Ambassador program because I wanted to have a meaningful and substantial impact on incoming first-year, transfer and graduate students at SDSU,” said Zak Labus, a graduate student in postsecondary educational leadership who recently completed his first full year as an Ambassador at the end of New Student Orientation. “The 55-minute campus walking tours give tour participants the chance to fall in love with the SDSU campus and community much like I did as a newly admitted student back in the spring of 2018. “The opportunity to play a role in these services, in addition to the events and ceremonies we work during the academic year, is not only humbling but exciting, as I get to give back to the very people and to the community that I benefited from and grew up in during my four years as an undergraduate student,” Labus said.  Sarah Williams, a fifth-year business management and theatre arts double major, has been an Ambassador for two years.  “I joined the Ambassador program because I wanted to share the deep love I have for our campus with others and hopefully make incoming students and families love it as much as I do,” said Williams. “I truly have had such a great experience at SDSU and I love interacting and sharing those experiences with others.” The Ambassadors program in recent years has introduced new tours to live up to the university’s commitment to advance equity and inclusion in everything it does. This year, the program launched Black Excellence Historical Tours, which dive deep into the achievements of the university’s Black students, alumni and others who played an influential role on campus, as well as tour the resources available to Black students.  New Student and Parent Programs, the Division of Student Affairs and Campus Diversity, anthropology professor and University History Curator Seth Mallios, the Black Resource Center and the Department of Africana Studies began planning work on the tours in 2021; they were implemented for Explore SDSU in March 2022.  Other tours, including ones tailored toward Latinx and Indigenous students, are in the works, Velazquez said.  “I think most importantly, we want to make sure that all of our families feel welcome at SDSU regardless of their background,” he said. “We want to ensure that our new students feel like SDSU can be their new home, and this tour is a first step toward us being inclusive to everyone and welcoming everyone to our campus. “We’re not having these tours just to check it off of a list,” Velazquez said. “As the first face that many students and families see when they come to campus, we are making sure we are being intentional and supportive of all of our students, regardless of their background.”  Among the highlights of the Black Excellence Historical Tour are when prospective students learn about Leon Williams, a 1950 graduate of San Diego State College who became the first Black person elected to the San Diego City Council in 1969, the first elected to the Board of Supervisors in 1982 and was a key figure in placing the MTS SDSU Transit Center on campus. They learn about Dr. Martin Luther King Jr.’s speech at the Open Air Theatre in May 1964 and also about the impact of NBA All-Star and SDSU men’s basketball legend Kawhi Leonard.  Michael Rumfola, who has guided the tour during its first year, said he’s seen the impact it has had on prospective Black students, as well as on himself.  “My favorite part about the tour is learning and speaking on the significance of Blackculture at SDSU and San Diego,” said Rumfola, a fourth-year student double majoring in Business Marketing and Sustainability. “I feel more connected to my culture and university when engaging tour participants in civil rights-related discussion.” Because an Ambassador can lead a tour for many different majors or student groups, they have to learn about all of the various majors and disciplines at SDSU — no easy task, said Ximena Lopez Rivera, a third-year English major who has been an ambassador for a year.  “I knew the position was very demanding, but learning a tour script about every single program and all the resources that the university offers and being able to understand each one is something that I wouldn’t have done if it wasn’t for the position,” said Lopez Rivera. “It is all very rewarding and worth the time (including some all-nighters) in order to make an impact on someone, even if it is only one person.” Ambassador training includes meeting staff and faculty from different departments and all seven SDSU colleges and can be rewarding beyond conducting the tours. “I didn’t know that we would learn about so many useful resources the university has to offer in such detail and depth,” said Madeleine Young, who is in her third year as a health communication major. “I feel very confident in my knowledge of almost every single department on campus, and it makes me look forward to answering questions from students and families. Beyond the training, Ambassadors said one of the best features of the program is the camaraderie they develop with their peers.  “My favorite part of the SDSU Ambassadors is having the opportunity to interact with a diverse group of students on campus and connect with students from all seven colleges on campus,” said Xavier Martin, a third-year psychology major with an emphasis in neuroscience and an Ambassador for a year. “This organization has allowed me to meet students who I wouldn’t typically interact with and to create connections outside of my college. I love the sense of community that is created among the SDSU Ambassadors and look forward to seeing familiar faces when I walk on campus.” Velazquez, who himself was an ambassador 20 years ago, said that hearing students praise the program is gratifying.  “As an alumnus of the program, coming full circle to see how it has evolved over the past 20 years is great,” Velazquez said. “We know that it has an impact on our prospective students but to hear the impact it is having on our current student leaders is very rewarding.” \n\n\n\n\n\n\n\n\n\n\nRelated Stories\n\n\nLatest Stories\n\n\nEvents\n\n\n\nSDSU’s 2023 Quest for the Best Winners NamedAmped Up: Aztec Mentor Program Provides Student with Career Insights, Post-Graduation Job2023 Quest for the Best Applications Are Being AcceptedLatinx Resource Center Director Comes 'Full Circle'The STEMinist MystiqueAztecs Rock Hunger Returns with Record-Breaking EffortMore Than A Decade in the MakingSDSU's Paid Internship Initiative Aims to Close Opportunity Gap for UndergradsAztecs Rock Hunger Returns with $100,000 GoalWelcome to California. Now Get Involved.After Childhood Rife With Post-9/11 Racism, Daughter of Immigrants Strives to Shape PolicyA Dream Achieved: Shawki Moore’s Path to A.S. President\n\n\nBROWSE ALL RELATED\n\n\n\n\nSeeman, Sato Named to All Mountain West TeamsSDSU Deepens Ties to OaxacaSDSU Wins Second Straight MW ChampionshipFour Aztecs Earn All-Mountain West HonorsSDSU's Class of 2023: Best Spots on Campus to Take Grad PhotosSDSU Imperial Valley Partnership Opens Doors to Higher Education for Foster YouthEducation Programs, Health Care Management Shine in New Graduate RankingsWater Polo: Legaspi and Valdes Earn GCC Postseason HonorsSDSU Educator Works to Improve Safety, Inclusion for LGBTQIA+ YouthAztec Baseball Collects Two MW Weekly HonorsEmployee Resource Group Sets Sights on a Broader ReachThe Road to SDSU’s Senior Design Day 2023\n\n\nBROWSE ALL LATEST\n\n\n\n\n\n\nCrossing the Line\n\n\n                                                                \n                                                                Ongoing through Thursday, May 4, 2023, 4pm The San Diego State University School of Art and Design presents Crossing the Line at the University Art Gallery through Thursday, May 4, 2023.Crossing the Line features the artwork of 29 local artists, faculty, and alumni of the School of Art and Design, whose work examines the notion of boundaries and borders. The work in this exhibition represents each artist’s expansive approach and perspective on the idea of divides. Campus Location: Art Gallery Event Type: Arts & Culture, Exhibits, Special Events Contact Name: Lizbeth Price Contact Email: lprice@sdsu.edu\n\n\n\n\nGlobal Education Info-Session: College of Health and Human Services\n\n\n                                                                \n                                                                Monday, May 1, 2023, 11am – 12pm If you're a CHHS student interested in Global Education opportunities join this zoom info-session to get a better understanding of the process! Before joining the info-session start the advising phase on Aztec's Abroad. You can select \"Program Search and Apply\" or \"Start Advising.\"Register Here. Room: Zoom Event Type: Information Sessions Contact Name: Global Education Office Contact Email: globaleducationoffice@sdsu.edu Contact Phone: 619-594-2475 Event Link: docs.google.com…\n\n\n\n\n\n\n\n\nBROWSE ALL EVENTS\n\n\n\n\n\n\n\n\n\n\n\n\n\nONLINE COMMUNITIES\n  \n\n\nADDITIONAL RESOURCES\nCampus Directory Maps Parking Jobs Media Web Portal CSU Land Acknowledgement \n\n\nNEWSLETTER SIGN UP\nSign up for the SDSU NewsCenter weekly newsletter.\n\n\n\n\n\n\n\n                    5500 Campanile Drive\n                    \n                    San Diego, CA 92182\n                    \n                    Tel: 619-594-5200\n                \n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "http://www.sdsu.edu/",
        "",
        "https://directory.sdsu.edu/",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/hr/jobs/",
        "https://admissions.sdsu.edu/",
        "https://newscenter.sdsu.edu/student_affairs/career/amplandingpage.aspx",
        "https://newscenter.sdsu.edu/student_affairs/career/internshipcentral.aspx",
        "http://newscenter.sdsu.edu/events/calendar.aspx",
        "https://admissions.sdsu.edu/tours_events",
        "https://library.sdsu.edu/",
        "https://newscenter.sdsu.edu/sdsu_newscenter/news.aspx",
        "https://titleix.sdsu.edu/",
        "https://smokefree.sdsu.edu/",
        "https://asir.sdsu.edu/",
        "https://directory.sdsu.edu/",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/hr/jobs/",
        "https://admissions.sdsu.edu/",
        "https://newscenter.sdsu.edu/student_affairs/career/amplandingpage.aspx",
        "https://newscenter.sdsu.edu/student_affairs/career/internshipcentral.aspx",
        "http://newscenter.sdsu.edu/events/calendar.aspx",
        "https://admissions.sdsu.edu/tours_events",
        "https://library.sdsu.edu/",
        "https://newscenter.sdsu.edu/sdsu_newscenter/news.aspx",
        "https://titleix.sdsu.edu/",
        "https://smokefree.sdsu.edu/",
        "https://asir.sdsu.edu/",
        "news.aspx",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "/sdsu_newscenter/news.aspx?dis=4",
        "news.aspx",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "/sdsu_newscenter/news.aspx?dis=4",
        "",
        "",
        "news.aspx",
        "news.aspx",
        "related_news.aspx?cat=32",
        "related_news.aspx?cat=32&page=1",
        "https://twitter.com/share",
        "news_story.aspx?sid=79163 ",
        "news_story.aspx?sid=79075 ",
        "news_story.aspx?sid=79075 ",
        "news_story.aspx?sid=79069 ",
        "news_story.aspx?sid=79022 ",
        "news_story.aspx?sid=79022 ",
        "news_story.aspx?sid=79016 ",
        "news_story.aspx?sid=79019 ",
        "news_story.aspx?sid=79019 ",
        "news_story.aspx?sid=79003 ",
        "news_story.aspx?sid=78968 ",
        "news_story.aspx?sid=78968 ",
        "news_story.aspx?sid=78949 ",
        "news_story.aspx?sid=78931 ",
        "news_story.aspx?sid=78931 ",
        "news_story.aspx?sid=78785 ",
        "news_story.aspx?sid=78765 ",
        "news_story.aspx?sid=78765 ",
        "related_news.aspx?cat=32",
        "news_story.aspx?sid=79183 ",
        "news_story.aspx?sid=79176 ",
        "news_story.aspx?sid=79176 ",
        "news_story.aspx?sid=79182 ",
        "news_story.aspx?sid=79180 ",
        "news_story.aspx?sid=79180 ",
        "news_story.aspx?sid=79178 ",
        "news_story.aspx?sid=79177 ",
        "news_story.aspx?sid=79177 ",
        "news_story.aspx?sid=79170 ",
        "news_story.aspx?sid=79179 ",
        "news_story.aspx?sid=79179 ",
        "news_story.aspx?sid=79173 ",
        "news_story.aspx?sid=79175 ",
        "news_story.aspx?sid=79175 ",
        "news_story.aspx?sid=79172 ",
        "news_story.aspx?sid=79171 ",
        "news_story.aspx?sid=79171 ",
        "news.aspx",
        "https://www.trumba.com/calendars/hpcal?eventid=165776342",
        "https://sunspot.sdsu.edu/map/display.cgi?new_loc_id=1194",
        "mailto:lprice@sdsu.edu",
        "https://www.trumba.com/calendars/hpcal?eventid=166381734",
        "https://sdsu-sa.terradotta.com/",
        "https://docs.google.com/forms/d/e/1FAIpQLSfTczJPhbNTrtVpAGlFGzmx_4XmmHgvyp1ui_Z0T7FlkgAwyQ/viewform?usp=sf_link",
        "mailto:globaleducationoffice@sdsu.edu",
        "https://docs.google.com/forms/d/e/1FAIpQLSfTczJPhbNTrtVpAGlFGzmx_4XmmHgvyp1ui_Z0T7FlkgAwyQ/viewform?usp=sf_link",
        "http://events.sdsu.edu/",
        "https://twitter.com/sdsu",
        "https://www.facebook.com/SanDiegoState",
        "https://communities.sdsu.edu/",
        "https://directory.sdsu.edu/",
        "https://www.sdsu.edu/map",
        "https://bfa.sdsu.edu/campus/parkingtrans/permits",
        "https://bfa.sdsu.edu/hr/jobs",
        "https://brand.sdsu.edu/stratcomm/media-relations",
        "https://sunspot.sdsu.edu/portal/",
        "http://www.calstate.edu/",
        "https://sacd.sdsu.edu/diversity-resources/land-acknowledgment",
        "https://cloud.comms.sdsu.edu/newscenter-subscribe"
    ]
}