{
    "title": "We Rise We Defy: Transcending Borders, Transforming Lives | Strategic Plan | SDSU",
    "body": "\n\n\n\n\n\nskip to main content\nClose Menu\n\n\n\n\n\n\n\nSan Diego State University\n\nStrategic Plan\n\n\n\n\n\n\nDisability Services\nCampus Directory\nInformation for…\n\nFuture Students\nCurrent Students\nFaculty/Staff\nAlumni\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSan Diego State University\n\nStrategic Plan\n\n\nMenu\n\n\n\n\n\n\n\n\n\n\n\nSkip site navigation\n\n\n\nPlan and Process\n\n\nTimeline and Updates\n\n\nTeams\n\n\nCampus Events\n\n\nCommunications and Documents\n\n\nFAQ\n\n\n\n\n\n\nDownload the report\n\n2020 - 2025 Strategic Plan Report\nShare Your Voice\n\n\nWe Rise We Defy: Transcending Borders, Transforming Lives\nSan Diego State University's strategic plan \"We Rise We Defy: Transcending Borders,\n                              Transforming Lives\" is designed to establish SDSU’s vision and mission for the next\n                              five years.\nThe plan will elevate the distinctive nature of the university and its campus community.\n                              The strategic plan serves as the primary guide for SDSU’s growth and commitment to\n                              teaching, research and creativity, with the intention of transforming the lives of\n                              students and engaging our communities. We believe and know that the transformative\n                              experience provided at SDSU enriches lives and strengthens communities on our own\n                              campus and in our binational region, and has a lasting impact around the world through\n                              the work of our students, faculty, staff and alumni.\nAfter months of institutional research, benchmarking, and community engagement and\n                              input, five strategic priorities have emerged. These include: Becoming a Premier Public\n                              Research University: A New Kind of Hispanic Serving Institution (HSI); Resilience.\n                              Designed to Thrive; We Are SDSU; Equity and Inclusion in Everything We Do; and Students\n                              at Our Core.\nEach of these priorities have corresponding key activities and deadlines, which are\n                              meant to guide the strategic planning process and chart SDSU’s future for the next\n                              five years and beyond.\n\n\nStrategic Directions, Goals and Activities\n\n\n\n\n\n\nFive strategic priorities emerged through a months-long process of institutional research,\n                  benchmarking and community engagement and input.\n\nBecoming a Premier Public Research University: A New Kind of HSI\nResilience. Designed to Thrive\nWe Are SDSU\nEquity and Inclusion in Everything We Do\nStudents at Our Core\n\n\n\n\n\n\nBecoming a Premier Public Research University: A New Kind of HSI\nSDSU will forge a path to become an R1 Doctoral University where excellence and access\n                  converge.  To achieve this long-term institutional goal, SDSU will leverage its unique\n                  stature as a community-engaged, border-connected, Hispanic-Serving Institution (HSI)\n                  located on Kumeyaay land. We are committed to developing infrastructure and resources\n                  that enable our research activity to grow while continuing to support excellence in\n                  teaching.\n\n\n\nKey Activities\n\n\n\n\nBy June 2021, conduct an assessment with recommendations for needed resources for\n                                 the university’s research infrastructure (such as library acquisitions, equipment\n                                 needs, research support).\nBy June 2022, develop proposals for at least three new collaborative research centers\n                                 with more than $1.5 million each in external funding per year in response to external\n                                 requests for proposals (RFPs).\nBy June 2025, formally propose eight to 10 new strategically placed Ph.D. programs\n                                 while advocating for the authority to offer independent doctorate degrees.\nBy June 2025, secure authorization and funding for at least one new LEED (gold or\n                                 platinum) certified major research facility.\nBy June 2025, submit proposals for 80% of federally designated HSI competitions for\n                                 which SDSU is eligible each fiscal year.\nBy June 2025, establish new research partnerships with three universities in Latin\n                                 America.\nBy June 2025, conduct hires of faculty members (five to 10 lines) clustered around\n                                 public-facing, border, or Indigenous scholarship.\n\n\n\n\n\n\nResilience. Designed to Thrive\nSDSU is committed to building a resilient and sustainable university through innovative\n                  practices.\n                  \t\t\tWe must develop new revenue streams to meet our scholarly and teaching aspirations,\n                  our dedication to community and diversity, and the athletic endeavors of the university.\n                  \t\t\tWe commit to using our resources with transparency, equity, efficiency, and accountability\n                  in alignment with the university's goals.\n                  \t\t\tAs citizens of a larger global community, SDSU proudly embraces the principles\n                  of responsible environmental stewardship.\n\n\n\nKey Activities\n\n\n\n\nBy December 2020, develop a structure that promotes entrepreneurial aspirations, which\n                                 includes a competitive revenue-generating proposal process for each college.\nBy December 2021, develop a one-year revenue plan for the following entities with\n                                 immediate areas of opportunity and planning (follow up with an additional four-year\n                                 plan by Fall 2022):\n\nSDSU Global Campus\nAthletics\nHigher Education FCC High Frequency License\nPhilanthropic Development\nResearch\nTech Transfer\nAll SDSU auxiliaries (Research Foundation, Residential Life, Aztec Shops, The Campanile\n                                    Foundation, Associated Students)\n\n\nBranding and Communications\n\nBy December 2020, develop and launch a comprehensive brand strategy for SDSU, which\n                                 will directly benefit our ability to create and generate new financial support for\n                                 the university. This strategy should build on the strengths of SDSU Athletics, should\n                                 enhance public-private partnerships (P3s) and philanthropy, and would contribute to\n                                 student recruitment.\nBy December 2020, realign the marketing initiatives led and/or managed by Strategic\n                                 Communications and Public Affairs (StratComm) with the outcomes of the strategic plan,\n                                 to include the creation of a centralized brand management portal and a revision of\n                                 the university's logo.\nBy December 2020, identify areas to advance synergies for shared services across divisions\n                                 and other units, and develop an organizational plan.\nBy June 2021, support and enhance the viability and excellence of SDSU’s auxiliaries\n                                 through a plan that continues to enable each unit to provide opportunities for students,\n                                 faculty, staff, and community partners while invigorating the economic success of\n                                 the university.\nBy June 2021, develop and align a process for Multi-Year Objective Setting and Budget\n                                 Planning for the university.\nBy December 2021, designate executive-level leadership to develop and provide oversight\n                                 of SDSU’s sustainability efforts.\nBy June 2022, update the University Climate Action Plan, inclusive of all campus locations,\n                                 with defined benchmarks until June 2025.\nBy June 2022, develop Guiding Principles for Sustainability that include local and\n                                 international standards (as referenced in the Associated Students Carbon Neutrality\n                                 by 2030 Recommendations) to be reviewed on an annual basis.\n\n\n\n\n\n\nWe Are SDSU\nSDSU will expand its global impact, unifying the university through a common mission\n                  and identity.\n                  \t\t\tUnder a single name, the multi-campus university includes the San Diego campus,\n                  SDSU Imperial Valley, SDSU Global Campus, a future SDSU Mission Valley location, regional\n                  microsites, and other programs around the globe and online.\n                  \t\t\tNo matter SDSU’s campus or program location, the collective mission is to support\n                  the educational and economic development of communities while creating a sense of\n                  unified belonging for students, faculty, staff, and alumni.\n                  \t\t\tWe span the California-Mexico border, and serve the world.\n\n\n\nKey Activities\n\n\n\n\nBy December 2020, establish a campus-wide working group to explore university-industry\n                                 partnerships that build alliances that benefit all university campuses.\nBy June 2021, ensure that SDSU Imperial Valley and SDSU Mission Valley have representation\n                                 on university resource planning and recommending bodies.\nBy June 2021, develop and implement a  Culture of Communication Plan  for the university\n                                 that improves synergy and collaboration between all campus-wide communication personnel.\nBy December 2021, establish a campus-wide working group to assess instructional and\n                                 information technology to establish an action plan to interconnect campuses, international\n                                 partners, and the campus community.\nBy December 2021, establish an SDSU microsite at every community college in the SDSU\n                                 service area.\nBy June 2021, establish a plan for continued collaborations for SDSU Georgia by June\n                                 2021.\nBy June 2021, create a  Global Strategy Action Plan  to address global program infrastructure,\n                                 international student recruitment, yield, and retention with implementation benchmarks,\n                                 along with a schedule to continually improve the plan. The initial plan will identify\n                                 future delivery dates for key implementation benchmarks.\nBy June 2022, finalize a formal partnership agreement for admissions and recruitment\n                                 with Kumeyaay Community College.\nBy June 2022, pilot a shuttle service between SDSU microsites in San Diego County\n                                 for SDSU’s major sporting and campus-wide events.\nBy June 2023, pilot a daily shuttle service between the SDSU and SDSU Imperial Valley\n                                 campus locations.\nBy June 2024, develop a subsidy program to lower public transportation fare costs\n                                 between SDSU and SDSU Mission Valley.\nBy June 2024, develop a green transportation plan between the SDSU and SDSU Mission\n                                 Valley campus locations.\nBy June 2025, establish four new bachelor’s programs and two new master's programs\n                                 at SDSU Imperial Valley.\n\n\n\n\n\n\nEquity and Inclusion in Everything We Do\nSDSU will be a global leader in advancing diversity, equity, and inclusion in research,\n                  teaching and in community engagement.\n                  \t\t\tAt SDSU, the mark of our global leadership will be an innovative institutional\n                  infrastructure that promotes and supports diversity, equity, and inclusion in everything\n                  we do: research, teaching, professional development, student experiences in and outside\n                  the classroom, and community relationships.\n                  \t\t\tOur values compel us to foster such an environment, where community members of\n                  all identities can thrive.\n                  \t\t\tWe embrace SDSU’s identity as a Hispanic-Serving Institution on the border and\n                  recognize our residence on Kumeyaay land.\n                  \t\t\n\n\n\nKey Activities\n\n\n\n\nBy December 2020, ensure that every major campus unit (college, division, auxiliary),\n                                 in coordination with the existing Diversity and Inclusion Planning committees, has\n                                 a standing diversity council to better coordinate and promote unit-specific Diversity,\n                                 Equity and Inclusion (DEI) activities.\nBy December 2020, establish a process and organized structure to coordinate, expand,\n                                 and increase visibility of heritage month programs and events.\nBy December 2020, establish a DEI Initiative (analogous to the Shared Governance Initiative)\n                                 to define and promote diversity, equity, and inclusion, and promote ongoing conversations\n                                 about DEI and how it can drive action.\nBy June 2021, establish a sustainable centrally-funded information technology unit\n                                 responsible for managing campus-wide accessibility to implement and drive institutional\n                                 governance and policy.\nBy June 2021, develop a structured, university-wide calendar to promote and highlight\n                                 diversity-related programs and university-sponsored events (to include student, faculty,\n                                 staff, and administration-led events).\nBy August 2021, develop a protocol for continuous review and development of campus\n                                 materials, events and programs to ensure diverse backgrounds, identities, and experiences\n                                 are reflected with respect and authenticity.\nBy December 2021, implement an onboarding program that emphasizes SDSU’s values and\n                                 educates all newly hired staff, regardless of classification (by December 2021), graduate\n                                 students (by June 2022), undergraduate students (by June 2022), newly hired lecturers\n                                 (by June 2022), and tenure-track faculty (by December 2022) about implicit bias, inclusive\n                                 communication, SDSU’s designation and identity as an Hispanic-Serving Institution,\n                                 and the university’s connection with the Kumeyaay people.\nBy December 2021, ensure participation in professional learning on inclusive practices\n                                 for all search committees (by December 2021), retention, tenure, and promotion committees\n                                 (by June 2022), staff supervisors and managers (by June 2022), and admissions committees\n                                 (by December 2022).\nBy December 2022, expand the role of the Diversity Liaisons to better coordinate DEI\n                                 activities across colleges and units.\nBy December 2022, develop a task force and apply for Asian American and Native American\n                                 Pacific Islander-Serving Institutions (AANAPISI) status.\nBy   December 2022, establish and launch intergroup dialogue programs (such as Human\n                                 Library, racial equity learning groups, peacemaking circles).\nBy December 2022, establish and provide institutional support for structured mentoring\n                                 programs for all faculty and staff (regardless of classification).\nBy June 2025, engage Arts Alive SDSU to display 10 permanent outdoor representations\n                                 of diverse communities (such as statues, murals, sculptures) across the university\n                                 campuses.\n\nLeadership Development\n\nBy December 2023, establish and provide institutional support for structured leadership\n                                 development opportunities for all faculty and staff (regardless of classification)\n                                 aligned with unit Diversity and Inclusion Plans.\n\n\n\n\n\n\nStudents at Our Core\nSDSU commits to a future where all students are able to achieve their greatest potential.\n                  \t\t\tOur collective efforts will elevate SDSU as a national exemplar, providing education\n                  and training for the innovators and leaders our region and global society demand.\n                  \t\t\tSDSU will provide access to success through transformational experiences in and\n                  outside of the classroom for undergraduate, graduate, and lifelong learners.\n                  \t\t\tWith an enduring commitment to innovation, resilience and to our students, we will\n                  cultivate a university culture and infrastructure that facilitates an affordable,\n                  student-centered, wellness-focused, life-long educational journey, supported by every\n                  member of the SDSU community.\n                  \t\t\n\n\n\nKey Activities\n\n\n\n\nBy December 2021, SDSU will provide all faculty and advisors with information on student\n                                 success and equity gaps in their classrooms and their respective colleges. In addition,\n                                 provide research-informed recommendations and professional development forways to\n                                 support student success in their teaching.\nBy December 2021, SDSU will invest in campus-wide technological and professional development\n                                 support as the foundation for a coordinated campus approach to advising, teaching,\n                                 and co-curricular support services.\nBy December 2021, SDSU will ensure that all academic programs are actively and continuously\n                                 engaged in equity-driven, evidence-based improvement efforts that reflect best practices\n                                 of assessment.\nBy June 2021, implement a wellness toolkit for faculty and staff to further promote\n                                 and educate the campus community about the resources available for students through\n                                 Counseling & Psychological Services and the Economic Crisis Response Team (ECRT) to\n                                 support student mental health and basic needs.\nBy June 2021, develop a service delivery model that expands placement of therapists\n                                 in university programs, departments and centers in order to increase capacity to meet\n                                 the unique needs of all students, including students from diverse backgrounds, graduate\n                                 students and students enrolled in SDSU Global Campus programs.\nBy December 2023, the university will have a 75% placement rate for undergraduate\n                                 students in internships, research opportunities, and fellowships to enhance employability\n                                 and access to graduate studies.\nBy December 2023, ensure that all graduate programs will develop a professional development\n                                 plan for graduate students.\nBy Fall 2023, develop a university infrastructure that fosters and sustains regional\n                                 partnerships with K-12 schools, community colleges, educational organizations, and\n                                 industry that promotes college readiness and a college-going culture.\nBy December 2024, SDSU will open a new multidisciplinary space to house and support\n                                 campus basic needs initiatives. The space will serve as a wellness hub for presentations\n                                 and workshops and where students can meet with ECRT case managers and community partners\n                                 to receive one-on-one personalized support.\nBy June 2025, increase the number of SDSU Global Campus adult learners by 25%.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5500 Campanile DriveSan Diego, CA 92182\n619-594-5200\n\n\n\n\n\n\n\n\nA-Z Index\n\n\nCampus Directory\n\n\nMaps\n\n\nParking\n\n\n\n\n\n\nEmployment\n\n\nMedia Relations\n\n\nGive to SDSU\n\n\nCanvas\n\n\n\n\n\n\nGeneral Contact\n\n\nNetwork Status\n\n\nStrategic Plan\n\n\nNewsletter Sign Up\n\n\n\n\n\n\n\n\n\nCopyright © 2023 San Diego State University\n\n\n\n\nRequires SDSUid\n indicates links which require an SDSUid.\n\n\n\nAccessibility\n\n\nSDSU Digital Privacy Statement\n\n\nFeedback\n\n\n\n\n \n\n\nDocument Readers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLast Updated 6/14/22",
    "links": [
        "#maincontent",
        "#",
        "/",
        "/strategic-plan/",
        "https://newscenter.sdsu.edu/student_affairs/sds/",
        "https://directory.sdsu.edu/",
        "#",
        "https://admissions.sdsu.edu/",
        "https://newscenter.sdsu.edu/home/currentstudents.aspx",
        "https://www.sdsu.edu/faculty-staff",
        "http://www.sdsualumni.org/",
        "https://www.facebook.com/SanDiegoState",
        "https://twitter.com/sdsu",
        "https://www.youtube.com/user/SDSUVideo",
        "https://instagram.com/sandiegostateuniversity",
        "https://communities.sdsu.edu/",
        "/",
        "/strategic-plan/",
        "#siteNavigation",
        "#post-site-nav",
        "https://www.sdsu.edu/strategic-plan/process",
        "https://www.sdsu.edu/strategic-plan/updates",
        "https://www.sdsu.edu/strategic-plan/teams",
        "https://www.sdsu.edu/strategic-plan/events",
        "https://www.sdsu.edu/strategic-plan/communications",
        "https://www.sdsu.edu/strategic-plan/faq",
        "/strategic-plan/pdfs/sdsu-strategic-plan-2020-2025-report-082620.pdf",
        "https://docs.google.com/forms/d/e/1FAIpQLSc2cUSIAWIvz3ah_q4k-S1HNeNB2blICXveuRovt6O2ufjUVQ/viewform",
        "#collapsed20e363_1",
        "#collapsed20e437_1",
        "#collapsed20e541_1",
        "#collapsed20e627_1",
        "#collapsed20e722_1",
        "https://www.sdsu.edu/",
        "tel:1-619-594-5200",
        "/departments/",
        "https://directory.sdsu.edu/",
        "https://map.concept3d.com/?id=801",
        "https://bfa.sdsu.edu/campus/parkingtrans/permits",
        "https://bfa.sdsu.edu/hr/jobs",
        "https://brand.sdsu.edu/stratcomm/media-relations",
        "https://give.sdsu.edu/",
        "https://canvas.sdsu.edu/",
        "/contact/",
        "https://status.sdsu.edu/",
        "/strategic-plan/",
        "https://www.sdsu.edu/newscenter-newsletter-signup",
        "https://it.sdsu.edu/sdsuid",
        "https://accessibility.sdsu.edu/",
        "https://sdsu.edu/digitalprivacy",
        "https://www.sdsu.edu/feedback?utm_source=www&utm_medium=web&utm_campaign=analytics",
        "https://www.sdsu.edu/document-readers",
        "https://www.facebook.com/SanDiegoState",
        "https://twitter.com/sdsu",
        "https://www.youtube.com/user/SDSUVideo",
        "https://instagram.com/sandiegostateuniversity",
        "https://communities.sdsu.edu/",
        "https://a.cms.omniupdate.com/11/?skin=sdsu&account=prod&site=www&action=de&path=/strategic-plan/index.pcf"
    ]
}