{
    "title": "5-SURE Safe Rides | Vaden Health Services",
    "body": "\n\n        Skip to main content\n      \n\n        Skip to secondary navigation\n      \n\n\nStanford University(link is external)\n\n\n\n\n\n\n\nRemember... it is okay to not be okay.Mental Health Resources at Stanford\n\n\n\n\n\n\n\n\n\nStanford\n\n \nVaden Health Services\n\n\n\n\n\nSearch this site\n\nSubmit Search\n\n\nMenu\nVaden Health ServicesAbout Vaden Health ServicesAdditional Information About Vaden Health ServicesEntrance RequirementsMedical Student Entrance RequirementsMedical Records Release, Privacy Rights, and Patient Rights and ResponsibilitiesPeopleVaden Health Services HoursVaden Health Services FeesCampus Health Service Fee (\"Health Fee\")Counseling and Psychological Services (CAPS) FeesImmunizationsMedical CareTravel ClinicVaden Health Services FormsMake an AppointmentMedical Services at VadenPreventive Care: STI and Other ScreeningNutrition ServicesPhysical TherapyTravel HealthOur ServicesGet Immediate Help NowAfter Hours Services When Vaden Is ClosedImmediate Medical HelpImmediate Mental Health Crisis AssistanceSexual Assault ResourcesMedical ServicesAppointments for Medical ServicesMedical Advice & General TipsMedical Services: What We DoHealth Maintenance and PreventionLab and X-ray ServicesSpecialists on SiteVaccinations, Allergy Shots, and Other Medication InjectionsMedical Services ResourcesEating & Body ConcernsEating & Body Concerns Online ResourcesMental HealthAcademic Accommodations Related to Mental Health NeedsAttention Deficit Hyperactivity DisorderCAPS ADHD ProtocolEmotional Support Animals and CAPSRelationshipsSexual HealthSexually Transmitted Infections (STIs)Substance UseDrug Use FactsWellnessLGBTQIA+ HealthCounselingMedical ServicesGender-Affirming CareFrequently Asked Questions about Gender Affirming CareGender Affirming Surgery Process and InformationGender Affirming Hormone Therapy (GAHT) ConsultationsFrequently Asked Questions: LGBTQIA+ Health at StanfordGlossary of Terms Related to Transgender CommunitiesSexual FluidityTransitioning your Medical and Mental Health CareAsthmaConcussionDiabetesEating DisordersEnvironmental Allergies/Hay Fever ManagementFood AllergiesInflammatory Bowel DiseaseMental Health IssuesMobility Issues or Wheelchair UseTravelCounseling and Psychological Services (CAPS)Connect to SupportCAPS Clinical ServicesNew WPO Therapy Option for StudentsCAPS Groups & WorkshopsVideosMindful MinutesOptions for Care Outside of CAPSLet's Talk in CommunityGet to Know CAPSCAPS StaffDiversity & Inclusion at CAPSAllyshipDiscriminationCAPS Forms & PoliciesCAPS FAQCAPS Confidentiality & DisclosuresCounseling and Psychological Services (CAPS)CAPS OutreachProfessional Training ProgramsDoctoral Internship in Health Service PsychologyPhilosophy & GoalsComponents of the Training ProgramApplication Qualifications & ProcessDoctoral Internship in Health Service Psychology FAQInternship Admissions, Support, & Initial Placement DataEvaluation, Required Minimum Levels of Achievement, Due Process and Grievance Procedures, and Exit CriteriaPostdoctoral FellowshipPsychiatry Training at CAPSHow to Help a Student in DistressConfidential Support Team (CST)What Does Confidential Mean?Time Sensitive Actions After an AssaultWhat CST OffersWho We AreHow to Connect With UsWhat Happens at CSTAdditional Programs and ServicesCST OutreachAdditional ResourcesWeiland Health InitiativeAbout Weiland Health InitiativeAbout Ric WeilandClinical ServicesTraining, Advocacy, Events & MoreTraining & EducationAdvocacyGender Inclusive Stanford (GIS)QT Umbrella Assistance Fund (QT Fund)EventsMoreResourcesWell-Being at StanfordYour Well-Being TeamWhat is Well-Being?Food and EatingNutrition CounselingWell-Being CoachingWell-Being Coaching TestimonialsAdditional Coaching ResourcesWell-Being TipsGet InvolvedCommunity Trainings & ConsultationWell-Being FAQsOffice of Substance Use Programs Education & Resources (SUPER)About SUPERUniversity Policies Related to Substance UseSUPER Reports and Current NewsPrograms5-SURE Safe Rides5-SURE on FootThe PEERsCardinal RecoveryI am in recovery and would like to know what support is available to meI am in recovery and seeking academic and housing accommodationsI have a loved one in recovery and I'm seeking supportI am not in recovery but want to learn about being an allyPodcasts, Webinars, Blogs, and AppsThe Well HouseHarm Reduction Tools ProgramEducationAlcohol & Drug InfoReduce Your RiskWhat are the Short-Term and Long-Term Risks?MAPP Strategy, Having Fun, and Playing it SafeCount Your DrinksToleranceWhat Is Blood Alcohol Concentration (BAC)?Alcohol Poisoning & Other Drug EmergenciesAlcohol Overdose/PoisoningBacchus ManeuverHow to Help a FriendLooking Out for Your FriendsInterveningOther Types of DrugsCannabisStimulants (Caffeine, Ritalin, Adderall, Cocaine etc.)Prescription Opioid DrugsHookahPredatory, Club and Party DrugsSteroidsTobacco/Nicotine and E-Cigarettes/VapingSUPER Trainings & WorkshopsAlcoholEduAlcoholEdu Letter 2021Training OfferingsRequest Materials/ResourcesSUPER CupsInfographicsAlcohol PoisoningTraining Request FormPartiesEANABs & MocktailsSober MonitorsWhat is a Sober Monitor?Sober Monitor ResponsibilitiesEmergenciesSober Monitor TestParty Planning GuideStudent Alcohol PolicyStudent Party Policy & GuidelinesAppendixResourcesFor StudentsDIP/MIPDrinking and DrivingOther Common CitationsFor Parents, Guardians, and FamiliesA Letter to Parents/Guardians Regarding Alcohol and DrugsParent/Guardian ResourcesParents Role in Student Alcohol Use: Myths v FactsTips for Talking to Your Student About AlcoholFor Staff/FacultyFor Student Organizations & Student StaffSchedule a TrainingSUPER AssetsStanford Living EducationWellness EducationLEADLifeWorksAbout Stanford Living EducationPharmacyFilling a PrescriptionObtaining a RefillPharmacy Payment OptionsEmergency ContraceptionInsurance & Referral OfficeHealth Insurance OverviewHow U.S. Health Insurance WorksInsurance vs. Campus Health Service FeeInsurance RequirementsCardinal Care Overview & BenefitsCardinal Care & Stanford Student Dependent Health Insurance for 2023-2024Medical, Mental Health & Dental BenefitsCost & Coverage DatesEnrollment in Cardinal CareChoosing Your InsuranceImportant DeadlinesRetaining Cardinal Care: All StudentsWaiving Cardinal Care: Domestic StudentsWaiving Cardinal Care: International StudentsDental & Vision Insurance OptionsFrequently Asked Questions About Insurance and the Health FeeDependent Insurance CoverageDependent EnrollmentEligibilityFrequently Asked Questions: Dependent Health InsuranceFrequently Asked Questions: AffordabilityStudent Affairs News\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5-SURE Safe Rides\n\n\n\n\n\n\n\nMain content start\n\n\n\n \n\n \n5-SURE is for all Stanford students, faculty and staff. Drivers are trained to handle a variety of situations. The service assists thousands of students per quarter by providing transportation to and from an array of campus locations that range from parties and other campus activities to dormitories and libraries. 5-SURE welcomes any constructive criticism, service oriented workers, and/or opportunities to aid the Stanford community by working towards eliminating serious risks. SERVICE NOW RUNS 5PM - 2AM.\n\n \n\n \n\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n650.725.SURE (650.725.7873)\nCall 5-SURE\n5-SURE has a new system. When you call please wait on the line, and your call will be answered in the order it was received. Do not hang up and call back, that will remove you from the automated queue. Please check the Ridership Policies for new COVID related updates. \nAccessibility: We have wheelchair accessible transportation available upon request. Please let our dispatch know when you call.  \nHours of Operation: 7 Days a Week,  5:00 p.m. - 2:00 a.m. (Last Call at 1:45 a.m.). Note: 5-SURE does not operate during Summer, Thanksgiving, Winter and Spring Breaks, Finals.\nPress Button to Call 5-SURE\n\n\n\n\n\n\n\n \n\n \n\n \n\n \n5-SURE Safe Rides now operates 5PM - 2AM.\n\n\n\n\n\n \n\n \nDates of Service\nAutumn Quarter\nService Begins: Friday, October 1, 2022\nThanksgiving Break\nClosed Saturday, November 19, 2022  \nReopens: Monday, November 28, 2022\n\nWinter Closure: Friday, December 9, 2022\n\n \n\nWinter Quarter\nService Begins: Friday, January 13, 2023\nService Ends: Saturday, March 18, 2023\n\n \n\nSpring Quarter\nService Begins: Tuesday, April 4, 2023\nService Ends: TBD\n\n \n\nSummer Quarter\nThere is no Summer Quarter service.\n\n\n\n\n\n\n \n\n \n\n \n\nRidership Policies\nCOVID Updates\nDue to COVID-19, all passengers must wear a mask or facecovering during the entirety of the ride.  Our drivers will also be wearing masks, and cleaning as often as possible to ensure a safe and clean vehicle. \nDuring this time we are also only taking two passengers per ride traveling from and to the same location together.  We are not able to accomodate larger groups.  5-SURE will not transport any person who is experiencing symptoms related to COVID-19, or has tested positive for COVID-19 in the past 2 weeks.  We will not transport anyone to or from quarantine or isolation rooms either on or off campus, and we will not transport anyone to the hospital.  Finally, we will be requiring all passengers to show their up-to-date HealthCheck.  Anyone with a negative HealthCheck will not permitted in the vehicles. \n\n \n\nRide Priorities\nOur main focus is providing service to groups of three or smaller due them being more vulnerable to possible risks. Groups of four or greater are statistically proven to deter possible criminals from serious crimes such as theft, assault, and rape. Because of this, if you request a ride for a group (see ‘Group Rides’ below), our priority will be those on our list that face a greater risk (e.g. a ride for one person receives a priority over a ride for 3 people).\n\n \n\nGroup Rides\nBecause we at 5-SURE value your safety and ours, we are limiting the number of people we transport for a given ride request in our vehicles to three people. Cramming more people than that into our vehicles poses an unnecessary risk to you, your friends, and our drivers, not to mention it is against the law. If you have groups of greater than three, you must request an additional ride for the remainder of your group. When doing so the ride must be requested with the name and number of a member of the second group and so forth. Remember, group rides have significantly lower priority and at this time we are not taking any group larger than two people. \n\n \n\nWaiting Periods\nWhen we have a lot of ride requests in a short period of time, we ask that when you call in for a ride you be ready to get out to our vehicle in the next couple minutes. Based upon the time estimate our receptionist gives you please be ready to go sooner rather than later. When you receive a call saying that your ride is waiting for you, you have three minutes to get out there. After this time, we will proceed on to the next scheduled ride and come back for you after that. If there is something preventing you from making it out to our vehicle in that time period, please let us know by calling our number and alerting our receptionist to the problem. Please also note that 5-SURE is limited by people-power constraints. It takes time to travel, especially across campus. Please be outside waiting to help us decrease waiting times for all riders.\n\n \n\nCleanliness\nWe understand that you may not be in the best state when entering a 5-SURE vehicle.  With that in mind there are buckets with liners available for your use. Unfortunanely, people do not always make it into the bucket.  If you vomit, or make any other mess in any of the vehicles you will be charged a cleaning fee of up to $250 per instance.  This can be proplematic since a vehicle that has been vomited in cannot be used for the remainder of the evening, and must be taken off-line until it is cleaned. This only adds to our already long wait times.  Be considerate of everyone else. \n\n \n\nRight to Deny Service\nThe 5-SURE staff has the right to refuse service to anyone if we feel that our services are being abused or if our safety is put in jeopardy.\n\n\n\n\n\n \n\n \n\n \n\nAbout 5-SURE\nOur Past\n5-SURE began as a SURE (Students United for Rape Elimination), first operating on March 5, 1979 during a time when rapes on and around campus were at epidemic levels. One student, who had been bothered by these events for several months, read an article by a rape victim that inspired him to take action. He recruited thirty students to volunteer two hours per week as escorts. SURE was fully funded during its first year with $900 from the Office of Student Affairs. This covered the phone line and printing costs. The Stanford Police Department donated flashlights, whistles and badges, while most publications, especially the Stanford Daily, donated advertising space. Escorts rode bicycles to any location on campus, then walked or biked alongside the students to their destinations within one mile of campus. The service began operating five nights per week, from 8:30 p.m. to 12:30 a.m., and quickly extended its hours to include a Winter shift from 6:30 to 8:30. SURE was created during the 1970's women's movement, and was under constant fire for its “chivalrous” nature. Frequent editorials in the Stanford Daily argued both sides of the issues. Some students opined that an organization founded and run by a man was the wrong recipe to thwart a crime of male dominance, while other students argued that SURE gave women the opportunity to be safe while traveling across campus at night. To appease the critics, SURE added women escorts, having them work in teams of two. This, coupled with the fact that the founder and director refused to engage in the debate, caused the sometimes heated argument to subside over time. SURE ran successfully for several years, but unfortunately, during the 80's the service stagnated and stopped running.\n\n \n\nA Rebirth\nIn the 90's, SURE Escorts reemerged as 5-SURE. Gradually, SURE Escorts once again became synonymous with campus safety, trustworthiness, and reliability. It operated seven days a week, providing a welcomed resource when that daytime study session became a late-night excursion. The service also increased its efficiency by introducing golf carts in lieu of the traditional walking escorts. This boosted its ridership attesting to the service's innovative nature, as no other campus had or currently has such a program.  These unique characteristics rooted 5-SURE into Stanford culture and have since enabled it to develop into its success as a service to the Stanford community.\n\n \n\nWhat We Are Today\n5-SURE has since changed its name to Students United for Risk Elimination as of January 24, 2011. This change was made since 5-SURE has evolved over the years as users have utilized our services to not just eliminate rape, but other risks including but not limited to theft, assault, and possible stalking situations. 5-SURE makes use of cars and golf carts, two-way radios and paid drivers to maintain a constant nighttime presence on campus. Over ten part-time student-staff are employed by 5-SURE who work in collaboration with campus departments and organizations such as Public Safety, the Women's Center and Residential Education. 5-SURE is student-managed and supervised by the Office of Substance Use Program, Education & Resources. Our 'Home Base' is located in Rogers House. Staff responsibilities entail answering phones at the dispatch desk and driving the cars. A typical shift involves two to three people - one person to answer the phones while the others drive. As many as two vehicles roam campus on busy nights. To request a ride, riders are encouraged to call 725-SURE. 5-SURE is for all Stanford students, faculty and staff. Drivers are trained to handle a variety of situations. The service assists thousands of students per quarter by providing transportation to and from an array of campus locations that range from parties and other campus activities to dormitories and libraries. 5-SURE welcomes any constructive criticism, service oriented workers, and/or opportunities to aid the Stanford community by working to eliminate serious risks.\nLibrary Archive and Exhibit on 5-SURE\n\n\n\n\n\n \n\n \n\n \n\nAdditional Campus Resources\nSHARE Office: 650.725.1056\nWomen’s Center: 650.723.2300\nRisk Management: 650.723.4554\nDisGO\nResidential Education: 650.725.2800\nPublic Safety: 650.723.9633\n\n\n\n\n\n\n \n\n \nHow's Our Driving?\nProvide feedback on the 5-SURE Safe Rides program\n\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n \nVaden Health Services\n\n\nWeb Login\n\n\n\nAddress\n\n \n866 Campus Drive\nStanford, CA 94305-8580\nUnited States\n\n\n\nCampus Map\n\n\nPhone:  650.498.2336\n\n\nVaden Feedback\n\n\n\n\n\n\n\n\n\nStanfordUniversity\n\n\n\n\nStanford Home(link is external)\n\nMaps & Directions(link is external)\n\nSearch Stanford(link is external)\n\nEmergency Info(link is external)\n\n\n\nTerms of Use(link is external)\n\nPrivacy(link is external)\n\nCopyright(link is external)\n\nTrademarks(link is external)\n\nNon-Discrimination(link is external)\n\nAccessibility(link is external)\n\n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n \n\n\n  Back to Top\n\n\n\n\n",
    "links": [
        "#main-content",
        "#secondary-navigation",
        "https://stanford.edu",
        "https://studentaffairs.stanford.edu/resources-our-communities/mental-health-resources-stanford",
        "https://vaden.stanford.edu/",
        "/home",
        "/home/about-vaden-health-services",
        "/home/about-vaden-health-services/additional-information-about-vaden-health-services",
        "/entrance-requirements",
        "/home/about-vaden-health-services/entrance-requirements/medical-student-and-physician-assistant",
        "/home/about-vaden-health-services/medical-records-release-privacy-rights-and-patient-rights-and",
        "/people",
        "/home/about-vaden-health-services/vaden-health-services-hours",
        "/home/about-vaden-health-services/vaden-health-services-fees",
        "/home/about-vaden-health-services/vaden-health-services-fees/campus-health-service-fee-health-fee",
        "/home/about/vaden-health-services-fees/counseling-and-psychological-services-caps-fees",
        "/home/about/vaden-health-services-fees/immunizations",
        "/home/about-vaden-health-services/vaden-health-services-fees/medical-care",
        "/home/about/vaden-health-services-fees/travel-clinic",
        "/home/about-vaden-health-services/vaden-health-services-forms",
        "/home/make-appointment",
        "/home/make-appointment/medical-services-vaden",
        "/make-appointment/medical-services/preventive-care-sti-and-other-screening",
        "/home/make-appointment/nutrition-services",
        "/home/make-appointment/physical-therapy",
        "/home/make-appointment/travel-health",
        "/make-appointment/travel-health/our-services",
        "/home/get-immediate-help-now",
        "/home/get-immediate-help-now/after-hours-services-when-vaden-closed",
        "/home/get-immediate-help-now/immediate-medical-help",
        "/home/get-help-now/immediate-mental-health-crisis-assistance",
        "/confidential-support-team-cst",
        "/medical-services",
        "/medical-services/appointments-medical-services",
        "/medical-services/general",
        "/medical-services/appointments-medical-services/medical-services-what-we-do",
        "/medical-services/appointments-medical-services/health-maintenance-and-prevention",
        "/medical-services/appointments-medical-services/lab-and-x-ray-services",
        "/medical-services/medical-services-appointments/specialists-site",
        "/medical-services/appointments-medical-services/vaccinations-and-other-medication-injections",
        "/medical-services/medical-services-resources",
        "/medical-services/medical-services-resources/eating-body-concerns",
        "/medical-services/medical-services-resources/eating-body-concerns/eating-body-concerns-resources",
        "/medical-services/medical-services-resources/mental-health",
        "/medical-services/medical-services-resources/mental-health/academic-accommodations-related-mental",
        "/attention-deficit-hyperactivity-disorder",
        "/caps-adhd-protocol",
        "/medical-services/medical-services-resources/mental-health/emotional-support-animals-and-caps",
        "/medical-services/medical-services-resources/relationships",
        "/medical-services/medical-services-resources/sexual-health",
        "/medical-services/medical-services-resources/sexual-health/sexually-transmitted-infections-stis",
        "/medical-services/medical-services-resources/substance-use",
        "/medical-services/medical-services-resources/substance-use/drug-use-facts",
        "/medical-services/medical-services-resources/wellness",
        "/medical-services/lgbtqia-health",
        "/medical-services/lgbtqia-health/counseling",
        "/medical-services/lgbtqia-health/medical-services",
        "/medical-services/lgbtqia-health/gender-affirming-care",
        "/medical-services/lgbtqia-health/gender-affirming-care/frequently-asked-questions-about-gender",
        "/medical-services/lgbtqia-health/gender-affirming-care/gender-affirming-surgery-process-and",
        "/medical-services/lgbtqia-health/gender-affirming-care/gender-affirming-hormone-therapy-gaht",
        "/medical-services/lgbtqia-health/frequently-asked-questions-lgbtqia-health-stanford",
        "/medical-services/lgbtqia-health/glossary-terms-related-transgender-communities",
        "/medical-services/lgbtqia-health/sexual-fluidity",
        "/medical-services/transitioning-your-medical-and-mental-health-care",
        "/medical-services/transitioning-your-medical-and-mental-health-care/asthma",
        "/medical-services/transitioning-your-medical-and-mental-health-care/concussion",
        "/medical-services/transitioning-your-medical-and-mental-health-care/diabetes",
        "/medical-services/transitioning-your-medical-and-mental-health-care/eating-disorders",
        "/medical-services/transitioning-your-medical-and-mental-health-care/environmental-allergieshay-fever",
        "/medical-services/transitioning-your-medical-and-mental-health-care/food-allergies",
        "/medical-services/transitioning-your-medical-and-mental-health-care/inflammatory-bowel-disease",
        "/medical-services/transitioning-your-medical-and-mental-health-care/mental-health-issues",
        "/medical-services/transitioning-your-medical-and-mental-health-care/mobility-issues-or-wheelchair",
        "/medical-services/travel",
        "/caps",
        "/caps/connect-support",
        "/caps/connect-support/caps-clinical-services",
        "/caps/mental-health-care-options-students/caps-clinical-services/new-wpo-therapy-option-students",
        "/caps/groups",
        "/caps/groups/virtual",
        "/counseling-and-psychological-services-caps/caps-groups-and-workshops/videos/mindful-minutes",
        "/caps/connect-support/options-care-outside-caps",
        "/caps/connect-support/lets-talk-community",
        "/caps/get-know-caps",
        "/caps/get-know-caps/caps-staff",
        "/caps/get-know-caps/diversity-inclusion-caps",
        "/caps/diversity-and-inclusion/allyship",
        "/caps/diversity-and-inclusion/discrimination",
        "/caps/get-know-caps/caps-forms-policies",
        "/caps/get-know-caps/caps-faq",
        "/caps/get-know-caps/caps-confidentiality-disclosures",
        "/caps/get-know-caps/caps-confidentiality-disclosures",
        "/caps/caps-outreach",
        "/caps/professional-training-programs",
        "/counseling-and-psychological-services-caps/get-involved-caps/professional-training-programs-4-0",
        "/counseling-and-psychological-services-caps/get-involved-caps/professional-training-programs-4-0-0",
        "/counseling-and-psychological-services-caps/get-involved-caps/professional-training-programs-4-0-1",
        "/counseling-and-psychological-services-caps/get-involved-caps/professional-training-programs-4-0-2",
        "/counseling-and-psychological-services-caps/get-involved-caps/professional-training-programs-4-0-3",
        "/counseling-and-psychological-services-caps/get-involved-caps/professional-training-programs-4-0-4",
        "/counseling-and-psychological-services-caps/get-involved-caps/professional-training-programs-4-0-5",
        "/postdoctoral-fellowship",
        "/psychiatry-training-caps",
        "/caps/how-help-student-distress",
        "/confidential-support-team-cst",
        "/confidential-support-team-cst/what-does-confidential-mean",
        "/cst/time-sensitive",
        "/what-cst-offers",
        "/confidential-support-team-cst/who-we-are",
        "/cst/how-to-connect",
        "/confidential-support-team-cst/what-happens-cst",
        "/confidential-support-team-cst/additional-programs-and-services",
        "/confidential-support-team-cst/cst-outreach",
        "/cst/resources",
        "/weiland-health-initiative",
        "/weiland-health-initiative/about-weiland-health-initiative",
        "/weiland-health-initiative/about-weiland-health-initiative/about-ric-weiland",
        "/weiland-health-initiative/weiland-clinical-services",
        "/weiland-health-initiative/training-advocacy-events-more",
        "/weiland-health-initiative/training-advocacy-events-more/training-education",
        "/weiland-health-initiative/training-advocacy-events-more/advocacy",
        "/weiland-health-initiative/training-advocacy-events-more/advocacy/gender-inclusive-stanford-gis",
        "/qt-umbrella-assistance-fund-qt-fund",
        "/weiland-health-initiative/training-advocacy-events-more/events",
        "/weiland-health-initiative/training-advocacy-events-more/more-about-weiland",
        "/weiland-health-initiative/resources",
        "/well-being-stanford",
        "/well-being-stanford/your-well-being-team",
        "/well-being-stanford/what-well-being",
        "/medical-services/general-resources/food-and-eating",
        "/well-being-stanford/nutrition-counseling",
        "/well-being/coaching",
        "/well-being-stanford/well-being-coaching/well-being-coaching-testimonials",
        "/well-being/coaching/additional-coaching-resources",
        "/well-being-stanford/well-being-tips",
        "/get-involved",
        "/well-being-stanford/community-trainings-consultation",
        "/well-being-stanford/well-being-faqs",
        "/super",
        "/super/about-super",
        "/super/about-super/university-policies-related-substance-use",
        "/super/about-super/super-reports-and-current-news",
        "/programs",
        "/programs/5-sure-safe-rides",
        "/super/programs/5-sure-foot",
        "/super/programs/peers",
        "/super/programs/cardinal-recovery",
        "/super/programs/cardinal-recovery/i-am-recovery-and-would-know-what-support-available-me",
        "/super/recovery/cardinal-recovery-community/i-am-recovery-and-seeking-academic-and-housing",
        "/super/recovery/cardinal-recovery-community/i-have-loved-one-recovery-and-im-seeking-support",
        "/super/recovery/cardinal-recovery-community/i-am-not-recovery-want-learn-about-being-ally",
        "/super/recovery/cardinal-recovery-community/podcasts-webinars-blogs-and-apps",
        "https://resed.stanford.edu/neighborhoods/theme-housing/university-theme-houses/academic-theme-houses/row-robert-moore-north",
        "/harm-reduction-tools-program",
        "/super/education",
        "/super/learn/alcohol-drug-info",
        "/super/learn/alcohol-drug-info/reduce-your-risk",
        "/super/learn/alcohol-drug-info/reduce-your-risk/what-are-short-term-and-long-term-risks",
        "/super/learn/alcohol-drug-info/reduce-your-risk/mapp-strategy-having-fun-and-playing-it-safe",
        "/super/learn/alcohol-drug-info/reduce-your-risk/count-your-drinks",
        "/super/learn/alcohol-drug-info/reduce-your-risk/tolerance",
        "/super/learn/alcohol-drug-info/reduce-your-risk/what-blood-alcohol-concentration-bac",
        "/super/learn/alcohol-drug-info/alcohol-poisoning-other-drug-emergencies",
        "/super/learn/alcohol-drug-info/alcohol-poisoning-other-drug-emergencies/alcohol-overdosepoisoning",
        "/super/learn/alcohol-drug-info/alcohol-poisoning-other-drug-emergencies/bacchus-maneuver",
        "/super/learn/alcohol-drug-info/how-help-friend",
        "/super/learn/alcohol-drug-info/how-help-friend/looking-out-your-friends",
        "/super/learn/alcohol-drug-info/how-help-friend/intervening",
        "/super/learn/alcohol-drug-info/other-types-drugs",
        "/super/learn/alcohol-drug-info/other-types-drugs/cannabis",
        "/super/learn/alcohol-drug-info/other-types-drugs/stimulants-caffeine-ritalin-adderall-cocaine-etc",
        "/super/learn/alcohol-drug-info/other-types-drugs/prescription-opioid-drugs",
        "/super/learn/alcohol-drug-info/other-types-drugs/hookah",
        "/super/learn/alcohol-drug-info/other-types-drugs/predatory-club-and-party-drugs",
        "/super/learn/alcohol-drug-info/other-types-drugs/steroids",
        "/super/learn/alcohol-drug-info/other-types-drugs/tobacconicotine-and-e-cigarettesvaping",
        "/super/education/super-trainings-workshops",
        "/super/education/super-trainings-workshops/alcoholedu-stanford",
        "/super/learn/alcoholedu-stanford/alcoholedu-letter-2022",
        "/super/education/super-trainings-workshops/training-offerings",
        "/super/education/super-trainings-workshops/request-materialsresources",
        "/super-cups",
        "/super/learn/super-resources/request-materialsresources/infographics",
        "/super/learn/super-resources/request-materialsresources/infographics/alcohol-poisoning",
        "https://docs.google.com/forms/d/e/1FAIpQLSdXdcNTHql6LGNs9WS7uYEeArf5j99FZFyWbcixwj8obQwfFQ/viewform?embedded=true",
        "/super/education/parties",
        "/super/education/parties/eanabs-mocktails",
        "/super/education/parties/sober-monitors",
        "/super/education/parties/sober-monitors/what-sober-monitor",
        "/super/be-safe/sober-monitors/sober-monitor-responsibilities",
        "/super/be-safe/sober-monitors/emergencies",
        "/super/be-safe/sober-monitors/sober-monitor-test",
        "/party-planning-guide",
        "https://studentaffairs.stanford.edu/student-alcohol-and-other-drugs-policy",
        "/student-party-policy-guidelines",
        "/super/education/parties/party-planning-guide/appendix",
        "/resources",
        "/resources/students",
        "/super/consult/students/dipmip",
        "/super/consult/students/drinking-and-driving",
        "/super/consult/students/other-common-citations",
        "/parents-guardians-and-families",
        "/super/resources/parents-guardians-and-families/letter-parentsguardians-regarding-alcohol-and-drugs",
        "/super/consult/parents-guardians-and-families/parentguardian-resources",
        "/super/consult/parents-guardians-and-families/parents-role-student-alcohol-use-myths-v-facts",
        "/super/consult/parents-guardians-and-families/tips-talking-your-student-about-alcohol",
        "/super/resources/stafffaculty",
        "/super/resources/student-organizations-student-staff",
        "https://docs.google.com/forms/d/e/1FAIpQLSdXdcNTHql6LGNs9WS7uYEeArf5j99FZFyWbcixwj8obQwfFQ/viewform?embedded=true",
        "/super-support",
        "/stanford-living-education",
        "/stanford-living-education/wellness-education",
        "/stanford-living-education/lead",
        "/stanford-living-education/lifeworks",
        "/stanford-living-education/about-stanford-living-education",
        "/pharmacy",
        "/pharmacy/filling-prescription",
        "/pharmacy/obtaining-refill",
        "/pharmacy/pharmacy-payment-options",
        "/pharmacy/emergency-contraception",
        "/insurance-referral-office",
        "/insurance-referral-office/health-insurance-overview",
        "/insurance-referral-office/health-insurance-overview/how-us-health-insurance-works",
        "/insurance-referral-office/health-insurance-overview/insurance-vs-campus-health-service-fee",
        "/insurance-referral-office/health-insurance-overview/insurance-requirements",
        "/insurance-referral-office/cardinal-care-overview-benefits",
        "/cardinal-care-stanford-student-dependent-health-insurance-2023-2024",
        "/insurance-referral-office/cardinal-care-overview-benefits/medical-mental-health-dental-benefits",
        "/insurance-referral-office/cardinal-care-overview-benefits/cost-coverage-dates",
        "/insurance-referral-office/cardinal-care-overview-benefits/enrollment-cardinal-care",
        "/insurance-referral-office/choosing-your-insurance",
        "/insurance-referral-office/choosing-your-insurance/important-deadlines",
        "/retaining-cardinal-care-all-students",
        "/insurance/choosing-your-insurance/waiving-cardinal-care-domestic-students",
        "/insurance/choosing-your-insurance/waiving-cardinal-care-international-students",
        "/insurance-referral-office/dental-vision-insurance-options",
        "/insurance-referral-office/frequently-asked-questions-about-insurance-and-health-fee",
        "/dependent-insurance-coverage",
        "/insurance-referral-office/dependent-insurance-coverage/dependent-enrollment",
        "/insurance-referral-office/dependent-insurance-coverage/eligibility",
        "/insurance-referral-office/dependent-insurance-coverage/frequently-asked-questions-dependent-health",
        "/insurance-referral-office/dependent-insurance-coverage/frequently-asked-questions-affordability",
        "https://news.stanford.edu/report/content-partner/student-affairs/",
        "#policies",
        "tel:6507257873",
        "https://exhibits.stanford.edu/activism/browse/5-sure",
        "https://share.stanford.edu",
        "http://wcc.stanford.edu",
        "http://www.stanford.edu/dept/Risk-Management",
        "https://transportation.stanford.edu/maps-resources-and-access/disgo",
        "http://www.stanford.edu/dept/resed",
        "http://police.stanford.edu",
        "https://forms.gle/abuuJ1yHzRkDsnAC8",
        "/saml_login",
        "https://campus-map.stanford.edu/index.cfm?ID=10-710",
        "https://stanforduniversity.qualtrics.com/jfe/form/SV_0pmSoqiFvRu75uB",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://bulletin.stanford.edu/pages/c7vDgeOuJIfpZe8GKmW3/",
        "https://www.stanford.edu/site/accessibility"
    ]
}