{
    "title": "Stanford’s new environmental justice minor - Stanford Report",
    "body": "\n\n\n\n \n \n\n\nSkip to main content\n\n\nStanford University\n\n\n\n\n\n\n\nStanford Report logo\n\n\n\n\n\n\n\nSaturday, April 29, 2023\n\n\n\n\n\n\n\n\nSearch this site\n\n\n                                Submit Search                            \n\n\n\nMenu\nStudents\nFaculty\nStaff\nAbout\n \n\n\n\n\nSearch this site\n\n\n                                    Submit Search                                \n\n\n\n\n\n\n\n\n\n\n\n\n\nMarch 21, 2022 Computer science major is first to sign up for Stanford’s new minor in environmental justice Evan Baldonado, ’23, a third-year student in the School of Engineering and co-director of Students for a Sustainable Stanford, is the first student to adopt a minor in environmental justice. The minor is offered by the Earth Systems Program, which will become part of the new school focused on climate and sustainability. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Megan Kalomiris\n\nEvan Baldonado, ’23, learned about environmental justice through his involvement in Students for Sustainable Stanford. Coming from a more traditional environmentalism background, environmental justice offered a new perspective to Baldonado – one that helped him reevaluate his understanding of environmentalism and the philosophies underlying it. As he describes it, the core difference between the two approaches is whom they are meant to benefit.\n\nEvan Baldonado (Image credit: Omar Baldonado)\n\n“It’s really easy to think of environmentalism as a thing for white, privileged people,” Baldonado explained. “But environmental justice really takes that narrative and flips it on its head. It’s about building a movement that’s inclusive of everyone, particularly people who are left out of mainstream environmentalism.”\nEager to engage further with this concept, Baldonado has recently signed up as the first student to minor in environmental justice at Stanford. In response to student demand, Stanford Environmental Justice Working Group members created the new environmental justice minor being offered through the Earth Systems Program in the School of Earth, Energy and Environmental Sciences, which will be part of the new school focused on climate and sustainability. The minor will continue to be part of the new school when it launches in fall 2022.\n“We are so thrilled to have Evan as part of the environmental justice community at Stanford,” said Sibyl Diver, an interdisciplinary environmental scientist and lecturer in the Earth Systems Program, who is co-leader for the Environmental Justice Working Group with Emily Polk, an advanced lecturer in the Program for Writing and Rhetoric. “Evan brings a commitment to building meaningful opportunities for environmental justice education, communication and deep discussion about environmental justice issues to our campus. He is aware of the tensions between mainstream environmental movements and environmental justice, and what it means to work towards centering frontline Black, Indigenous, Latinx, Asian and Asia Pacific Islander communities in sustainability work.”\nBaldonado is also a member of the transition council for the new school. Student involvement on the council, which brings environmental justice priorities into our sustainability work, is key, said Diver. This is because the younger generation plays a significant role in leading environmental justice efforts that include facilitating “research-to-action efforts that help us to achieve racial equity and environmental protection” at Stanford and the world at large, Diver explained.\n“Being in the broader community around the environmental justice minor helps connect me with people who are in the space, which helps with coalition building and organizing,” said Baldonado. “That way, if I’m hoping to organize efforts, such as raising funds for a cause or starting a petition, there will be people with similar values with whom I can work.”\nFrom environmentalism to environmental justice\nIn 2012, Baldonado landed a ping-pong ball in a cup at the Duveneck Harvest Carnival and won a pet goldfish. Figuring out how to take proper care of the fish was more work than he expected; so much so that, for the carnival in 2013, Baldonado created and distributed a goldfish care sheet. He also created AquariumKids.org, a website where young “aquatic enthusiasts” can learn about aquarium care, aquatic ecosystems and the environment.\nBaldonado draws a direct path from his early lessons in fishkeeping – which he likens to “maintaining a mini-ecosystem” – to his subsequent passion for environmentalism.\n\n\nRelated story\nQ&A: Education programs within the new school\n\nIn high school, Baldonado built on this passion by joining the environmental club and in his first year at Stanford, he joined Students for a Sustainable Stanford, where he now serves as co-director. It was through the club that Baldonado became interested in environmental justice and how it aims to adjust the narrative of environmentalism to focus on social groups that have previously been excluded from that conversation. In his work, Baldonado seeks to build connections between other organizers, helping create a more unified and inclusive movement.\n“Mainstream environmentalism has not always been the most welcoming place for non-dominant social groups, such as people of color, women, queer people, low-income people and people with disabilities,” Baldonado said. “Environmental justice involves actively reclaiming environmentalism, and concepts such as equity and inclusivity are key values of the environmental justice minor.”\nBridging divides\n\nSome members of Students for a Sustainable Stanford at the O’Donohue Educational Farm. In the photo are (from left to right) Anya Goeders, Tanvi Dutta Gupta, Sydney Schmitter, Neha Patkar and Evan Baldonado. (Image credit: Students for a Sustainable Stanford)\n\nThe requirements of the environmental justice minor are flexible. As far as courses required for the minor, there is an introduction to environmental justice, service-learning courses and at least one course in environmental justice history, ethics and practice. Other than that, the student is free to craft their own experience. Additionally, if there’s a course that a student feels is relevant to environmental justice but is not listed in the minor, Baldonado said that they are free to contact the course advisor and minor organizers about it.\nThough he is unsure of his eventual career path, Baldonado hopes that the minor will teach him about more issues in environmental justice and connect him with others who would be interested in solving them.\nIn addition to the minor in environmental justice, Baldonado is majoring in computer science in the School of Engineering. He views knowledge of computers as a skill that he can easily apply to any line of work and has already had some experience combining computer science and environmentalism – from developing AquariumKids.org to helping a group doing environmental research when their website got hacked.\nHe also believes that computer science and technology can be used to bridge divides and combat inequality, but also notes the need for careful consideration, as they also have the potential to perpetuate and worsen existing inequalities.\n“What I’m doing with the environmental justice minor is more learning about the issues,” he said. “I think it’s important to both understand issues and have an applicable skill set to help solve them.”\n\n\n\n\n\n\n\n\n\n\n\n\nStanford News\nSustainability\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nAcademic Council\nReport of the president: Academic Council Professoriate appointments\nThe following Academic Council Professoriate appointments, promotions, and reappointments for the periods indicated were reviewed by the Advisory Board of the Academic Council on Jan. 17, Jan. 31, Feb. 7, Feb. 21, Feb. 28, and March 7, 2023, and were approved by the president. Please note that while all appointments below have been approved by the president, some candidates may not have accepted offers.\n \n\n\n\n\n\n \nUniversity Affairs\nFaculty Senate approves changes to Honor Code, Judicial Charter\nFollowing lengthy debate, the Faculty Senate approved changes to the Honor Code and Judicial Charter on Thursday. The changes to the Honor Code will allow for proctoring in the fall barring further action by the Undergraduate Senate.\n \n\n\n\n\n\n \nDeliberative Polling\nAn unprecedented experiment in probing public opinion\nParticipants in the “California Considers” Deliberative Poll weighed policies that would address the state’s many intractable challenges, and then made their judgments.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford\n\n\n\nReport\n\n\n\n\n\n\nNews and information for the university community.\n\n\nGet in touch \n\n \n\n\n\nSign up to receive the Stanford Report daily email\nFaculty, staff, and students automatically receive Stanford Report emails. Others are invited to subscribe. \n\n\n\n\n\n\n\n\n                        Stanford\n                        \n                        University\n                    \n\n\n\n\n\nStanford Home\n\n\nMaps & Directions\n\n\nSearch Stanford\n\n\nEmergency Info\n\n\n\n\nTerms of Use \n\nPrivacy \n\nCopyright \n\nTrademarks \n\nNon-Discrimination \n\nAccessibility \n\n\n\n© Stanford University.\n  Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://stanford.edu",
        "https://news.stanford.edu/report",
        "https://news.stanford.edu/report/students/",
        "https://news.stanford.edu/report/faculty/",
        "https://news.stanford.edu/report/staff/",
        "https://news.stanford.edu/report/about-stanford-report/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D6600",
        "https://studentsforasustainablestanford.weebly.com/",
        "https://news.stanford.edu/report/wp-content/uploads/sites/3/2022/03/Baldonado.jpg",
        "https://www.ejstanford.com/",
        "https://earth.stanford.edu/news/earth-systems-program-announces-new-minor-environmental-justice#gs.te2y4f",
        "https://earth.stanford.edu/esys#gs.sro89l",
        "https://earth.stanford.edu/",
        "https://sustainabilityinitiative.stanford.edu/",
        "https://news.stanford.edu/report/2021/11/03/equity-seed-grant-bolsters-environmental-justice-efforts/",
        "http://aquariumkids.org/",
        "https://sustainabilityinitiative.stanford.edu/news/qa-education-programs-within-new-school",
        "https://engineering.stanford.edu/",
        "https://news.stanford.edu/report/content-partner/stanford-news-service/",
        "https://news.stanford.edu/report/topic/sustainability/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2Freport%2F%3Fp%3D6600",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/content-partner/academic-council/",
        "https://news.stanford.edu/report/2023/04/28/report-president-academic-council-professoriate-appointments-13/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://news.stanford.edu/report/content-partner/university-communications/university-affairs/",
        "https://news.stanford.edu/report/2023/04/27/faculty-senate-approves-changes-honor-code-judicial-charter/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report/content-partner/university-communications/deliberative-polling/",
        "https://fsi.stanford.edu/news/california-100-announces-results-new-california-considers-deliberative-pollr-examining-long",
        "https://news.stanford.edu/report",
        "http://stanford.io/contact_stanford_report",
        "https://facebook.com/stanford",
        "https://twitter.com/stanford",
        "https://instagram.com/stanford",
        "https://www.linkedin.com/school/stanford-university/",
        "https://youtube.com/stanford",
        "/report/subscribe",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}