{
    "title": "Chico State College of Business Earns AACSB Reaccreditation - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nChico State College of Business Earns AACSB Reaccreditation\n\nChico State\nFebruary 9, 2023\n\n\n\n\nJason Halley / University Photographer \n\n\n\t\t\tThe hallway of Glenn Hall awaits students to return to campus for the first day of the spring semester on Monday, January 24, 2022 in Chico, Calif.\n(Jason Halley/University Photographer/Chico State)\t\t\n\n\n\n\nChico State’s College of Business has been reaccredited by the Association to Advance Collegiate Schools of Business (AACSB) International, the highest standard of achievement for business schools. Less than 6 percent of the world’s schools offering business degree programs hold AACSB business accreditation, ensuring the College of Business remains a competitive leader in the business world.\nEstablished in 1916, AACSB International is a global association of leaders in education and business dedicated to supporting and advancing quality business education worldwide. The University’s College of Business has been fully accredited by AACSB since 1972.\n“Renewal of our accreditation is the result of years of strategic planning and implementation, as well as incredible levels of engagement and effort from faculty and staff who come to the table every single day to provide our students with an outstanding educational experience,” said Suzanne Zivnuska, associate dean for the College of Business. \nAn AACSB Peer Review Team conducted an extensive site visit September 26–27, 2022 that included meetings with campus administrators, faculty, staff, current students, and alumni to ensure the College of Business meets the rigorous standards of accreditation. The team consisted of three business deans, one from each of the following institutions: the University of North Georgia, the University of Illinois-Springfield, and Baylor University. The Peer Review Team’s recommendation for extension of accreditation was concurred with by the AACSB Continuous Improvement Review Committee and ratified by the Board of Directors on January 25, 2023.\n“Reaccreditation happens every five years and there are nine standards we have to meet,” said Terence Lau, dean of the College of Business. “These standards include faculty qualifications and expectations around research and currency in business, budget and facilities, student assessment and outcomes, and how we contribute positively to society. The peer review team was impressed with how, in spite of many obstacles, our business school community moved forward with our strategic plan in the spirit of continuous improvement to deliver our mission to our stakeholders, particularly our learners.”\nThe College of Business is one of seven colleges at Chico State, with 1,774 students majoring in and 333 students minoring in business-related programs. The college offers ten different options in accounting, business analytics, entrepreneurship and small business management, finance, human resource management, management, marketing, project management, management information systems, and operations and supply chain management. In addition to two undergraduate degrees, the college offers a campus-based and online MBA program, and continues to innovate by offering highly sought-after degrees like the new option in Health Services Administration. The College of Business also offers an Online Bachelor of Science in Business Administration (OBSBA) degree completion program.\nThe College of Business strives to be a leader in business education and scholarship that solves the unprecedented challenges of the 21st century. Through innovative curricula that emphasize critical thinking and experiential learning, we prepare graduates to achieve early career success and contribute to the ethical stewardship of environmental, social, and economic resources. The College of Business is an engaged and collegial learning community that values practice-relevant, high faculty interaction teaching, and applied scholarship. Our college is student-centered, interdisciplinary, committed to continuous improvement, and tightly integrated with our business and community partners.\n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tChico State\t\t\n\n\n\t\tFounded in 1887, California State University, Chico is the second-oldest CSU campus and one of the highest-ranked master’s-level public universities in the West.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/publicaffairscsuchico-edu/",
        "https://www.csuchico.edu/cob",
        "https://today.csuchico.edu/chico-state-college-of-business-earns-aacsb-reaccreditation/?share=facebook",
        "https://today.csuchico.edu/chico-state-college-of-business-earns-aacsb-reaccreditation/?share=twitter",
        "https://today.csuchico.edu/chico-state-college-of-business-earns-aacsb-reaccreditation/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Chico%20State%20College%20of%20Business%20Earns%20AACSB%20Reaccreditation&body=https%3A%2F%2Ftoday.csuchico.edu%2Fchico-state-college-of-business-earns-aacsb-reaccreditation%2F&share=email",
        "https://today.csuchico.edu/chico-state-college-of-business-earns-aacsb-reaccreditation/#print",
        "#",
        "https://today.csuchico.edu/author/publicaffairscsuchico-edu/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}