{
    "title": "Jesse Friedman on raising the WP hosting standard across the industry with WP.cloud-Post Status Draft • Post Status",
    "body": "\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nAboutExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\nAccount\n Login\n\n\n\n\nSearch\n\n\n\n\n\nJoin\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nHome / Post Status Podcasts / Draft / Jesse Friedman on raising the WP hosting standard across the industry with WP.cloud-Post Status Draft\nByCory Miller \nPosted onApril 20, 2023April 21, 2023 \n\nUpdated onApril 21, 2023 \n1 Comment\n\n\nBusiness Draft Planet Post Status Podcasts WP Products \n\n\n\nIn this episode, Jesse Friedman, Head of WP Cloud, joins Cory Miller to provide valuable insights and strategies for improving infrastructure and service to deliver superior hosting. They also highlight how managed hosting can help businesses focus on their core operations while leaving the technical aspects to the experts. \n\nEstimated Reading Time:  24 minutes\n\n\nTranscript ↓\nCory Miller is joined by Jess Friedman from WP Cloud discuss how hosting companies can improve their infrastructure and services to provide better performance and reliability to their customers. They also dive into the importance of customer support, the benefits of using managed hosting services, the ethics of data collection, and more. The experience and expertise offered are sure to inspire you to increase your standards of service\nTop Takeaways:\n\nOutsourcing Infrastructure. WordPress hosting companies can benefit from outsourcing their infrastructure to specialized providers such as WP Cloud. This can free up their customer support team from dealing with infrastructure-related issues and enable them to focus on providing better customer service and value-added services.\nIncrease Customer Satisfaction. By democratizing publishing and providing a superior WordPress experience, hosting companies can reduce churn and retain customers who may otherwise switch to other platforms if their WordPress experience is subpar.\nSet Up for Speed. While many factors can impact website speed, some of the most important ones include optimizing images, using a content delivery network (CDN), and minimizing the use of plugins. By focusing on these areas, WordPress agencies can help their clients improve their website speed and ultimately provide a better user experience for their visitors.\n\n\n\n\n\n\n🙏 Sponsor: A2 Hosting\nA2Hosting offers solutions for WordPress and WooCommerce that are both blazing fast and ultra-reliable. WordPress can be easily deployed on ANY web hosting plan from A2: Shared, VPS, or Dedicated. A2 also offers Managed WordPress and WooCommerce Hosting. Take a look at a2hosting.com today!\n\n\nA2 Hosting\n\n\n🔗 Mentioned in the show:\n\nWP Cloud\nWP Hosting Benchmarks $25-50\nWP Hosting Benchmarks $201-500\nKinsta\nWP Engine\nSiteGround\nBluehost\nDigitalOcean\nPressable\ncPanel\nPlesk\nCloudflare\n\n🐦 You can follow Post Status and our guests on Twitter:\n\nJess Friedman (Head of WP Cloud)\nCory Miller (CEO, Post Status)\nOlivia Bisset (Intern, Post Status)\n\nThe Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧\nTranscript\nCory Miller: [00:00:00] Everybody welcomed back to post status draft. I’ve got a longtime friendof mine in the WordPress space. I think we met like 10 years ago, Jesse. Um, but we’re gonnabe talking about WP Cloud today, and this is part of our product people series. Um, I heardabout WP Cloud, I know Jesse and I was like, Hey, I wanna know more about WP Cloud.It’s really compelling from what I’ve heard. Um, but first and foremost, welcome to the podcast.Jesse. Could you tell us a little bit about your.Jesse Friedman: Yeah. Thanks Corey. And yeah, it probably has been a decade. It’s, it’s, uh,it’s awesome to, to be able to, uh, know people like you and be able to work with people like youfor so long.Um, and that’s one of the great things about the WordPress community, right? Oh, yeah. Uh,yeah. So, uh, I, I, uh, got started in WordPress, geez, back in 2005, I think. Uh, I was, uh,working as a professor at a university and, uh, trying to teach, [00:01:00] uh, students, uh, wellactually I was a student at the time and then later I became a professor and started teachingWordPress.Uh, but my professor, Hillary Mason, who’s actually, used to work at Bitly and is pretty worldrenowned, uh, data scientist. She, she turned me onto WordPress and, uh, I never looked back.Uh, prior to that I was building like static websites. Um, and, uh, and WordPress, uh, is not just apiece of software, right?It’s a community of people that, uh, help to kind of raise the level of everyone who works on it.Um, and that, that’s where I got my career jump off. It was, uh, it was definitely with WordPressfor sure. That’s awesome.Cory Miller: Well, we met when you’re part of Brute Protect and uh, I was asking in the pre-rollabout your art in the background.I’m a big fan of art. Yeah. I wanna get some from the walls, but tell me, tell me more about theart in the background cuz I was like, Hey, we met when you were part of Brute Protect before itwas acquired by automatic. And you kind of pointed to the [00:02:00] lightning in the back. So,yeah, tell me more.Jesse Friedman: Yeah. So actually before we jump in here, this is an not an, uh, chronologicalorder, but I was actually working for a company called Astonish, uh, where I actually got to builda, a, a large web team.I actually still work with one colleague from that company, Jeff Kalinsky. He works at Automaticnow. Uh, when we were tasked with building, um, or converting a. source.net based cms, uh,from an old product called Blue Squid, uh, to a new WordPress powered multi-site. And it wasgonna house like 4,000 sites.Um, and so we, I found this at like a art show. Uh, bought it, hung it on the wall, and uh, and wespent a year building this new platform. The funny thing about it, this is a really unique story.Didn’t give us access to the source files. Uh, and they kind of held everything hostage. This thirdparty company that we were host, host, hosting everything with.Um, so we actually had to build a, like a [00:03:00] w get scraper. To scrape our own websitesand convert them into WordPress themes. So we didn’t even like turn them into Ion out, weturned them into full blown WordPress themes on a multisite. And, uh, we were able to move allthose sites over very quickly. Um, and so I asked that same artist, I said, Hey, can you paint a, aharpoon now that Blue Squid is dead?It’s this old product. And so we hung that up on the wall and that, and that was that. I left thatcompany and co-founded Brew Protect. Uh, brew Protect was a cloud powered. Um, Uh, botnetprevention service. So like anyone who’s trying to brute force into your website, we used, uh,data that we would gather from attack vectors from different various, uh, areas.And it was really the first time that I was able to say like, we’re building something that leveragesinformation that we gained from multiple hosting partnerships to better the entire WordPresscommunity. Because everything that was happening before then was hosts would gather attackvectors against their own infrastructure, and that was the only thing they could [00:04:00] learnfrom.But what we did was we grabbed that information from across different hosting companies, uh,across customers who were around the globe, and we were able to really do a better job of\nthwarting those attacks. Um, and so that represents cloud data raining down on a, a botnet, uh,going outta business there.And then, uh, yeah, and so then we got, uh, acquired by Automatic back in 2014, and I joinedthe Jet Pack team. Uh, I’ve been working on hosting partnerships and. Product development forJet Pack for almost nine years now. And, uh, then we started, uh, you know, launched WP Cloudlast year.Cory Miller: So it has been 10 years.Because I met you all right before the automatic acquisition. Acquisition. Yeah. Yeah. Um, man,well, some nostalgia there. Um, so what’s, what’s, uh, really compelling, what you just said too,is Jet. So when I knew you all got required and got got to meet you and Sam [00:05:00]Hotchkis, and then at some point I realized, Sam, and you were on the jet pack team and at Ithewe.Felt like we were competitors to Jet Pack in many ways, um, from backups and security. And Iwas like, oh no, these, these guys are gonna take jet pack to the next level. And I’ve definitelyseen, I think, what is probably the product of your work over the years where it’s like, oh no.Okay, Sam, Jesse getting in there, um, with Jet Pack.So, uh, that’s a, I wanted to mention that cuz I’ve thought that many times. I think I’ve expressedthat to Sam. Um, but. Anyway, thanks for that background. That’s, that’s really compelling. Backto the old static h CML days. Woo. Thanks WordPress. Yeah. So Jesse, let’s talk about WPCloud. I know, um, we’ve talked a couple times about this and I, what, I know I can throw this atyou and you’ll, you just, you just hit it out of the part and, uh, but tell me really succinctly, whatdo you [00:06:00] think? What is WP Cloud?.Jesse Friedman: WP Cloud is a WordPress focus cloud platform that we built within automaticto power the highest and most trafficked websites in the world. Um, and to provide a very uniquesolution, uh, that gets very close to, if not a hundred percent up time. Um, and so we’re doingsomething that’s a little bit different than what you see with other cloud platforms.We provide vertical scaling and automated real-time fail. So what we want to do is provide asolution that, again, is 100% WordPress focused, but allows you to stop thinking about hostingaltogether. You don’t have to worry about it anymore. We’re gonna take care of all theinfrastructure, keep it up and running, keep it high performance, and, uh, let hosting companiesor others focus on what they do best, um, to provide a, a fantastic experience to customer.Cory Miller: Well, anytime you say something around wordpress.com infrastructure, I alwaysgo, holy [00:07:00] cow. Yeah. When you can say, pretty near, I know you’re being humbled too,but like that, that system is renowned because it’s incredible. I mean, people that work on, uh,the platform and what it does, but. Now, who’s it? Who’s it really for?When you think about WP Cloud, you kind of maybe mentioned this, but I wanna drill down onthat. Who do you think it’s really for?Jesse Friedman: Yeah. All right. So if we look at the actual, uh, hosting, uh, platform itself, it’sfor anyone who wants to have high availability, high performant websites. Uh, but if we look atthe brand WP Cloud, what we’ve done is we’ve decided to take, um, the entire platform and, andgive.A brand that we can then go to hosting companies with and, and provide services to hostingcompanies. So WP Cloud is not interested in individual customers, uh, small agencies, thingslike that. What we’re actually interested in doing is providing services to hosting companies[00:08:00] to help them provide. Better hosting.Um, you can think about WP Cloud as a utility service, like the electrical grid underground, uh,providing services to customers all, all around the globe. But, um, allowing those hostingcompanies to, uh, maintain their experience, the things that differentiate themselves, all of. But ifyou’re, if you’re listening to this and you’re thinking, oh, I have one website or 10 websites and Iwant to host them and I don’t want to have to worry about, um, downtime or, or speed issues oranything like that, I would suggest going straight to one of WP Cloud’s partners, pressable, forexample.Mm-hmm.Cory Miller: So when we were prepping for this, I said, Hey, so this, this pa uh, this isleveraging the.com platform, and you corrected me. Share a little bit more about that.Jesse Friedman: Yeah, sure. So, uh, so what we did was we took the minds and, and thepeople behind wordpress.com powering hundreds of millions of sites there.\nWe took the [00:09:00] same, um, experienced individuals who were helping to power some ofthe, um, most powerful websites on v i p. Uh, we took the experience that we had from RunningPressable, which is, um, like a, uh, a managed WordPress host that we, uh, use to, um, really.Test and grow our own product base. And so we took all those things and we said, what, howcan we build a cloud platform that’s gonna service all of the needs that we have internally, um,and, and provide the absolute best experience?And so when we did that, we ended up launching, uh, what we called internally, uh, productcalled Atomic, uh, and that is now powering uh, wordpress.com business and e-commerceplans. Pressable News Pack. And so that was, uh, similar to like how a w s got born. You know,a, uh, Amazon was an e-commerce platform that was dealing with scale issues.They couldn’t compensate for [00:10:00] the amount of the influx of traffic, so they had to reallysit down and think about how they can rebuild their entire platform. Um, and so then that’s howaw w s was born. It’s not too dissimilar from what we’re doing. We have built a platform that isnow powering, um, 13 billion page views.Um, and, uh, with sites that are experiencing incredibly fast speed under load. Um, and, andnow we’re saying to ourselves like, well, we know we built something amazing here. We knowthat it’s something that we can really give back to the community as a way to raise the bar forcloud hosting across, across the board.Um, and so now that, that is the, that is the effort there is we’ve powered. Internally what weneed to, to make sure that everything runs smoothly. So again, if anybody wants to try out WPCloud, sign up for a wordpress.com business site, sign up for pressable. Um, you’ll feel thespeed, [00:11:00] uh, the proof is in, in the, uh, experience right there.Um, but then WP Cloud is really now focused on how it can provide services to hosting.Cory Miller: Yeah. I love that I’ve observed from the industry being in as long as both of us havethat, you know, there was this day where you started seeing some of the really big hostingcompanies start go moving. There WordPress stuff over to the cloud.Yeah, there’s a lot of bumpy roads along that way, but um, your comparison with aws forinstance, cuz I’ve heard Google Cloud, aws, some of those offerings kind of moving over andthat’s the way it feels like it’s shifting. I’m not a technical person, but I’ve been in the space along time and I go, it makes sense to have cloud-based hosting, especially for WordPress.And then you get specific WordPress expertise. That knows that application better than anybodyI’d, I’d, I’d challenge anybody to say, do you know more about WordPress and automatic teams?Yeah. Um,Jesse Friedman: we definitely leveraged our, our own internal expertise to solve for that. And,and you’re right. I [00:12:00] mean, you look at hosting companies and they’re trying to figureout ways to differentiate themselves outside of the infrastructure.A lot of them are moving to Google Cloud or aw. Um, the shared hosting is still, you know,mostly the same kind of solution, um, that everyone is kind of racing to the bottom on pricing on.Mm-hmm. Um, and so, so how are hosts differentiating themselves? Well, it’s, it’s, you know, it’smade on top of promises of speed and performance and, and security.But the reality of the situation is the, the infrastructure underneath is actually not. That different.So hosting companies are really focused on trying to differentiate themselves now in the way inwhich they market themselves. The onboarding experience that provide the partnerships thatthey can leverage to provide a better experience to customers.The speed at which you can launch your site, the customer service, those are all things thatHUS hosting companies really f are, are focused on, and. Frankly, the places where they can,they can really win. One of the conversations I had at cloudfest, uh, which was a conferencethat we went to, um, [00:13:00] two weeks ago, was about the power of diversity within hosting.Um, and so I think that it’s really important to recognize that, especially when we’re talking aboutWP Cloud, helping to power those hosting companies in terms of like a utility. Um, you look atsomething like shop. And or, or w and they have these global solutions for every single, um,customer across the world.Um, but you know, we, we know why that’s not, uh, advantageous and why WordPress is better.But one of the major advantages that WordPress has is that, um, the hosting companies candefine the niche that they wanna solve. They can solve problems specific for geographicallylocations. WordPress has seeded itself into hosting companies around the globe.\nSo the solutions you get from a hosting company in let’s say the Netherlands, is completelydifferent than what you might get in Malaysia or Africa. Um, and so that’s an advantage that thathosting companies have in that diversity. And so, uh, you know, if we can come [00:14:00] inand try to help and provide better services at that infrastructural, Then that frees those hostingcompanies up to think about ways in which they can differentiate themselves and provide theabsolute best experience to those, to those customers.Cory Miller: Take care of wordPress, you got the power of WP Cloud, the.com top experienceand do other stuff on top that adds value for your customers. Yeah, exactly. So. I know havingbeen acquired, our company was acquired by hosting company, uh, been on the inside of thatand realizing how much, you know, they, they really worry all, all hosting companies about price.Um, yeah. Anytime you, you know, c panel was this big conversation in the industry for a longtime because they started cranking at prices and everybody started fleeing because they’re like,they felt held hostage. But I know every penny accounts in hosting. So Can you talk a little bitabout the pricing structure for WP.And I know that this is still early.Jesse Friedman: It is still early, and I [00:15:00] appreciate that and, uh, I probably shy awayfrom getting into the super specifics of pricing right now, but what I can tell you is this, is that theway in which WP Cloud Scales is based on the number of pH p workers, uh, CPUs. Uh, andstorage that you want.And so what we want to create are ways in which hosting companies can come in, um, andcreate bespoke offerings to either power their managed WordPress offering now, or to start byoffering the higher tier hosting that they haven’t been able to offer before. If you look at most ofthe hosting companies in the world, a lot of them cap out at a hundred bucks, 150 bucks amonth.Um, and so then you leave, uh, the super high end. Hosting customers to, to either fend forthemselves with their own cloud platform to go to, uh, you know, higher, higher end managedhosting. Um, or something like W P V I P. What we wanna do is be able to provide services thatgo from that range, from, uh, 25 bucks a month to [00:16:00] $2,000 a month, um, and to beable to provide consistent uptime throughout all of that.So hosting companies will be able to come in and use WP. Um, and, and if they want to go witha lower tier, like two PHP workers, two CPUs, this is getting super technical. That’s still built forlike 400,000 sustained visitors a month, uh, which is gonna compensate for, you know, most.Customers that’s only gonna cost that hosting company a few bucks a month with WP Cloud.Um, and then, and then it scales up from there. And since we’re talking about scaling, I’ll, I’ll, I’lljust say one thing is, is that we offer something that’s pretty unique in that we don’t, uh, we don’treserve, uh, we, we don’t have any limitations on visits. So if you take a look at other hostingcompanies, you’ll see that they create, uh, they’ll create really robust, powerful servers.And then they’ll put traffic limits on it. Mm-hmm. I’m thinking of a hosting company right now[00:17:00] that has, um, a robust amount of power, uh, allows for up to 40 WordPress websitesand only, uh, and stops at like 400,000 visits a month. Mm-hmm. Well, if you only have 10,000visits a month, you don’t need all that power anyway.Uh, even if you’re not sharing it across all of those things, that’s just a waste of power. That’s aLamborghini on the, on the back of a flatbed pickup truck. You know what I mean? Like you’renot taking full advantage of that. WP Cloud is gonna come in and, and basically say, uh, we’regoing to create bespokes solutions that are designed to house the amount of traffic that you’re,or serve the amount of traffic that you’re bringing.Uh, but we’re not gonna limit you on, on the amount of traffic that you have there. Um, so thereare no real, uh, traffic limitations with WP Cloud, unlike other hosting companies.Cory Miller: Yeah, it, I don’t know all the specs, but I know enough to go when they put a trafficthing, there’s something underneath that they’re trying to be careful of when they put limits andthings.But, um, [00:18:00] so that, that’s a conversation for another well, unless you.Jesse Friedman: Well, I was just gonna say that it’s a way for them to mitigate their, their, theirrisk and their costs. Yeah. Um, but we, we have built a platform that we know can scale to anyamount of traffic. So, uh, we’re, we’re gonna differentiate ourselves there.\nCory Miller: Yeah. Um, so I think you said fully managed performance security and WordPress.What does that mean?Jesse Friedman: It means that we’re literally gonna take care of it all for you. So in terms ofsecurity, uh, it has built-in backup solutions. So it’s actually pretty unique in the way in which wedo backups. I’m sure we’re gonna touch on automated failovers soon.But the way we do our backups is that we do, um, daily file backups and hourly databasebackups, but we don’t just store that on the same box. What we do is we put it onto another datacenter. On another box that actually has power ready so that we can switch to that if we need to.We can talk about that in a second.Um, but we [00:19:00] do, it comes with s ssl, it comes with, uh, TLS encryption. It comes with,uh, WAF DDoS protection. I’m telling you. Like we harden the heck out of it. Yeah. Um, and thenin, in addition to that, we automatically build in a c. No extra cost. It has a CDN built into it. Um,and it, uh, also resizes your images.So you’re only serving the size of the image that you need high resolution, but you’re not servingthese 10 megabyte images that people upload straight from their phone to their WordPressinstance, right? We’re resizing it and only showing the size that you need for the device that’srequesting it. Uh, we also do, uh, automated caching built in too.Um, and. It’s all run by our team internally, so there is really no tweaking or configuring oranything that you have to do. Um, it’s 100% fully managed outta the box. That also includes themanagement of things like P H p, uh, database. Um, it manages, uh, WordPress core [00:20:00]files, certain plug-ins. It allows for templating and staging.Um, and again, we handle all of that. It’s not, these aren’t things that you’re gonna have to.Cherry pick based on price or anything. It’s all 100% inclusive in the product.Cory Miller: So I, you mentioned principle way earlier. I’m a paying, and I wanna say that reallyloud and clear. I’m a paying customer principle.Yeah. So I’ve seen this, the performance, all these things. And, uh, so that, that’s, that’s prettyawesome. But I, I wanted to push in on that because I’m a, this is my comment, not. But whenyou say managed, you always, I always go, tell me what that really means. Yeah. Yeah. It’s like,you know, the Tommy Boys, like you can slap a label on the side, but it’s, you know, whatactually happens inside.And I think that’s one thing that differentiate, differentiates, uh, any automatic brand is it’s not alabel on the outside. Um, yeah. Okay. So tell me what automated realtime fellows.Jesse Friedman: So we touched on this briefly, right? [00:21:00] So if we, if we back up yourentire site to another location and we put that back up on a box that has power, um, and you’reserving traffic to one location, we can automatically detect some kind of, any kind of issue.So even if there was catastrophic failure, uh, you know, a pipe got cut. Uh, the data centeractually you. We have tons of redundancies in terms of power and things like that, but like, let’sjust say like a volcano erupted or something like that, you know, something really catastrophic.We can in real time redirect that traffic to another data center that already has your site live on itand already has, uh, the, the power behind it.So we can in real time, switch that traffic and people will not experience any downtime. And thatis something that is nearly impossible with other cloud platforms. It is possible, but it’s incrediblyexpensive. And because of the scale that we operate at, uh, and the WordPress efficiency thatwe [00:22:00] have, um, we’ve been able to, to build that into the platform.Cory Miller: See, when you talked about backups earlier, it’s something to know about havinghelped lead our product, uh, for backups. And when you said that one thing, it’s not on thatserver. It’s somewhere else within a vast infrastructure. That’s really compelling to me becausewe would tell customers all the time, don’t just don’t back up on that server because what’s,what’s it gonna do for you when it crashes?Um, so like, I love the secure, the backup feature of that. It’s not just a. A backup if somethinghappens. And this was way before all this technology existed today, but that’s how we got thebackup is like into our product. Is it crashed? We didn’t have, we had backups maybe on thatserver. And literally the hard drive was like capoot.And so that was our mantra. Always remote, offsite, you know, so that you can restore and. IncaseJesse Friedman: we’ve, we’ve seen this, I, I’ll [00:23:00] leave hosting companies names out ofthis, this conversation, but we’ve all seen hosting companies that have had. Catastrophic failure.\nUm, data center fires, for example, things like that.Uh, and if you’re not backing up, this is getting into like a conversation about Jet Pack two, butlike, if you’re not backing up your, your website offsite, you’re susceptible to that. Mm-hmm. Um,and that, that can be, um, unbelievably painful. I can’t tell you how many conversations I hadwith people who say, well, I’ll worry about security later, or I’ll, I’ll, you know, I don’t really careabout backups right now.I just wanna get my site. But all the time you’re investing in that, right? You’re building yourwebsite. Think about the dozens of hours of time that you’re spending tweaking all those things.And if you lose that, it’s, it’s not just catastrophic failure for the host, it’s catastrophic failure forthe site owner too.It’s, it’s incredibly painful and to, you know, some, some people out there have stronger will thanI to start all over from the beginning, but I don’t, but that’s, [00:24:00] sometimes I felt that painyou left with doing.Cory Miller: Yeah, I, I felt that. Yeah. Um, we were, we were scraping. We had some clients atthe time and scraping data from Google Cash to redo websites, and so I felt that pain.Yeah. So we’ve talked about, um, the power, performance, security, all these things that arebaked into WP Cloud, that powers.com business, eCommerce plans. But how about the,Preserving and growing the hosting experience. What are your thoughts on that? So key, keyclient for this is our hosting companies, um, to be able to really leverage all of this for, I mean,when you said utility tool, it really rang a bell for me.It’s like, okay, all of this at a re, very. Reasonable price, and I know they need to talk to youabout all those things. But yeah, let’s, let’s talk about that hosting experience a little bit. Tell me,tell me your thoughts on that related to WP Club.Jesse Friedman: So every single [00:25:00] host that, and I’ve worked with a lot of hostingcompanies, every single host has a unique experience.Uh, the signup flow is typically about the same, but the second that you get into that WordPressinstance being launched, Unique onboarding flows. You get unique sets of tools. Um, thedifferent combinations of the way in which they combine, uh, partnerships they have withsecurity or performance companies.Um, And then the platform, the platform is always really unique. Um, a lot of them are built ontop of cPanel or Plak. I think something like 70, 80% of all hosts use that technology. Mm-hmm.Um, and sometimes you feel it and sometimes you don’t. Like, there are certain hostingcompanies that are just using cPanel.It literally says cPanel and you, and you know what you’re on. But then there are other hostingcompanies that have built a completely custom bespoke solution that’s layered on top of. Nomatter what it is, um, that, that again is how you’re differentiating yourself. Um, so if I look at sixhosting companies that are using the same [00:26:00] basic boxes to do shared WordPresshosting, they’re the only difference.There is price, but we’re all. All hosting companies are racing to the bottom on price, and we’re,we’re talking about a difference of a few bucks a month. Um, so then what is it that you get withthat hosting that’s really gonna differentiate ’em? And so most people are either makingdecisions based on the fact that they have a recommendation from a friend, or they’re taking alook at, uh, you know, the, the, the bespoke solutions that are coming bundled with that.The great thing about WP Cloud is that it has no platform. It has no user interface. It is 100%API driven. So for any hosting company to use it, it has to work underneath every single thingthat they’ve already built. Um, and so it can work with C Panel, it can work with Plesk, uh, or itcan work with whatever bespoke solution you have.Um, but your, um, Unveiling of the use of WP Cloud is up to you as a host and company. You[00:27:00] can go one way and say, Similar to, I think like WP Engine does this with like a w s orGoogle Cloud. They say like, you know, proudly like we’re partnered with this company to, tolaunch this. Um, and the same way that Pressable does this with like WP Cloud or Grid Pain,uh, you know, they say proudly powered by WP Cloud.And that’s starting to mean something as we start to have more of these conversations andmore people understand what WP Cloud really is. But, um, WP Cloud also offers a completely.Uh, an option that allows you to basically use our infrastructure without ever mentioning us. Youcould even bring your own IP addresses if you wanted to, um, and then take use of the entire\ninfrastructure underneath it, uh, without having to disclose that it’s not something that’shomegrown.Um, so however the host and company wants to work in that, in that area makes sense to us.Uh, what we want to do is just really. Allow them to refocus their efforts away from things like[00:28:00] managing WordPress or handling security or dealing with uptime. The other thing I’lltalk about too is, um, cost to serve.Cost to serve is something that’s on the mind of every single hosting company. Uh, whenPressable moved onto WP Cloud, we saw a dramatic decrease in, um, support tickets related toanything infrastructure rate, limiting DDoS, anything like. Um, and the same thing withwordpress.com, uh, wordpress.com business and e-commerce customers.They’re not, uh, reaching out and asking for support on anything related to the box or how fasttheir site is performing. What they are asking questions about is more things around how canthey be successful. How can you know what plugins should I use for this? Or, or that that’s yourdecision as a host and company decide pr provide support in that area or not.But I can tell you that when you relieve your host, your, your happiness engineers, yourcustomer service team, from the burden of having to figure out why a site is down or why it’s[00:29:00] performing so slowly, it gives them the ability. You know, focus on what keeps thosecustomers there for the long term, reducing churn, which is what every host and company thinksabout.Pressable had something like 36,000 tickets last year. Less than half of a percentage of themwere even associated with anything, uh, related to to infrastructure. And I even read some ofthem. And a lot of them were just questions about how, how Pressable goes about handling.Um, so we’ve basically eliminated support for, for hosting.Cory Miller: That’s the headline right there for, for WordPress hosting that, that’s the headline ofthe interview today. For sure. Well, um, Jesse, we’ve covered a lot, but I wanna make sure wedidn’t miss anything. Um, I think it’s an incredibly compelling service. Could help really raise thestandard of the hosting industry for WordPress.Um, that’s exactly. So what, uh, [00:30:00] and, and this is the note I wanted to say about thehosting experiences like that, uh, I think that frees a hosting company to also innovate on thatapplication labor. What things, whether it’s plugins, themes, services on top that add value forwho their customers are and what they’re trying to get.And I think that’s, that’s pretty dang cool. If I were in that seat hosting product, uh, manager, I’dbe like, okay, this is taken care of. It’s base lever, le level here. Now how can we set ourselvesapart by adding value to who our customers are? But is there anything with that, um, we left at,or you wanna mention?Jesse Friedman: Well, I’ll actually just pick up right there where you, uh, you mentioned about,uh, hosting companies. I think one thing to remember is, is that, Our mission at Automatic morethan anything is to provide, um, and democratize publishing. We know that, but it’s, it’s alsoabout making sure that WordPress is not only [00:31:00] readily available, but performing at alevel that, um, allows you to focus on getting the word out about your business or your politicalviews or whatever it might be.Um, but hosting companies, uh, are experiencing incredible churn right now. Uh, we. This waslike the number one topic at that conference I mentioned earlier. Cloud Fest, um, hostingcompanies are seeing extreme churn, and the problem is, is that when someone churns from ahosting company that is specifically for WordPress, they don’t churn and go, they don’t tryhosting company a.Say, oh, my WordPress experience wasn’t so great there. I’m gonna go try hosting company Band try WordPress there, and then I’m gonna try hosting company C and try WordPress there.That’s not really What happens is that they give WordPress a shot on whatever hostingcompany they’ve chosen. And if that fails, uh, or that doesn’t work out for them, a lot of themend up going to something else.And so that one opportunity to provide a [00:32:00] superior WordPress experience is reallywhere we want to help, right? So if we can take care of the, the infrastructure, the hosting, thesecurity, the performance, and make sure that everyone has this like level set, amazing hostingexperience in terms of the infrastructure.I wanna touch on the exact, like, I wanna reiterate what you just said, which is that that allowshosting companies to innovate on what they can do to provide better onboarding, reduce time to\nlive, which is how fast they can launch their site, helping to make sure customers aresuccessful, focus your time on marketing so that customers sites, once they’re launched, theycan actually gain traffic and, and really help them to achieve their business goals.And the other thing that I just wanted to touch on real quick too is, is just, uh, we talked a little bitabout scaling, but one of the things I do wanna mention is, is that, um, so these are bare metalboxes that we built up that we own. They’re, we’re not outsourcing anything at all. Um, and wehave 28 data centers around the globe already that are ours, uh, powering this entireinfrastructure.[00:33:00] Um, and then, uh, when someone. Hit with traffic, an extreme amount of traffic. Whattypically happens with other, um, cloud platforms is that they replicate everything onto aseparate box and they try to throw additional boxes at the problem. But the problem is that ifyou’re down, because you can’t service the amount of traffic that you’re handling, you have towait for that extra box to spool up, or you’re paying for it to be laying in weight.Right. What we can do actually is what we do is vertical scaling. So we have the option to throwmore PHPs and more CPUs at the problem until we’ve compensated for the amount of trafficthat you have. But this is where things get really unique. We go when we build out hostingplans. As I said before, hosts can build plans between two and say 30 PHP workers and CPUs.That’s built for sustained traffic of 400,000 visits to 15 million visits. Um, but now let’s say youhave an e-commerce website that got featured on the wire cutter, or you have, uh, a productthat you’ve been [00:34:00] ready to release and you have a huge wait list, uh, and everyone’sgonna slam your site at the same exact time.WP Cloud has a very unique opportunity that we can burst to 110 PhD P workers in CPUs. Andthen what we’re talking about then is, is handling the type of traffic that like the Washington Postgets when they release an article about what’s happening in our, in our government, or. C n ntraffic, you know what I mean?Mm-hmm. Um, and so those, those are the types of things that we’re, we’re mainly focused onso that we can provide, you know, v i p level hosting, um, and allow hosting companies to breakout of that shared hosting and the cheaper managed hosting, and to really offer something to,you know, to any of those customers that are, that are experiencing incredibly high.Cory Miller: I wanna go back to something you said because I absolutely, it rings true with me,is that if the hosting experience is not good, particularly on the WordPress as an applicationlayer, [00:35:00] um, yeah, we’re, we’re not, we’re doing a disservice to the entire industrybecause we’re. Turning a WordPress person into another Com competitor.And you know, I’ve been in this space a long time and I go, you know, I woke up a year ago andgo, wow, there’s very solid competitors to WordPress now out there. And if we want to, as thebusiness eco ecosystem of WordPress continued to have this incredible thriving grow.Ecosystem and the software. Then we, you know, we used to say like, you need two things.You need a domain name and you need WordPress hosting to Yep. To buy our products. Andthen again to those agencies out there who we serve, um, at post tennis and are building onthat, that love, that inflow and growth that we’ve all enjoyed with the growth of WordPress, thenwe need to be serious about this conversation in the hosting experience because, You hit it righton the nail.They’re not leaving the hosting [00:36:00] company. Just the hosting company. They’re leavingpotentially WordPress. And that’s the bell I want to keep ringing, is that as an industry, we needto do things like this. This is, this is a key pillar. I think. Um, there’s other things that we need tobe doing as a WordPress business ecosystem to keep this healthy, thriving, growing.And, uh, I’m glad you mentioned that because it’s something I’ve seen, um, too, but that justgives a real world experience of like, if these hosting companies are having churn, it’s not justthem, it’s all of us. And there, there’s a brand that we’ve had with WordPress that has beenawesome and I’m incredibly grateful for the brand and the open source software.So I appreciate you mentioning that .Jesse Friedman: Yeah, of course. Yeah. If you remember the old days of the five minute install,um, I do. That was basically, uh, yeah. And for anyone who’s listening, who, who may not befamiliar with that, cuz it’s, it’s been enough years now. Uh, when you used to get a, [00:37:00] a,a new hosting account, it never really came pre-built with WordPress, uh, out of the box, you’dhave to.\nDownload WordPress from wordpress.org, re-upload it, sftp, build a database. Um, and then thefive minute install came out and it was like this brilliant way of like launching a WordPresswebsite super fast. And that was the moment I think that husband companies decided like, waita minute, we can actually like really create custom WordPress experiences.Because it’s no longer in charge of the customer to actually launch a WordPress website. It’snow up to the, the host to actually launch that instance. And that’s when they started packagingtheir own plugins, their own themes into it, providing their own unique solutions. And that’s allwell and good. Um, but I think there is a responsibility to those hosts, to the larger ecosystem tomake sure that we’re, we’re furthering the mission across the board.Um, and so their churn is definitely a reflection of the larger ecosystems. Hundred percent.Cory Miller: I mean, that affects all of our members that post us from product companies,[00:38:00] professionals that do WordPress love, being able to do pre WordPress as their careerand the agency serving their clients out. Across the world.So a hundred percent agree. And this, this is something we’ll have to change the headline a littlebit and add to it because it’s my personal viewpoint that we need to, all of us collectively look atthe industry and go, what makes it healthier for everybody? And this is a, this is part of theconversation, so it matters, this conversation today, even if they don’t choose to go with WPCloud, that we need to be thinking about this experience for the overall health of, of the industry.Yeah. Absolut. For sure, Jesse, my friend. Um, so if somebody’s interested and wants to talkmore about W Cloud, what do they do?Jesse Friedman: So if you’re a hosting company and uh, you wanna partner with WP Cloud, goto wp.cloud. Uh, it’ll load so fast, you think it’s a local site. Uh, so that’ll be your first taste of thepower of WP Cloud.Uh, funny [00:39:00] enough, that site is actually hosted by Pressable on just a regular account.Nothing special. Um, so, uh, you’ll see, you’ll see how that works if you’re thinking. Moving yourown personal sites or your businesses sites, um, and you’re not a hosting company, but youwant to, you want to try out WP Cloud, take a look at our partners.So we have, uh, wordpress.com Pressable, uh, if you’re a news site, you could try News PackGrid Pain now offers, um, uh, WP Cloud as well. And, uh, and uh, yeah, we have some otherpartners coming down the pike too. Uh, that will be, uh, will be.Cory Miller: Let me know when the newpartners come in. We wanna share that, um, to, to our members at Postes.But Jesse, thanks. Sure. Uh, for this today. I appreciate your time sharing about what you’redoing at WP Cloud and Automatic. Um, so thank you and everybody else. Thank you forlistening in to another post status draft episode I, the product People series.Jesse Friedman: Yeah. Well, thank you for having me. I really appreciate it.[00:40:00]\n\n\n\n\n\n\t\t\tPost Tags:\t\t\n#Accessibility#Acquisition#Africa#Agency#Altis DXP#Automattic#B2B#Black Friday#Blocks#Bluehost#Brian Gardner#CloudFlare#Cloudways#CMS#community#Content#contracts#Cory Miller#CSS#Cyber Monday#Dan Knauss#DDoS#Digital Ocean#Discussion#Diversity#Documentation#DXP#Encryption#Enterprise#Ethics#Featured Image#Figma#Forbes#Freemius#Genesis#GitHub#GoDaddy#Gutenberg#Health#Hosting#HTML#Human Made#Inclusion#Interviews#JavaScript#Jesse Friedman#JSON#Kinsta#Magento#maintenance#Marketing#Membership#Migrate#Multisite#Nathan Ingram#New York Times#Nexcess#Open Source#Outsourcing#Pandemic#Partnerships#Performance#PHP#Plugins#Pressable#Pricing#Publishing#SaaS#Scale#SEO#Shopify#Square#Standards#Static#Themes#TikTok#tutorials#UX#Webflow#WooCommerce#WordCamp#WordPress VIP#WordPress.com#WordPress.org#WP Cloud#WP Engine#Yoast \n\n\n\n\n\nPost navigation\nPrevious\nPreviousWordPress Book • Women & Nonbinary Release • WP6.3 • More Effective Contributor DaysNextContinue\nLaunching a WordPress Product in Public: Session 10\n\n\n\n\n\nSimilar Posts \n\n\n\n\n\n\nLaura Hazard Owen wrote another great…\nByBrian Krogsgard \nMay 5, 2017 \n\n\n\nLaura Hazard Owen wrote another great post on Nieman Lab, this time closer to home. She featured Longreads, the member-driven journalism site Automattic acquired in 2014. I learned a few things from this feature, including that Automattic is matching $3 for every dollar that comes in from memberships. They also now spend all revenue on…\n\n\n\n\n\n\t\t\t\tRead More Laura Hazard Owen wrote another great…Continue\n \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nDesign | Hosting | Make WordPress | Planet | The Week in Review | WordPress Community | WordPress News \n\nWordPress 6.1 Beta 3  • Active Install Growth Chart\nByCourtney Robertson \nOctober 6, 2022October 10, 2022 \n\n\n\nHelp test WordPess 6.1 Beta 3! 🧪 Check out the latest features that are coming in the 6.1 release. 📦 Follow updates about bringing back the Active Install Growth chart. 📈\n\n\n\n\n\n\t\t\t\tRead More WordPress 6.1 Beta 3  • Active Install Growth ChartContinue\n \n\n\n\n\n\n\n\n\n\nAdding to the list of growing…\nByBrian Krogsgard \nDecember 12, 2018 \n\n\n\nAdding to the list of growing Gutenberg blocks, these two are worth a look: Secure Blocks for Gutenberg from Matt Watson is a block plugin that secures content by user role, allowing display of alternative content to logged-out users and users not assigned to roles. Easy Digital Downloads released the first version of their Gutenberg…\n\n\n\n\n\n\t\t\t\tRead More Adding to the list of growing…Continue\n \n\n\n\n\n\n\n\n\n\nMika Epstein tackles the common concerns many…\nByBrian Krogsgard \nJuly 28, 2018 \n\n\n\nMika Epstein tackles the common concerns many people have about Gutenberg as its debut in WordPress 5.0 approaches. Most themes and plugins don’t interface with the post editor or custom meta boxes, so they will be fine. For those that do involve the editor interface or meta boxes, Mika notes it may be a bit of a rocky road. It’s…\n\n\n\n\n\n\t\t\t\tRead More Mika Epstein tackles the common concerns many…Continue\n \n\n\n\n\n\n\n\n\n\n\n\nWordPress News \n\nWP App Store removes top-level menu item from their plugin\nByBrian Krogsgard \nMarch 11, 2013January 31, 2015 \n\n\n\nBased on customer feedback, we’ve removed the top-level menu item and added submenu items under Plugins and Appearance. Good move? Bad move?\n\n\n\n\n\n\t\t\t\tRead More WP App Store removes top-level menu item from their pluginContinue\n \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nWordPress News \n\nFaceted search for WordPress\nByBrian Krogsgard \nSeptember 4, 2013August 14, 2022 \n\n\n\nMatt Gibbs, the original creator of the popular Pods Framework, has launched his latest project: FacetWP. FacetWP is a commercial plugin to offer faceted search capability for WordPress. Faceted search, if you’re unfamiliar, is an advanced search technique: A technique for accessing information organized according to a faceted classification system, allowing users to explore a collection of…\n\n\n\n\n\n\t\t\t\tRead More Faceted search for WordPressContinue\n \n\n\n\n\n\n \n\n\n\n\n\n\n\nOne Comment \n\n\n\n\n Kingsley Felix says: \n\nApril 20, 2023 at 11:49 am \n\n\nIs WPCloud a new hosting from Automattic or just a listing of WordPress compliance hosting?\n\nReply \n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment *Name *\nEmail *\nWebsite\n Save my name, email, and website in this browser for the next time I comment.\n \n\nΔ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\n\n\n\n\n\nPost Status is proudly supported by great partners\nPagelyGravity FormsElementorA2 HostingPressable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\nTwitter\nYouTube\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© Post Status, 2023 | Made with WordPress | Privacy Policy | Website Terms\n \n\n\n\n\n\n\n\n\n\n\nScroll to top\nScroll to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAboutExpand child menuExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand child menuExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand child menuExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand child menuExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand child menuExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu Close\n \n\n\n\n\nSearch for:\n\n\n\nSearch\n \n\n\n",
    "links": [
        "#main",
        "https://poststatus.com/",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner",
        "https://poststatus.com/login",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/",
        "https://poststatus.com/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/podcast/draft/",
        "https://corymiller.com",
        "https://corymiller.com",
        "#comments",
        "https://poststatus.com/wordpress/business/",
        "https://poststatus.com/podcast/draft/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/wordpress/business/wp-products/",
        "https://twitter.com/Professor",
        "https://wp.cloud/",
        "https://twitter.com/corymiller303",
        "#h-transcript",
        "https://twitter.com/corymiller303",
        "https://twitter.com/Professor",
        "https://wp.cloud/",
        "https://poststat.us/a2-hosting",
        "https://wp.cloud/",
        "https://wphostingbenchmarks.com/benchmark/2022-50-wordpress/",
        "https://wphostingbenchmarks.com/benchmark/2022-500-wordpress/",
        "https://kinsta.com/",
        "https://wpengine.com/",
        "https://www.siteground.com/",
        "https://www.bluehost.com/",
        "https://www.digitalocean.com/",
        "https://pressable.com/features/100-percent-uptime-guarantee/",
        "https://cpanel.net/",
        "https://www.plesk.com/",
        "https://www.cloudflare.com/",
        "https://twitter.com/Professor",
        "https://wp.cloud/",
        "https://twitter.com/corymiller303",
        "https://twitter.com/post_status",
        "https://twitter.com/lemonadecode",
        "https://twitter.com/post_status",
        "https://poststatus.com/category/post-status-podcasts/",
        "https://itunes.apple.com/us/podcast/post-status-draft-wordpress/id976403008",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5zaW1wbGVjYXN0LmNvbS8ySkU5c2M4UA",
        "https://www.youtube.com/c/PostStatus",
        "http://www.stitcher.com/podcast/krogsgard/post-status-draft-wordpress-podcast",
        "https://wordpress-post-status-draft-podcast.simplecast.com/",
        "https://feeds.simplecast.com/2JE9sc8P",
        "https://poststatus.com/tag/accessibility/",
        "https://poststatus.com/tag/acquisition/",
        "https://poststatus.com/tag/africa/",
        "https://poststatus.com/tag/agency/",
        "https://poststatus.com/tag/altis-dxp/",
        "https://poststatus.com/tag/automattic/",
        "https://poststatus.com/tag/b2b/",
        "https://poststatus.com/tag/black-friday/",
        "https://poststatus.com/tag/blocks/",
        "https://poststatus.com/tag/bluehost/",
        "https://poststatus.com/tag/brian-gardner/",
        "https://poststatus.com/tag/cloudflare/",
        "https://poststatus.com/tag/cloudways/",
        "https://poststatus.com/tag/cms/",
        "https://poststatus.com/tag/community/",
        "https://poststatus.com/tag/content/",
        "https://poststatus.com/tag/contracts/",
        "https://poststatus.com/tag/cory-miller/",
        "https://poststatus.com/tag/css/",
        "https://poststatus.com/tag/cyber-monday/",
        "https://poststatus.com/tag/dan-knauss/",
        "https://poststatus.com/tag/ddos/",
        "https://poststatus.com/tag/digital-ocean/",
        "https://poststatus.com/tag/discussion/",
        "https://poststatus.com/tag/diversity/",
        "https://poststatus.com/tag/documentation/",
        "https://poststatus.com/tag/dxp/",
        "https://poststatus.com/tag/encryption/",
        "https://poststatus.com/tag/enterprise/",
        "https://poststatus.com/tag/ethics/",
        "https://poststatus.com/tag/featured-images/",
        "https://poststatus.com/tag/figma/",
        "https://poststatus.com/tag/forbes/",
        "https://poststatus.com/tag/freemius/",
        "https://poststatus.com/tag/genesis/",
        "https://poststatus.com/tag/github/",
        "https://poststatus.com/tag/godaddy/",
        "https://poststatus.com/tag/gutenberg/",
        "https://poststatus.com/tag/health/",
        "https://poststatus.com/tag/hosting/",
        "https://poststatus.com/tag/html/",
        "https://poststatus.com/tag/human-made/",
        "https://poststatus.com/tag/inclusion/",
        "https://poststatus.com/tag/interviews/",
        "https://poststatus.com/tag/javascript/",
        "https://poststatus.com/tag/jesse-friedman/",
        "https://poststatus.com/tag/json/",
        "https://poststatus.com/tag/kinsta/",
        "https://poststatus.com/tag/magento/",
        "https://poststatus.com/tag/maintenance/",
        "https://poststatus.com/tag/marketing/",
        "https://poststatus.com/tag/membership/",
        "https://poststatus.com/tag/migrate/",
        "https://poststatus.com/tag/multisite/",
        "https://poststatus.com/tag/nathan-ingram/",
        "https://poststatus.com/tag/new-york-times/",
        "https://poststatus.com/tag/nexcess/",
        "https://poststatus.com/tag/open-source/",
        "https://poststatus.com/tag/outsourcing/",
        "https://poststatus.com/tag/pandemic/",
        "https://poststatus.com/tag/partnerships/",
        "https://poststatus.com/tag/performance/",
        "https://poststatus.com/tag/php/",
        "https://poststatus.com/tag/plugins/",
        "https://poststatus.com/tag/pressable/",
        "https://poststatus.com/tag/pricing/",
        "https://poststatus.com/tag/publishing/",
        "https://poststatus.com/tag/saas/",
        "https://poststatus.com/tag/scale/",
        "https://poststatus.com/tag/seo/",
        "https://poststatus.com/tag/shopify/",
        "https://poststatus.com/tag/square/",
        "https://poststatus.com/tag/standards/",
        "https://poststatus.com/tag/static/",
        "https://poststatus.com/tag/themes/",
        "https://poststatus.com/tag/tiktok/",
        "https://poststatus.com/tag/tutorials/",
        "https://poststatus.com/tag/ux/",
        "https://poststatus.com/tag/webflow/",
        "https://poststatus.com/tag/woocommerce/",
        "https://poststatus.com/tag/wordcamp/",
        "https://poststatus.com/tag/wordpress-vip/",
        "https://poststatus.com/tag/wordpress-com/",
        "https://poststatus.com/tag/wordpress-org/",
        "https://poststatus.com/tag/wp-cloud/",
        "https://poststatus.com/tag/wp-engine/",
        "https://poststatus.com/tag/yoast/",
        "https://poststatus.com/wordpress-book-women-nonbinary-release-wp6-3-more-effective-contributor-days/",
        "https://poststatus.com/launching-a-wordpress-product-in-public-session-10/",
        "https://poststatus.com/laura-hazard-owen-wrote-another-great/",
        "https://poststatus.com",
        "https://poststatus.com/laura-hazard-owen-wrote-another-great/",
        "https://poststatus.com/wordpress-6-1-beta-2-serverless-wordpress-annual-meetup-survey-catalyst-for-creativity-2/",
        "https://poststatus.com/wordpress/tech/design/",
        "https://poststatus.com/wordpress/tech/hosting/",
        "https://poststatus.com/wordpress/make-wordpress/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/wordpress/week-in-review/",
        "https://poststatus.com/wordpress/community/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/wordpress-6-1-beta-2-serverless-wordpress-annual-meetup-survey-catalyst-for-creativity-2/",
        "https://poststatus.com/author/courtney/",
        "https://poststatus.com/wordpress-6-1-beta-2-serverless-wordpress-annual-meetup-survey-catalyst-for-creativity-2/",
        "https://poststatus.com/adding-to-the-list-of-growing/",
        "https://poststatus.com",
        "https://poststatus.com/adding-to-the-list-of-growing/",
        "https://poststatus.com/mika-epstein-tackles-the-common-concerns-many/",
        "https://poststatus.com",
        "https://poststatus.com/mika-epstein-tackles-the-common-concerns-many/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/wp-app-store-removes-top-level-menu-item-from-their-plugin/",
        "https://poststatus.com",
        "https://poststatus.com/wp-app-store-removes-top-level-menu-item-from-their-plugin/",
        "https://poststatus.com/faceted-search-wordpress/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/faceted-search-wordpress/",
        "https://poststatus.com",
        "https://poststatus.com/faceted-search-wordpress/",
        "https://techquirer.com",
        "https://poststatus.com/jesse-friedman-on-raising-the-wp-hosting-standard-across-the-industry-with-wp-cloud-post-status-draft/#comment-499166",
        "#comment-499166",
        "/jesse-friedman-on-raising-the-wp-hosting-standard-across-the-industry-with-wp-cloud-post-status-draft/#respond",
        "https://akismet.com/privacy/",
        "https://poststat.us/pagely",
        "https://poststat.us/gravity-forms",
        "https://poststat.us/elementor",
        "https://poststat.us/a2-hosting",
        "https://poststat.us/pressable",
        "https://www.facebook.com/poststatusblog",
        "https://twitter.com/post_status",
        "https://www.youtube.com/c/PostStatus",
        "https://poststatus.com/privacy-policy",
        "https://poststatus.com/website-terms",
        "#wrapper",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner"
    ]
}