{
    "title": "Launching a WordPress Product in Public: Session 10 • Post Status",
    "body": "\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nAboutExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\nAccount\n Login\n\n\n\n\nSearch\n\n\n\n\n\nJoin\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPost Status\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nHome / Post Status Podcasts / Draft / Launching a WordPress Product in Public: Session 10\nByCory Miller \nPosted onApril 20, 2023April 20, 2023 \n\n\n\nBusiness Draft Launching a WordPress Product in Public Planet Post Status Podcasts WP Products \n\n\n\nCorey Maass and Cory Miller look to the future of WordPress as they continue the development of their new WordPress plugin, Crop.Express. From sharing tips on how to keep your WordPress website safe from hacks and vulnerabilities to insights on how to optimize website performance, improve user experience, and enhance website accessibility, this episode is packed with valuable takeaways. \n\nEstimated Reading Time:  43 minutes\n\n\nTranscript ↓\nIn this episode, Cory Miller and Corey Maass discuss the future of WordPress. From the adoption of the block editor to the rise of headless WordPress, they consider the impact on the growing WordPress community. Gain insights on how WordPress professionals can stay ahead of the curve, the importance of keeping up with the latest updates and developments in the WordPress ecosystem, and the significance of fostering a strong and supportive community. This is an honest and hopeful look at the current and future state of WordPress.\nTop Takeaways:\n\nKeep up with the latest WordPress updates. It’s important for WordPress professionals to stay up-to-date with the latest WordPress updates, including security patches, bug fixes, and new features. This will ensure that your WordPress site stays secure and runs smoothly.\nInvest in continuous learning. As WordPress evolves, it’s important to invest in continuous learning to keep up with the latest trends, technologies, and best practices. This can include attending conferences, networking with other professionals, and regularly reading blogs and publications related to WordPress and web development. Keeping up with the latest trends and best practices can help professionals stay competitive and provide the best possible service to their clients.\nFocus on user experience. User experience should be at the forefront of any WordPress professional’s mind. This means designing websites that are easy to use, fast-loading, and visually appealing, as well as ensuring content is relevant and engaging for the target audience. By focusing on user experience, WordPress professionals can create websites that are both effective and enjoyable to use.\n\n\n\n\n🔗 Mentioned in the show:\n\nCrop.Express\nJetpack\nAutomattic\nWooCommerce\nMatt Mullenweg\nChris Coyier\nCSS-Tricks\nCodePen\nYoast\nWP Engine\nGitHub\nAtlassian\nTrello\nAsana\nBasecamp\nZapier\nDropbox\nZoom\nNotion\nFigma\nSketch\nInVision\n\n🐦 You can follow Post Status and our guests on Twitter:\n\nCorey Maass\nCory Miller (CEO, Post Status)\nOlivia Bisset (Intern, Post Status)\n\nThe Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧\nTranscript\nSession 10 Corey & Cory Launch a WordPress Product Live\nCory Miller: [00:00:00] Nice. Um, so it makes it really nice to stream YouTube. Um, okay, sosession 10. Now turn off YouTube. Um, so session 10, we’re talking, um, last week we saidwe’re good on the version for Crop Dotted Express, and we had saw a new direction with theproject you had been working on anyway. Mm-hmm. And we spent some time just privatelydiscussing that.And so, um, we were just chatting in the pre-roll before this about okay is, you know, building itin public, but we’re, we’ve pa not paused, we’ve put a bow on that one and said, okay, there’ssomething else here. And now it’s time to kind of explore that and figure out what’s, what couldthat product be. [00:01:00] Um, you just had a couple really good, um, comments about thatwhole process of here’s that one, but we’re going onto this next one.Hmm. Can you share some of that you’re just sharing with me? Cause I think it’s really goodand I don’t want to Sure. Oh, your butcher, you’re your top.Corey Maass: Um, so, uh, for the sake of accountability, I do wanna say that Crop express, uh,is pending a read me update that you and I worked on, I think last time. And there are a coupleof tweaks to make to the product itself.The plugin itself. To in fact put a bow on it cuz I wanted it. It’s gonna be, you know, so, so a littledigression here. It’s very easy for, uh, any product team as we now are to go, uh, that wasyesterday’s new shiny, [00:02:00] today’s new shinies over there. Um, and if we are notabandoning crop express, which we are not, then it’s important that I sit down at some point andactually put a bow on it.And we don’t just keep saying we’re gonna put a bow on it and let it ride, but, um, you know, letit be a whole product unto itself. I think that’s important. So that’s on my list. Um, but yeah, we,in, in the process of talking about crop express and where the value add is, um, one of thethings that you talked about really well, um, is the, Difference between, you had a little graphicthat, you know, pain solving a pain versus adding value.Um, and obviously these things are not mutually exclusive by any stretch, but, um, crop Expresssolved a problem for us. That’s why, why we started the conversation in the first place. I built thislittle web utility. You went, holy crap, this [00:03:00] needs to be in WordPress. Uh, and thatlaunched our journey, but we kept having these great meta conversations about image imagesin WordPress as a whole.And one of the things, problems that I’ve been struggling with for a while, for my own blog andagain for, um, client sites, not only is it cropping images correctly, which solves a pain point,ideally, um, but is you write a blog post and, and then what? Right. You need other assets to goalong with it. Uh, and then in a perfect, you know, so we’re talking, now we’re talking aboutmarketing, right?We’re talking about marketing assets, things to put on Twitter, images to put on Twitter imagesto put on Instagram, and, and having to go over to Canva to do that or some other tool. Um, andso now we’re talking [00:04:00] about that, which is, you know, there is pain involved. These areextra steps, but it’s the difference between, to me, you know, the difference between trying towrite a, a basic blog post with an image inward press, and that it’s.You get to the end of the words and you’re like, oh, this is such a pain. I need to do somethingwith an image and leave WordPress. Versus traditionally, I think we’d write a blog post inWordPress and then go, okay, the WordPress part is done. Now let me jump over to Canva,Photoshop, whatever it is to generate these other images.Um, and so now we’re sort of switching over to a value add potentially.Cory Miller: Yeah. I, um, most of my product experience is in the pain threshold. Um, you know,backup, security, all that, you know, updating stuff, very [00:05:00] utilitarian, um, practicalthings, and I really appreciate it. That’s part of my personality too. I like utility things. You know,there’s this pin, for instance, is the big. A pin.And in my belief, there’s no other better pin than this pin. So I take ’em from everywhere thathas ’em, that gives ’em out. And I promote all Napa Valley Winery. Um, so I, I’m practical in that\nutilitarian, like, do something for you. And it was great to see some of the products, like peoplejust, they needed it, you know?Um, I always aspired to the ones that help people look good, make money, all that. And we builtthose into those products for sure, where people could use those things and what labeled themor package them into a bigger thing. And so a lot of the products were very utility products, butthe marketing and things we did was very aspirational.Um, [00:06:00] this one so interesting because you had already been working on something andyou showed it to me and I was like, oh, wow. And. As I can do anything, I can blow somethingreal big up, you know? And that’s what we did. We, wow. The compelling thing was, you know,I’ll take some of the marketing tools, like for instance, uh, the one I just kind of default to think ofis Optum Monster.Hmm. When you see what, whatever time they came out with the Optum Monster, um, whenyou see that a popup and what they, what you could do with that, you instantly kind of go, ohwow, I could do that too. And that’s, that’s really compelling for me. Um mm-hmm. When you’reable to show an outcome that people go, I mean, it’s marketing product for sure.It helps you build your email, um, email list. It helps you potentially, [00:07:00] uh, get somepurchases from coupons and things like that. Not to go into the full thing about Optum Monster,but. You go right there, you can see what the product does. Mm-hmm. And if you don’t havethat, you can go, wow, this could make, make it easier.What’s compelling about what you said was, or what we, we, you showed me is this, one of themany things we talked about was the social images, being able to, you write your post and thenyou’re, you’re ready to promote it and like you said, go to Cam and do all these things. Um, Ithink in this conversation, what I’ve kinda learned from Crop Drive Express and then past stuff isparticularly with this idea, we can give that aha oh wow moment for someone.And we talked about using it on some of our client sites, post status and different things. Um,because then when you see. That’s where I [00:08:00] think, you know, when they seesomething going out that has a nice treatment, um, yeah. Where it’s not just a link. I mean,that’s what I tend to do personally. Um, then I think there’s, there’s some merit there of you wantyour base hub to be your website and they’re promoting outs through your social channels, andthen those to look appealing and good, whether it’s Facebook, Instagram, whatever those thingsare.Yeah. Um, and kinda lead back. And that’s where I go. I’ll tell you, I in this, in this whole projectthat we’ve been working on together, it just keep, I keep coming back to you and I talked aboutour, at our product owners meet up this week. Um, getting as close as you can to the pain that apotential customer has, um, or that desire to do for them to look better, make more money.\nUm, I don’t know. This is the work I need to do more is getting closer to that, you know? Mm-hmm. Where it’s not just theory, us talking, it’s like, [00:09:00] you know, do, is this an issue?\nAnd there’s, um, you know, a book out called the Mom Test and mm-hmm. The thing is, whenyou have an idea and you go to your mom, she’s always gonna say, I love it.Yeah. So making it in a way where it’s more discovery. But that’s my thoughts about this and Iwanna be sure because this is a bigger project. Um, I guess the word would be validating. Yep.Is there a pain point? Is there someone willing to, to, to pay for it? Um, so we’re really taking it. Iknow we approached this as a hobby, but going, okay, give our best effort to make this intosomething that actually does pay us my thought.Corey Maass: Yeah. . And that was, and that was, I think, part of why, so I don’t remember thesummary to, to, we’re on session 10. So in session eight, I think we, we, the conversation cameto a point where we said, okay, so, so [00:10:00] cropping images is one piece of the puzzle ofconsistent, good looking images on a WordPress site.That could be a blog, that could be WooCommerce, whatever, right? Um, and so we were stillsort of solving, um, yeah, we were solving a basic problem. Um, again, a p a a point of pain that,uh, we had. Um, I’m, I’m trying, in my brain, I keep drawing this analogy of, um, a basic car, yourHonda Civic from, I, my first Honda Civic, uh, that I bought in 2015 was from 2000.So 15 year old, you know, but in good shape. But it would get you there, but no bells andwhistles. The, the crank windows, the whole thing, right? And so, um, and, and a lot of people, Ithink this was a, you know, more traditionally [00:11:00] WordPress as a blog platform was thatfor a lot of people, I’m gonna put words out.\nMaybe people find it or they don’t. I’m gonna tell my friends about it along come social media,uh, and, and other paradigms and, and the things go from, I guess you sort of hope for inbound,you know, and we’re talking about amateurs or, or non-professionals is the better word, right?But, um, you know, to outbound.And then also I think there’s an expectation now, or most people blog for money, right? Mostpeople publish for money. Most people use WordPress for money a lot more than back in theday when it was, you know, express yourself or put yourself online or, or, you know, buildauthority, all those things. Um, and so taking that, uh, your, the, the bigger problem that we,when we talked about with crop express of consistent [00:12:00] images and putting yourself outthere, and it’s like we’re talking about, um, Individuality, right?So it’s not just cropping finding a, finding a, a stock photo one for each post, right? Or each, um,product image. If you’ve, if you’re running Woo commerce, it’s like, yeah, it’s a square. Okay, it’s,I sell, you know, this widget and that widget, and I crop them all to be squares. But it’s like, dothose images stand out?Do those images have more information? So it’s like, if I go to the website, there’s all theinformation next to a photo. But on Twitter, if I put that photo up and it’s just a picture of awidget, it doesn’t list the benefits. It doesn’t, you know, so it’s not, um, a compelling bigger, andthis is where, you know, um, I think one of the things that really clicked for me was you sent me.The, on the, on the post status blog, one of the threads there is, or tags or something is, youknow, here are all the [00:13:00] people we’ve featured. And I was like, wait, all of these bannerimages not only are the same size, but they’ve all got the same treatment. They all have thepost status logo on the left. Um, you know, and we look at, and that, and that, that solidifiedsomething for me that you’d touched on, but I, I couldn’t relate to as much.Like, you, you really liked slides, um, and talked about using slides again to promote things.And, and we sort of went, wow, what if, you know, you have, um, uh, your product images, youor your, your, your blog post banner, image featured image, um, that had bullet points on it or,you know, so it was like taking these, I guess what I’m trying to do is summarize, um, veryspecifically, A little bit of how we got here, but also what we’re now talking about, right?So we’re talking about image treatment, image generation, um, based around one post quoteunquote [00:14:00] post, which in WordPress can be a product, can be a blog post, can be anarticle, can be your course if you’re running an l m s, whatever it is. Um, and so that’s kind ofthe, the switch from solving a pain point, cropping an image to this huge value add.And it’s like, and I guess, yeah, uh, it’s, it’s coming together in my head. You brought in opt,brought up Optum Monster. So it’s like you could have a website, you could have great content.Optin Monster is this value add. If your end goal is promotion, money, fame, and fortune, all thatkind of stuff, being a reality TV star, um, optin Monster is this great.You know, the going from, from your Honda Civic to the, the sport version, and then the fins andthe, you know, so now suddenly you’ve got, you know, you’ve gone from a basic way to publishcontent to, you know, bells and [00:15:00] whistles essentially. Um, which isn’t to diminish it likebells and whistles are often it’s, um, not it’s, it’s said in a condescending way or a bad way, butwe’re talking about like, okay, how can you, you know, make the, the basic car that gets youfrom A to B be a fun experience, that kind of thing.Um, enough restraining the metaphors. The point is, um, yeah, OptinMonster adds this extravalue and whatnot. So it’s like if we have, uh, if you write a blog post, what we’re talking aboutdoing is, is. A product in WordPress that can generate slides, can generate images, could cropthe image, but also could add potentially a, a graphical treatment.Um, so it’s always got a blue fade or it’s always got a logo on the left, or it’s always got, and, andthese things would be auto-generated. Um, so you, you finish your post, you click a button and[00:16:00] you’ve got an image for Twitter, an image for Facebook, an image that you know, Imean, taking this to a, um, an extreme no idea if we can yet, if we can do this, but, um, anim ancreating an animated gift that has three slides that go by or, you know, things, so things youcould upload to Instagram.You know, if it’s an animated gif it should be, we could create an MP4 out of it and then it’s, um,a story for Instagram cuz it’s a video and da da da. So all these, all these shareable assets,which again, take that basic blog post and just blow it up to, to create all these amazing thingsthat you could then do something with.\nUm, when we came to, when we were starting to talk about that as a product in our previous callor previous previous call, that was when I said, okay, let’s have a conversation offline cuz I thinkmaybe I’ve got a solution for this. Um, so in [00:17:00] parallel, for a few months now, um, I built.Little SAS app, basically web service, um, called screenshot.express and haven’t launched it.That was if, if you follow me on Twitter, or I think I might have mentioned here too, like this is aproduct that I built, um, and the a p I works, it works as a, is a little screenshotting platform. Um,but what I really wanted it for was, yes, it’s great for taking a screenshot of a website, but if itcan take a picture of, of, of a website.But that website could be the size and shape of a Twitter banner or, you know, could be a, um, aslide. Then we’re now talking about using H T M L to, to define a layout. Whatever we want thatto look like. And then taking pictures of it. And then there you’ve got your image and so, and CRand [00:18:00] generating different types of H T M L pages and also taking advantage of res, theresponsiveness of, of layout.So it’s like if you have a header and some text next to each other, but on mobile, the he, theheader goes above the text with one H T M L output. You take two pictures, one wide and onenarrow. You’ve now got a, uh, a Twitter banner and you know, a mobile screenshot or whatever.So it’s like, I realized that in parallel, I’ve already got this little service that will potentially solvethe technical aspect of this.Um, and so that was where sort of all this came together and we went, wow, that’s, that to me isa much bigger thing. Um, and so as you said at the, the beginning of my ramble, like, we seethis as a, as a much bigger product to me, right away my gut says, okay, that’s much more of a,something we could sell. You know, it’s, [00:19:00] it’s a big packageable thing.Whereas crop Express, it was like, this is a great little utility. It solves a neat little problem. Andwe could probably keep adding some things or, or splashing around in the problem until wefound something that would, people pay, would pay a little bit for. Um, but this to me seems likesomething much bigger.Cory Miller: Yeah, for sure. And I don’t, um, my tendency is always like, oh, let’s go, let’s go.And I’m trying to really not do that because I, I wanna be careful, you, you in particular. Me too.But you, um, as a developer on the partner, um, and lead on this, I, I wanna be really carefulwith the time. Mm-hmm. Um, because I, I think we both go, we did something of value here, andI wanna be a little bit more calculated than I have in the past about Okay.Because I can blow these ideas up and go, okay, I see these, what I don’t wanna do is just dothat in a [00:20:00] vacuum. Um, not to like you and I are doing this, but I, I want to, I feel likethere’s something so powerful of getting to whatever the person is trying to do, like havingsomebody in mind, or talking to people and seeing what they.Talk about it’s, it’s funny. So with product at post status, I go, just to give you kind of a parallelabout how I’ve historically think about product and need to change and, and evolve, is I go,okay, for our agency, we, we saw real quickly becoming an owner post status that, um, okay,product people, smaller group of people than you got hosting companies, you haveprofessionals that do all the work.But I really honed in on, there’s a lot of WordPress agencies out there, and I don’t see in thisspace a lot of people that there are really cool companies doing really high-end work foragencies like [00:21:00] Troy, Dean’s work, um, uro, different things like that. But I go, okay, I,for me, Passion and ability and go.I’d love to promote and help people tell stories and draw expertise. So long story short, besidesjust Slack and e and our email newsletter, I think we can offer more to them. Where I’m at in thatproduct is really interesting for me. Frustrating. I shouldn’t say interesting. I don’t wanna sayinteresting.It’s frustrating as hell is I go, we could do mar co-marketing for these agencies. Now you knowhow it is, you bring in an idea to somebody else. It’s so different from the my uh, the, my big FatGreek wedding when he goes, you have to make it his idea. And I go, oh, that’s so true with metoo. But, but I go, if you get to customer and see what they’re doing, um, potential customer andjust talk.So like in my interviews with the agency owners, one of the things they stand up, but I[00:22:00] think there’s a bias cause I’m coming at as post status. Um, and one of the featureswe’ve had in our products is job listings. I go. That’s what they tend to have gravitated toward it.\nAnd I go, well, I don’t know what more else we could potentially offer in that, but keep gettingpros in there.And so that’s like existing product, just trying to make it better, which is valid foundational. Iwanted to do more for them. Now this is where we’re in that process and, but I don’t want it tobe like, I got this cool idea. Cuz then you’re kind of just striking trying to try to hit a hit, a hit awinning lado.Um, but that’s where I’m at, you know? And, um, with this my mind went to, oh, I mean we, wewere talking about our own problems right now, and then we’re using some clients and differentthings to think about that. But before we go, I wanna make sure [00:23:00] specifically first andforemost on your behalf is we. Gets some validation.A little spark of something. Yeah. And collect enough sparks that go, this could be a fire. Right?This could be, I just, I wanna do that cuz my tendency is I’m an DF fair and you know, I dr at theopportunity to work with a great developer like yourself and, and product person like yourself.And, uh, so anyway, that’s where my mind tends to go.But this is interesting to both of us. Um, now it’s like if you got a hammer, everything looks like,like a nail. Uh, I wanna be careful of that in this.Corey Maass: Yeah, sure. And I tend to build first and ask questions later. We know this, so,which isCory Miller: freaking cool. I think that’s better. See, it would be better as an idea person to beable to build it first too.Right. And say, but I just, I wanna be careful cause I don’t have those skillsets.\nCorey Maass: Well, and, and this one is, I think one of the other things I mentioned in the pre-roll is [00:24:00] this is a much bigger lift. Yeah. And so I’m also, my brain is saying there’s, there\nare red flags here to that approach. Crop express, small, you know, crank something out, get it,you know, we, the prototype is going to be straightforward, uh, or was straightforward and, andyou coming in and going start with featured images.Great. Even simpler. So we’ve got one and it turned out to be replicable. So then media library,um, block, um, we did have to hire somebody to get us over a couple of hurdles, but for themost part, Replicable, um, reusable code and all at once. Whereas this, I mean, so I alreadystarted my intention of spinning up screenshot express, which is abstract.And I knew that. I’m like, this is probably isn’t a thing. I’m gonna, [00:25:00] I’m, I’m gonna sellon its own. There are, and there are people who are making progress with, with other productsthat take screenshots. And I admire that because I’m like, this is a, this is a service. This is a,this a hundred percent a solution looking for a problem.And so it’ll be other developers or me as a developer that uses this tool for whatever problem.And so it’s like the, I said about building a, a WordPress plugin, which I think you and I shouldreview and start pulling apart and see what we can do with, um, But it’s, uh, to generate socialimages to accompany a post.Um, and so the good news is, yeah, I’ve, I’ve solved some of the, like, some of the problems,like, what do I wanna say, as a product, it’s more complicated and involving a third party service,like screenshot.express is more complicated. And [00:26:00] then setting up different images fordifferent use cases is complicated.And, uh, and solving the right problems is complicated. It’s like you go to Canva, they’ve got like,not only do they have all the assets and stuff, but they’ve got a gajillion templates. What do youwanna make today? I wanna make an Instagram post. I wanna make a, you know, a musicvideo. I wanna make a dot, dot dot.Like all these things. So somebody had to sit down and, and make templates out of all thosethings. Um, and so it’s building, this is going, you know, as already. Even though I’ve solvedsome of the problems connecting to the p i of Screenshot express and stuff is like, all of that ismore complicated, a much more complicated user experience.Um, before we even get to the fun part of like, okay, now we can just build a gajillion templatesand hope that one of them is the right thing and, and, and on and on. So, um, so yeah, it, itstrikes me that you doing more interviews, re more research, [00:27:00] um, us getting moreanswers, um, before I, like, I’m, I’m inclined to, I keep waiting for you to say, like you saying,featured image early on was such a pivotal point, like, here’s how we simplify this big,complicated thing to start with.\nUm, so no pressure, but I’m waiting for you to come up with that again. Um, but I do think thatsince I’ve got, since I’m close to having s a, an initial. Social image generator plugin forwardWordPress using Screenshot express that maybe we start there cuz it does solve the problem.Um, enough for us to, for, for you to get eyes on it as far as user experience and go, yeah, no,this is, you’ve made it as you, Corey have made it as simple as possible.It’s good enough. You know, we can, we can [00:28:00] tolerate people, people will toleratestepping through this pro progress process, even though it’s a handful of steps to get the valuethat we are creating at the end. Um, and then, and we keep having these conversations like wedid with Crop Express, where we go, okay, wait, but if we put this over here, it makes moresense in context.Or if we mm-hmm. You know, connected to a different service or we put it in front of certainkinds of people, um, then. It’ll take us, it’ll take us to it. It’ll help us grow.Cory Miller: Yeah. Uh, I just asked ChatGPT what are the most popular features of Canva?Hmm. So that, that’s interesting. Um, excuse me, because we’ve mentioned that a number oftimes and different photo editing tool.Um, I think so two parts, making sure I really understand what Screenshotted Express can do atthe moment. Um, [00:29:00] but two, I think in this next experiment is having, having a defaultcustomer in mind. Yeah. And, you know, sizing that market, the, the person that we know, thatwe think we understand or have some connections with.And then seeing how that market is. Because it cur, it occurs to me like I told you with backupbuddy. I go, well, that’s a hundred percent. Theoretically, theoretically, everyone should want a,a backup for their WordPress site, right? Um, that was easy, right? Because the, you know,we’re gonna go into this field and we’re gonna hit something.Um,Corey Maass: But to, but I think to your point, like your average non nerd or non-professionaldoesn’t think about that. You know, there’s a reason why they are automatically that mosthosting companies [00:30:00] offer automatic backups. And even if they don’t, I almost canguarantee that they’re doing at least some periodic, because the majority of their support ticketsare, I broke my site, or somebody hacked my site.What? And I, you know, and, and support. A technician comes back and says, great, whatabout, what do you have for backups? And the person goes, what’s a backup? And then theygo, oh, well you are lucky on our server in a very hidden technical way. I can at least restore itfrom seven days ago or from yesterday or what have you.You know, but you should have thought about this and then mm-hmm. You know, but, but youraverage person doesn’t think about backups. Right. Um, so you still, you were solving a problemthat everybody has, but most people don’t know they have. Mm-hmm.Cory Miller: Yeah. And, and where when we get the main product out, we’re able to do[00:31:00] content marketing around all the reasons why it would be good.We even created a content, um, content replacement calendar or something. We tried to say,what’s the value of all your posts? Because I lost, uh, I lost things from my personal websitewhen we had a server crash. Now, you know, there they weren’t invaluable, but it was, it was aheadache. So we started doing that to try to map that out.But, um, when we talk about avatars for a second, um, we have your clients content journey,and then the, what I hear over, and it’s so interesting, my, my own perception of WordPress haschanged so much. Um, but what I hear over and over from our agencies and owners and thingsis that the people running when they deliver projects, I, it’s really compelling that it’s marketing[00:32:00] specific people.Mm-hmm. I just got outta the, a agency owners meetup and it was again, like they’re turningsites over and typically it’s marketing related type. People are actually the people using theirWordPress sites from enterprise. WordPress does really good in the enterprise becausemarketers go, it’s cheaper, it’s faster, and I can use it.So I, I would say like in this backup buddy thought, I go big market, I am a marketer. I go that,that’s really compelling. Which is why when we talked about screenshotted express, I was likethe social images. I, but I don’t, I gotta admit, make sure I’m honest about this. I don’t do that. Idon’t really post to our website.Um, we have team and content journey and different things that do that. But if we take that a,that’s one big avatar. I can like say, generally speaking, [00:33:00] if we hit the marketing room\nand that’s the, the sexy make you look better, make money kind of realm. Yeah. So there’s one,um, I think about yours as a lot of publishers, um, uh, publishers.But even like a lot of the content journey, you know, clients, um, it’s, it kind of boils down to themarketing people. They’re the ones interfacing with those clients. Yeah. Very.Corey Maass: Yep. Um, yeah, we’ve got, I’ve got a couple of different scenarios. One is on oneteam, we have a person dedicated to social media. Um, and I am, so, so there’s an interview Iwant to have, um, customer interview, like talk to them about how they’re making stuff.I think they’re using Canva. Um, and I think that they’ve got template set up so that, again, it’s,they plug in a featured [00:34:00] image, they plug in a featured image, but it’s got the sametreatment every time. Um, I want to make sure of. And I’d love, we’ll have you talk to them if, ifyou’re following the, um, mom interview methodology.Um, cuz I’d also, I think what would be really interesting would be, I have a history of taking, uh,blue ocean products and, and rebuilding them, repurposing them for WordPress. Um,sometimes with legit value and sometimes just because it’s a smaller market, so it’s easier tofocus. And, and I’m still fascinated with the idea of WordPress being the control panel for a, aperson’s entire business.Um, but I also would be curious if, you know, sorry. Um, if the people are who, if they arejumping into Canva, are they struggling? Like, is it too many choices? [00:35:00] Is it, um,repeatable? Uh, sorry, I gotta let a dog in. Hold on.Cory Miller: Go, go for it. I, I’m opening up a y board to take some notes.Corey Maass: And thankfully my spouse stepped in and cornered him. Um, but yeah, it’s, youknow, so is, is there value in generating these things from WordPress with the expectation that,like I just wrote, wrote a blog post, and as we talked about before, you know, there’s the, the last10% or the, you know, maybe it’s, let’s use 80 20, right?Like 80% of what should be the process is writing a blog post. But at least in our experience,80% of the pain is. Um, the technically speaking anyway is going and finding an image,cropping [00:36:00] an image, all that kind of stuff, which is what we were trying to solve withCrop Express. And so, um, you know, is it, is it parallel here where it’s like, okay, I’ve written ablog post now what?And I think that that’s a big problem, uh, to solve. Uh, or it’s a, a question that, that we wanna becareful. We want to do a good job of defining the question to then come up with the solution.Um, and so it’s, you know, our people. If, if, if we can get to the point where you’ve generated ablog post, click a button, and then you’ve got assets, that’s amazing.Um, is that enough? How hard or difficult is it to create those assets? Because it’s like Canvaoffers creativity. Right. You can do anything all the time forever. But I, for me, um, like I have amusic blog, and so every time I, [00:37:00] or one of my writers writes a review, I go into Canvaand I open exa, I open the same design, I say duplicate page.I change the title. I change the, so that it has the same treatment, right? Like, I’m not doing whatCanva kind of seems to want you to do, which is starting from scratch every single time.Because I’m not, I’m not doing that. I’m not trying to be that creative, and in fact, that takes waymore time rather than, You know, a quick, simple 32nd, copy, paste, change, title, publish.Um, and so I’m, I’m intrigued to find out if I’m right about that. Um, mm-hmm. You know, if, if ourteam, if my teammate, somebody writes a story, publishes a story, like we have professionalwriters who are writing, um, you know, long form content, and then we’ve got, again, a separate[00:38:00] person whose job it is in part to create social media content from that story to thenpublish everywhere.Um, and I’d be interested to know if it’s a simple process for them or, uh, the hypothesis similarto the crop express hypothesis is are they going, you know, the hard part should be. Putting allthis stuff out there, looking at the analytics, like creating a, essentially a, a mini campaign, um, topromote this blog post.But most of the pain is actually going in and, and cropping an image and adding the treatmentand all that kind of stuff. Um, and if, and if there’s value in having that sit in WordPressalongside the blog post, um, you know, whether it’s under media or whether it’s going into thepost and then seeing a little icon that opens up an app or, you know, whatever approach it is,um, you know, to make sure that there’s as much benefit there as we’re [00:39:00] hoping.Cory Miller: Okay. I’m trying to make sure I take all these,\num, okay. So, um, potential avatars, I think we’ve said marketing. I try to put a little bit. Thinghere. We got publishers I added in here. Um, because one thing that kind of, if you, if I justcamp out in this marketing realm, um, I thought about screenshot express, and I go ebookcreation or lead magnet creation.Mm-hmm. Like the covers. Mm-hmm. Um, you know, some kind of cover. Now I think that wouldalso lend to this featured image creation in the sense of those graphics you talked about withpost status. Like we got the featured image graphic that we kind of pulled together, but it justkind of made me [00:40:00] think like outputs, maybe I should put that here.Uh, outputs,um, social images, we said this, uh, featured images, uh, oh e let me just say ebook coverage,just in the realm of possibility here. Yep.Corey Maass: Slides was the thing that got you your gears turning early on.Cory Miller: I was thinking of tip boxes. Lemme see if I can share my screen. Nope. I have toclose the Y board. I was on, uh, CAO’s website looking at their di i y lighting kit and they had apullout with a tip. Oh, okay. So I, I don’t know how to call, like pull out, pull out boxes and Iguess that could be quotesthey call to action. Hmm. Um, like, [00:41:00] well, let’s put ads, ads into Oh yeah. Post etcetera. Wow. Yeah.Corey Maass: Wow. Wow. Ads like auto ad gener, ad ad image generator from a Woocommerce product. Mm. Holy crap.Cory Miller: That could be coupons, like mm-hmm. I, I was even thinking your HTML side, cuzyou’re generating H M L and then you’re taking the snapshot of it.But like, you know, Kohl’s or Bed Bath and Beyond, you know, they have a coupon and it lookslike a little coupon thing. And I mean, if there’s HTML, if we’re generating HTML, don’t even, youdon’t have to go to the screenshot if you don’t want to, but like, you could put that with a littledressing that kind of calls it out, so.Yep. Um,[00:42:00]okay, let me, let’s do this for a second. Let’s take this marketing because I think we, there’s thebig market, bigger market there. It’s a lot of the users. When I think about creating a blog post,I’m thinking about organic search traffic primarily. Um, But so that it gets placed in the searchengine, uh, it gets ranked and then traffic comes to that page.When they get on page, then I want them to do something. This is where, you know, Optummonitor or popup thing is like compelling because it’s, you get attention, like offer free offerinside, right?Corey Maass: Kind of thing. Yeah. It turns, it turns passive into, uh, there’s ac there’ssomething’s actionable. Yeah. So it’s not, don’t just consume, like, and so this is where you’vegot, uh, share these, bookmark these, you know, it’s like, so I’m reading somebody’s article andyet I get a popup that says, [00:43:00] want more great content like this?Sign up. Want an ebook of related content? Sign up. Um, here, share buttons. Please share thison, you know, if you got value out of this, share this on Twitter. Um, email it to a friend. Um, butthinking in terms of, yeah, images, um, so, you know, if we’re just talking content, written words,then, um, my, the featured image that you’d see ideally would be stylized, something that fits inwith your site.But if you ask a guest to share this story on Twitter, big pretty image is obviously morecompelling than just a, a headline. Um, but you don’t want to share the featured image becausethe featured image probably doesn’t have, uh, the title of the post. Uh, it might or might not, butit certainly, what I, what I thought you, a brilliant idea you came up with was, [00:44:00] youknow, a featured image with a, or, or a shareable image, which is the featured includes thefeatured image, the title of the post, and then one or two.It could be the excerpt, it could be one or two bullet points, but, so it’s like if I go to share, if Iread an article, You know, and it has a pretty image of a, some sunset and it says, best placesto retirement, retire to, okay. But if I’m sharing an image on Twitter, the image that I share shouldsay the best places to retire to should have the sunset in the background.And then, you know, a, a tag, an excerpt that says the results will blow you away. Total click bait.Or, you know, the top, you know, should say the top five, Hawaii, Alaska, blah, blah, blah. Youknow, click to read the rest of ’em, kind of thing. So then it’s, it’s, um, you know, and that’sdifferent from the featured image and that’s different from, that’s the type of thing you’d run over\nto Canva and, and generate and, and maybe [00:45:00] generate in a number of different sizesand shapes to then push, you know, drag into buffer or whatever you use to schedule yoursocials or to broadcast your socials.I definitely wanna make sure we don’t get into that realm. Um, Because interacting with all thoseAPIs is a nightmare, and there’s a hundred of those tools already. But, um, oh, and, um, Yost, shuh, the OG image, uh, is the other one. So again, if an image that’s different from you’ve gotyour featured image, you go and you, you pa paste the URL into Twitter or into Slack, and youget that little preview card, that’s your open graph image.Twitter now has Twitter cards, which is their version. And so again, having different, differentversions generated for all of these things. And some of this I think we can do even behind thescenes, which I think will be really, really neat. And then some of this I think could be, and thenit’s like, [00:46:00] so maybe that’s where, you know, we’re, we’re, we haven’t yet talked about.I mean, we’re not, we’re not ready yet to talk about business models and that kind of thing, buthypothetically, a. Beginner version that just does a couple of the basic things. Here’s ashareable image. Um, or here’s the, the open graph image for every post, every productautomatically generated, done. Um, and that’s not necessar.That’s maybe something that people can set and forget kind of thing. But then we’re also talkingabout, in my mind at least, we’re talking about something that approaches more of a Canva kindof functionality for marketers. So it’s like, yes, the, the basics are covered, the incoming stuff iscovered, or the quick share, uh, in Slack preview is covered.Um, but then talking about, you know, saying, okay, now I need the list of assets that I’ve[00:47:00] predefined, I wanna slide for, um, you know, for social medias. Cuz it’s like, and ifyou. If you’re doing it right, air quotes, right? You are not posting about a, a blog post once youare not, uh, putting an image into or putting a product into woo commerce, tweeting about itonce and then hoping that it sells a gajillion, you are again, creating a campaign that says, okay,you know, over the next six months, tweet about this every couple of days, every then, everyfew days in it, every once a week.And you sort of, you might peter off, but there’s this arc and you want those images to bepotentially to be different every time. And so it’s like, could you generate a bunch of images thatthen get cued, um, you know, on all different platforms. And so it’s like potentially you’re talkingabout, um, oh, I think the other neat thing that you mentioned in a previous conversation waslike, Answer a few questions, [00:48:00] right?So it’s like word w WordPress is already gonna ask you for an excerpt fine. But it’s like, what arethree bullet points? What are two or three quotes? And then if it auto-generated a whole bunchof images that had the quotes, that had the, um, oh, you know what, uh, uh, what’s analogous?Like there’s, um, what’s it called?Um, I have a book marked, um, avatar Image. Photo.Cory Miller: Oh, yeah. Avatars.Corey Maass: So there’s, um, yeah. Avatars. And so basically kind of creating little avatarimages for, um,Cory Miller: I mean, profile cards, you know, like, right.Corey Maass: So yeah. So p fp maker.com. P fp maker mm-hmm. Profile pick maker. Is whatit’s short for, right? But you upload a photo of yourself, it, it [00:49:00] strips the background out,and then it, and then it just delivers you a page full of avatars.So it’s your photo over and over again, but all these different funky backgrounds. And so youscroll through them and you’re like, Ooh, I like that one. I like that one. I like that one. Um, Ithink, yeah, go to my Twitter account and you’ll see one, and I use this to just like, I go, I uploadthis to, we’ve looked at the, um, sticker mule background remover kind of thing.Um, and I think there’s, remove.bg was one that I just found recently. That’s a great r l. But soit’s like you create an image, you take an image of yourself, you use a tool to strip thebackground, and then you upload it here. And now you’ve got, you know, a dozen or two orthree dozen different backgrounds and they’ve got ones with palm trees and the Eiffel Tower,which is fun, right?But so picturing like, You know, you write a blog post, you create a new Woo commerce product,you go, you, you hit publish. And, and then, you know, our plugin essentially says, okay,[00:50:00] you’re ready to create marketing assets. Um, what do you want to create today?\nTwitter, Instagram, you know, and then, great, what’s, what’s the headline, which we can auto,auto pull.Um, what’s the excerpt? We, again, we can auto pull, um, featured image to start with, right?But maybe you wanna upload other ones. Um, what are three bullet points? What are some pullquotes? What are some benefi, you know, we can sort of customize a questionnaire that says,fill these in, generate. And then now you’ve got essentially a matrix that’s like, you know, animage for Twitter, an image for Facebook, an image for do, do, do, do.And going across. You’ve got quote, quote, Bullet point, bullet point, bullet point, style, style,style, um, you know, light mode, dark mode, play with fonts kind of thing. Um mm-hmm. Youknow, and it, and so you suddenly, you’ve got a catalog of generated relevant images designedto go on a bunch of different platforms and you’d [00:51:00] go, okay, yep, this one works.This one works, this one’s silly. Ignore it, you know, whatever. Um, butCory Miller: so in, yeah, so in this, um, I went to the ChatGPT my researcher Yep. And, um,image SEO came out and I was like, okay, if I’m embodying, um, I’m trying to do this, I’mpublishing site content in order to get ranked in Google. And you get on here, if you’ve done allthe work to do an SEO o keyword blog post, you’re using WordPress.Great platform to do that. You go what was be one extra while you’re already there to get a littlebit extra stuff. Mm-hmm. And this Image SEO thing popped up in the list that I asked. Mm-hmm.And it’s kind of compelling. Um,and I read something just a second ago, uh, and I checked out your profile maker too. That’ssuper cool. [00:52:00] Um, half of all Google searches end on the searcher. So wait, I’m sorry. Ithought I was saying how, how big SEO image SEO is, but we’re kind of saying that with thesocial images too, is you’ve got this thing, there’s ways you can distribute your content in a wayout to the different platforms.But I go Google too. Like I image should be, if we land on this should be a part of thisconversation. Mm-hmm. Because then you’re going, okay, ex. I mean, what if you could takeyour blog posts, they get all this traffic and increase it by 10%? That’s a headline. Wow. Or the,the product. So, you know, well, like you talked about e-commerce, um, what if there’s a way togenerate, easily an image that could be feature post featured image post or [00:53:00]something in, in the thing.But it also gets some SEO ranking when they’re going, and I don’t, I don’t do this myself, but,um, I don’t look for images in Google necessarily, but it just compelling to kind explore that. Doyou? Okay. Yeah.Corey Maass: Like we talked about, I think, I think it would be really interesting to know, like, I, Imake the assumption that Google looks at images more than alt tag, title tag.Like, I think we’re to the point. I, I, I.Safe assumption, I don’t know. Um, but I assume that Google can, if they look at a blog post,they look at the image, they read the alag, but then they actually parse the image and say, yes,this is in fact an image of a sunset when we’re talking about places to vacation. I don’t know ifthat’s true. I’d love to find out if that’s [00:54:00] true.But it’s like, so if you have an image that has words on it, I mean, at this point when I open animage with words on it in, you know, Mac preview or Microsoft Paint, the words are editable. Sothe, uh, algorithm for parsing text in an image is so commonplace now that it’s built into the, thefree image editor on, on Mac Os.So I have to assume that it’s that pervasive everywhere. So, Um, you know, so is there a, anSEO benefit to having words in an image that then gets shared? Um mm-hmm. Or no?Cory Miller: Well, I mean, I would go, if you’re gonna post an image, you know, your tourism,your e-commerce shop, you’re, why not? You’ve already got the images there.Yeah. Um, you should be doing some image sto. I mean, that’s just easy, you know, a little bitmore effort and you’re able to, [00:55:00] I don’t know, cast a net water, but I go, if you’re gonnapost, uh, I don’t know, air compressors in somebody’s trying to find, you know, whatever thereason they might be looking for that.But you post a picture of the image compressor, that’s one thing. But I’ve seen more images toocome up where it’s like, put a little bit of text on there or it branded, you know, or I don’t know. Ilike that mindset of going, how do we help them get a little bit more. Um, reach from somethingthey’re probably already doing.\nCorey Maass: Um, right. I googled how to do image seo and one of the results that came up,so the first sponsored post, uh, is the, the image next to it is dude on laptop. The, the imageadds nothing to the headline, how to optimize images for websites. And [00:56:00] there’s apicture of a dude with a, with a laptop, no value, no context, like if that image came outtacontext, there’s nothing there.Scroll down, um, to another one. 10 steps to optimize images for seo, and next to it is a cardthat has. People, you know, a little graphic of people. Awesome. But it’s in, in text, even thoughthe image is this big in text that almost fills the card. It has the same headline, 10 steps tooptimize images for seo.And there’s a little logo of the website that it’s on, and if I click on it and it gets bigger, there’s thesubtitle that’s like, you know, who’s who. It’s by when it was posted. Um, you know, and it’s likeright there. That’s the image that we’re talking, we’re talking about generating, but somebodyhad to go in and create that card.Well, so I figure if, if, if the, if the third result for searching for Google for [00:57:00] Image SEOis an article about optimizing images for seo, and they include an image that has words on it.You know, and, and like, I mean, we we’re talking about Google, you know, the, the automation,the bots, the algorithms, the, you know, the ai, whatever. But I mean, the obvious benefit is ofjust human stuff is obvious. Like putting something on Twitter, an image that has words ratherthan an image of just a dude on a laptop.Yeah. Obvi, you know, obvious value, but, well, but we do, I thought about Pinterest.Cory Miller: Mm-hmm. Yep. Oh yeah. It’s, I forget about it all the time, but I mean, there’s somany that go, like, it’s a pin and you’re looking for stuff and mm-hmm. You know, taking, it’s away to get a tra traffic back to your post about it.Well put enough detail that entices them to come over. Yep. Um, okay. I wanna get back to[00:58:00] this. Okay. I’m, I’m doing a post and, and may, maybe there’s others, but I think aboutjust. I spent my career with the organic SEO content, um, and I get somebody to the site, andthat’s the first part of the big, the whole process, just getting someone to the site.Um, it talked about like popups help you, you know, do that. Mm-hmm. There’s inbound content,like now that we have patterns within Gutenberg, code editor, block editor, like insertingsomething called a action within that. Um, my traditional has been get ’em on the site and givethem some offer that fills irresistible discount, ebook, lead magnet, you know, opt into thenewsletter thing.Corey Maass: Yep.[00:59:00]And I’m, and I, what I’m thinking is, Sim similar to our previous conversations. You know, it’sgonna take a handful of conversations to continue to unearth all of these possibilities, right?This list, which already is 10 points long, is gonna be a lot longer. And so I want someconfirmation, like there’s, there’s an, to me, there’s an obvious benefit of like what I justdescribed.I’m seeing a card, a text on it that somebody had to generate. Do we, can we confirm that youraverage team of one a person who’s blogging, um, recipe, ooh, recipe cards, um, do they.[01:00:00] More of these images generated and or are they already trying to generate theseimages? Are they, you know, is, is the average, um, person, you know, a team of one or two,um, who’s got a, a YouTube vlog or a recipe blog or whatever.Are they posting their article with the recipe? And then what are the next steps they take? Like,that’s the broad question. Do they then go generate images to then put on socials and how dothey schedule, you know, all that stuff? What are the images that they actually care about? Um,to me the, the gut assumption is there are enough people doing something as a next step.And so I’m inclined to. Um, again, get to a point where I’ve essentially solved a problem forgenerating something. And to me, I’m, I’m, I have no problem solving this for me [01:01:00] andyou to start with. Mm-hmm. Um, where I’m generating my images from my music blog, I’mgenerating a couple of basic templates for Instagram, whatever, me as a musician to promote.Um, again, I’m looking at my clients like, what do they need? So a basic Twitter image with aheadline that has a logo on it. Um, and then for you, the post status, um, banners make, how dowe make them all look the same? So again, a logo and, you know, if, if these are all, um, I thinkwhat we looked at, right? Were profiles of people.So it’s upload a picture of the person, post status logo on the left, maybe their name and, um,you know, and, and something from the, you know, and, and then. And then it’s, it’s, to me, it’s,\nit’s up to, again, we’re looking for feedback and or you doing some interviews to find out like,yes, everybody, everybody wants Twitter, Instagram, Facebook, [01:02:00] LinkedIn, like theobvious socials.Um, or yes, people desperately wish that there were slides. Like, I love your interest in slides,but you’re the only person I’ve ever heard of that says that. Um, which doesn’t dismiss it. It justmeans like, that’s not the circle I’m in, right? So, um, yeah, that’s, to me, that’s not something wewant to generate first, but go find me 10 people that are gonna find that interesting.Or if I get you to a point where you can sit down and generate pro templates yourself, you’ll belike, cool, let me go build a slide one, because that’s what I want. And then, and then cuz it’s likeonce, it’s kind of like Canva, like, you know, that they have somebody on staff whose job it is tojust crank out templates mm-hmm.To solve all these little problems. Oh, whoops. We don’t have one for podcasts. Great. 3000 by\n\nGo, go generate that. Oh, there you go. Podcast. Um, yeah. Add that to your list. Um, orwe don’t, you know, [01:03:00] people are posting record their, their new album on, onBandcamp. What, how do you know an image generator for Bandcamp that I’m talking aboutback to Canva?It’s like they, because they’re going, they’re going inch deep, mile wide, you know. Yeah. Sothey, they want one of everything, but there’s, you know, and for them, there’s s e o value, like,you know, there’s a landing page for every single template they have. Because that wayanybody who’s googling for anything, you know, album cover template, they’re, they’re hoping topop up.Mm-hmm. We’ll get there once we have the delivery system for templates, essentially. Um, andI’m not saying we necessarily want to, like, we don’t wanna start there, like let’s find some clearanswers of, of what templates to build first, what, what problems to solve first.Cory Miller: I, I’m still, uh, still so compelled by the slide content and I put in the crazy ideascolumn Here is, uh, LinkedIn [01:04:00] slide content.So the AJ told me about, find this link for you. Um, this service, it’s like a LinkedIn. You’ve seenthis on Instagram too. Um, I’ll find it. It’s a LinkedIn image carousel creator. You put your tweet inand it’ll give you the, the slide content. Oh, Uhhuh. You know, when I tested that on LinkedInseveral years ago, my slide content got way more views than anything else I was doing.And, uh, so I think even like for LinkedIn, um, you think about it, it’s like busy professionals usedto a common language of slides. Yep. Uh, and then being able to quickly get the informationwithout having to go through 1500 words. Yep. It’s still compelling to me.Corey Maass: Um, well, and, and a, a neat coincidence, right?I was like everybody else, I’m looking at, um, Twitter threads [01:05:00] about chat g p tprompts. Um, or you know, what, what are 10 neat things that have happened in the 48 hourssince they released ChatGPT four, um, you know, people have generated re had it generate aworking version of pong, uh, in 60 seconds. I’d mean ridiculous things.But one of the things that I saw was that I, that I was like, oh, this is actually relevant to theworld. Um, other than recreating pong, um, Is somebody dumped in an article and said, make,make 10 slides. And it did. And I, yeah, they’re not styled or anything, but it’s just, here are thebullet points that you’d wanna put on each.So it’s like, uh, you know, have this talk to AI that then gen, you know, write a blog post, click abutton, chat, g p t or some other AI generates the slide content. We generate the slide images.Yeah. Yeah. Holy crap.Cory Miller: Yeah. On that [01:06:00] link too for you.Corey Maass: Um, okay, so we’re over an hour. Where do we go? What’s next? How do westart?What do you wanna do? What are you gonna do today? Um, what do you want me to do? Whoare we gonna talk to? How are we gonna get clients? I think,Cory Miller: I think, um, one area to explore is, um, talking to content journey. Seeing the outputof what they’re doing, asking about the problems and challenges they have in that process fortheir clients.Um, I just forgot, I think there’s an opportunity here to potentially innovate in this of here’s howthis is going, here’s how people do, what is the way to help you stand out? Hmm. So thestandout, and that’s why I say innovate, not just helping cure the workflow issue, but I think[01:07:00] one thing I wanna really explore this time is can we innovate with something?\n\nThat’s where I think the slide content, you know, whether it’s a valid thing or not, is in that realmof they’re doing something. What’s way, one way that could help that content stand out evenmore. It, it includes social images, it includes STO image, SEO and stuff like that. Um, I waslike, Lindsay has a mental health treatment center client.And, and that’s probably one of their best case studies because they took a, aside from, youknow, rarely getting any content to, uh, tenant, I mean considerable. And it drove a lot ofbusiness for ’em. And, uh, you think about it, like I, I, I remember talking to him cuz I did someconsulting with them, with the client and they’re trying to find images.That’s another issue we’ve talked about, but it’s out, that’s out there. It’s for somebody else’ssaw potentially. But you go, if they’re doing the image, what’s something that could help thatstand out? And it’s maybe a pull quote. [01:08:00] Mm-hmm. You know, from it or something likethat. That’s where I want to dig in is, um, I’ll talk to Emily over there.Um, And, uh, ask some of that. They’ve got another service called my marketing assistant too.And I’ll ask, what are some of the anonymized, um, client requests they get? Yeah, sure. Theydo have a podcaster in their beta program. Um, prolific podcaster who uses a lot of thedistributed media. Um, like I think he probably uses his website as the base, but, um, a lot of therequests he’s getting is, you know, create the thumbnails for those things that they do, use thosetools that we talked about.But, uh, I think one thing that might give us an edge on this is just like creating a new standardwhere everybody’s going like, whoa, whoa, how’d they do that? I want that too. Like I was tellingyou about the Casto little tip box and stuff. [01:09:00] Um, so that’s what I would like to explorein this and then just understand their process a little bit better.And what would be something that doesn’t take a lot of time. But then enhances uh, the contentand makes it stand out a little bit more. And I mean, it could be that whole call to action thing,you know? Um, like a, being able to stylize some, you know, for the treatment center it’s call us.Cuz if they call, if someone calls the treatment center, they can really help them and understandwhat the right fit is and all that kinda stuff.So their call to action is, you know, I think it still is the case, but if they get a phone call, that’sgreat. That’s where they want to be. And then that turns over their sales operation. I’m trying tothink of another client. Um, there’s a lot of b2b, so, um, B2B there too. That seems like[01:10:00] another area where maybe big companies have innovated with the B2B space.Let me put that in here cause I don’t want to drop this. Like, I have a friend that has amanufacturing company. He does the air condit, the cooling compressor stuff. He remanufacturethem. And, uh, I mean, there’s a space with people with money, um, and it’s business money.They go, oh, if it helps increase whatever their KPI is.I mean, that’s, that’s pretty big.Corey Maass: Yeah. And I’ve got, I was just pinging, um, people within my client teams of like,okay, who generates social media content so that I can line up an interview, talk to them about,okay, what’s your process? Um, and I, and what’s kind of neat is, is again, I’ve got. It’stechnically the same, same [01:11:00] client, but I’ve got two websites, two teams that approachthings very differently.One is, um, a lot more tech savvy and a lot more, um, trendy or, or, you know, they are active onTikTok. We are advertising on TikTok, stuff like that. And the other one is, is a fairly traditionalnews content magazine. Um, and, uh, with, and the, and the team is a lot less technical and we,and we don’t need to be nearly as cutting edge or edge or trendy.Um, and so I’m, I’ve kind of got a young hip social media marketer wizard, and then I’ve also gotpeople that are like, I write the article and then I go put it on Twitter. Um, and, and so I can kindof see how, how two of these very different approaches go about solving more or less the sameproblem. Yeah.Cory Miller: And that featured image summary card type thing I think is still [01:12:00] reallycompelling. I’m gonna highlight that. Where’s that? Yeah, I,Corey Maass: I, that’s a very quick, easy win for anybody, not for us specifically. It’s like makeyour featured image more compelling and, and much more valuable when shared.Cory Miller: And because again, you know, look at outputs for that, you go, well that’s aPinterest thing. I mean, maybe that doesn’t get pinned, but it’s a social card. It could havepossibilities for the Pinterest stuff. It’s a visual thing that en might entice someone to go, oh,that’s interesting. Um, and that stuff like to just do that pull image from post add overlay of.\nThere you go. Print, you know, I mean, as simple as that with the brand logo. Yep. Dacon orsomething like that. Yep,Corey Maass: yep. [01:13:00] Okay. Yeah. And there’s, and there’s, yeah, and there’s, there’s acouple of plugins out there that do something that touch on that. Um, and I’ve, I messed aroundwith one, not the other of the two that I know of, but they, they were, at least at the time, were,were limited to generating, um, an open graph image.I was like, generate image, paste it into Slack, you see the image. And I, and I was like, great,but I, where do I write? Click Save as so that I can go post it to Twitter. Mm-hmm. It’s like, oh,you know, it’s, you know, it’s, it’s just in, it’s in your media library. It’s like, okay, well, And thenalso what about all these other solutions or other scenarios?Um, for me, I was just originally thinking the big socials, Twitter, Facebook, Instagram,Instagram. The big difference being 16, nine or square. But now we’re talking about, it’s like,yeah, either easy ways to generate multiple variations and [01:14:00] stuff. It’s like this could goa lot, a lot further. Um, so, but it’s, but I definitely, you know, there’s to talk about, you know,people talk about competition.It’s like, oh, the competition is Photoshop, Canva, um, nothing, nothing is always a, acompetitor. Um, you know, but also I, you know, there are other WordPress plugins that dotouch on this, so we’ll have to do a little research there too.Cory Miller: Yeah, like the nothing part is me. Um, I created a blog post and then it’d beprobably nice to have some visual.Icon, thumbnail featured image that, um, highlight some points in there, but, um, okay. That’ll be,mine is exploring that with, uh, I’ll start with Emily cause she’s doing a lot of the team interface,[01:15:00] cl team, client interface stuff. She seemed a pretty good volume of work. I like themarketing angle. How do we, cuz that could go across any of these potential avatars if we’rehelping them do better marketing, um, redistribution, that’s the social images of seo, all that kindof stuff.Corey Maass: Yeah. Um, well, and um, again, I,I wanna say I put my foot down cuz I think that’s a hilarious phrase. In a Mad Men 1960shusband sort of way. I don’t make me put my foot down. Um, but I, I, I want to, I very adamantlywanna draw the line at doing the posting or interacting with the socials. Um, other than like, wecan have a button that says, post this to Twitter and it just links, you know, we’ll throw you overthere kind of thing.Cuz I’ve actually even, I [01:16:00] built a plugin at one point that you could queue up tweets,but it’s like, it worked. But, you know, with all the drama around Twitter, a p i lately, let alone forthe last Yeah. 10 years, like, I don’t want to get into that. But, um, you know, one, one of the, wewere talking about. What are we talking about?We must have been talking about, um, integration points with other tools, um, for Crop Expressanyway, it’s like, so if we generate images and then, and then I, you know, let’s, we can look at,um, auto, you know, if you generate an, an open graph image that Yost automatically picks thatup. Um, so there’s an integration point.Um, I use Buffer to post to mild my socials. Maybe they have an API or an integration point. Soit’s like we can, you know, there’s gonna be a potential for not only generating the images, but atleast getting them to the services that use those images. I don’t wanna become those [01:17:00]services, but you know, there’s, we’ve, we’ve got an opportunity there too.Cory Miller: Yeah. Okay. I put integrations with SEO plugins. Um,That, that questionwhen I talk to Emily, I’ll ask, um, what, what are the common goals that they’re, are they trying topush to a phone number? Are they trying to push to, um, an email list? It’s probably one of thosetwo, I would guess is building the appeal, unless social startCorey Maass: higher up. Do they even, you know, are they thinking that strategically, like, not tosay the agency [01:18:00] isn’t or shouldn’t, but as a client, like if a client comes to ’em as like,we need images for Twitter, like, because everybody else does or because you under, youknow, they understand.It’s the value in including a phone number.Cory Miller: Now I do know, I do know, um, a lot of the clients they work with, and these are notWordPress or tech people, um, social is hot, you know?\nCorey Maass: Sure. Um, social hot, why, I guess, right? Mm-hmm. Cynically, are they doing itbecause everybody tells them to, you know, are there, are there teenage kids telling them, dad,you’ve gotta get your, um, shoe com, you know, your air compressor company on the tos.And dad goes, okay, son, great, I’ll do that. You know, or, or are they measuring? [01:19:00] Youknow, are they like, what, where does our traffic come from? Oh, we sell most of our aircompressors on Twitter, but not, or probably Facebook, but not on Twitter, and we’ve never.Sold anything off of Insta, you know what I mean?Like, I’m curious if, if, if, how companies are thinking about these, what am I trying to say? Weknow in, especially in the context of this conversation, that there’s a potential to turn these patturn to turn passive images into valuable calls to action. Mm-hmm. To actually generate, youknow, it’s like I post an image, I post, I post something on Twitter.It sucks In the featured image. The featured image is, you know, a pretty sunset. It, it might drawa human’s attention, but that’s very different than again the card. Uh, the [01:20:00] s e o cardthat I saw here, that’s like words that are also drawing me in to like a phone number. So it’s like,wow, I don’t even have to click through.To, uh, to find out a phone number. I’m just dialing eight eighty eight, et cetera. Mm-hmm. So it’slike there’s, I, I’m curious how people are thinking about it, if they’re thinking about it, because ifnot, like there’s great opportunity to ask for us to do education, um mm-hmm. And, or cuz it’slike, we’ve, we’ve talked about, this is the first time you’ve mentioned phone numbers.Um, so it’s like, you know, our, our default is like, oh, this is gonna go on Twitter and it’s gonnalook pretty, it’s gonna be the title of the post. Um, you know, with bullet points. It’s a tldr, but likewhat you just said I think is amazing of like, imagine if for a small business, if it included thephone number, the logo, and the phone number.So it’s like nobody ever, or the address, right? Mm-hmm. So people don’t see it on Facebook orsee it on Twitter and they don’t even have to click through.Cory Miller: [01:21:00] Mm-hmm. Then it’s an ad, right? Like, Retail shop coming up withsomething, they’ve got an event, a coupon or something that could, they’re posting on theirwebsite, so it’s RSVPs and then having a card that they could just easily go export or, you know,save or whatever it is, and then they can go post that.Corey Maass: How is the, we have a, a pie shop in town. How are they generating the imagefor their daily specials? Are they going into Canva every day?Yep. The sandwich shop, the, you know, all the food trucks that are posting their location, andthis is taking it way out of the context of a post.[01:22:00]Which is where something like Canva makes more sense. Like people are doing it, generatingan image unto itself. Right. My friend, um, Mike has the epic food truck that makes unbelievablebrisket and meat filled happiness, um, out of his food truck. Um, so he has to consistently postwhere he’s at, what are today’s specials, and this is, and I’ll post them on the local Facebookgroups and people go running us too.So I’m like, okay, I should ask him how he’s generating and I need to think back. It’s like, is hegenerating images? Is he upload? I kind of feel like he’s uploading the same logo every timeand then writing the content, but, and so is there value in all of the content being on the image?I don’t know. I have to think about that.I’m sure you’d wanna include the words [01:23:00] too, but, right. Yeah. I might have aconversation with him.Cory Miller: Yeah, I think that’d be great. Um, I’ll do one with, uh, Emily, see where that goes.And then I, I just shared the, uh, this whiteboard with you in Slack. Great. I have a friend.Thanks so much. This is, uh, this is good stuff.Okay. So I got my marching orders to talk to Emily about that, see what they’re doing, see ifthere’s ideas to like, drive the conversions that they need for post, explore some of the eBookstoo. I put course up here cause I think that’s another thing. Yep. But, um, yeah, I was thinkingthat too.Corey Maass: Okay. Um, yeah, and I think I’m gonna talk to, I’ve got one or two people to talkto.Um, and I think, I think I will try to, I, well, I, like I said earlier, like I do want to. Make sure thatI’m wrapping up Crop express properly. [01:24:00] Um, but then, you know, out of sheerexcitement, I imagine I’ll reopen the, the plugin that I’d started to build and see if I can get itworking enough to send it to you.\nOkay, cool. All right.Cory Miller: Thanks dude. Talk to you soon. I’ll be talking to you. Okay.\n\n\n\n\n\n\t\t\tPost Tags:\t\t\n#Accessibility#ACF#Adobe#Agency#Agency Owners#Altis DXP#Apple#Automattic#B2B#Black Friday#Block Editor#Blocks#Blogging#Bob Dunn#Burnout#Chris Coyier#Clarity#Cloudways#CMS#community#Content#Cory Miller#CSS#CSS-Tricks#Cyber Monday#Dan Knauss#Digital Ocean#Discussion#Documentation#DXP#Elementary#Email#Enterprise#Extension#Featured Image#Figma#Founders#Freelance#Freemius#GitHub#GoDaddy#Gravity Forms#Gutenberg#Headless#Health#Hiring#Hosting#HTML#huddles#Human Made#Iconic#Illustrator#Inclusion#Integrations#Interviews#JavaScript#Jetpack#Jobs#JSON#LMS#Magento#maintenance#Marketing#Matt Cromwell#Matt Mullenweg#Membership#Mental Health#Migrate#Mobile#MOZ#Multisite#Nathan Ingram#New York Times#Newsletter#Nexcess#Ninja Forms#Page Builder#Pagely#Partnerships#Performance#Perspectives#PHP#Plugins#Pressable#Publishing#React#SaaS#Scale#SEO#Shopify#Sketch#Square#Static#Testing#Themes#TikTok#tutorials#UX#WebP#WooCommerce#WordCamp#WordPress VIP#WordPress.org#WP Engine#WPEngine#www.youtube.com#Yoast \n\n\n\n\n\nPost navigation\nPrevious\nPreviousJesse Friedman on raising the WP hosting standard across the industry with WP.cloud-Post Status DraftNextContinue\nWP Feature Notifications • Prioritizing Performance Benefits • DevBlog updates\n\n\n\n\n\nSimilar Posts \n\n\n\n\n\n\n \n\n\n\n\n\nBusiness | The Week in Review | WooCommerce | WordPress News \n\nWoo Snippet: Help Test Custom Table Migrations\nByBob Dunn \nMay 20, 2022May 22, 2022 \n\n\n\nCan you help test migrations of  WooCommerce’s new custom tables? Easy fund transfers for all Singaporeans — and WooCommerce.\n\n\n\n\n\n\t\t\t\tRead More Woo Snippet: Help Test Custom Table MigrationsContinue\n \n\n\n\n\n\n\n\n\n\nI like Ryan Sullivan’s post on…\nByBrian Krogsgard \nMarch 20, 2017March 20, 2017 \n\n\n\nI like Ryan Sullivan’s post on how WP Site Care is managing to put on a really awesome company retreat without throwing down a ridiculous amount of money. Hosting the meetup in a nice place, but off-season, is one of several great tips.\n\n\n\n\n\n\t\t\t\tRead More I like Ryan Sullivan’s post on…Continue\n \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nMake WordPress | Planet | The Week in Review | WordPress Community | WordPress News \n\nThis Week at WordPress.org (May 1, 2022)\nByCourtney Robertson \nMay 4, 2022May 6, 2022 \n\n\n\nIt’s the latest news from WordPress.org’s core teams you don’t want to miss. New Five for the Future section this week! \n\n\n\n\n\n\t\t\t\tRead More This Week at WordPress.org (May 1, 2022)Continue\n \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nDesign | Hosting | Planet | The Week in Review | WordPress News \n\nWordPress Podcast and Video Picks for the Week of April 25\nByDavid Bisset \nApril 28, 2022July 21, 2022 \n\n\n\nChima Mmeje on valuing yourself and raising your rates. Making the most of your WordCamp experience. The importance of community. What’s the “WordPress Way” for payment models — and is it the right way?   \n\n\n\n\n\n\t\t\t\tRead More WordPress Podcast and Video Picks for the Week of April 25Continue\n \n\n\n\n\n\n\n\n\n\nWP Rocket shared some good SEO…\nByDan Knauss \nMay 14, 2021 \n\n\n\nWP Rocket shared some good SEO tips and best practices to get ready for Google‘s Page Experience Update and Core Web Vitals. 🔍\n\n\n\n\n\n\t\t\t\tRead More WP Rocket shared some good SEO…Continue\n \n\n\n\n\n\n\n\n\n\nBob Dunn has announced the launch…\nByDan Knauss \nOctober 9, 2020 \n\n\n\nBob Dunn has announced the launch of DotheWoo.io, a website to connect the WooCommerce builder community: “I believe that there is a need for a central location to help connect those who build WooCommerce sites, products and services. These people are the ones that drive the community and can benefit from being connected through insights,…\n\n\n\n\n\n\t\t\t\tRead More Bob Dunn has announced the launch…Continue\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment *Name *\nEmail *\nWebsite\n Save my name, email, and website in this browser for the next time I comment.\n \n\nΔ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\n\n\n\n\n\nPost Status is proudly supported by great partners\nPagelyGravity FormsElementorA2 HostingPressable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\nTwitter\nYouTube\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© Post Status, 2023 | Made with WordPress | Privacy Policy | Website Terms\n \n\n\n\n\n\n\n\n\n\n\nScroll to top\nScroll to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAboutExpand child menuExpand\n\n\nOur Vision\nGive, Grow, Together\nPost Status Swag\n\n\nJobsExpand child menuExpand\n\n\nCurrent Listings\nJob Seekers & Employers\nGet Hired Newsletter\n\n\nNews\nMembersExpand child menuExpand\n\n\nAgency Members\nProduct Members\nHosting Partners\n\n\nContactExpand child menuExpand\n\n\nAsk a Question\nShare your News\n\n\nJoinExpand child menuExpand\n\n\nFor Individual Professionals\nFor Agency Owners\nFor Product Founders\nOur Partner Program\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu Close\n \n\n\n\n\nSearch for:\n\n\n\nSearch\n \n\n\n",
    "links": [
        "#main",
        "https://poststatus.com/",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner",
        "https://poststatus.com/login",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/",
        "https://poststatus.com/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/podcast/draft/",
        "https://corymiller.com",
        "https://corymiller.com",
        "https://poststatus.com/wordpress/business/",
        "https://poststatus.com/podcast/draft/",
        "https://poststatus.com/podcast/draft/launching-a-wordpress-product-in-public/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/podcast/",
        "https://poststatus.com/wordpress/business/wp-products/",
        "https://twitter.com/coreymaass",
        "https://twitter.com/corymiller303",
        "https://crop.express/",
        "#h-transcript",
        "https://twitter.com/corymiller303",
        "https://twitter.com/coreymaass",
        "https://crop.express/",
        "https://jetpack.com/",
        "https://automattic.com/",
        "https://woocommerce.com/",
        "https://twitter.com/photomatt",
        "https://twitter.com/chriscoyier",
        "https://css-tricks.com/",
        "https://codepen.io/",
        "https://yoast.com/",
        "https://wpengine.com/",
        "https://github.com/",
        "https://www.atlassian.com/",
        "https://trello.com/",
        "https://asana.com/id",
        "https://basecamp.com/",
        "https://zapier.com/",
        "https://www.dropbox.com/",
        "https://www.zoom.us/",
        "https://www.notion.so/",
        "https://www.figma.com/",
        "https://www.sketch.com/",
        "https://www.invisionapp.com/",
        "https://twitter.com/coreymaass",
        "https://twitter.com/corymiller303",
        "https://twitter.com/post_status",
        "https://twitter.com/lemonadecode",
        "https://twitter.com/post_status",
        "https://poststatus.com/category/post-status-podcasts/",
        "https://itunes.apple.com/us/podcast/post-status-draft-wordpress/id976403008",
        "https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5zaW1wbGVjYXN0LmNvbS8ySkU5c2M4UA",
        "https://www.youtube.com/c/PostStatus",
        "http://www.stitcher.com/podcast/krogsgard/post-status-draft-wordpress-podcast",
        "https://wordpress-post-status-draft-podcast.simplecast.com/",
        "https://feeds.simplecast.com/2JE9sc8P",
        "https://poststatus.com/tag/accessibility/",
        "https://poststatus.com/tag/acf/",
        "https://poststatus.com/tag/adobe/",
        "https://poststatus.com/tag/agency/",
        "https://poststatus.com/tag/agency-owners/",
        "https://poststatus.com/tag/altis-dxp/",
        "https://poststatus.com/tag/apple/",
        "https://poststatus.com/tag/automattic/",
        "https://poststatus.com/tag/b2b/",
        "https://poststatus.com/tag/black-friday/",
        "https://poststatus.com/tag/block-editor/",
        "https://poststatus.com/tag/blocks/",
        "https://poststatus.com/tag/blogging/",
        "https://poststatus.com/tag/bob-dunn/",
        "https://poststatus.com/tag/burnout/",
        "https://poststatus.com/tag/chris-coyier/",
        "https://poststatus.com/tag/clarity/",
        "https://poststatus.com/tag/cloudways/",
        "https://poststatus.com/tag/cms/",
        "https://poststatus.com/tag/community/",
        "https://poststatus.com/tag/content/",
        "https://poststatus.com/tag/cory-miller/",
        "https://poststatus.com/tag/css/",
        "https://poststatus.com/tag/css-tricks/",
        "https://poststatus.com/tag/cyber-monday/",
        "https://poststatus.com/tag/dan-knauss/",
        "https://poststatus.com/tag/digital-ocean/",
        "https://poststatus.com/tag/discussion/",
        "https://poststatus.com/tag/documentation/",
        "https://poststatus.com/tag/dxp/",
        "https://poststatus.com/tag/elementary/",
        "https://poststatus.com/tag/email/",
        "https://poststatus.com/tag/enterprise/",
        "https://poststatus.com/tag/extensions/",
        "https://poststatus.com/tag/featured-images/",
        "https://poststatus.com/tag/figma/",
        "https://poststatus.com/tag/founders/",
        "https://poststatus.com/tag/freelance/",
        "https://poststatus.com/tag/freemius/",
        "https://poststatus.com/tag/github/",
        "https://poststatus.com/tag/godaddy/",
        "https://poststatus.com/tag/gravity-forms/",
        "https://poststatus.com/tag/gutenberg/",
        "https://poststatus.com/tag/headless/",
        "https://poststatus.com/tag/health/",
        "https://poststatus.com/tag/hiring/",
        "https://poststatus.com/tag/hosting/",
        "https://poststatus.com/tag/html/",
        "https://poststatus.com/tag/huddles/",
        "https://poststatus.com/tag/human-made/",
        "https://poststatus.com/tag/iconic/",
        "https://poststatus.com/tag/illustrator/",
        "https://poststatus.com/tag/inclusion/",
        "https://poststatus.com/tag/integrations/",
        "https://poststatus.com/tag/interviews/",
        "https://poststatus.com/tag/javascript/",
        "https://poststatus.com/tag/jetpack/",
        "https://poststatus.com/tag/jobs/",
        "https://poststatus.com/tag/json/",
        "https://poststatus.com/tag/lms/",
        "https://poststatus.com/tag/magento/",
        "https://poststatus.com/tag/maintenance/",
        "https://poststatus.com/tag/marketing/",
        "https://poststatus.com/tag/matt-cromwell/",
        "https://poststatus.com/tag/matt-mullenweg/",
        "https://poststatus.com/tag/membership/",
        "https://poststatus.com/tag/mental-health/",
        "https://poststatus.com/tag/migrate/",
        "https://poststatus.com/tag/mobile/",
        "https://poststatus.com/tag/moz/",
        "https://poststatus.com/tag/multisite/",
        "https://poststatus.com/tag/nathan-ingram/",
        "https://poststatus.com/tag/new-york-times/",
        "https://poststatus.com/tag/newsletter/",
        "https://poststatus.com/tag/nexcess/",
        "https://poststatus.com/tag/ninja-forms/",
        "https://poststatus.com/tag/page-builder/",
        "https://poststatus.com/tag/pagely/",
        "https://poststatus.com/tag/partnerships/",
        "https://poststatus.com/tag/performance/",
        "https://poststatus.com/tag/perspectives/",
        "https://poststatus.com/tag/php/",
        "https://poststatus.com/tag/plugins/",
        "https://poststatus.com/tag/pressable/",
        "https://poststatus.com/tag/publishing/",
        "https://poststatus.com/tag/react/",
        "https://poststatus.com/tag/saas/",
        "https://poststatus.com/tag/scale/",
        "https://poststatus.com/tag/seo/",
        "https://poststatus.com/tag/shopify/",
        "https://poststatus.com/tag/sketch/",
        "https://poststatus.com/tag/square/",
        "https://poststatus.com/tag/static/",
        "https://poststatus.com/tag/testing/",
        "https://poststatus.com/tag/themes/",
        "https://poststatus.com/tag/tiktok/",
        "https://poststatus.com/tag/tutorials/",
        "https://poststatus.com/tag/ux/",
        "https://poststatus.com/tag/webp/",
        "https://poststatus.com/tag/woocommerce/",
        "https://poststatus.com/tag/wordcamp/",
        "https://poststatus.com/tag/wordpress-vip/",
        "https://poststatus.com/tag/wordpress-org/",
        "https://poststatus.com/tag/wp-engine/",
        "https://poststatus.com/tag/wpengine/",
        "https://poststatus.com/tag/www-youtube-com/",
        "https://poststatus.com/tag/yoast/",
        "https://poststatus.com/jesse-friedman-on-raising-the-wp-hosting-standard-across-the-industry-with-wp-cloud-post-status-draft/",
        "https://poststatus.com/wp-feature-notifications-prioritizing-performance-benefits-devblog-updates/",
        "https://poststatus.com/woo-snippet-help-test-custom-table-migrations/",
        "https://poststatus.com/wordpress/business/",
        "https://poststatus.com/wordpress/week-in-review/",
        "https://poststatus.com/wordpress/woocommerce/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/woo-snippet-help-test-custom-table-migrations/",
        "https://bobwp.com/",
        "https://poststatus.com/woo-snippet-help-test-custom-table-migrations/",
        "https://poststatus.com/i-like-ryan-sullivans-post-on/",
        "https://poststatus.com",
        "https://poststatus.com/i-like-ryan-sullivans-post-on/",
        "https://poststatus.com/this-week-at-wordpress-org-may-1-2022/",
        "https://poststatus.com/wordpress/make-wordpress/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/wordpress/week-in-review/",
        "https://poststatus.com/wordpress/community/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/this-week-at-wordpress-org-may-1-2022/",
        "https://poststatus.com/author/courtney/",
        "https://poststatus.com/this-week-at-wordpress-org-may-1-2022/",
        "https://poststatus.com/wordpress-podcast-and-video-picks-for-the-week-of-april-25/",
        "https://poststatus.com/wordpress/tech/design/",
        "https://poststatus.com/wordpress/tech/hosting/",
        "https://poststatus.com/planet/",
        "https://poststatus.com/wordpress/week-in-review/",
        "https://poststatus.com/wordpress/",
        "https://poststatus.com/wordpress-podcast-and-video-picks-for-the-week-of-april-25/",
        "http://www.davidbisset.com",
        "https://poststatus.com/wordpress-podcast-and-video-picks-for-the-week-of-april-25/",
        "https://poststatus.com/wp-rocket-shared-some-good-seo/",
        "http://dan.knauss.ca",
        "https://poststatus.com/wp-rocket-shared-some-good-seo/",
        "https://poststatus.com/bob-dunn-has-announced-the-launch/",
        "http://dan.knauss.ca",
        "https://poststatus.com/bob-dunn-has-announced-the-launch/",
        "/launching-a-wordpress-product-in-public-session-10/#respond",
        "https://akismet.com/privacy/",
        "https://poststat.us/pagely",
        "https://poststat.us/gravity-forms",
        "https://poststat.us/elementor",
        "https://poststat.us/a2-hosting",
        "https://poststat.us/pressable",
        "https://www.facebook.com/poststatusblog",
        "https://twitter.com/post_status",
        "https://www.youtube.com/c/PostStatus",
        "https://poststatus.com/privacy-policy",
        "https://poststatus.com/website-terms",
        "#wrapper",
        "https://poststatus.com/about/",
        "https://poststatus.com/open-web-manifesto/",
        "https://poststatus.com/the-post-status-member-pledge/",
        "https://swag.poststatus.com",
        "https://poststatus.com/jobs/",
        "/jobs/#current-job-listings",
        "https://poststatus.com/get-hired/",
        "/get-hired/#%f0%9f%93%a7-subscribe-to-the-get-hired-newsletter",
        "https://poststatus.com/news/",
        "https://poststatus.com/profiles/",
        "https://poststatus.com/profiles/category/agency/",
        "https://poststatus.com/profiles/category/product/",
        "https://poststatus.com/profiles/category/hosting/",
        "https://poststatus.com/contact/",
        "https://poststatus.com/ask/",
        "https://poststatus.com/share-your-news/",
        "https://poststatus.com/#choose-membership",
        "https://poststatus.com/#Pro+",
        "https://poststatus.com/#Agency",
        "https://poststatus.com/#Founder",
        "https://poststatus.com/#Partner"
    ]
}