{
    "title": "The CSUF Podcast | Podcast on Spotify",
    "body": "The CSUF PodcastCalifornia State University, FullertonFollowWelcome to the CSUF POD, a weekly series in which we give tips, tools, and resources for Titans of all walks of life to achieve greatness. #ItTakesATitanNo ratingAll EpisodesANSWERING YOUR COMMENCEMENT QUESTIONS!Are you class of 2023? If so, we’ve got you covered on this #CSUFPod where we answer your commencement questions! Including regalia information, where to park, and more so you can be ready for your big day!  Apr 2410 min 21 secThe Transfer Experience! CSUF alumna, Savannah Terrazas, shares her experience as a transfer student. Learn about the importance of meeting deadlines and resources on campus that are available for all CSUF Titans! Apr 1716 min 19 secLet's Talk Trash! Talking Trash isn't so simple. #CSUF alumna and Biology major Trina Miller spent her time as undergraduate documenting trash in Southern California intertidal zones. Learn about her research on this week’s #CSUFPod! Apr 1157 min 45 secPlaces to Visit Near CSUF!Welcome back, Titans! Start your week off with this #CSUFPod and learn about the different places to visit around campus! Apr 39 min 43 secCSUF Student Housing Titans who live on-campus call Cal State Fullerton their home away from home. Check out this week's #CSUFPod to dive into the student experience in Housing and Residential Engagement. Mar 2724 min 35 secHow to Advocate for Social JusticeDid you miss out on Social Justice Week? Don't worry Titans, we got you covered! Tune in to this week's #CSUFPod to learn more about the event and activities that took place. Mar 179 min 3 secRaising 270 Million for Student Success! Hey, Titans! Tune in to this week's #CSUFPod to learn how the \"It Takes a Titan: The Campaign for Cal State Fullerton,\" builds futures and delivers a higher education for students. Mar 109 min#TitansGive is Almost Here! Hiya, Titans! Tune in to this week's #CSUFPod to learn how we can bring our community together to raise funds for scholarships, programs, and more!Mar 126 min 3 secCampus Climate Survey Hey, Titans! Have you taken the Campus Climate Survey? Tune in to this week's podcast to get a better understanding of how it can impact you and future Titans. Feb 2411 min 43 secFind Your Community at CSUFHey, Titans! Tune in to hear about what Associate Director for Diversity Initiatives and Resource Centers, Mariham Iskander, has to say about building community! Feb 1745 min 1 secEnglish",
    "links": [
        "/episode/1jpViXOwUL8xmRNhkMRI0k",
        "/episode/1aLrIaALEAWYjq6jAhbVjX",
        "/episode/5yEmJGLv8NXrCdeH6rpHx1",
        "/episode/5Y9XA6bS2otOJzPH9q4ONP",
        "/episode/6IcPUMbfxV2Dd99u7F1zOr",
        "/episode/1779kHUVOt0ovFSLZ9QhdH",
        "/episode/1hUIqLWtR2IE66zfRiuEri",
        "/episode/5kodPDxcbnA10Pmo4ppYgm",
        "/episode/71c8dLLjs07bz6Vs9iIfpT",
        "/episode/3wgbVMCDdXlXsZaTsmrS55"
    ]
}