{
    "title": "ScholarWorks",
    "body": "\n\nSkip to Content\n\n\n\n\n\n\n\nToggle navigation\n\n\n\n\n\n\n\n\n\n\n\n\n Login\n \n\n\n\n\n\n\n\n\n\n\n\nScholarWorks\nScholarship from the California State University on a shared, open platform.\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n Share Your Work\n Terms of Use\n\n\n\n\n\n\n\n\n\n\n\n\nDissertations & Theses\n\n\n\n\n\n\n\n\n\nFaculty Publications\n\n\n\n\n\n\n\n\n\nResearch Datasets\n\n\n\n\n\n\n\n\n\nOpen Educational Resources\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBrowse by campus\n\n\n\n\n\n\n\n\n\n\nBakersfield\nChannel Islands\nChico\nDominguez Hills\nEast Bay\nFresno\nFullerton\nHumboldt\nLong Beach\nLos Angeles\nMaritime\nMonterey Bay\n\n\n\n\nMoss Landing\nNorthridge\nPomona\nSacramento\nSan Bernardino\nSan Diego\nSan Francisco\nSan Jose\nSan Luis Obispo\nSan Marcos\nSonoma\nStanislaus\n\n\n\n\n\n\n\n\n\nWhy upload your work to ScholarWorks?\n\n\n\n\n\n\n\n\nGreater visibility\nFreely share your work alongside CSU peers for a global audience. Increase your readership, citation counts, and impact on your field.\n\n\n\n\n\n\n\n\n\nPersistent URL\nGo ahead and bookmark that link. You and others will always be able to find it again.\n\n\n\n\n\n\n\n\n\nLong-term preservation\nScholarWorks is maintained by experts in the CSU Libraries who are committed to consistent access as systems and standards change over time.\n\n\n\n\n\n\n\n\n\nCheck out\nOur numbers\n\n\n\n107,631\nItems submitted\n\n\n41,011,102\nTotal views\n\n\n9,425,115\nViews last year\n\n\n500\nCollections\n\n\n\n\nWe're currently migrating content from our old system to this new platform. Learn more.\n\n\n\n\n\n\n\n\n\n\n\nRecent submissions\n\n\n\n    Masters Thesis\n\n\nAddressing Self Harm Among Foster Youth\n\n\n\n\n    The purpose of this project was to provide child welfare social workers at San Joaquin County Human Services Agency with a training workshop on how to provide effective case management support for clients exhibiting Non-Suicidal Self Injury. Speci...\n\n\n\n\n    Dissertation\n\n\nThrough the Looking-Glass: The Transformative Evolution of Students Who Experience a Culturally Sustaining Theater Education Program in a Title I School\n\n\n\n\n    Theater education can transport students into a dream world where they are free to explore and find pieces of them that they once might have pushed under the surface. Much like Alice stepping through the looking glass, students step into a play wo...\n\n\n\n\n    Masters Thesis\n\n\nThe Impact of a Plant-Based Diet to Reverse Atherosclerosis in Cardiovascular Patients: A Longitudinal Study\n\n\n\n\n    Cardiovascular disease (CVD) is the most common disease in the world. In 2019, approximately 17.9 million people died from CVD, which accounts for nearly one-third of all deaths (World Health Organization [WHO], 2021). CVD is most often a result o...\n\n\n\n\n    Masters Thesis\n\n\nMachine Learning Paradigm for Comparative Techniques to Classifying Diabetes Data\n\n\n\n\n    Diabetes is a metabolic illness that appears when the body cannot produce enough insulin or utilize it properly. If diabetes is ignored and undiagnosed, numerous complications develop such as heart disease, visual impairment, and kidney failure. T...\n\n\n\n\n    Masters Thesis\n\n\nBiological and chemical characterizations of endotoxin from nonencapsulated Pasteurella multocida.\n\n\n\n\n    One of the earliest observations in studies of hostparasite relationships was that the cell substance of certainbacteria was toxic when injected into experimental animals.This toxic principle, characteristic of gram-negative bacteria,was present i...\n\n\n\n\n    Masters Thesis\n\n\nA fluorometric assay for DNA endonuclease activity.\n\n\n\n\n    The PMB-9 strain of Escherichia coli contains a plasmid thatcodes for the production of extracellular, antibiotic proteins. ThePMB-9 plasmid is a small, twisted, covalently-closed, circular duplex DNA molecule with a molecular weight of 4.2 x 10 d...\n\n\n\n\n    Masters Thesis\n\n\nA Bacillus pumilus BpC1 neutral proteinase.\n\n\n\n\n    A mechanism of inhibition of enzymes by specificantibodies is known to involve steric hindrance due tocombination of antibody with the active site of the enzyme.Another possible mechanism is thought to include binding ofantibodies to other antigen...\n\n\n\n\n    Masters Thesis\n\n\nAge structure and reproductive biology of a black-tailed jackrabbit population in Madera County, California.\n\n\n\n\n    The ecology of the black-tailed jackrabbit (Lepus californicus Gray) has been studied in a variety of habitats including cultivated grainfields (Bronson, 1957; Lechleitner, 1958), grassland (Vorhies and Taylor, 1933), and desert scrub communities ...\n\n\n\n\n    Masters Thesis\n\n\nSources of feather count variations in white-crowned and golden-crowned sparrows.\n\n\n\n\n    The total number of feathers on a bird varies widely between different species. The source and significance of this variation, however, has received little study. Feather counts for a single individual of a species range from Wetmore's (1936) tota...\n\n\n\n\n    Masters Thesis\n\n\nResource partitioning and competition among carnivorous fishes in Ruth Lake, Merced County, California.\n\n\n\n\n    Five introduced and one native fish species in centralCalifornia were studied to find whether they partitionedtheir resources. The degree of competition was assessedthrough analysis of resource breadth and niche overlap, andwith a discriminant fun...\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\nScholarWorks is supported by Systemwide Digital Library Services\n           in collaboration with the CSU Libraries.\n\nCalifornia State University\nContact us\nAccessibility Statement\n\n\n\nAbout ScholarWorks\nScholarWorks is a shared institutional repository that collects, preserves, and provides access to scholarship by research communities at The California State University. Collections include CSU faculty publications, student dissertations and theses, datasets, and teaching materials.\nPowered by Samvera Hyrax 2.9.6\n\n\nUpload your work\nFaculty, staff, and students at any CSU campus are encouraged to upload works to ScholarWorks.\n           Terms of Use.\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#skip-to-content",
        "/",
        "/sign_in",
        "/dashboard/my/works",
        "/terms",
        "catalog?f[has_model_ssim][]=Thesis",
        "catalog?f[has_model_ssim][]=Thesis",
        "catalog?f[has_model_ssim][]=Publication",
        "catalog?f[has_model_ssim][]=Publication",
        "catalog?f[has_model_ssim][]=Dataset",
        "catalog?f[has_model_ssim][]=Dataset",
        "catalog?f[has_model_ssim][]=EducationalResource",
        "catalog?f[has_model_ssim][]=EducationalResource",
        "catalog?f[campus_sim][]=Bakersfield",
        "catalog?f[campus_sim][]=Channel Islands",
        "catalog?f[campus_sim][]=Chico",
        "catalog?f[campus_sim][]=Dominguez Hills",
        "catalog?f[campus_sim][]=East Bay",
        "catalog?f[campus_sim][]=Fresno",
        "catalog?f[campus_sim][]=Fullerton",
        "catalog?f[campus_sim][]=Humboldt",
        "catalog?f[campus_sim][]=Long Beach",
        "catalog?f[campus_sim][]=Los Angeles",
        "catalog?f[campus_sim][]=Maritime",
        "https://digitalcommons.csumb.edu/",
        "catalog?f[campus_sim][]=Moss Landing",
        "catalog?f[campus_sim][]=Northridge",
        "catalog?f[campus_sim][]=Pomona",
        "catalog?f[campus_sim][]=Sacramento",
        "https://scholarworks.lib.csusb.edu/",
        "https://digitallibrary.sdsu.edu/",
        "catalog?f[campus_sim][]=San Francisco",
        "https://scholarworks.sjsu.edu/",
        "https://digitalcommons.calpoly.edu/",
        "catalog?f[campus_sim][]=San Marcos",
        "catalog?f[campus_sim][]=Sonoma",
        "catalog?f[campus_sim][]=Stanislaus",
        "/about",
        "/concern/theses/tb09jc78p",
        "/concern/theses/41687q969",
        "/concern/theses/9z903622z",
        "/concern/theses/z316q7625",
        "/concern/theses/k0698f76v",
        "/concern/theses/qr46r704t",
        "/concern/theses/9880vz71r",
        "/concern/theses/r781wp77f",
        "/concern/theses/028713185",
        "/concern/theses/fj236856q",
        "https://calstate.edu/library",
        "https://libraries.calstate.edu/",
        "https://calstate.edu",
        "/contact",
        "/about#accessibility",
        "/terms"
    ]
}