{
    "title": "BuddyPress Plugin Usage Declining, Remaining Contributors Discuss Path Forward – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nSeptember 15, 2022\nSarah Gooding\nBuddyPress Plugin Usage Declining, Remaining Contributors Discuss Path Forward\n\nIn the most recent BuddyPress developers’ chat, contributors discussed progress on the upcoming 11.0.0 release, which is expected on December 14, 2022.  \nMathieu Viet, one of BuddyPress’ lead developers who spearheaded the effort to get the BP Attachments API into BuddyPress 2.3 in 2015, has been working on templating to display single media items on the front-end.  He made it possible to share media using the Activity Block editor when the BP Attachments plugin is active. The BP Attachments Admin UI has been updated to include an “Edit Item” view. \nBP Media Library “Edit Item” view\nIn addition to updates related to the upcoming release, contributors addressed the important topic of BuddyPress‘ declining usage over the past five years. WordPress.org reports active installations at 100,000+, whereas last month they were at 200,000+. The directory rounds that number so it’s not always representative of the number of people using the plugin. After digging further into the numbers, contributors found that installs are hovering at just under 200,000, but growth is steadily declining and contributors are dwindling.\n\n“The trend is really not great,” Viet said. “We are slowly losing users and the red line is even more concerning. We’re doing worse compared to last year.\n“My analysis is: we’re not getting enough new users to compensate for users loss.”\nBuddyPress’ growth and usage seemed to have peaked around 2016/2017. Participants in the dev chat speculated on the reasons for the decline, which Viet summarized in a writeup of the meeting:\n\nlack of cool front-end things added to the plugin recently\nhesitancy to install a big plugin like BuddyPress for a single feature\nlack of privacy tools, of a media component\ngrowth of the use of things like Teams and Slack\nBuddyBoss’ commercial aggression (eg: Google Adwords) or their slick-looking theme \n\nBuddyBoss forked BuddyPress years ago and has set itself up as a competitor to BuddyPress, maligning the open source project in its video introduction, while still making the platform compatible with all BuddyPress extensions. The video insinuates that BuddyPress is no longer maintained, which has caused confusion for users who have asked on the BuddyPress forums if it’s shutting down. BuddyBoss benefits from the ecosystem of extensions that have grown around BuddyPress but is no longer invested in improving the core software.\n“I also think that the work-from-home changes of the 2020s really grew the use of things like Teams and Slack, and some organizations were using BP for that, too,” BuddyPress contributing developer David Cavins said.\nAs a first step towards trying to address the lack of privacy tools, contributors are exploring introducing a “Private Site” toggle that would require users to be logged in to visit any BuddyPress components. There is some pushback on this idea, as there are already plugins that enable these types of communities and some view it as adding bloat to BuddyPress core.\n“We are clearly observing a huge decrease on active installs stats,” Viet said. “This basic feature might not be the thing to inverse the trend, but it would at least show a basic private community can be easily built for users who only need a logged in user only community area. It doesn’t prevent plugins to build something more granular.” \nContributors are also considering launching a new survey, as well as asking the WordPress Marketing Team for help. The last time BuddyPress surveyed its users was in 2020 and Viet reports that there were only 40 actual respondents while the rest were spam, so it’s impossible that this is representative of the community. Contributors also plan to post in the support forum to ask, “What is the most important feature that BuddyPress is missing?”\n“Even if usage / downloads are going down, we’re still maintaining the project,” Viet said. “Let’s hope our current work on Attachments and the Activity Block editor will attract more users.”\nCategory: BuddyPress, NewsShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n42\n\n\n\n\t\t42 responses to “BuddyPress Plugin Usage Declining, Remaining Contributors Discuss Path Forward”\t\n\n\n\n\n\n\n\n\n\n Anita says: \n\nSeptember 16, 2022 at 9:10 AM \n\n\nI was a big user of Ning[dot]com (social platform). I had 15 high school sites there. When I took it down to one school (my own) I was looking for a way to migrate the JSON content over to BuddyPress. There were a lot of users there, lots of images and videos and I needed to figure out how to migrate and use it with BuddyPress. There was one lone plugin but it hadn’t been updated so there was never a connection between Ning[dot]com and BuddyPress. There are still people there who would possibly want to move to BuddyPress but there isn’t a bridge to successfully do it.\nI personally tried to use it again a year ago. I needed a dedicated server to handle the day-to-day traffic. The hold back and why I set it aside “again” was that the block editor had been introduced to replace the classic editor when giving members the ability to write blog content. It wasn’t the greatest experience and so I looked for ways to turn the classic editor back on for that purpose. But I just couldn’t make it user-friendly enough to launch the site.\nI really thought that when Ning[dot]com went to an all paid platform that BuddyPress would become a top contender to market to their users and but it didn’t.\n\nLoading…\n\n\n\n\n\n\n\n\n\n David McCan says: \n\nSeptember 16, 2022 at 10:22 AM \n\n\nMembership sites in general seem to be thriving.  Sites for courses, coaching, private access to member only content, and communities organized around a product.  How well does Buddy Press work in those types of use cases?\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 4:00 PM \n\n\nHi David,\nBuddyPress can be a reply to most of the needs you shared. But about:\nprivate access to member only content\nWe don’t include a basic way to satisfy this need out of the box. I personally believe we should at least consider it as I know it’s a must have for company intranets/community sites.\nThanks for asking 👋\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Brandon Meyer says: \n\nSeptember 16, 2022 at 6:52 PM \n\n\nI don’t see where in the BuddyBoss website or video that “insinuates that BuddyPress is no longer maintained,” instead it claims that BuddyPress “is not evolving as well as we wish it did, and “development is moving too slowly.” Let’s not confuse the BuddyBoss theme, with the BuddyBoss Platform plugin, which is free AND licensed under GPLv3.\nBuddyBoss was created to integrate many of the features that the developers, as theme developers found to be a necessity in almost every BuddyPress community site they built. So they created the platform plugin to avoid having to re-do the same work over, and over, again, while also improving the system to work seamlessly as a whole (they also bring up in the video that many of the same features missing from BuddyPress requires third-party plugins and that some important ones haven’t been updated in years, which is true).\nWhile it’s true that BuddyBoss maintains the platform plugin (and does a great job I might add), I don’t think it’s fair to frame the issue as a big greedy corporation taking over open source. The BuddyBoss Platform plugin that is dominating the BuddyPress plugin is also open source. Don’t confuse the platform with the theme…\n\nLoading…\n\n\n\n\n\n\n\n\n\n Nomad Skateboarding says: \n\nSeptember 17, 2022 at 11:26 PM \n\n\nIt sounds like your reply is from the perspective of a Buddy Boss advocate? Which there’s nothing wrong with, of course. But it feels like that’s influencing your reply here.\nLess than one minute in when they go to Vito for his review, Vito says that Buddy Boss has a huge team behind it, and is developing and evolving while, “BuddyPress STOPPED a while back”.\nIf I’m hearing that without any other info, I’m taking that to mean BuddyPress is no longer developing the plugin.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Brandon says: \n\nSeptember 18, 2022 at 10:45 PM \n\n\nHi Nomad,\nNo, I didn’t account for it simply because it isn’t BuddyBoss that is making that claim as the article implies, but rather is a BuddyBoss user named Vito Peleg (creator of the WP FeedBack plugin) giving his review of the two platforms. You can blame BuddyBoss for including it in the video, but they don’t double down on that claim anywhere else and, even so, the context of Vito’s statement was that, compared to BuddyBoss, BuddyPress is a “wonky, kind of a 90’s tool at the moment.” That is likely partly comparing the BuddyBoss theme to the core BuddyPress plugin because the BuddyBoss Platform plugin is very basic as well in terms of design, but the Vito’s user review also points out that as a feature-rich platform the BuddyBoss Platform plugin does significantly save on development time.\nYou can take my critique to be biased, but I really do wish BuddyPress all the best. It’s just that nobody has pointed out any legitimate reason to prefer BuddyPress over BuddyBoss here. Rather, the argument against it tends towards ad hominem attacks. That is what inspires me to reply, where I otherwise wouldn’t have. The BuddyBoss Platform plugin is free and licensed under GPLv3. The BuddyBoss theme and app is what is what is advertised – and their slick-looking theme is not at fault.\nI can see a potential argument in a claim that BuddyBoss is bloated with unnecessary features that slows down the sites that use it compared to BuddyPress, but that would have to be proven by 1) Demonstrating that many of the features that BuddyBoss has included are not necessary for the majority of users, and 2) that BuddyBoss is demonstrably slower as a result. I can at least tell you that most BuddyBoss users are not only happy with the features included with BuddyBoss, but often demand that they include even more features. I do not know how it compares to BuddyPress in terms of site speed, but BuddyBoss has done considerable work on improving load times in any case.\nA single user review is not akin to a company-wide position, and a clarification does not imply a fanboy…\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n Lee says: \n\nSeptember 16, 2022 at 10:51 PM \n\n\nI’d LOVE it if BP could work for my needs (communities related to online courses). But it feels like 1995, it’s not user-friendly to style it, and to get it outfitted with enough features to make it feel relevant takes a lot of custom work. People are used to much more sophisticated experiences now. And there are many startups offering private social network platforms for those who choose to avoid FB forums for their communities. So BP is squeezed between FB, private for-profit hosted offerings that have sophisticated features and provide tech support, and… what space does that leave for BP?\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 2:47 PM \n\n\nHi Lee,\nThanks for sharing your experience about using BuddyPress. About styling BuddyPress to better incorporate into WordPress sites. We’ve been working about it for a while trying to improve our BP Theme Compat API so that BuddyPress integration is “not so bad” in every possible WordPress theme.\nToday BuddyPress content is nicely displayed into the next generation themes (supporting block templates) and we’ll carry on improving this part and also explore Block Templates theme 👀\nWe’ve been building BP Blocks and observing carefully the WP block Templates API, and we recently started to explore ways to use this API to improve customization for users switching to these next generation themes (maybe we’ll be able to build out of it something we could call Full Community Editing 🎨).\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Derin Tolu says: \n\nSeptember 17, 2022 at 2:55 AM \n\n\nI love BuddyPress, but for me  BP its always been  more complicated to use than other wordpress plugins because the bp activities, groups, and  members sit outside of the  wordpress post type functionality. This makes a lot of newbies think it doesnt work at all. Also user experience isnt the best.\nI think it needs a more specific mission and purpose.  An idea I have been playing with  at a very high level.\nBuddyVerse\nA peer to peer,  federated, multinetwork plugin that allows individual WordPress sites to connect to each other and share posts, activities members, groups, and pages.\nDemocratize social media one interconnected BuddyVerse site at a time.\nImagine new P2 on wordpress.com, tumblr and mastadon  shack up together and birth an awesome love child that is naturally open source, easy to install, a breeze to customize and runs on the software that already powers 40% of the web.  Open Source Social might just catch on.\nOooo Concept: Block Patterns as Posts or even chats ? ?\n\nLoading…\n\n\n\n\n\n\n\n\n\n Brandon says: \n\nSeptember 17, 2022 at 11:45 AM \n\n\nI do really like the idea of BuddyPress pivoting to better apply to narrower use cases within a broader social networking system. I was shocked that there were no solutions in WordPress for creating a Research Repository or a Mentor Platform (like mentorloop.com). However, as such it might be best as a plugin extension and it wouldn’t solve the problem with the core plugin.\nI was a big advocate of the fediverse at one point and was especially excited about the OLKi federated research repository (even while I grew to become a huge critic of cryptocurrency and Web3). However, I have since also learned that the redundancies and overhead of decentralization is a very serious issue. Just saying, I wouldn’t rush to that as a solution to fix BuddyPress.\nView at Medium.com\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 2:10 PM \n\n\nHi Derin,\nI really like your BuddyVerse idea, Thanks for sharing it 👍\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n basicD says: \n\nSeptember 17, 2022 at 3:08 AM \n\n\nBuddyBoss didn’t need to fork BuddyPress to create a platform of its own. BuddyPress comes with all the paraphernalia to create a plugin and customise everything of their own. They could have simply created a plugin to achieve Buddyboss. Instead they chose a path of forking an existing popular open source software and marketing as their own platform.  They ads often show up for BuddyPress. Obviously they charge a lot for their App. Their hosting requirements are also huge, check reviews posted on their unofficial facebook group, monthly costs run up to $xxxx . This has been detrimental to the BP & its community + potential adopters. As a trend the  SASS platforms are quick to pick up a big chunk of BP users. While customisability and code quality of BuddyPress still remains the best in the plugin industry it needs more love from the community. There is tremendous potential that WP is missing out here.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Brandon says: \n\nSeptember 17, 2022 at 11:25 AM \n\n\nPart of the beauty of open source itself is the ability to fork and improve other products – even the BuddyBoss Platform plugin. You point out customizability and plugin compatibility as the strengths of BuddyPress and that’s obviously the reason why BuddyBoss decided not to throw the baby out with the bathwater! The resulting success of BuddyBoss speaks to the need that existed then to modernize and improve BuddyPress. I’m sure those discussions are ongoing, but still, BuddyPress remains behind.\nHowever, it seems there is a need to be reminded that BuddyBoss is a fork of BuddyPress (and bbPress) because every critique of BuddyBoss at least partially applies to BuddyPress as well. Hosting requirements will quickly stack up with user concurrency and plugin activation in both platforms. The BuddyBoss IS expensive – it’s an app – but unless BuddyPress includes an app with the plugin it is not relevant to the discussion. There are other areas that make BuddyBoss more complicated than BuddyPress, but for good reason. For instance, BuddyBoss has created their own permission management system using symlinks in order to prevent unwanted or unauthorized access to documents and media in the social network that has complicated things in terms of configuration and offloading. They also significantly improved the load time of the activity feeds by tightly integrating Redis Object Cache support.\nOn the other hand, there are SaaS platforms out there that are giving everyone a run for their money. Circles.so, PeerBoard, and LearnWorlds offer modern, feature-rich interfaces at affordable rates without the headache of running everything yourself. Instead of being mad at BuddyBoss for trying to compete with these other platforms, BuddyPress needs to take notes…\n\nLoading…\n\n\n\n\n\n\n\n\n\n Peter Shaw says: \n\nSeptember 22, 2022 at 10:33 PM \n\n\nBuddyboss may be gpl but it an example of a company taking advantage of gpl\nThey produce little that is new, instead they copy existing software into their plugin then brand it as their own, giving zero credit to the people who wrote the original.\nThis problem is not unique to buddypress but buddyboss are probably the worst example in the whole WordPress ecosystem\n\nLoading…\n\n\n\n\n\n\n\n\n\n Brandon says: \n\nSeptember 23, 2022 at 6:05 PM \n\n\nHi Peter,\nI’m certain that the claim that BuddyBoss hasn’t done anything new since forking BuddyPress is absolutely false. I listed two not-insignificant examples already, the new permissions system and the integration with the Redis Object Cache to speed up the load times of the activity feed, but that’s just the tip of the iceberg. I don’t understand how anyone can square the claim that all BuddyBoss did was simply fork BuddyPress and bbPress and haven’t done anything meaningful with it since, with the broader claim that BuddyBoss is hurting BuddyPress… You can review what they’ve done yourself in their release notes at https://www.buddyboss.com/resources/buddyboss-platform-releases/ and what they are planning to do in their roadmap at https://www.buddyboss.com/roadmap/. BuddyBoss has claimed that they are not even pulling from BuddyPress code anymore besides the occasional security patch.\nReading into why it was forked, it does appear to be complicated. Mike Eisenwasser simply had a different vision and didn’t think he could realize it without forking BuddyPress, but JJJ pointed out that Mike didn’t provide any feedback or requests before doing so. Given that, I understand both sides and in an ideal world BuddyPress and BuddyBoss would come together and merge the two plugins – even at least partially – to share in the development. That seems unlikely for the same reasons it was forked in the first place, which gives legitimacy to the necessity of forking it. On the other hand, if BuddyPress wants to make the case that it wasn’t necessary to fork BuddyPress at all for Mike to realize his vision, then merging BuddyBoss and BuddyPress should be under serious discussion.  In my mind, those are the two determining factors/choices in front of everyone that offer us insight as to the wisdom of forking BuddyPress.\nHowever, the BuddyPress team seems to be averse to adding too many features to the core plugin, while the BuddyBoss team is committed to a modern, feature-rich social networking platform that can be configured out-of-the-box. It doesn’t need to be winner take-all though, but it is up to BuddyPress to determine their value-proposition and path forward.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 2:31 PM \n\n\nHi basicD,\n\n\n  While customisability and code quality of BuddyPress still remains the best in the plugin industry it needs more love from the community\n\n\nI totally agree 😁. Thanks for sharing these lovely words 😍\n\nLoading…\n\n\n\n\n\n\n\n\n\n Eder Ribeiro says: \n\nOctober 6, 2022 at 2:06 PM \n\n\nI think I’m one of the few people who started with BuddyBoss and moved to BuddyPress. It was through BuddyBoss’ aggressive marketing that I found a very good theme for online courses (Learndash).\nI run a course site with 50,000 members, and the constant updates from BuddyBoss added to the plethora of social networking features were making everything slower and more difficult to manage.\nBasically I needed the LMS with more speed, the photo profile system, less features and less updates. I even considered using just BuddyBoss with my redesigned theme just for basic courses and profiles. But that’s when I realized that the BuddyBoos plugin is totally dependent on the main theme and loads huge stylesheets and javascript for its “full” social networking purpose.\nWith a lot of work redoing the courses theme I brought in all the necessary course and profile functions and switched from BuddyBoss to BuddyPress. The difference in page load speed was over 1 second faster: BuddyBoss (2.70) X BuddyPress (1.60). The average server CPU usage dropped 3x, this made it possible for a lot more people to be online simultaneously.\nBuddyPress includes much less unused javascript/css with additional modules turned off. For all these reasons, I can say that the quality of the BuddyPress code is much higher and more optimized than that of BuddyBoos.\nThe problem is that this migration I made is not something simple to program. I think BuddyPress should invest more in features/themes for sites in the Members Area profile closed for online courses, it’s a very sought after need.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n Tom Watts says: \n\nSeptember 17, 2022 at 3:22 AM \n\n\nWe’ve built a whole business around BuddyPress! Using it week in week out, you get to know its strengths and weaknesses.\nOne of the key elements missing is the ability to get a BuddyPress community to the iOS and android app stores. I think with communities having that presence on a mobile phones is critical.\nWe wrestled with the problem for a bit and then realised the best way to solve the problem was to create a solution. So we built software that translates buddypress websites into apps –\nhttps://ziplinecommunities.com/buddypress/\nOther than that, I think there’s always going to be an issue with how plug and play something as complex as buddypress is. Anyone with a bit of WordPress knowledge can create a community with buddypress. Getting it to work how you want it to? That can be a bit tougher. That might seem beneficial for businesses like ours – being able to sell services to fix problems – but that’s not really the case. Ultimately the easier it is to use buddypress the more vibrant the ecosystem around it becomes.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 2:27 PM \n\n\nThanks a lot for sharing about your tool to transform BuddyPress as an app and I agree about your last words. We need to make the plugin easier to use and extend.\nWe’re exploring ways to do so such as using what we call BP Add-ons (an other way to call a plugin actually!) to package next features such as the long awaited Community Attachments one 😇.\nWe use to consider splitting the plugin into smaller parts but results about this specific question of our 2020 survey seem to show us Users prefer to get all into one huge plugin.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Sander van Dragt says: \n\nSeptember 17, 2022 at 3:37 AM \n\n\nA better website would help, and with that I mean\n1) more focused on use cases.\n2) highlighting some plugins that make buddypress better for these use cases\nI think WordPress shows people will happily install plugins, but they can’t find out if buddypress fits their needs.\nI had to click on “can be extended” which was not a clear link, and then on a url on the next screen. And that got me a forum list, which is not visual enough and not ordered by an editor or popularity.\nSo my suggestion is no amount of new features will help if they can’t be discovered. Hope that’s useful.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 2:15 PM \n\n\nHi Sander,\nThanks a lot for your suggestion. A new BuddyPress standalone theme we could ship with the plugin and also use as our official site’s theme to showcase it, is something we’ve been discussing about.\nI agree we need to improve this part 👌\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Mr David Hoy says: \n\nSeptember 17, 2022 at 4:35 AM \n\n\nThe most powerful plugin after WooCommerce in my wee humble opinion.\nIt would have been the collaboration platfrom of choice over the pandemic had the privacy and security been there.\nIt is the perfect choice for company intranets, yet takes so much work to secure properly it’s just not got traction in this space.\nBlend P2 with BuddyPress, add security and privacy features that are bulletproof and theme / plugin fail resistant. Re market it as the ultimate platform for internal company interactions.\nThe big USP over the other platforms is the self-hosting. Companies will OWN their data.\nMy thanks go to all the plugin contributors!\n\nLoading…\n\n\n\n\n\n\n\n\n\n Derin Tolu says: \n\nSeptember 17, 2022 at 12:51 PM \n\n\nYeah that combination would easily give modern sharepoint a run for its money.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 2:20 PM \n\n\nHi Mr David Hoy,\nThat’s how I’ve first discovered BuddyPress 12 years ago: using it to power a company intranet around sharing ideas about how to improve how we work etc.\nOwning data is very important, I totally agree.\nThanks for your kind words, we’ll try to keep up the good work 😅\n\nLoading…\n\n\n\n\n\n\n\n\n\n Brandon says: \n\nSeptember 18, 2022 at 11:12 PM \n\n\nAs I’ve said before, there are no solutions for research repositories, peer-reviewed journal systems, or mentoring platforms on WordPress. Look at Dovetail, mentorloop, userinterviews.com, lookback, PKP journals, and even public repositories with advanced permissions like the drupal-based mukurtu archive. To the extent that you think BuddyBoss has over-extended itself, take it back and pare it down – there’s no denying that they’ve done great work. However, to the extent that BuddyBoss has hit the nail on the head in every way, think about how you’re going to continue to exist through plugins and addons that create those kinds of unique systems mentioned above. Be honest with yourself. I would love to see any of those things happen!\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n Tara says: \n\nSeptember 17, 2022 at 8:53 AM \n\n\nits great as a concept but to be honest, its expensive, slow and support sucks.. also.. key features never materialise.. not surprised usage is declining.. they dont list to customers..\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 3:52 PM \n\n\nHi Tara,\nThanks for sharing your thoughts. About costs, I agree it can be expansive to maintain a community site but for the software part both WordPress & BuddyPress are free tools, I mean we don’t charge anything for the energy and time we’ve dedicated to build the plugin.\nWhen we’re building free and open source things we expect a lot from users so I can tell you we are trying to find the time to read your reviews, opinions, support topics, etc.., each time we can. From time to time we manage to make some understand that if they can do some more little efforts in addition to their use to help us to improve documentation, support, translation and why not the plugin’s code, that’s a big win for all of us (all users and contributors).\nI agree our Support Forums needs more love. Today it’s a good tool to ask questions but not a so good one to find answers 😔. The current people contributing to it are doing a really great job, I try myself to bring some answers but we need more hands to reply and code a way to immediately gives you an answer when the question was previously asked and resolved.\nMaterializing key features sometimes happen 😅. I agree we don’t always succeed to include all the ideas we talked about at the launch of new development cycle, but “never” seems a bit exaggerated imho, we ship things into our major releases, I can tell you as I usually package the release and deploy it on WordPress.org 😉\nI’m almost sure we never assimilated BuddyPress users to customers, but I get the idea. At least, we try to take as much feedbacks as possible in account and then we have to decide / select / choose the ones we think are making sense to most users (end users, plugin & theme authors). A good way to maximize the inclusion of you desired feature into BuddyPress core is to build it or a part of it and share a patch or a PR with us.\nWe’re wide open to contributions 😇.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Mounir says: \n\nSeptember 17, 2022 at 1:17 PM \n\n\nWow, all the feedback here was amazing, it’s a survey in itself.\nI would add that one of the things which BuddyPress also needs is more companies  with a vested interest working in its ecosystem + 3 very succesful companies relying on it.\nBuddyBoss could have been one but they choose to trace their own route in parallel, that’s sad but that’s their choice and possibly the better one for their company and interests, so that’s fair. I would love for them to chim in and give their point of view or opinion.\nAs I said above, all this feedback was amazing and I think there are some actionable insights in there.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 19, 2022 at 1:32 PM \n\n\nHi Mounir,\nI think there are some actionable insights in there\nI totally agree, there are really great constructive suggestions.\nThanks a lot for your thoughts, a 1% for the future of BuddyPress would be really nice 😉\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Jann says: \n\nSeptember 17, 2022 at 3:09 PM \n\n\nBuddyPress can be described as developer-focused.  The BP volunteer devs work on things that interest them – understandable.   Contributors burn-out quickly because of the nature of the BP dev  process.\nBuddyBoss is a business.  BuddyBoss is user-focused and very successfully so.  Their decision to fork BuddyPress and create their Platform was embraced by developers and users alike.   Take a look at their git repo pull-requests – very active.  Simply put – BuddyPress is suffering from an attitude problem at the leadership level.  Mathieu continues to do great work as a developer.  But strategically, BP is floundering.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Nick Chomey says: \n\nSeptember 17, 2022 at 9:27 PM \n\n\nYes, BuddyBoss has been much more active and responsive, which is to be expected given the commercial focus – its a great product. Its also fair to say that BP does not really have, and perhaps never really had, a well-developed organizational structure and workflow, or strategic direction.\nBut let’s be clear about one thing – BuddyBoss’s official policy is to not accept pull requests via Github. If you do so, they will sit in limbo forever. You need to submit a ticket through their customer portal, which will likewise sit in limbo forever. I have submited bugfix PRs that have been ignored for over a year now…\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 17, 2022 at 4:40 PM \n\n\nHi Jann,\nThanks for sharing your thoughts and for your kind recognition of my work ☺️.\nContributors burn-out quickly because of the nature of the BP dev process\nI’m sad to read the above words, and your point on the leadership of the project because I must be one of the people responsible for these consequences.\nI started as a BuddyPress contributor before joining the team as a developer and now as one of the lead developers. I think everyone in the team just like me are considering ourselves as contributors first and we know how strategic contributors are to the project. I think we’re in the middle of vicious circle : contributors need quick feedbacks but we need more contributors to be faster. I try to review each submitted ticket, patch or PR on our SVN/Git repositories but sometimes it can take me a long time.\nI’m very open to suggestions on ways to improve our development process so that contributors can quickly realize their impact on the code.\nUnlike businesses who are customer-focused, BuddyPress is user-focused, but we need to satisfy various types of users. I partly agree with you when you write:\nBuddyPress can be described as developer-focused.\nBecause one of our users is the BuddyPress plugin or theme developer. Each time we add a change to the source code we need to think about potential backward compatibility issues. This can also explains why some huge changes like the feature we packaged into the BP Rewrites plugin can take a long time. We actually also care a lot about the end users – caring about plugin/theme authors – because we want to make sure to take the less risks as possible for their community site. When something goes wrong into the community areas of their site, BuddyPress responsibility is their immediate guess.\nAbout :\nThe BP volunteer devs work on things that interest them\nWell, I’d say it’s a human nature, we like to work on interesting things 😇. But we’re an open source project and as such every user is a potential contributor / developer, what about doing some steps? I and everyone in the team will be happy to help them improving their work to finally have a solid feature shared with all users.\nThanks again for your feedback 👍\n\nLoading…\n\n\n\n\n\n\n\n\n\n Vicent Nemeyimana says: \n\nSeptember 18, 2022 at 7:03 PM \n\n\nOh it makes me sad to read that the usage of buddypress is declining. I just love buddypress so so much. Actually, I have ever tried buddyboss plugin too, but there were many compatibility issues with my theme and I gave up. I have used buddypress since 2018 and it has done many great things for me on various websites. It even won me an award some day!\nI want to encourage all the contributors and developers and leadership of BuddyPress to know that their work is valued and we are grateful. Of course, there are things to improve, but don’t be discouraged  at all. Well, I would suggest that you add private membership management to the core plugin, enable ajax loading for acvitiy, profiles, and more, and improve the user interface to make it really attractive and easy. Additionally, try to showcase success websites or companies using the plugin or even partner with them for wider promotion. I still think BuddyPress is a powerful social plugin.\nMy God, if you could add the ability to use the plugin for research journal or booking marketplaces, that would be awesome. In general, thanks for the work, and just keep improving. I also suggest a strong partnership with WordPress team for promotion. Thank you.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 19, 2022 at 1:28 PM \n\n\nHi Vicent (or maybe Vincent as it looks familiar with a french first name ☺️ I know of).\nThanks a lot for your BuddyPress love and your encouragement 😍. We really appreciate your kind words. We are not discouraged, no worries and we are very motivated to work on improving users BuddyPress experience. Many thanks for your suggestions, adding a basic private community feature is definitively something we could implement very soon (maybe into our next major release: we’re considering it).\nUsing the BP Nouveau Template pack (you can switch to it going to the Options tab of the BuddyPress settings) you’ll get “Activity Ajax loading”, it’s natively included, I think it’s also available using the BP Legacy template pack, but Nouveau has gone further into this area 😁.\nImproving the user interface is always on our mind, but it’s a very difficult challenge as we are not targeting one theme but all possible WordPress themes 😅. We’re making progress every day 💪.\nI totally agree with you: BuddyPress is a powerful plugin to power community sites.\nThanks a lot for your trust.\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Bryant says: \n\nSeptember 19, 2022 at 8:24 PM \n\n\nYes, Buddypress is a little dated. Some core features that should be there that aren’t, like security. Using both platforms. I’ve used Buddypress more as it has been out longer. Buddyboss is nice. It’s most of what Buddypress should be. But, I can’t say that I truly agree with the way Buddyboss has used Buddypress. Or, the other plugin developers either. They copied (forked)Buddypress, copied (forked) some other plugins, and called it a new platform.\nSo, Fair is fair, Buddypress team.  Get a copy of Buddyboss. Edit and use the features you need for Buddypress. Send Buddyboss a thank you for their contributions. Let everyone know that Buddypress 12 is ready 😂\nAlso, blocks for all buddypress components.  This will make styling member areas so much easier. I’m in the middle of building a project now Buddypress and was just thinking Buddypress blocks for components will be so great.\nExample, one of the features of this site is customer to sales direct messaging. So I need to style the message component to fit the styling of the my account page. Hide Buddypress profile and header and nav bar as this should be an account page like for woocommerce.  Only the messages should show. It would be great if we could just drag the messages component block on to a page like we do with the comments block or the query block.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Mathieu Viet says: \n\nSeptember 20, 2022 at 2:28 AM \n\n\nHi Bryant,\nThanks a lot for your suggestion, I might say you just confirmed my conviction: BuddyPress future will be written in Blocks 🧱. We will definitely try to benefit from the WP Block API & block templates to build community features users can easily customize 👍\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n Vibethemes says: \n\nSeptember 20, 2022 at 12:25 AM \n\n\nVery interesting discussion. Really delighted to see so many comments, we will work on this in our upcoming BP meet. This only proves that community is interested in BP and we need to work on BP with more passion and love.\n\nLoading…\n\n\n\n\n\n\n\n\n\n William Friend says: \n\nSeptember 20, 2022 at 4:19 AM \n\n\nI can’t believe I just read this whole article and half of the comments and I still have no idea what Buddy Press is or Buddy Boss or what it does. And yet I keep reading hoping for a glimpse of what feature isn’t good enough. Maybe your usage problem starts with a user journey. Wtf is it\n\nLoading…\n\n\n\n\n\n\n\n\n\n Soren says: \n\nSeptember 23, 2022 at 4:46 PM \n\n\nIn 2013 I started making WP multi-sites and also began to get community projects. Of course, they were based on Buddypress and what other options were around at that time.\nOver the years I spend time searching the BP forums never really finding anything useful, or if it seemed useful it was years outdated. Then there were a lot of different paid Buddypress plugins and tons of developments, all because the features the client asked for weren’t available in Buddypress or were missing integration to other tools.\nWith every BuddyPress update I never really felt it was going anywhere.\nOne happy day in 2019 Buddyboss theme/platform arrived, it opened a door to secure and streamlined development, tons of integration, and a clear roadmap for the future.\nToday I almost solely work with clients whose needs can be based on Buddyboss platform/theme and it is Great.\nTo summarize:\n2013-2018 BuddyPress = Frustration\n2019-             BuddyBoss = Everything is awesome\n\nLoading…\n\n\n\n\n\n\n\n\n\n LaSet says: \n\nOctober 5, 2022 at 8:58 AM \n\n\nI think so too, BuddyPress has been standing still all these years imitating some activity, and joining Automattic only slowed down that development. I have been following them for over 15 years.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Derin Tolu says: \n\nNovember 2, 2022 at 6:55 AM \n\n\nJust reading through this again and was thinking about Automattic’s  financial support and upcoming integration with https://element.io/. Looking at github it seems that there is already a plugin in the works. Thats a big opportunity to bring social features to wordpress. Although I find the way it handles encryption from a ux standpoint an obstacle to using element as easily as other chat platforms.\n\nLoading…\n\n\n\n\n\n\n\n\n\n Steve says: \n\nNovember 20, 2022 at 3:09 AM \n\n\nThis has been an interesting read. I first tried out BuddyPress but like so many found that it wasn’t a good enough replacement for my aged Boonex Dolphin community site. Mostly due to security and a complete lack of media functionality. My site is very heavy on photos and videos.\nBuddyBoss came along and I thought my prayers were answered. The reality was it took another 2 years before I could migrate my site. Lots of talk here on how BuddyBoss has added great features that BuddyPress should have, true but if you actually look at what has been produced by BuddyBoss, it’s really quite poor. Modules have been rushed through, missing core functionality. For example the moderation module does not allow admin to view an auto suspended profile. Helpful.\nRecent updates to BuddyBoss platform have invariably broken other major functionality. Developement had all but ground to a halt on the web plugin and they focus all their energy on the mobile app.\nBuddyPress has an opertunity to claw back users right now, but they will need to show they can develope at pace to bring the core up to date.  The UI is key. Let other plugins deal with security.  And media is key for community sites, there is currently nothing in the BP core or plugins that can address the lack of media functionality..\n\nLoading…\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou may also like\nBuddyPress 12.0 to Focus on Merging BP Rewrites Into Core, Moving Legacy Widgets Into BP Classic PluginFebruary 6, 2023BuddyPress 11.0.0 Adds Filter for Improved JS and CSS Asset Loading, WebP Support, and New Ways to Fetch ActivitiesJanuary 6, 2023BP Rewrites Feature Plugin Now in BetaFebruary 15, 2022\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLoading Comments...\n\n\n\n \n\n\nWrite a Comment...\n\n\n\n\nEmail (Required)\n\n\n\nName (Required)\n\n\n\nWebsite\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://bpdevel.wordpress.com/2022/09/14/bp-dev-chat-summary-september-7-2022/",
        "https://wordpress.org/plugins/buddypress/",
        "https://www.buddyboss.com/compare/buddyboss-vs-buddypress/",
        "https://buddypress.org/support/topic/buddypress-org-shutting-down/",
        "https://buddypress.trac.wordpress.org/ticket/8734",
        "https://buddypress.trac.wordpress.org/ticket/8734#comment:6",
        "https://buddypress.org/2020/12/buddypress-2020-survey-results/",
        "https://wptavern.com/category/buddypress",
        "https://wptavern.com/category/news",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward?share=twitter",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward?share=mastodon",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward?share=facebook",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward?share=telegram",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward?share=jetpack-whatsapp",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward?share=pocket",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20BuddyPress%20Plugin%20Usage%20Declining%2C%20Remaining%20Contributors%20Discuss%20Path%20Forward&body=https%3A%2F%2Fwptavern.com%2Fbuddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward&share=email",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433063",
        "https://www.webtng.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433067",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433115",
        "http://indigetal.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433073",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433119",
        "http://indigetal.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433134",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433078",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433111",
        "https://derintolucom",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433082",
        "http://indigetal.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433101",
        "https://medium.com/@waitmang/decentralization-is-killing-our-environment-a4398b7e5ebe",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433105",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433083",
        "http://indigetal.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433100",
        "https://shawfactor.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433266",
        "https://indigetal.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433284",
        "https://www.buddyboss.com/resources/buddyboss-platform-releases/",
        "https://www.buddyboss.com/roadmap/",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433110",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433634",
        "http://ziplinecommunities.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433084",
        "https://ziplinecommunities.com/buddypress/",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433109",
        "https://vandragt.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433085",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433106",
        "https://davidhoywp.com/",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433086",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433103",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433107",
        "http://indigetal.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433135",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433097",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433114",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433104",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433153",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433112",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433118",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433116",
        "https://miklahlife.com",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433131",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433152",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433157",
        "https://imathi.eu",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433167",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433164",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433173",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433283",
        "https://blog.net.ua/",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-433576",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-434214",
        "https://element.io/",
        "https://wptavern.com/buddypress-plugin-usage-declining-remaining-contributors-discuss-path-forward#comment-434612",
        "https://wptavern.com/buddypress-12-0-to-focus-on-merging-bp-rewrites-into-core-moving-legacy-widgets-into-bp-classic-plugin",
        "https://wptavern.com/buddypress-12-0-to-focus-on-merging-bp-rewrites-into-core-moving-legacy-widgets-into-bp-classic-plugin",
        "https://wptavern.com/buddypress-11-0-0-adds-filter-for-improved-js-and-css-asset-loading-webp-support-and-new-ways-to-fetch-activities",
        "https://wptavern.com/buddypress-11-0-0-adds-filter-for-improved-js-and-css-asset-loading-webp-support-and-new-ways-to-fetch-activities",
        "https://wptavern.com/bp-rewrites-feature-plugin-now-in-beta",
        "https://wptavern.com/bp-rewrites-feature-plugin-now-in-beta",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge",
        "#",
        "#"
    ]
}