{
    "title": "Tartan Soul | Student Life | University of California, Riverside",
    "body": "\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\nUniversity of California, Riverside\n\n\n\n\n\nUCR Home\n\n\n\n\n\n\n\nA to Z Listing\n\n\nCampus Map\n\n\nFind People\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUC Riverside\n\n\n\n\n Student Life \n\n\n\nTartan Soul\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nWelcome\n\n\nBeing Highlander\n\n\nOrigins\n\n\nWe've Got Soul\n\n\nBare Your Soul\n\n\nContact\n\n\n\n\n\n\n\nUCR Home\n\n\n\n\n\n\n\nA to Z Listing\n\n\nCampus Map\n\n\nFind People\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBeing Highlander\n\n\nYour heart sings to the tune of bagpipes and your brain sparks with innovation. You’ve got Tartan Soul. There are four qualities that show the world you’re a Highlander: Integrity, Accountability, Excellence and Respect.\nAs a UCR student, you’ve always exhibited these values. You wouldn’t have been accepted to UCR if you hadn’t!\n\n\nNow is the time to demonstrate your Tartan Soul. Act with integrity, be accountable individually and for your ethical conduct, strive for excellence, and respect the rights and dignity of others. As you mature and take on more responsibility, you will see how these important values – the “core four” of your Tartan Soul – will help you to earn the trust and respect of others, work more efficiently, and succeed in ways you never imagined.\n\n\n\n\n \n\nExcellence\nLeading With Excellence\n\n\n \n\nRespect\nA Campus of Respect\n\n\n \n\nIntegrity\nLiving with Integrity\n\n\n \n\nAccountability\nCommunity with Accountability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Four Colors of the UCR Tartan represent the four core values of Tartan Soul.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow Soul Was Born\n\n\nIn 2005, the University of California Office of the President (UCOP) put forth a Statement of Ethical Values. The UC Regents recognized and adopted the four values: integrity, accountability, excellence and respect. UCR embraced these values with the Tartan Soul campaign which was created by the Student Life Orientation Team.\nThe campaign debuted in 2009 at UCR’s Bear Facts summer orientation program. During orientation, all incoming, first-year students were introduced to the four values by the Dean of Students and given tartan lapel pins.\n\n\nThe Dean explained each value and provided examples of students embodying Tartan Soul. Each value was linked to one of the four colors of the UCR Tartan. Integrity is represented by blue, accountability by white, excellence by gold and respect by black. Throughout that summer, the campaign experienced huge success.\nNow it’s time to make the Tartan Soul campaign bigger and better. We’re asking students, faculty and staff to promote Tartan Soul. Find new ways to show your soul, recognize people who exhibit the four values and wear UCR’s tartan whenever possible.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUCR Highlanders strive to represent integrity, accountability, excellence and respect every day\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe've Got Soul!\nBrave Scots one and all, the tartan clan of UCR stands together! Click a portrait below to see how some Highlanders exemplify our core Tartan Soul values!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRaghad Tabaza\n\nAdvocate, facilitator, collaborator, and mentor. As MESA President, Raghad are all these things and more.  She works towards promoting education, cultural awareness, and policy changes with the Middle Eastern and UCR community. Her efforts to help bring together people from all backgrounds. This is why Raghad is a shining example of Tartan Soul Respect.\n\nRespect\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamal Myrick\n\nBeing a resident director means more than just making sure things run smoothly in the residential halls. As an RD, Jamal Myrick is also an adviser, counselor, organizer and a problem solver. Accomplishing his duties while still making each resident in Lothian feel at home illustrates why Jamal exemplifies all four Tartan Soul values.\n\nAccountability\nIntegrity\nExcellence\nRespect\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLaura Dimler\n\nLaura Dimler goes above and beyond what many students expect of their TA. She is known to be willing and eager to help students not only within the classroom, but outside it as well. Always punctual, helpful and kind, she has repeatedly shown that she truly cares for her students. Laura constantly demonstrates her Accountability and Integrity.\n\nAccountability\nIntegrity\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJason Llamas\n\nJason Llamas demonstrates excellence in everything he is involve in. First and foremost, he deeply values his education and puts in the time and effort. From being an orientation leader, to a CNAS ambassador, to a resident adviser, Jason commits 110% to UC Riverside and still remains very humble. Jason truly represents Tartan Soul Excellence.\n\nExcellence\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBryant Glover\n\nOftentimes we see our faculty as the ones that inspire our students. But at UCR, it is not unusual to see our students inspire others as well. And Bryant Glover is no exception. As a student of SoBA, he has been known to not only push himself, but to push everyone to a high standard. It's no surprise Bryant embodies Accountability.\n\nAccountability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSetsu Shigematsu\n\nAs an Associate Professor in the Media & Cultural Studies Department, Setsu Shigematsu greatly demonstrates passion and excellence within her classes. Every single student she’s interacted with gained valuable knowledge and awareness about culture and conformity. Her work in the creation of the Guardian Princesses further illustrates Highlander Excellence.\n\nExcellence\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTuppett Yates\n\nAs an Associate Professor in UCR's Department of Psychology, Tuppett goes out of her way to respect the backgrounds and histories of others. She also looks out for her students beyond what others expect of her. She will not hesitate to give warnings for triggering material and she will always acknowledge her mistakes. Tuppett embodies UCR Accountability.\n\nAccountability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTiffany Chen\n\nBeing a residence life coordinator is no easy task, but Tiffany Chen has more than stepped up to the challenge. She is always there to help the community assistants in any type of situation and has proven to be a great role model. Tiffany represents Excellence for being a great coordinator and helping all the CAs with events and other responsibilities.\n\nExcellence\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMike Atienza\n\nAs a former CHASS academic adviser, Mike Atienza epitomized Tartan Soul. He embraced Accountability, went above and beyond to assist students he advised. His interactions with first-year students during Highlander Orientation were always positive. He embraced each of them with a smile. What's more, he was always showing his UCR spirit by wearing his tartan kilt.\n\nAccountability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDanna Fakhoury\n\nDanna saw smoke coming from a trash can on the second floor of the HUB. After contacting UCPD, she mobilized a team of students to move water up the staircase to extinguish it quickly. Danna demonstrated calmness in the face of danger. Her commitment to bringing about a safe and successful resolution makes Danna a great example of Accountability.\n\nAccountability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet Mad About the Plaid! Represent and spread the word about Tartan Soul!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBare Your Soul\n\n\nAs a student, you can represent Tartan Soul by exhibiting integrity, accountability, excellence and respect. Wear the UCR tartan lapel pin and UC Riverside apparel to remind people you’re a Highlander! UCR and Student Life resources have more ways to promote your Tartan Soul. \n\n\nStaff and faculty members can  can participate as well. We need departments to incorporate Tartan Soul branding into programming. Set up a meeting with Student Life to learn creative ways to use Tartan Soul. Also, let us know if you’re already using the branding .\n\n\nCreate Buzz\nSpread the word about Tartan Soul by wearing the UC Riverside gear. Shirts are available during select R'Day Giveaways and key Student Life events, so keep a look out! For more information, email student life.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTartan Soul Partners\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet In Touch\n\n\nLet's Talk\nAs the creators of Tartan Soul, we love talking about it. Feel free to email us when you have questions or want to get involved in the campaign.\nWant to talk face to face? Stop by Student Life in HUB 229 (between 8 a.m. – 5 p.m.) and ask to speak to an Orientation team member.\n\n\nAddress\n\nStudent Life\nHighlander Union Building 229\n900 University Ave.\nRiverside, CA 92521\n(951) 827-1012\n  studentlife.ucr.edu\n  ucrlife@ucr.edu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\nUniversity of California, Riverside\n\n900 University Ave.\n            Riverside, CA 92521\nTel: (951) 827-1012\n\n\nUCR Library\nCampus Status\nCampus Store\nCareer Opportunities\nDiversity\nMaps and Directions\nVisit UCR\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent Life\n\n             HUB 229\n            Riverside, CA 92521                         \n tel: (951) 827-7344                 fax: (951) 827-2439         email: ucrlife@ucr.edu \n\n\n Find Us\n\n\n\n\n\n\n\n\nFollow Us:\n    \n\n\n\n\n\n\n\n\nRelated Links\n\n\nHighlander Student Orientation\n\nR'SIDE Events\n\nAssociated Students Program Board \n\nHighlander Union Building\n\nDean of Students\n\nAssociated Students of UCR\n\nGo Highlanders\n\n\n\n\n\n\n\n\n\nDisclaimer\nThis information is accurate and reliable at time of posting but may change without notice. Please contact Student Life for the most up-to-date information.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy and Accessibility\nTerms and Conditions\n© 2023 Regents of the University of California\n\n\n\n\n\n\n\n\n\n\n×\n\n\n\n\n\n\nLet us help you with your search\n\n\nEnter your Search Criteria.\n\n\n\nSearch\n\n\nCancel\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main-content",
        "https://ucr.edu",
        "https://www.ucr.edu",
        "http://www.ucr.edu/alpha",
        "https://campusmap.ucr.edu/",
        "http://profiles.ucr.edu/",
        "/",
        "/",
        "/home",
        "/home#anchor-beinghighlander",
        "/home#anchor-origins",
        "/home#wegotsoul",
        "/home#anchor-baresoul",
        "/home#anchor-contactus",
        "https://www.ucr.edu",
        "http://www.ucr.edu/alpha",
        "https://campusmap.ucr.edu/",
        "http://profiles.ucr.edu/",
        "mailto:ucrlife@ucr.edu",
        "mailto:ucrlife@ucr.edu",
        "mailto:ucrlife@ucr.edu",
        "https://vcsa.ucr.edu/",
        "https://aspb.ucr.edu/",
        "https://studentlife.ucr.edu/",
        "mailto:ucrlife@ucr.edu",
        "home#anchor-baresoul",
        "https://studentlife.ucr.edu",
        "mailto:ucrlife@ucr.edu",
        "https://library.ucr.edu/",
        "https://campusstatus.ucr.edu/",
        "https://ucr.bncollege.com/shop/ucr/home",
        "https://jobs.ucr.edu",
        "https://diversity.ucr.edu/",
        "https://campusmap.ucr.edu/",
        "https://www.ucr.edu/about/visitors",
        "http://tobaccofree.ucr.edu/",
        "https://campusmap.ucr.edu/?find=P5404",
        "mailto:ucrlife@ucr.edu",
        "https://campusmap.ucr.edu/?find=P5404",
        "https://www.instagram.com/ucrstudentlife/",
        "https://www.facebook.com/ucrstudentlife/",
        "https://orientation.ucr.edu/",
        "https://events.ucr.edu/group/rside",
        "https://aspb.ucr.edu/",
        "https://hub.ucr.edu/",
        "https://deanofstudents.ucr.edu/",
        "https://asucrexchange.ucr.edu/",
        "https://gohighlanders.com/",
        "#top",
        "http://www.ucr.edu/privacy.html",
        "http://www.ucr.edu/terms.html"
    ]
}