{
    "title": "Hard-to-quantify emissions are the next frontier for Stanford sustainability goals | Stanford News",
    "body": "\n\n\n\n \n \n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\nSearch form\n\n\n\nSearch term\n\n\n\n\n\n\nHome\nFind Stories\nFor Journalists\nContact\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 20, 2021 Hard-to-quantify emissions are the next frontier for Stanford sustainability goals Stanford is celebrating Earth Day with a week of virtual events and is looking ahead to additional ways the campus can reach ambitious net-zero emissions goals, including tackling emissions from campus food, goods, travel and investments. \n\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\nBy Amy Adams\n\nEven before the pandemic, Stanford’s emissions from campus operations, which include providing electricity, heating and cooling to buildings and running campus shuttles, had fallen by 72% from their peak 2011 levels. Emissions will achieve an 80% reduction by 2022 when a new solar facility comes online, which is 3 years ahead of the 2025 deadline Stanford set for reaching that goal.\n\nBut those numbers only reflect relatively easy-to-track emissions. Now, Stanford is beginning to measure what are known as Scope 3 emissions, the indirect emissions generated by things such as growing and transporting food, travel, investments and producing the goods we buy.\nTackling Scope 3 emissions will be critical for achieving the goals laid out last year when Stanford’s Board of Trustees signed a resolution to reach at least net-zero greenhouse gas emissions from its operations and endowment by 2050. The Faculty Senate later urged the university to revise that target date to 2040 and encouraged faculty, students and staff to accelerate efforts to reduce emissions in their own lives.\nA living lab\nSally Benson, professor of energy resources engineering, has been working on measuring Scope 3 emissions produced through growing, producing, packaging and transporting food and goods. She hopes her work will have benefits beyond campus by helping governments, businesses and other universities reach their own emissions goals.\n\n\n\n\nStanford’s Long-Range Vision lays out the future direction for the university’s research, education and impact.\nRead our updates about those initiatives and their progress.\n\n\n“If you want to be on the cutting edge of reducing emissions you are going to have to tackle Scope 3 too,” Benson said. “For me, what’s important isn’t just that we reduce ours. What we do doesn’t matter unless we can provide tools that others can use to replicate our success.”\nWith Earth Day approaching April 22, Stanford is looking ahead to this next frontier while also encouraging other areas of personal and policy sustainability solutions through a series of virtual events.\nFood, travel and goods\nBenson’s interest in Scope 3 emissions began more than a decade ago when she had her students evaluate their own carbon footprints.\n\n\nCampus sustainability goals\nAs part of the Long-Range Vision, Stanford has committed to use 100% renewable energy sources and to have greenhouse gas emissions levels at 80% below peak by 2025. In addition, the university is working toward producing zero waste by 2030.\nMany of the innovations that will achieve these goals are run through Land, Buildings and Real Estate (LBRE), including the energy-efficient campus heating and cooling system that’s integrated into Stanford Energy System Innovations, and the water- and energy-saving Codiga Resource Recovery Center.\nThe Office of Sustainability, which is within LBRE, also runs an engagement program called My Cardinal Green, which rewards Stanford community members who take sustainable actions in their own lives.\nThese efforts and others focused on campus dining and residential life that are run through Residential & Dining Enterprises, have earned Stanford a Platinum ranking from the Association for the Advancement of Sustainability in Higher Education – one of nine universities to earn that ranking out of more than one thousand members.\nBuilding on these successes, and in recognition of the urgent threats facing the planet, Stanford is creating a new school focused on climate and sustainability that aligns existing expertise in research, education and impact to accelerate solutions. A faculty committee designing the school’s structure recently presented recommendations to the Faculty Senate and Board of Trustees, and work to develop and then launch the school will continue over the next year.\n\nSince baseline in 2000 or at peak levels, campus initiatives have reduced greenhouse gas emissions, energy intensity of campus activities, water use and waste. These reductions are from before the pandemic dramatically reduced all emissions, energy and water use. Click on image to enlarge. (Image credit: Courtesy Office of Sustainability)\n\n\n\n“Everyone knows flying is really bad,” she said. “But we found the stuff we buy was the biggest part of the footprint and it’s completely invisible.”\nThese emissions are invisible largely because they are so difficult to quantify. Benson and a graduate student are working on a tool that will make quantifying Scope 3 emissions easier, starting with those produced by the lowest-hanging fruit – food.\nTools exist that attempt to calculate all the emissions generated by a product’s journey from raw materials to the hands of a purchaser, Benson says. But some calculate based on the weight and others based on cost, and the two aren’t comparable. It turns out goods appear to produce far less emissions when calculated by cost, which is what most tools use because the data is easier to get. And because the tools don’t report how they calculate emissions, the results are inconsistent and Benson and Grekin can’t tell which are correct.\n“It isn’t apples to apples,” said Rebecca Grekin, the graduate student working with Benson. Two organizations ordering the same apples could report very different emissions – up to a three-fold difference, according to Benson – depending on the tool they use. In order to tackle Scope 3 emissions, they needed to start with a tool they could trust.\nIn collaboration with Residential & Dining Enterprises and the Office of Sustainability, Grekin has started from scratch, calculating emissions generated by the food actually served on Stanford campus. She is also coordinating with 10 other universities that have given her their own food data.\nGrekin added that Stanford had already made great strides in reducing emissions in the food served, in particular by offering many choices as alternatives to carbon-intensive beef.\n“When you compare the food served on campus to the typical American diet they’ve had a lot of initiatives to make improvements,” Grekin said.\nCreating a tool to quantify the emissions produced by food served on campus has been the focus of Grekin’s master’s degree, but it’s not her final goal.\n“The tool can also be edited to categorize other things,” she said.\nFor her PhD project, which she’ll begin with Benson next year, Grekin is going to begin looking at other sources of emissions including products like office goods. Eventually, Grekin says, the tool will be used to help Stanford evaluate and then reduce sources of emissions, and be made available for other businesses, governments or universities that wish to do the same.\nMany campus organizations have taken pledges to reduce emissions and have done a good job with energy efficiency and renewable energy sources, Benson said. She suggested that organizations with Scope 3 commitments could form a buying group to support emerging office products or food sources that have lower emissions. Benson added that her group’s focus on food and goods is just one part of a multi-year effort Stanford has launched to reduce its Scope 3 emissions, under the leadership of Randy Livingston, vice president of business affairs, chief financial officer and university liaison for Stanford Medicine. The program will be advised by a working group including faculty, staff and an undergraduate and graduate student.\nA helping hand\nReducing your carbon footprint – the emissions your actions directly produce – is important, Grekin said, but can feel discouraging. Instead, Grekin focuses on what she calls her handprint, or the emissions her influence has helped to reduce. Working on Scope 3 emissions is a way of increasing her handprint and having an even larger impact.\n“You need to not only look at the emissions you cause but also the emissions reductions you cause,” she said. “With this work, I can have a larger handprint by helping others become aware and reduce their own emissions.”\n\nEarth Day virtual events\nIn observance of Earth Day, Stanford’s Office of Sustainability is hosting a week of virtual events that celebrate campus commitments and support community sustainability efforts, including virtual tours of Codiga, discussions of how to sort waste and save water and energy at home and a sustainable cooking demonstration. The Stanford Woods Institute for the Environment will have additional scientific panels on wildland fire, sustainable development, human and planetary health and environmental justice.\nThe events also include a panel on carbon pricing – a policy mechanism that puts a price on carbon emissions as an incentive for industries to reduce their own emissions. The panel will be moderated by Catherine Luo ’23, who has been working with faculty and student organizations encouraging Stanford to sign a letter acknowledging carbon pricing as an indispensable step to effectively combat climate change.\nThe Associated Students of Stanford University have passed a resolution calling on the university to sign the letter, address its Scope 3 emissions and implement a carbon pricing system on campus.\n“Carbon pricing is a critical part of tackling climate change,” said Luo, who is majoring in Earth systems and economics. “When I heard about other higher education institutions signing on to support the carbon pricing letter I thought advocating for that at Stanford was a way I could make a difference.”\nShe’s been working with those Stanford faculty who support carbon pricing as a way of gaining attention for the policy solution among students, other faculty and university leadership. Although carbon pricing has many supporters, other faculty members support alternative mechanisms for combating climate change.\nThe panel, which takes place April 21 at 4 p.m., includes Lawrence Goulder, Shuzo Nishihara Professor of Environmental and Resource Economics, Frank Wolak, Holbrook Working Professor of Commodity Price Studies, John Weyant, professor of management science and engineering and Robert Litterman, from Kepos Capital. It is intent is to help educate the community about the nuances of carbon pricing and how it may be incorporated into future climate policy at the national level.\nLuo has worked on her carbon pricing initiative with Kunal Sinha ’24, who is a member of Fossil Free Stanford. “We’ve gotten a lot of support from faculty members who think carbon pricing is an important policy solution,” he said. Next year, Luo is thinking about doing research on carbon pricing and plans to continue advocating for it during her time at Stanford.\nLuo will be the initial undergraduate student representative on the working group advising the Scope 3 effort overseen by Randy Livingston. “Carbon pricing is one of many mitigation initiatives that the Scope 3 program and working group will consider.”\n\n\n\n\n\n\n\n\n\n\n\n\nMedia Contacts\nAmy Adams, University Communications: (650) 497-5908; amyadams@stanford.edu\n\n\n\nUniversity Affairs\nOur Vision\nSustainability\n\n\n\nFacebook\nTwitter\nLinkedIn\nEmail\n\n\n\n\n\n\n\n\n\nWhat to read next:\n\n\n\n\n \nScience & Technology\nA better, faster tool for saving water on farms\nA new tool for designing and managing irrigation for farms advances the implementation of smart agriculture, an approach that leverages data and modern technologies to boost crop yields while conserving natural resources.\n \n\n\n\n\n\n \nScience & Technology\nBanking on nature\nThe Natural Capital Project is working with development banks and 10 pilot countries to put the environment at the forefront of policy and investment decisions.\n \n\n\n\n\n\n \nLaw & Policy\nBeyond the room where it happened\nYou may have given little thought to the role Native Americans played in the creation of the U.S. Constitution. But SLS scholars argue that Native people profoundly shaped the conversation.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Report\nTo receive Stanford news daily,\nsubscribe to Stanford Report.\n\n\nFor Journalists\n\nPress Releases\nMedia Contacts\nStanford Experts\n\n\n\nSee Also\n\nContact Stanford News\nFaculty / Staff Resources \n\n\n\n\nEvents\n\nEvents calendar\n\n\n\nStanford News is a publication of Stanford University Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "/",
        "https://news.stanford.edu/",
        "https://news.stanford.edu/find-stories/",
        "https://news.stanford.edu/for-journalists/",
        "https://news.stanford.edu/contact/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D39214",
        "https://news.stanford.edu/wp-content/uploads/2021/04/Emissions_March2020_FNA_V5.jpg",
        "https://news.stanford.edu/2020/06/12/trustees-commit-accelerating-transition-to-net-zero-greenhouse-gas-emissions/",
        "https://news.stanford.edu/2020/11/05/faculty-senate-urges-action-sustainability/",
        "https://profiles.stanford.edu/sally-benson",
        "https://news.stanford.edu/wp-content/uploads/2018/11/OurVision-Logo-Red-grey.jpg",
        "https://ourvision.stanford.edu/",
        "https://news.stanford.edu/topic/our-vision/",
        "https://sustainable.stanford.edu/campus-action/stanford-energy-system-innovations-sesi",
        "https://cr2c.stanford.edu/about-0",
        "https://sustainable.stanford.edu/",
        "https://sustainable.stanford.edu/cardinal-green",
        "https://sustainabilityinitiative.stanford.edu/",
        "https://news.stanford.edu/2021/03/12/new-stanford-climate-sustainability-school-designed-achieve-ambitious-goals/",
        "https://news.stanford.edu/wp-content/uploads/2021/04/Scope3_graphic.jpg",
        "https://sustainable.stanford.edu/cardinal-green/cardinal-green-events/celebrating-sustainability/earth-week-2021",
        "https://woods.stanford.edu/",
        "https://woods.stanford.edu/events/upcoming-events",
        "https://collegepetitions.org/stanford-university/carbon-pricing/",
        "https://citizensclimatehighered.org/endorsements",
        "https://www.stanforddaily.com/2021/03/29/senate-urges-stanford-to-consider-a-campus-price-on-carbon-emissions/",
        "https://profiles.stanford.edu/lawrence-goulder",
        "https://profiles.stanford.edu/frank-wolak",
        "https://profiles.stanford.edu/john-weyant",
        "mailto:amyadams@stanford.edu",
        "https://news.stanford.edu/section/university-affairs/",
        "https://news.stanford.edu/topic/our-vision/",
        "https://news.stanford.edu/topic/sustainability/",
        "#",
        "#",
        "#",
        "mailto:?subject=An%20interesting%20article%20from%20Stanford%20News&body=I%20want%20to%20share%20this%20news%20story%20from%20Stanford%20University%20with%20you%3A%20https%3A%2F%2Fnews.stanford.edu%2F%3Fp%3D39214",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://news.stanford.edu/section/science-technology/",
        "https://news.stanford.edu/2023/04/27/better-faster-tool-saving-water-farms/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://news.stanford.edu/section/science-technology/",
        "https://naturalcapitalproject.stanford.edu/news/global-forum-kicks-new-project-mainstream-nature-decision-making",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "https://news.stanford.edu/section/law-policy/",
        "https://law.stanford.edu/2023/04/18/stanford-law-school-authors-argue-for-a-new-vision-of-native-peoples-contributions-to-constitutional-law/",
        "/report/subscribe/",
        "/press-releases/",
        "/contact/media-contacts/",
        "/experts/",
        "/contact/",
        "http://ucomm.stanford.edu/facstaff/",
        "http://events.stanford.edu/",
        "https://ucomm.stanford.edu",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://studentservices.stanford.edu/more-resources/student-policies/non-academic/non-discrimination",
        "https://www.stanford.edu/site/accessibility"
    ]
}