{
    "title": "Research - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\nResearch \n\n\n\n \nBusiness Double Major Ready for Life’s Next Big Challenge \n\n\t\tMore than 10 years ago, Hirra Khan moved from Pakistan to Gridley as a pre-teen. She will now graduate with one degree in business administration and another in business information systems, and an impressive work résumé.\t\n\n\n\n\n \nLife of Hard Work Pays Off for Agricultural Business Major \n\n\t\tZion Brigham says coming to Chico State: “felt like going from a black and white TV to full color.” He graduates in May with an agricultural business degree and a clear vision for what’s ahead.\t\n\n\n\n\n \nStudent-Managed Investment Fund Takes on a Bull Market  \n\n\t\tThe College of Business' Student Managed Investment Fund is giving students real-life opportunities to test money investment strategies.\t\n\n\n\n\n \nFrom Northern California to Ocean Engineer \n\n\t\tGridley native Irene Duran (Mechatronic Engineering, '20), moved to Cape Cod after graduating with one mission: an engineering job. \t\n\n\n\n\n \nThree Imaginative Media Arts Alumni Making Exciting Moves \n\n\t\tKarsten Kaufmann’s dance moves became a viral sensation in 2015. Find out where he and collaborating media arts majors Sophie McGuirk and Michael Connell are today. Hint: They're still making amazing content!\n\t\n\n\n\n\n \nStudents, Faculty Embrace New Fossils from Ever-Growing ‘Miocene Zoo’ Site \n\n\t\tChico State continues to lead the way in making scientific determinations from the findings at a Northern California site.\t\n\n\n\n\n \nNew Study Explores Drivers of Homelessness and Impact on Public Lands \n\n\t\tJesse Engebretson’s research aims to uncover ways state and federal governments can better serve unhoused communities who are increasingly pushed out of urban areas.\t\n\n\n\n\n \nDistinguished Alum, Scientist, and CEO Thomas Butler \n\n\t\tThomas Butler found his passion in a Chico State lab. Today, he's the CEO of a company creating medicines designed to attack cancer and diabetes. \t\n\n\n\n\n \nOffice Hours with Multicultural and Gender Studies Assistant Professor Lateasha Meyers \n\n\t\tAssistant professor Lateasha Meyers is combining her passion for art and scholarship in leadership in her teaching.\t\n\n\n\n\n \nDistinguished Alum and Strategic Architect Kimate Richards \n\n\t\tVeteran and alum Kimate Richards designs cutting-edge smart technology while making time to give back to his community.\t\n\n\n\n\n \nGateway Science Museum Exhibit Takes Visitors on a Water Drop’s Extreme Journey \n\n\t\tThe Gateway Science Museum's newest exhibit, \"Water's Extreme Journey,\" explores the water cycle, while water cycle works, while asking critical questions about the choices we make in our everyday lives.\t\n\n\n\n\n \nBig Chico Creek Ecological Reserve Partners with CalTrout, Mechoopda for Native Fish Passage Restoration Project in Bidwell Park \n\n\t\tThe University's Big Chico Creek Ecological Reserve is partnering with agencies, such as CalTrout and the Mechoopda Indian Tribe, on a native fish passage restoration project in Bidwell Park.\t\n\n\n\n\n \nDistinguished Alum and Farmworker Rights Advocate Armando Ibarra \n\n\t\tArmando Ibarra (Sociology, Spanish, ’99; MA, Public Administration, ’02) is being honored as the 2023 Distinguished Alumni of the College of Behavioral and Social Sciences.\t\n\n\n\n\n \nExpanding Collaborations in Latin America: Dean of College of Agriculture Visits Chile \n\n\t\tCollege of Agriculture Dean Patricia Stock visited several academic and research institutions to exchange knowledge about the myriad challenges agriculture is facing in Mediterranean climate regions—like those in California and Chile.\t\n\n\n\n\n \nWildland Management Master’s Student Driven to Preserve Natural Spaces \n\n\t\tAlum and current wildlands management master’s student Ben Chang is dedicating his life to battling climate change and mentoring the next generation of environmental stewards.\t\n\n\n\n\n \nStudent-Athlete Captures CalHOPE Courage Award \n\n\t\tGretta Kirkby, winner of the CalHOPE Courage Award, is using the opportunity to remind her peers to reach out for help if they need it. \t\n\n\n\n\n \n‘Beauty in the Chaos’: Fulbright Scholar’s Focus on Gemstone Trade in Sri Lanka \n\n\t\tAnthropology faculty Brian Brazeal navigated the global pandemic and political unrest as he went to Sri Lanka to document the country's gemstone trade as part of his Fulbright Scholar Award.\t\n\n\n\n\n \nCan Psychedelic Drugs Treat Mental Illness? One Grad Student’s Quest to Find Out \n\n\t\tChico State graduate student Ty Weber is collecting data to research whether psychedelic drugs may be helpful in treating mental health disorders.\t\n\n\n\n\n \nOffice Hours with Criminal Justice Faculty and Rural Issues Researcher Amy Magnus \n\n\t\tA passion for justice and activism has always been part of criminal justice professor Amy Magnus' identity. Now, she's sharing it with the next generation of changemakers. \t\n\n\n\n\n \nChico State Professor Helps Reshape How CSUs Teach About Climate Change \n\n\t\tChico State Professor Mark Stemen's Faculty Learning Community earns coveted sustainability award for helping CSUs integrate climate change topics in classrooms.\t\n\n\n\n\n \nFulbright Experience Helps Agriculture Faculty Deepen Roots Across the World \n\n\t\tWhether it was teaching his students, learning from colleagues, or endearing himself to local food vendors, College of Agriculture faculty Lee Altier's Fulbright experience in Turkey was a memorable one.\t\n\n\n\n\n \nBiology Student Among First to Research Fish’s Unusual Schooling Pattern \n\n\t\tCole Schmitt has been working with the National Systemics Laboratory and the Smithsonian Museum of Natural History, studying the vertical schooling behavior of the cutlassfish.\t\n\n\n\n\n \nA Space for Students to Practice Self-Care \n\n\t\tWith high rates of depression and anxiety among college students nationwide, Chico State has added an on-campus resource to help our Wildcats get to graduation, both healthy and happy.\t\n\n\n\n\n \nPARADISE U Helps Elementary Students Rediscover the Joy of Movement  \n\n\t\tPARADISE U, a physical education program created by kinesiology professor Cathrine Himberg, helps students discover the benefits and joy of movement. \t\n\n\n\n\n \nThe Princeton Review Honors Chico State as One of its Green Colleges \n\n\t\tThe Princeton Review recently listed Chico State on its 2023 Guide to Green Colleges.\t\n\n\n\n\n \n‘Latinx and Immigration’ Class Dives Deeper into Lived Experiences \n\n\t\tWith a course as relevant and impactful as \"Latinx and Immigration,\" MCGS faculty Gabby Medina Falzone is also preparing her students for their post-graduation goals.\t\n\n\n\n\n \nChico State University Farm Celebrates 60th Anniversary on November 5 \n\n\t\tAs Chico State's University Farm marks its 60th anniversary, it will host a free event to the public to celebrate its impact of serving the North State on Saturday, November 5.\t\n\n\n\n\n \nMessy Science: Pumpkin Drop Set for Halloween Day \n\n\t\tPut on by the Society of Physics Students the 33rd Chico State Pumpkin Drop demonstrates physics to elementary students in a creative and explosive way.  \t\n\n\n\n\n \nUltracold Atom Lab Attempting to Cross ‘Unreachable’ Threshold \n\n\t\tWith the ultra-high vacuum chamber up and running, the University's ultracold atom chamber is ready to cool atoms to near absolute zero so they display their true quantum nature.\t\n\n\n\n\n \nStudent Researchers Share Insight into Summer Projects \n\n\t\tCSC² has supported nearly 300 students in undergraduate research projects across the three colleges. \t\n\n\n\n\n \nMultimillion-Dollar Grants Provide Undergraduate Research Opportunities to Underserved Students in STEM \n\n\t\tSince 2016, the Chico STEM Connections Collaborative has provided academic and other support services to historically underserved students in science, technology, engineering, mathematics, and agriculture.\t\n\n\n\n\n \nCivil Engineering Faculty Awarded $1 Million Grant to Study Lagoon Wastewater Treatment \n\n\t\tCivil Engineering faculty Pablo Cornejo was one of two recipients nationally to receive a $1 million grant to study wastewater treatment systems.\t\n\n\n\n\n \nAlumna Chooses Nature to Nurture Others￼ \n\n\t\tBlake Ellis is at the leading edge of harnessing the natural world’s healing powers—even when that environment itself may trigger anxiety.\t\n\n\n\n\n \nChico State Earns Coveted Top Spot in Prestigious AASHE Sustainability Rankings \n\n\t\tThe Association for the Advancement of Sustainability in Higher Education recognized Chico State for its environmental practices, honoring it as the top performer in its Master’s Institutions category. \t\n\n\n\n\n \nBringing Mental Health to Light \n\n\t\tChico State alumni and family find healing through mental health awareness advocacy and the creation of a Senate bill to improve youth mental health in schools. \t\n\n\n\n\n \nNatural Sciences Students Put Themselves Under the Microscope During Summer Research \n\n\t\tThe College of Natural Sciences’ Summer Research Institutes provide  students with hands-on experience with a research topic in their field of study.\t\n\n\n\n\n \nInnovative Program Strives to Protect the Wildlands of the West \n\n\t\tThe first of its kind in the CSU, the interdisciplinary master's degree in wildland management is graduating students from its inaugural cohort.\t\n\n\n\n\n \nThousands of Physical Maps Need a Home—Students Helped Find One \n\n\t\tWith a move from Butte Hall looming, GIS students helped find a new digital home for hundreds of physical maps.\t\n\n\n\n\n \nCollege of Natural Sciences Dean Recognized with Environmental Lifetime Achievement Award \n\n\t\tThe Association for Environmental Studies and Sciences has recognized College of Natural Sciences Dean David Hassenzahl with its William R. Freudenburg Lifetime Achievement Award.\t\n\n\n\n\n \nOffice Hours: Sociology Professor and Dance Music Culture Researcher Danielle Hidalgo \n\n\t\tDanielle Hidalgo spent four years physically and digitally following three women DJs in an immersive research experience into dance culture. \t\n\n\n\nPosts navigation\n1\n2\n3\n…\n5\nNext\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/student-managed-investment-fund/",
        "https://today.csuchico.edu/from-northern-california-to-ocean-engineer/",
        "https://today.csuchico.edu/three-imaginative-media-arts-alumni-making-exciting-moves/",
        "https://today.csuchico.edu/students-faculty-embrace-new-fossils-from-ever-growing-miocene-zoo-site/",
        "https://today.csuchico.edu/study-homelessness-and-public-lands/",
        "https://today.csuchico.edu/distinguished-alum-thomas-butler/",
        "https://today.csuchico.edu/office-hours-lateasha-meyers/",
        "https://today.csuchico.edu/distinguished-alum-kimate-richards/",
        "https://today.csuchico.edu/gateway-exhibit-water-journey/",
        "https://today.csuchico.edu/bccer-partners-native-fish-passage/",
        "https://today.csuchico.edu/distinguished-alum-armando-ibarra/",
        "https://today.csuchico.edu/dean-stock-visits-chile/",
        "https://today.csuchico.edu/ben-chang-wildland/",
        "https://today.csuchico.edu/student-athlete-captures-calhope-courage-award/",
        "https://today.csuchico.edu/brazeal-fulbright-experience/",
        "https://today.csuchico.edu/psychedelics-as-therapeutics/",
        "https://today.csuchico.edu/office-hours-amy-magnus/",
        "https://today.csuchico.edu/mark-stemen-flc/",
        "https://today.csuchico.edu/altier-fulbright-experience/",
        "https://today.csuchico.edu/biology-student-among-first-to-research-fishs-unusual-schooling-pattern/",
        "https://today.csuchico.edu/the-well/",
        "https://today.csuchico.edu/paradise-u/",
        "https://today.csuchico.edu/princeton-review-green-school/",
        "https://today.csuchico.edu/latinx-and-immigration/",
        "https://today.csuchico.edu/university-farm-60th-anniversary/",
        "https://today.csuchico.edu/messy-science-pumpkin-drop-set-for-halloween-day/",
        "https://today.csuchico.edu/ultracold-atom-lab-update/",
        "https://today.csuchico.edu/csc2-student-researchers/",
        "https://today.csuchico.edu/csc2/",
        "https://today.csuchico.edu/cornejo-million-dollar-grant-wastewater/",
        "https://today.csuchico.edu/alumna-forest-therapy/",
        "https://today.csuchico.edu/2022-aashe-sustainability-rankings/",
        "https://today.csuchico.edu/bringing-mental-health-to-light/",
        "https://today.csuchico.edu/natural-sciences-summer-research/",
        "https://today.csuchico.edu/ms-wildland-management/",
        "https://today.csuchico.edu/maps-find-digital-home/",
        "https://today.csuchico.edu/environmental-lifetime-achievement/",
        "https://today.csuchico.edu/office-hours-danielle-hidalgo/",
        "https://today.csuchico.edu/category/research/page/2/",
        "https://today.csuchico.edu/category/research/page/3/",
        "https://today.csuchico.edu/category/research/page/5/",
        "https://today.csuchico.edu/category/research/page/2/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}