{
    "title": "People - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\nPeople \n\n\n\n \nBusiness Double Major Ready for Life’s Next Big Challenge \n\n\t\tMore than 10 years ago, Hirra Khan moved from Pakistan to Gridley as a pre-teen. She will now graduate with one degree in business administration and another in business information systems, and an impressive work résumé.\t\n\n\n\n\n \nExpanded CalFresh Eligibility Brings Food Access to More Chico State Students \n\n\t\tMore Chico State students can now qualify for CalFresh benefits to access food, thanks to expanded eligibility requirements.\t\n\n\n\n\n \nWorth Sharing: Health Services Administration College Bowl Team Scores Wins \n\n\t\tA listing of professional achievements by Chico State faculty, staff, and students.\t\n\n\n\n\n \nLife of Hard Work Pays Off for Agricultural Business Major \n\n\t\tZion Brigham says coming to Chico State: “felt like going from a black and white TV to full color.” He graduates in May with an agricultural business degree and a clear vision for what’s ahead.\t\n\n\n\n\n \nFond Farewell: Retired Librarian Joel Leonard \n\n\t\tWith a strong personality and a lot of joy, Joel Leonard embraced his job as librarian as one with a primary mission of supporting students. \t\n\n\n\n\n \nRooted in Connection: The Wildcat Family Tree \n\n\t\tAttending college is a significant milestone for any student, but for many, enrolling at Chico State is both a personal achievement and a family tradition.\t\n\n\n\n\n \nMother, Son Turned Classmates Learn From Each Other \n\n\t\tKevin LaCombe and Evone LaCombe were overlapping kinesiology students for two semesters—an experience the mother and son called unique and inspiring. \t\n\n\n\n\n \nDegrees of Hope and Opportunity \n\n\t\tThe patriarch of the Yang family wanted to see all of his children earn college degrees. All 10 of them did from Chico State.\t\n\n\n\n\n \nCrossed Paths Lead Back to Chico \n\n\t\tRecreation Administration majors Suzy and Paul McCreary fell in love at Chico State, and they built their lives around their shared love for their school and giving back.\t\n\n\n\n\n \nIdentical Twins Follow Different Dreams \n\n\t\tRelying on each other for support, Vanessa and Viviana Mendoza discover their own identity in college.\t\n\n\n\n\n \nPitch-Perfect Wildcats \n\n\t\tThirteen sets of siblings have donned the cardinal and white of the Wildcats, and the men's soccer program’s legacy is becoming intergenerational.\t\n\n\n\n\n \nFive Siblings Fulfill Father’s Dream \n\n\t\tSalvador Hernandez left a remarkable legacy as his five children earned college degrees from Chico State, fulfilling his dream.\t\n\n\n\n\n \nChild Development Major Owes Success to Her Grandmother \n\n\t\tOvercoming obstacles and adversity as a child, Abigail Resendez is ready to graduate with a degree in child development—and it was her grandmother who helped make it possible.\t\n\n\n\n\n \nChico State Recognizes 2022–23 Outstanding Faculty \n\n\t\tThese awards—among the highest at Chico State—celebrate eight phenomenal faculty for academic distinction, prominent scholarship, and commitment to transformative experiences.\t\n\n\n\n\n \nSoon-to-be Theatre Arts Graduate Has Played a Starring Role Offstage \n\n\t\tGaby Saxon has spent four years at Chico State telling outstanding stories, all while using her growing voice and passion for social justice to create one of the most compelling stories of all—her own! \t\n\n\n\n\n \nStudents Travel, Grow, and Build Friendships Through Speech and Debate Team \n\n\t\tThe speech and debate team, which doubles as a club and a course, offers team members space to grow far beyond the competition stage. \t\n\n\n\n\n \nJournalism Major Finds Career Path to Write Her Own Future \n\n\t\tA love of writing led Skylar Trostinsky to journalism and Tehama Group Communications, where she’s honing her skills and paving the way for a successful career in PR.\t\n\n\n\n\n \nMolecular Biology Student Turns ‘Beautiful Disasters’ into Lifelong Call to Service \n\n\t\tHikmat Abou Shahla has spent his formative years stepping up to help during seasons of global crisis. He is set to graduate and continue on the path of service.    \t\n\n\n\n\n \nWorth Sharing: Chico State Model UN Wins Outstanding Delegation Award \n\n\t\tA listing of professional achievements by Chico State faculty, staff, and students.\t\n\n\n\n\n \nFrom Northern California to Ocean Engineer \n\n\t\tGridley native Irene Duran (Mechatronic Engineering, '20), moved to Cape Cod after graduating with one mission: an engineering job. \t\n\n\n\n\n \nIn the Midst of a Successful Career of Catching Bad Guys, Military Vet  Pursues Online MBA \n\n\t\tAfter a long and successful career first in the military and then the financial industry, Rio Miner enrolled in Chico State's online MBA program to further his career and fill in the gaps in his business acumen.\t\n\n\n\n\n \nConstruction Management Student Gets Solid Start to Future \n\n\t\tSenior construction management major Mateus Avalos went from novice to leader in the program—securing three internships and helping lead community service projects in his hometown of Chico.\t\n\n\n\n\n \nGraduating Public Health Student Embraces Support and Grows Through Challenges \n\n\t\tFirst-gen student, Elizabeth “Eli” Contreras-Perez, has navigated many personal struggles on her path to graduating, finding newfound resilience, and beginning a new chapter in life.  \t\n\n\n\n\n \nThree Imaginative Media Arts Alumni Making Exciting Moves \n\n\t\tKarsten Kaufmann’s dance moves became a viral sensation in 2015. Find out where he and collaborating media arts majors Sophie McGuirk and Michael Connell are today. Hint: They're still making amazing content!\n\t\n\n\n\n\n \nTitle IX at 50: Current Wildcat Calling Attention to Women Who Paved the Way \n\n\t\tThe legacy of Title IX at Chico State is filled with stories of inspiring women. Mia Mendoza knows many of them by heart after spending this year sharing them with Chico State’s student-athletes and fans to honor the 50th anniversary of the landmark legislation.\t\n\n\n\n\n \nFond Farewell: Business Professor Emeritus Casey Donoho \n\n\t\tBusiness Professor Emeritus Casey Donoho is remembered for his passion for ethics and his others-centered approach.\t\n\n\n\n\n \nFond Farewell: Former Student Development Director Cleo Bauer \n\n\t\tWorking at four CSUs and Cornell University, Cleo (Bash) Bauer's sense of adventure also led her to climb mountains and explore the world.\t\n\n\n\n\n \nKinesiology Major Finds Groove in Adapted Physical Education \n\n\t\tFrom hating PE to aspiring to change how it is taught, Drew Jones’ passion for adapted physical education has taken her on a journey of service-learning opportunities and to pursue her teaching credential.\t\n\n\n\n\n \nAlumna Takes Pride in Identity, Launches ‘Queer Gear’ Business \n\n\t\tSarah Weiss started an e-commerce store that's not just fashionable, but impactful. Queer Gear sells clothing to promote visibility and representation, while giving back to nonprofit organizations focused on LGBTQ+ causes.\t\n\n\n\n\n \nWorth Sharing: University Enjoys Trio of Rankings \n\n\t\tA listing of professional achievements by Chico State faculty, staff, and students. \t\n\n\n\n\n \n’Cats Get Cookin’ with Rancho Llano Seco Marketing Director Lindsey Barrett  \n\n\t\tFrom Boston to South America and back home to Chico, Lindsey Barrett explores life through her love of food and writing, and shares her recipe for fresh pasta dough!\t\n\n\n\n\n \nOffice Hours with Concrete Industry Management Professor Mohammed Albahttiti \n\n\t\tCIM Professor Mohammed Albahttiti empowers students through hands-on service-learning projects that connect theory with real-world application. \t\n\n\n\n\n \nChief Diversity Officer Joseph Morales Writes a New Chapter at Chico State \n\n\t\tAs a first-generation graduate whose life was transformed by access to education, Joseph Morales knows firsthand how powerful it can be.\t\n\n\n\n\n \nNew Study Explores Drivers of Homelessness and Impact on Public Lands \n\n\t\tJesse Engebretson’s research aims to uncover ways state and federal governments can better serve unhoused communities who are increasingly pushed out of urban areas.\t\n\n\n\n\n \nReligious studies alumna provides a ministry of presence \n\n\t\tOne of the crucial steps along Kelly Ann Nelson's path to being present with others in pain was the religious studies education she earned at Chico State.\t\n\n\n\n\n \nWorth Sharing: Chase Selected as a Fulbright US Scholar \n\n\t\tA listing of professional achievements by Chico State faculty, staff, and students.\t\n\n\n\n\n \nFond Farewell: Retired University Farm Mechanic Jerry Miguel \n\n\t\tJerry Miguel, University Farm mechanic for nearly 30 years, is remembered for all his tools—those he held in his hands, as well as his heart, spirit, and mind.\t\n\n\n\n\n \nAlumna Uses International Education, Business Acumen to Build Cascade of Success \n\n\t\tAfter getting her start in business importing zippers while working on her MBA, Linling Gan has thrived in industries ranging from fashion to aerospace, as well as international education and real estate.\t\n\n\n\n\n \nChico State Freshman Impresses Coaches on The Voice \n\n\t\tSophia Hoffman overcame a processing disorder to make it to Chico State—now she is turning heads on international television.\t\n\n\n\n\n \nOffice Hours with Journalism and PR Department Chair and Professor Janell Bauer \n\n\t\tFueled by her passion for feminism and gender equity research, Janell Bauer aims to inspire her students to be thoughtful communicators.\t\n\n\n\nPosts navigation\n1\n2\n3\n…\n22\nNext\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/fond-farewell-joel-leonard/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://today.csuchico.edu/mother-son-turned-classmates-learn-from-each-other/",
        "https://today.csuchico.edu/degrees-of-hope-and-opportunity/",
        "https://today.csuchico.edu/mccreary-family/",
        "https://today.csuchico.edu/identical-twins-follow-different-dreams/",
        "https://today.csuchico.edu/pitch-perfect-wildcats/",
        "https://today.csuchico.edu/five-siblings-fulfill-fathers-dream/",
        "https://today.csuchico.edu/abigail-resendez/",
        "https://today.csuchico.edu/2023-outstanding-faculty/",
        "https://today.csuchico.edu/gaby-saxon/",
        "https://today.csuchico.edu/friendships-through-speech-debate/",
        "https://today.csuchico.edu/skylar-trostinsky/",
        "https://today.csuchico.edu/hikmat-abou-shahla/",
        "https://today.csuchico.edu/worth-sharing-04242023/",
        "https://today.csuchico.edu/from-northern-california-to-ocean-engineer/",
        "https://today.csuchico.edu/rio-miner-online-mba/",
        "https://today.csuchico.edu/mateus-avalos/",
        "https://today.csuchico.edu/elizabeth-contreras-perez-profile/",
        "https://today.csuchico.edu/three-imaginative-media-arts-alumni-making-exciting-moves/",
        "https://today.csuchico.edu/title-ix-at-50/",
        "https://today.csuchico.edu/fond-farewell-casey-donoho/",
        "https://today.csuchico.edu/fond-farewell-cleo-bash-bauer/",
        "https://today.csuchico.edu/drew-jones/",
        "https://today.csuchico.edu/sarah-weiss/",
        "https://today.csuchico.edu/worth-sharing-04032023/",
        "https://today.csuchico.edu/cats-get-cookin-with-rancho-llano-seco-marketing-director-lindsey-barrett/",
        "https://today.csuchico.edu/office-hours-with-concrete-industry-management-professor-mohammed-albahttiti/",
        "https://today.csuchico.edu/meet-joseph-morales-chief-diversity-officer/",
        "https://today.csuchico.edu/study-homelessness-and-public-lands/",
        "https://today.csuchico.edu/religious-studies-alumna-provides-a-ministry-of-presence/",
        "https://today.csuchico.edu/worth-sharing-03202023/",
        "https://today.csuchico.edu/fond-farewell-jerry-miguel/",
        "https://today.csuchico.edu/linling-gan/",
        "https://today.csuchico.edu/sophia-hoffman-the-voice/",
        "https://today.csuchico.edu/office-hours-with-janell-bauer/",
        "https://today.csuchico.edu/category/people/page/2/",
        "https://today.csuchico.edu/category/people/page/3/",
        "https://today.csuchico.edu/category/people/page/22/",
        "https://today.csuchico.edu/category/people/page/2/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}