{
    "title": "Moving Forward and Giving Back: The Graduates of CSUN’s Project Rebound  |  CSUN Today",
    "body": "\n\n\n\nCSUN Homepage\nWebmail\nA to Z\nPeople Finder\nEvents Calendar\nAccessibility\nSkip to Content\n \n\n\n\n\n\n\nCSUN Today\nCalifornia State University, Northridge\nNavigation\n\n\n\nSubscribe:\nRSS\n\n\n\nSearch\n\n\n\n\n\n\n\n\nHome\nTop Stories\nCSUN Leaders\nUniversity News\nFor the Media\nFaculty & Staff\nCSU News\n \n\n\n\n\n\n\nMoving Forward and Giving Back: The Graduates of CSUN’s Project Rebound\n\n\n\n\n\t\t\t\t\tJenny Steinbeck\t\t\t\t\n\non\nJune 23, 2022\n\n\nin\nAlumni, Computer Science, Faculty and Staff Achievements, Graduation Ceremony, Presentations, students \n\nComments Off on Moving Forward and Giving Back: The Graduates of CSUN’s Project Rebound \n\n\n\n\n\n\n\n\nShannon Tinker is congratulated by Congressman Tony Cardenas at the Project Rebound graduation ceremony at Chicano House on Friday, May 6. Photo by Lee Choo.\n\n\n\nFamily and friends gathered to celebrate with the graduates at a special ceremony held at the Chicano House, Friday, May 6. Photo by Lee Choo. \n\n\n\nMaria Martinez listens to speeches at the Project Rebound ceremony for the graduates of 2022. Photo by Lee Choo.\n\n\n\nAlexandra Reyes poses for a family portrait at the Project Rebound graduation ceremony on Friday, May 6. Photo by Lee Choo.\n\n\n\nA special graduation ceremony and party took place on Friday, May 6, 2022 at CSUN's Chicano House to celebrate the graduates from the Project Rebound program. Photo by Lee Choo.\n\n\n\n\n\n\n\n\n\n\n\n\n\nGraduation is a time of joy and pride. At CSUN, the happiness is palpable across campus. So many students have made sacrifices to complete their degrees — working multiple jobs, taking out loans and giving up time with friends and family for the promise of higher education.\n\n\nFor nine Matador graduates this year, crossing the commencement stage was a particular triumph.\n\n\nThese members of the Class of 2022 — all women — made up the university’s second cohort of Project Rebound. The program, which launched at CSUN in 2020, was created at San Francisco State University in 1967 to guide formerly incarcerated people through higher education.\n\n\nSeven Project Rebound graduates shared their stories with us. Many graduated with honors this spring, and five earned master’s degrees. Some have served years in state or federal prisons. Others spent time in county jail. Some grew up in families where addiction, not college, was the norm. One is a former foster youth who, as a teen, tried to hold her family together after the death of her guardian.\n\n\nTheir stories may differ, but each shares a common thread of struggle, whether emotional or financial.\n\n\nThe graduates also share an unwavering desire to give back, through their chosen career path or as volunteers tutoring, counseling or listening to others.\n\n\nTheir time in college ignited the fire of determination and the will to succeed in each of them, even when facing uncertain housing, parenting responsibilities and financial difficulties.\n\n\nThe Project Rebound graduates’ love and appreciation for education is evident. They have learned, the hard way, how education can lift them up — and they are ready to keep climbing.\n\n\nDespite their accomplishments, many still feel self-doubt and shame. They worry about being accepted at work and in the community. Those who have had their criminal records expunged still worry that their past mistakes will prevent them from doing meaningful work in the future.\n\n\nProject Rebound offered this cohort a safety net, financial support and, most importantly, a community of others, like family, who have traveled the same road.\n\n\nHere are some of their stories.\n\n\nThe Graduates \n\n\nKathy Jamieson (M.S.W, Social Work, College of Social and Behavioral Sciences)\nKathy Jamieson, M.S.W., Social Work. Photo by Lee Choo.\n\n\nThis spring, Kathy Jamieson completed her master’s in social work, graduating with honors. She plans to pursue certification as a Licensed Clinical Social Worker. Jamieson is the first in her family to get a college degree.\n\n\nFor the self-described “non-traditional student,” it’s been a long road to that degree. Jamieson, 52, was first incarcerated at age 33, then again at 37. Alcohol and drug addiction led her to poor choices, she said. “I know what opiates can do,” Jamieson said. “I know how they ravage families.”\n\n\nShe credits her first steps toward higher education to the staff at the treatment center where she went through detox. Later, the staff hired her as a psychiatric technician. Encouraged to consider a career in that profession by the treatment center staff, Jamieson enrolled at Pierce College.\n\n\n“I was very scared walking on that campus my first day,” she said. “My legs shook.” Jamieson didn’t tell anyone about her past in her general education classes. “There was so much shame and so much guilt,” she said.\nAfter transferring to CSUN and completing her bachelor’s degree in psychology (magna cum laude), Jamieson applied to CSUN’s Master of Social Work program, where confidence and truth slowly overtook her shame and guilt.\n\n\n“The professors in the M.S.W. program, once I disclosed my past in class … I just felt understood,” she said. “There’s just been something super special about this program. And then came Project Rebound.”\n\n\nLike other graduates in the program, Jamieson credited the emotional support provided by the Project Rebound community with helping her get through graduate school. “Dr. [Martha] Escobar is creating a community for people to feel like they belong,” she said.\n\n\nSome of her feelings of guilt and shame linger, but they’re fading, Jamieson said. “There is a view of what a person with a criminal history looks like or a drug addict looks like,” she said. “I want to change that face.”\n\n\nDellaynnah Cleveland (M.S.W, Social Work, College of Social and Behavioral Sciences)\nDellaynnah Cleveland, M.S.W., Social Work. Photo by Lee Choo.\n\n\nDellaynnah Cleveland wants to start her own nonprofit someday, working with the homeless population. A single parent of a 7-year-old daughter, Cleveland worked full time while pursuing her master’s degree and maintained, as she put it, “pretty much straight-A’s.”\n\n\n“It’s tough being a single parent, trying to get an education and model something for them,” Cleveland said.\n\n\nCleveland was incarcerated at the age of 19, for 3-and-a-half years, after growing up, in part, in foster care. While in prison, she earned her associate degree in business, through a correspondence course. It was there she realized an education was necessary because her criminal background would limit her opportunities.\n“I knew that I would need to obtain an education in order to combat the ills of society and to increase my odds of having and living a ‘normal’ productive life,” she said. After she was released, she enrolled in social and behavioral sciences courses at CSU Bakersfield, where she completed her bachelor’s degree in sociology with a minor in psychology.\n\n\nAlways interested in higher education, Cleveland had maintained at least a 3.5 GPA in high school. But her path forward was full of disruptions and tragedy. She left foster care to live with an aunt, who died in a car accident when she was 17 years old. She was determined to stay with her younger cousins.\n\n\n“So here we are, 17, 16 and 15, trying to figure out how to survive and not get pulled into the [foster care] system again,” she said. “And that is what opened doors to petty crimes, that turned into me being incarcerated.” It was about survival, Cleveland said, “but the system doesn’t look at the things that you go through that get you here, the trials that you face.”\n\n\nProject Rebound’s focus on formerly incarcerated students is critical, she said.\n\n\n“Most people come [to higher education] already believing they don’t have what it takes to do it,” she said. “To have an organization who believes in your ability to access higher education is needed — to lift up those people who are actually trying to make a difference and trying to fit into society the best way that they can.”\n\n\nAna Zapata (B.A., Sociology, College of Social and Behavioral Sciences).\nAna Zapata, B.A., Sociology. Photo by Lee Choo.\nAna Zapata started taking college courses at Mission College when she was in high school.\n“I always knew I wanted to go to college,” Zapata said. She started with a child development class, and then took another class during her senior year of high school. “Then I got into some trouble,” she said, “and I had to stop taking that class.”\n\n\nZapata and her mother had a heated argument after Zapata’s class was cancelled for the day.  Her mother thought she was cutting school. The police were called. Many members of Zapata’s family are undocumented immigrants from Mexico, and she worries about family members getting arrested. “I’m very overprotective of my family,” she said. “I never want anything bad to happen to them.”\n\n\nAfter that run-in with the police, Zapata said she spent time recovering in a mental health facility. Later, in her 20s, further problems with the law led to Zapata serving a stint in county jail. Since then, she has become a U.S. citizen and now, a college graduate, the first in her family. The 34-year-old is considering pursuing a master’s degree in social work or library science.\n\n\n Whatever career path she follows, Zapata said, she wants to help people.\n\n\n“I’ve been through a lot, and I just wanna make sure that the next person who is in need of help at least has guidance,” she said. She credited Project Rebound with spurring her interest in graduate school. “I noticed, once I joined them, I got more motivated,” Zapata said.\n\n\nShannon Tinker (M.S.W., Social Work, College of Social and Behavioral Sciences)\nShannon Tinker, M.S.W., Social Work. Photo by Lee Choo.\n\n\nShannon Tinker has spent the past eight years pursuing higher education. With her newly completed master’s degree in social work, she wants to work as a mental health and substance abuse clinician. Part of her studies have included internships in counseling.\n\n\n“My life has completely changed,” she said. “I help a lot of clients who have mental health and substance abuse issues and legal issues, so I feel like I’m giving back what was given to me.”\n\n\nYears ago, Tinker’s behavior due to her addiction led to criminal charges. She spent a brief time in county jail, then went through recovery programs that allowed her to have her criminal record expunged.\n\n\nTinker is the first in her family to graduate from college. Despite how far she’s come, she still feels doubt and worries that her past will limit her future endeavors.\n\n\n“I have a lot of hope, but those questions always play in the back of your head, because there’s a limit to what someone can do when they’ve been arrested and had a felony,” Tinker said.\n\n\nThe support she’s received from Project Rebound was much more than financial, she said. “The financial resources have been really helpful, but they also assign you to a social worker who checks in with your needs,” Tinker said. “You just have this little community that’s uniquely working with you and providing any kind of help you need.”\n\n\nHer joy at graduation has been shadowed by loss, however. While completing her last semester at CSUN, Tinker’s older brother died. She struggled with grief while finishing her thesis, and she said her Project Rebound support system helped her get to the finish line. On graduation day, Tinker honored her brother’s memory by decorating her sash and mortar board with his name.\n\n\nMaygin McEwen (M.S.W, Social Work, College of Social and Behavioral Sciences).\nMaygin McEwen, M.S.W., Social Work. Photo by Lee Choo.\n\n\nMaygin McEwen is graduating with a master’s degree in social work, after completing her bachelor’s degree in psychology at CSUN in 2019. Still weighing her career path options, McEwen is considering working toward certification as a licensed clinical social worker. She also enjoys lobbying and working on behalf of human rights and social justice. She has participated in lobby days with the National Association of Social Workers and the American Civil Liberties Union.\n\n\nProject Rebound has offered McEwen help with some basic needs, but there’s much more to the program, she said.\n\n\n“Community is such a big thing, you know?” she said. “Martha [Escobar] and Lily [Gonzalez] are just there [for us],” McEwen said of the program’s directors. She’s now an intern for Project Rebound, working with Gonzalez, corresponding with incarcerated people about to be released and helping them plan their education.\n\n\nMcEwen, 55, completed all of her college coursework after stints in state and federal prisons. “I’ve worked hard for this,” she said, “but it also gives me the ability [to say to] somebody who’s gotten out, ‘You can’t tell me you can’t do it.’”\n\n\n \nMaria Martinez (B.S., Computer Science, College of Engineering and Computer Science).\nMaria Martinez. B.S. Computer Science. Photo by Lee Choo.\nAfter a year-long internship as a software engineer with the Walt Disney Company, Maria Martinez has lined up a full-time job with the entertainment giant, complete with a six-figure salary. They credited their success in difficult computer science courses, in part, to a hobby they learned in prison.\n\n\n“The classes were really hard until it clicked, and I was like, ‘Oh, it’s like crocheting!’” Martinez said. “It’s a new language and it’s a pattern, and the logic behind it.” Martinez learned to crochet while in prison, to de-stress.\n\n\nTheir younger sister, Denise, encouraged them to get their degree in computer science, Martinez said. Shortly before they were paroled from Folsom Women’s Facility, Denise came for a visit and asked about their career plans. “I told her, ‘[I’ll] probably just go and be a hairdresser or something,’” Martinez said.\n\n\nBut Denise had other plans. A software engineer for a gaming company, Denise enrolled Maria at East Los Angeles Community College, even before they’d been released from prison. The classes were hard, and Martinez struggled with imposter syndrome. After they transferred to CSUN, they drew strength from the Project Rebound community, Martinez said\n\n\n“Seeing other individuals graduating with similar backgrounds, I was like, ‘OK, I can do this. They can do it — I can do it,’” they said.\n\n\nWhile working and pursuing their degree at CSUN, Martinez has also tutored others in computer science and coding. Another point of pride: They convinced Disney management to create an internship for formerly incarcerated people studying computer science.\n\n\nAlexandra Reyes, M.A. Diverse Community Development Leadership. Photo by Lee Choo.\nAlexandra Reyes (M.A., Diverse Community Development Leadership, Tseng College, Graduate, International and Midcareer Education)\n\n\nAlexandra Reyes has earned her master’s degree in diverse community development leadership. She works as a paralegal — a job she landed through an internship, while studying sociology as an undergraduate at CSUN. But it’s been a difficult journey. Reyes dealt with homelessness as a teen and got into trouble with the law around the same time. After having her son, she knew she needed to pursue higher education for better opportunities, she said.\n\n\n “The doors started closing. When I was trying to look for work, simple work, everyone was just denying me,” she said. “As a new mother, you just feel like a failure. How can I not provide for this child?”\n\n\nAt CSUN, her undergraduate courses sparked a passion for social justice work, Reyes said. Then, an email from CSUN about the new master’s program for diverse community development leadership attracted her.\nOn this journey, the support from Project Rebound was important, she said. “Project Rebound is amazing,” Reyes said. “They were able to help me with food, to give my kids food.”\n\n\nReyes, 33, enjoys her work as a paralegal and wants to focus more on securing grants for the non-profit where she works, Neighborhood Legal Services of Los Angeles County. She is considering going to law school. “If it wasn’t for my higher education, I don’t know where I’d be,” she said.\n\n\nThe Founders \n\n\nLily Gonzalez (B.A. Chicana/o Studies, 2017. College of Humanities) and Martha Escobar, Ph.D.\nLily Gonzalez and Martha Escobar, Ph.D. Photo by Lee Choo.\n\n\nLily Gonzalez and Martha Escobar are the driving forces behind Project Rebound at CSUN. Gonzalez, Project Rebound’s program coordinator, is  a CSUN student, pursuing a master’s degree in Chicana/o Studies and formerly incarcerated.\nIn 2015-2016, she started Revolutionary Scholars, a group on campus that also supported formerly incarcerated students and lobbied to bring Project Rebound to CSUN.\n\n\n“Revolutionary Scholars allowed us to do a lot of the work that was needed to bring Project Rebound to campus,” Gonzalez said. “It was a collective effort.”\nGonzalez corresponds with incarcerated people who are about to be paroled and works with them to determine their best path to continue their education.\n\n\nEscobar is a professor of Chicana/o studies in the College of Humanities. She is the executive director of CSUN’s Project Rebound but is quick to say that it is a part-time position. However, her presence and dedication to the program is praised by the students, who said they receive emails from her starting at 4:30 in the morning. “What can I say? It’s when I have some time!” Escobar said.\n\n\nParticipating students sign an agreement to be part of the Project Rebound program and receive state funding for food and transportation, and books, Escobar said. The group also fundraises to help with emergencies.\nEscobar said she worries about those who have signed up with the program but are not in close contact with members. “We don’t know what their struggles are, you know?” She said.\nAs for the success of the program, Escobar says it’s not just that a degree opens opportunities. “It’s that you change the way that you think about the world and about yourself. It’s very much grounded in social justice.”\n\n\nProject Rebound has more than 30 students enrolled. Its organizers are also communicating with about 150 incarcerated people who want to continue their education once they are paroled.\n\n\n \n\n\n\n\n\n\n\n\n\n Alumni, College of Engineering and Computer Science, College of Social and Behavioral Sciences, Community, CSUN, Events, Students\n\n\nSubscribe\n\n\n\n\n\n\n\n\nRelated Posts:\n\n\n\nCSUN Success Story: How Malachia Hoover’s Time as a Matador Put Her on the Path to Saving Lives\n\n\nStudying Away – Get to Know the International and Exchange Student Center\n\n\nNew Tech and a Sense of Community: CSUN’s Assistive Technology Conference Celebrates 38 Years\n\n\nCSUN to host multimedia performance that explores climate change\n\n\n‘Ghosts’ Stories: On a Hit TV Show, CSUN Alum Uses His Voice\n\n\n\n \n\n\n← Return of the Movie Fest – Summer Movie Nights Return to CSUN Campus\nCSUN Prof to Spend Next Year Studying Mexico’s Indigenous Social Networks as a Ford Postdoc Fellow →\n\n\n\n\nTopicsArts and Culture\nAthletics\nBusiness\nCommunity\nEducation\nFaculty and Staff News\n\nFaculty and Staff Achievements\n\nHonors & Awards\nPresentations\nPublications\nResearch and Sponsored Projects\n\n\n\n\nHealth and Fitness\nMedia Releases\nPolitics and Society\nScience and Technology\n@CSUN Archive\nCSU News\n Unknown Feed\n\n\n\n\n\n\nGet the full  experience\n\nSubscribe Today\n\n\n\n\n\n\n\nSubscribe:\nRSS\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\nCalifornia State University, Northridge\nUniversity Advancement\nMarketing and Communications\n\t\t\t\t\t18111 Nordhoff Street, Northridge, CA 91330\n\t\t\t\t\tPhone: (818) 677-2130 / Contact Us\n\n\nContact Page Owner\nUniversity Policies\nAcrobat Reader\n\n\nCalifornia State University\nEmergency Information\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "http://www.csun.edu",
        "https://www.csun.edu/webmail/",
        "http://www.csun.edu/atoz/",
        "https://mynorthridge.csun.edu/psc/PANRPRD/EMPLOYEE/EMPL/c/NRPA_CSUN_APPS.NR_PEOPLESRCH_CMP.GBL/?&",
        "http://www.csun.edu/calendar/",
        "http://www.csun.edu/accessibility/",
        "#header",
        "https://csunshinetoday.csun.edu/",
        "https://csunshinetoday.csun.edu/",
        "#navigation",
        "https://csunshinetoday.csun.edu/feed/",
        "http://csuntoday.csun.edu/",
        "http://csuntoday.csun.edu/tag/featured/",
        "http://csuntoday.csun.edu/category/csun-leaders/",
        "http://csuntoday.csun.edu/category/university-news/",
        "https://csunshinetoday.csun.edu/for-the-media/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/",
        "https://csunshinetoday.csun.edu/category/csu-news/",
        "https://csunshinetoday.csun.edu/category/alumni/",
        "https://csunshinetoday.csun.edu/category/computer-science/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/",
        "https://csunshinetoday.csun.edu/category/graduation-ceremony/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/presentations/",
        "https://csunshinetoday.csun.edu/category/students/",
        "https://csunshinetoday.csun.edu/tag/alumni/",
        "https://csunshinetoday.csun.edu/tag/college-of-engineering-and-computer-science/",
        "https://csunshinetoday.csun.edu/tag/college-of-social-and-behavioral-sciences/",
        "https://csunshinetoday.csun.edu/tag/community/",
        "https://csunshinetoday.csun.edu/tag/csun/",
        "https://csunshinetoday.csun.edu/tag/events/",
        "https://csunshinetoday.csun.edu/tag/students/",
        "https://csunshinetoday.csun.edu/feed/",
        "http://www.twitter.com/csunorthridge",
        "http://www.facebook.com/calstatenorthridge",
        "http://www.youtube.com/calstatenorthridge",
        "https://csunshinetoday.csun.edu/science-and-technology/csun-success-story-how-malachia-hoovers-time-as-a-matador-put-her-on-the-path-to-saving-lives/",
        "https://csunshinetoday.csun.edu/arts-and-culture/studying-away-get-to-know-the-international-and-exchange-student-center/",
        "https://csunshinetoday.csun.edu/community/new-tech-and-a-sense-of-community-csuns-assistive-technology-conference-celebrates-38-years/",
        "https://csunshinetoday.csun.edu/arts-and-culture/csun-to-host-multimedia-performance-that-explores-climate-change/",
        "https://csunshinetoday.csun.edu/arts-and-culture/ghosts-stories-on-a-hit-tv-show-csun-alum-uses-his-voice/",
        "https://csunshinetoday.csun.edu/arts-and-culture/return-of-the-movie-fest-summer-movie-nights-return-to-csun-campus/",
        "https://csunshinetoday.csun.edu/arts-and-culture/csun-prof-to-spend-next-year-studying-mexicos-indigenous-social-networks-as-a-ford-postdoc-fellow/",
        "https://csunshinetoday.csun.edu/category/arts-and-culture/",
        "https://csunshinetoday.csun.edu/category/athletics/",
        "https://csunshinetoday.csun.edu/category/business/",
        "https://csunshinetoday.csun.edu/category/community/",
        "https://csunshinetoday.csun.edu/category/education/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/honors-awards/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/presentations/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/publications/",
        "https://csunshinetoday.csun.edu/category/faculty-and-staff-news/faculty-and-staff-achievements/research-and-sponsored-projects/",
        "https://csunshinetoday.csun.edu/category/health-and-fitness/",
        "https://csunshinetoday.csun.edu/category/media-releases/",
        "https://csunshinetoday.csun.edu/category/politics-and-society/",
        "https://csunshinetoday.csun.edu/category/science-and-technology/",
        "http://blogs.csun.edu/atcsun",
        "https://csunshinetoday.csun.edu/category/csu-news/",
        "http://csunshinetoday.csun.edu/category/faculty-and-staff-achievements/feed/",
        "",
        "http://localhost:8888/csunnews",
        "https://csunshinetoday.csun.edu/feed/",
        "http://www.csun.edu/contact/",
        "mailto:csuntoday@csun.edu",
        "http://www-admn.csun.edu/vp/policies/",
        "http://get.adobe.com/reader/",
        "http://www.calstate.edu/",
        "http://www-admn.csun.edu/publicsafety/emergency/"
    ]
}