{
    "title": "North State Planning & Development Collective",
    "body": "\n\n\nNORTH STATE PLANNING &DEVELOPMENT COLLECTIVE\n\n\n\n\n\n\n\nMENU\n\n\nWelcome to the Collective\nNorth State Planning and Development CollectiveAbout the CollectiveHow We Can HelpCOVID-19 Resources NewslettersCommunity Economic Resilience Fund (CERF)Center for Economic DevelopmentAbout the CEDNewsHow We Can HelpBusiness Assistance ProgramsEventsEconomic Forecast ConferenceRegional SummitsHolistic Financial PlanningInternship ProgramOur PartnersBiomass Feasibility StudyGeographical Information CenterAbout the GICHow We Can HelpInternship ProgramContactRiver RestorationBroadband ConsortiaNortheastern California Connect ConsortiumUpstate California Connect Consortium \n\n\n\n\n\nWelcome to the Collective\nAbout the CollectiveHow We Can HelpCOVID-19 Resources NewslettersCommunity Economic Resilience Fund (CERF)North State Planning and Development CollectiveNewsAbout the CEDBusiness Assistance ProgramsHow We Can HelpEconomic Forecast ConferenceRegional SummitsHolistic Financial PlanningEventsInternship ProgramOur PartnersBiomass Feasibility StudyCenter for Economic DevelopmentAbout the GICHow We Can HelpInternship ProgramContactRiver RestorationGeographical Information CenterNortheastern California Connect ConsortiumUpstate California Connect ConsortiumBroadband Consortia \n\nOUR OFFICES\n\n\nNorth State Planning and Development Collective\n\n\n35 Main Street, Suite 132\nChico, CA 95928\n\nOffice: (530) 898-4372\n\n\n\nThe Geographical Information Center\n\n\n35 Main Street, Suite 132\nChico, CA 95928\n\nOffice: (530) 898-4372\n\n\n\nCenter for Economic Development\n\n\n35 Main Street, Suite 203\nChico, CA 95928\n\nOffice: (530) 898-4598\n\n\n\n\n\n\n\n\nWelcome to the Collective\nWelcome to the North State Planning and Development Collective at California State University, Chico. \n\n            \"The Collective\" is a lead agency for planning, research and development needs across the University's 12-County service region and beyond.\n\n\n\n\nNorth State Planning and Development CollectiveCenter for Economic DevelopmentGeographical Information CenterBroadband Consortia \n\nWelcome to theNorth State Planning and Development CollectiveWelcome to the North State Planning and Development Collective at California State University, Chico. \n\"The Collective\" is a lead agency for planning, research and development needs across the University's 12-County service region and beyond.\nFor a list of Coronavirus Resources, please click here.About the CollectiveClick to learn moreHow We Can HelpClick to learn more about our servicesCOVID-19 Resources NewslettersCommunity Economic Resilience Fund (CERF)Welcome to theCenter for Economic DevelopmentThe Center for Economic Development is a division of the North State Planning and Development Collective at California State University, Chico. The Center provides regional leaders with accurate and timely information to address the socio-economic challenges and opportunities facing the region. About the CEDClick to learn more!How We Can HelpClick to learn more!EventsClick to learn more about our Events!Internship ProgramClick to learn more!Our PartnersBiomass Feasibility StudyWelcome to theGeographical Information CenterAbout the GICHow We Can HelpInternship ProgramContactRiver RestorationWelcome to theBroadband Consortia The Northeastern and Upstate California Connect Consortia, programs of the California Public Utilities Commission, are focused on improving broadband availability and performance within the region through information sharing, assessment of current broadband performance, incorporation of broadband intormation into local government planning, generating strategic broadband plans and more.  The Northeastern California Connect Consortium covers Butte, Modoc, Tehama, Lassen, Plumas, Shasta and Siskiyou counties.  The Upstate California Connect Consortium covers Colusa, Glenn and Lake counties. Working together, we can help bridge the digital divide.Northeastern California Connect ConsortiumUpstate California Connect Consortium\n\n\n\nJoin our Newsletter!\n\n\n\n\nYou have been subscribed\nSomething went wrong try again later\n\n\n\nCopyright © 2021 All Rights Reserved\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.necalbroadband.org/",
        "https://www.upcalbroadband.org/",
        "https://www.necalbroadband.org/",
        "https://www.upcalbroadband.org/",
        "https://www.google.com/maps/place/35+Main+St,+Chico,+CA+95928",
        "tel:530-898-4372",
        "https://www.google.com/maps/place/35+Main+St,+Chico,+CA+95928",
        "tel:530-898-4372",
        "https://www.google.com/maps/place/35+Main+St,+Chico,+CA+95928",
        "tel:530-898-4598",
        "https://www.necalbroadband.org/",
        "https://www.upcalbroadband.org/"
    ]
}