{
    "title": "Post Status Podcasts on Stitcher",
    "body": "\n  stitcherLogoCreated with Sketch.  \n      Get Premium\n     \n      Download App\n     \n          Listen\n           \n            Discover\n           \n            Premium\n           \n            Shows\n           \n            Likes\n           \n      Merch\n             \n      Listen Now\n      \n        Discover\n       \n        Premium\n       \n        Shows\n       \n        Likes\n          \n                Post Status Podcasts\n               \n              248 Episodes\n                \n                    Episodes\n                     \n                    About\n                             \n      46 minutes |\n      Apr 27, 2023\n      \n          Talking With Valet’s Ceo Kimberly Lipari About The Changing Value Of Websites To Organizations\n         Kim Lipari, owner and CEO of Valet, talks with Cory Miller about their insights and experiences on entrepreneurship, including how to handle challenges, the importance of building relationships, and the role of vulnerability in leadership. They offer advice on building a successful WordPress business and emphasize the need for continuous learning and personal growth. Overall, this episode provides valuable insights and advice for anyone interested in entrepreneurship and building a successful WordPress-based business. Top Takeaways:  Focus on the customer: It's important to understand the customer's pain points and what they're looking for in a website. By focusing on the customer, you can create a website that meets their needs and helps them achieve their goals. Prioritize security: As a WordPress professional, it's important to make sure that your client's websites are secure and protected from hackers and other online threats. This means staying up-to-date on the latest security best practices, using secure hosting providers, and regularly updating plugins and themes. Stay up-to-date on the latest trends: It's important to stay up-to-date on the latest trends and technologies in the WordPress ecosystem. This means attending conferences, following industry blogs and publications, and networking with other WordPress professionals. By staying on top of the latest trends, you can ensure that you're offering your clients the latest and greatest in WordPress technology.  🔗 Mentioned in the show:  Valet Nathan Wrigley Beaver Builder Jennifer Bourn Chris Lema Pagely WP Engine GoDaddy Flywheel Media Temple Kinsta Liquid Web Pippin Williamson Restrict Content Pro AffiliateWP Sandhills Development Easy Digital Downloads Gravity Forms iThemes Liquid Web Carl Alexander Lindsay Halsey Nathan Ingram Jason Resnick Matt Medeiros Hallway Chats  Trello Slack Zoom HubSpot Infusionsoft ActiveCampaign Salesforce AgileCRM 🐦 You can follow Post Status and our guests on Twitter:  Kimberly Lipari (Owner and CEO of Valet) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      95 minutes |\n      Apr 27, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 11\n         In this episode, Corey Maass and Cory Miller move from personal to professional. They offer impactful transparency, from discussing the importance of website speed, user experience, and SEO to practicing mindfulness and finding balance. They share insights on optimizing WordPress websites for performance, including hosting, caching, and image optimization tips. They also discuss the role of content in driving traffic and engagement, as well as strategies for leveraging social media to grow an online presence.   Top Takeaways:  Imposter Syndrome. Imposter syndrome is very common among people who work in tech, and it's important to acknowledge it and understand that it's okay to feel this way. It's helpful to talk to others about your feelings and to remind yourself of your accomplishments and skills. It's important not to compare yourself to others and focus on your progress and growth. Seeking support from a therapist or coach can be very helpful in managing imposter syndrome. Slow Hustle. Take a more intentional, thoughtful, and sustainable approach to work and life. Instead of constantly hustling and working long hours, “slow hustle” focuses on balancing work and rest, taking breaks, and being intentional about your work. Finding a pace that works for you helps in avoiding burnout. “Slow hustle” can help you find more fulfillment and purpose in your work and can be beneficial for long-term success. Personal Brand. Building a personal brand can help in various aspects of life. Establish your personal brand by identifying and highlighting your unique skills and strengths, being authentic and consistent, and cultivating relationships. Use social media and online platforms to share your expertise and connect with potential clients or collaborators. Continually invest in your personal and professional development, whether through learning new skills, attending conferences, or seeking mentorship or coaching. Remember the importance of maintaining a positive and professional online presence and reputation, as this can greatly impact your personal brand and career success. 🔗 Mentioned in the show:  Crop.Express Crop.Express Apple WordPress SquareSpace Medium Substack Ghost Matt Mullenweg  Chris Coyier Jeff Bezos Mark Zuckerberg Tim Ferriss Marie Forleo Gary Vaynerchuk  Casey Neistat Ben Thompson Peter Thiel  🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      85 minutes |\n      Apr 20, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 10\n         In this episode, Cory Miller and Corey Maass discuss the future of WordPress. From the adoption of the block editor to the rise of headless WordPress, they consider the impact on the growing WordPress community. Gain insights on how WordPress professionals can stay ahead of the curve, the importance of keeping up with the latest updates and developments in the WordPress ecosystem, and the significance of fostering a strong and supportive community. This is an honest and hopeful look at the current and future state of WordPress.   Top Takeaways:  Keep up with the latest WordPress updates. It's important for WordPress professionals to stay up-to-date with the latest WordPress updates, including security patches, bug fixes, and new features. This will ensure that your WordPress site stays secure and runs smoothly. Invest in continuous learning. As WordPress evolves, it's important to invest in continuous learning to keep up with the latest trends, technologies, and best practices. This can include attending conferences, networking with other professionals, and regularly reading blogs and publications related to WordPress and web development. Keeping up with the latest trends and best practices can help professionals stay competitive and provide the best possible service to their clients. Focus on user experience. User experience should be at the forefront of any WordPress professional's mind. This means designing websites that are easy to use, fast-loading, and visually appealing, as well as ensuring content is relevant and engaging for the target audience. By focusing on user experience, WordPress professionals can create websites that are both effective and enjoyable to use.  🔗 Mentioned in the show:  Crop.Express Jetpack Automattic WooCommerce Matt Mullenweg Chris Coyier CSS-Tricks CodePen Yoast WP Engine GitHub Atlassian Trello Asana Basecamp Zapier Dropbox Zoom Notion Figma Sketch InVision 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)    The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      41 minutes |\n      Apr 19, 2023\n      \n          Jesse Friedman on raising the WP hosting standard across the industry with WP.cloud\n         Cory Miller is joined by Jess Friedman from WP Cloud discuss how hosting companies can improve their infrastructure and services to provide better performance and reliability to their customers. They also dive into the importance of customer support, the benefits of using managed hosting services, the ethics of data collection, and more. The experience and expertise offered are sure to inspire you to increase your standards of service.   Top Takeaways:  Outsourcing Infrastructure. WordPress hosting companies can benefit from outsourcing their infrastructure to specialized providers such as WP Cloud. This can free up their customer support team from dealing with infrastructure-related issues and enable them to focus on providing better customer service and value-added services. Increase Customer Satisfaction. By democratizing publishing and providing a superior WordPress experience, hosting companies can reduce churn and retain customers who may otherwise switch to other platforms if their WordPress experience is subpar. Set Up for Speed. While many factors can impact website speed, some of the most important ones include optimizing images, using a content delivery network (CDN), and minimizing the use of plugins. By focusing on these areas, WordPress agencies can help their clients improve their website speed and ultimately provide a better user experience for their visitors.  🙏 Sponsor: A2 Hosting A2Hosting offers solutions for WordPress and WooCommerce that are both blazing fast and ultra-reliable. WordPress can be easily deployed on ANY web hosting plan from A2: Shared, VPS, or Dedicated. A2 also offers Managed WordPress and WooCommerce Hosting. Take a look at a2hosting.com today!🔗 Mentioned in the show:  WP Cloud WP Hosting Benchmarks $25-50 WP Hosting Benchmarks $201-500 Kinsta WP Engine SiteGround Bluehost DigitalOcean Pressable cPanel Plesk Cloudflare 🐦 You can follow Post Status and our guests on Twitter:  Jess Friedman (Head of WP Cloud) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      55 minutes |\n      Apr 13, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 9\n         In this episode, Cory Miller and Corey Maass share their insights and experience about the challenges of finding the right balance between simplicity and complexity and the importance of testing and documentation. They also share their personal stories of how they got started with WordPress and how their experiences have shaped their approach to plugin development. This episode is a must-listen for anyone interested in developing WordPress plugins, especially if you are looking to improve your development process and create more user-friendly plugins. Top Takeaways:  Building a successful plugin requires a deep understanding of user needs and pain points: Understanding your users' needs and pain points to develop a plugin that solves their problems effectively is critical. This requires continuous user testing and feedback to improve functionality and user experience. Collaboration and communication are crucial for plugin development: Plugin development is a team effort that requires effective communication, collaboration, and project management. Clear communication channels, regular meetings, and shared project management tools help ensure everyone is on the same page. Monetization strategies should align with user value: Considering various monetization strategies for plugins, including premium features, subscriptions, and sponsorships, is helpful. Your chosen strategy should align with the user's value proposition and offer a fair exchange of value. Being transparent with users about the plugin's monetization strategy and how it impacts their experience is important for successful adoption. 🔗 Mentioned in the show:  Crop.Express WPEngine Pagely StudioPress 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧     \n      87 minutes |\n      Apr 6, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 8\n         As Corey Maass and Cory Miller move further into their experience of launching a WordPress product in public, they delve into the insights they’ve gained and the obstacles they are facing. Listen to their perspectives on building a community around the product, overcoming challenges, handling feedback, and implementing effective marketing strategies. Top Takeaways  The impact of technology on personal and professional lives: Technology has revolutionized various aspects of our lives, from communication and information access to work and productivity. This brings about the benefits and challenges of living in a digitally connected world, including privacy, cybersecurity, and work-life balance issues. . The role of mindfulness in the digital age: Mindfulness practices can help individuals navigate the challenges of the digital age, such as reducing stress, improving focus and concentration, and promoting healthy technology habits. Integrating mindfulness into daily routines and setting boundaries with technology is more important than ever.  The need for conscious and intentional technology use: Being conscious and intentional about how we use technology, including being mindful of the impact of technology on our physical and mental health, relationships, and overall well-being, is critical. Being thoughtful about developing healthy technology habits, such as managing screen time, practicing digital detox, and being mindful of online behavior, can have a significant impact 🔗 Mentioned in the show:  Crop.Express iThemes Caldera Forms  Restrict Content Pro  WooCommerce  Gravity Forms 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      59 minutes |\n      Mar 30, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 7\n         Learn from Corey Maass, the go-to on WordPress product design topics, and Cory Miller, a master on the business of WordPress. They discuss finding the balance in the small and big pictures of product development, highlighting the process of trial and error. Top Takeaways  Courage Under Fire. After what feels like a miserable failure, it’s vital to keep trudging forward. Great product design takes time to build and grow in the space you are putting it into. Keeping your passion alive and remaining consistent in your efforts will eventually lead you to success. The Impact of Thoughtful Design. Developing a product is of course based on meeting some kind of user need, but it’s important to consider if you are really going to make that user’s life easier with your product. When the end user is your top priority, your product will shine, and you’ll be proud of the direct impact you made in someone’s everyday life. Finding the Spark in Your Product. Focusing on the overall product journey is key for great product development, but zooming in on the minor details is also just as important. Brainstorming and finding the spark is not easy, but it is crucial to set your product apart from the rest. Using Your Audience to Improve Development. Put your ideas and questions out there for your audience to speak to. If you are wondering how people will perceive a certain product aspect or want more information on what their exact pain points are, it’s good to directly ask. Getting information straight from your customers or peers can help you make well-informed decisions in product development. 🔗 Mentioned in the show:  Crop.Express StickerMule 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      36 minutes |\n      Mar 23, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 6\n         Learn from Corey Maass, a master of WordPress plugins and apps, and Cory Miller, a marketing, business, and WordPress experience guru. The two discuss the intimacies of partnering on a product and how solopreneurs can benefit from support.   Top Takeaways:  The Value of Partnerships. Starting a business can be a lonely experience. Having someone to bounce ideas off, talk through tough subjects with, and celebrate successes with makes a significant difference. Having that collaborative support system can make managing a business more enjoyable and streamlined, which is a huge benefit, especially for startups and small businesses. Discussion vs. Decision. It’s important to be intentional with communication considering the stage you are in when you are improving a product or creating something brand new. Being vocal about whether you are still discussing or whether you are ready to make decisive moves is critical to keep the process moving forward without missteps. The Art of Failing. Understanding that taking risks and being willing to fail in order to ultimately achieve success is key for solopreneurs and partnerships. Quantifying your success rate on projects isn’t the ultimate indicator of how successful you truly are. Stumbling through a myriad of shortcomings while still pursuing success is powerful. 🔗 Mentioned in the show:  Crop.Express Elementor Beaver Builder 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      92 minutes |\n      Mar 15, 2023\n      \n          Post Status Live – The Right Approach to WordPress Accessibility\n         The talented team from Modern Tribe joined Cory Miller for this critical discussion about accessibility in WordPress. They highlight accessibility as a non-negotiable aspect of web development and provide guidance for leaders, developers, and designers to ensure your websites are accessible to all people. Top Takeaways:  Why Value Accessibility? Accessibility ensures all people have access to the things we create. It can’t be an afterthought or something for the web dev team to figure out. It must drive the entire creative process and serve as an anchor to ground our teams and our work. Requirement vs. Challenge. Most creative projects work within a set of requirements. These don’t prohibit the creative process. Instead, they challenge us to enhance the things we build and make them better than we might have without thinking through and within these constraints. It’s All Around Us. We think of accessibility as a new idea, but in so many spaces, it’s the norm. We have curb cutouts and braille signage. We see this every day, so tech is catching up. Improving Usability. Developing through the lens of accessibility means delivering experiences that solve people’s problems and help them with tasks. It Takes Tools. The creative and engineering are just rails. Utilizing tools to ensure accessibility when publishing and setting up processes and guidelines will equip you to flex as requirements change. It’s necessary for your organization to resource accessibility for it to be done effectively. 🔗 Mentioned in the show:  Modern Tribe Eric Meyer MySpace 🐦 You can follow Post Status and our guests on Twitter:  Chris Kindred (Director of Backend Development, Modern Tribe) Sarah Gless (Creative Director, Modern Tribe) Mike Klanac (Director of Business Development, Modern Tribe) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      82 minutes |\n      Mar 15, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 5\n         As the development of Crop.Express continues, Cory Miller and Corey Maass continue to gain clarity on what is needed for their product to succeed. They discuss features and integration, free vs. paid versions, ensuring compatibility, and more, as they fold in their experience, expertise, and gathered feedback into the future strategy of their product business. Top Takeaways:  Cultivating empathy is important for developers. It's essential to understand the needs of different users, particularly those who are not very tech-savvy or who come from different cultural backgrounds. Empathy helps create products that are more user-friendly and accessible to a broader audience. Collaboration is crucial for success. No matter how brilliant a product developer is, they can't do everything on their own. They need a team of people with different skills and backgrounds to support them, whether it's in terms of design, marketing, or other areas. Building a supportive team requires humility and a willingness to accept feedback and help from others. Failure is a necessary part of growth. Many product developers go through a difficult experience where they realize that their work isn't as good as they thought it was. This experience can be humbling, but it's also an opportunity to learn and grow. It's important for developers to be open to feedback, to take risks, and to be willing to try new things, even if it means making mistakes along the way. 🔗 Mentioned in the show:  Sticker Mule Canva Kickstarter Unsplash Stock Unlimited 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      92 minutes |\n      Mar 10, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 4\n         In this episode, Corey Maass and Cory Miller focus on preparing Crop.Express for launch. They discuss building launch assets, utilizing a freemium model as a path toward a premium product, and future possibilities. Top Takeaways:  Value of a Soft Launch. This is a great way to test the waters and get initial feedback. If you utilize a soft launch, you need to be willing to make changes and improvements based on that feedback before you fully launch. Building a Sustainable Premium Product. Start by setting up a basic website and integration to attract customers. Establishing a freemium model allows you to identify what users will value enough to pay for and provides space for your plugin to become a recommended tool for users, agencies, and hosting providers as a premium product. Feedback as Fuel. Gathering input from customers and agency owners in the WordPress ecosystem can help you understand the barriers to adoption, like already established workflows, the challenge of installing and learning a new tool, and limitations within initial versions to full adoption. Importance of Image Use. Current workflows make images an afterthought in content creation, but they are critical to drawing interest, provide context, and evoke emotion. While there may be SEO value, the primary purpose is to appeal to human visitors. Creating tools to make this easier is the case for Crop.Express. Consider the possibilities. As product creators, you should continue to explore potential opportunities for development. Leveraging AI, increasing user engagement, and offering more value can uncover future revenue streams while you focus on current integration points. 🔗 Mentioned in the show:  Crop.Express Canva Photoshop Stock Unlimited Unsplash Content Journey Hacker News Beaver Builder Patrick Garman Hendrick Luehrsen Elementor Jess Frick Pressable Kadence 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      26 minutes |\n      Mar 10, 2023\n      \n          Interview With Product Lead Brandon Dove Of Pixel Jar\n         Brandon Dove, co-founder of Pixel Jar, joins Cory Miller to discuss his WordPress plugin, AdSanity Plugin. They dive into the nuance of advertising, evaluate the benefits of free and paid plugins, and talk through the challenges and opportunities available to agencies who invest in product development while providing other services.   Top Takeaways:  Recurring Product Revenue. While it can be challenging for an agency to balance custom service work with product development, having a product that generates recurring revenue can provide a cushion and diversify the overall business revenue. AdSanity is a successful example of this, and the team is working on dedicating more resources towards the product to even out development between the two sides of their business. However, it can be difficult to maintain free plugins without generating revenue, and it's important to consider how to incorporate them into the business model. Value vs. Spam in Advertising. For many people, advertising has become a four-letter word, so there is a need to help customers become good advertisers rather than just spamming ads everywhere. It’s critical to empower your visitors by explaining the importance of creating a community around the site to allow for more meaningful conversations with visitors. The Point of Free Plugins. Building free plugins is more about passion and community engagement than being a lead generator. The main outcome has been connecting with people within the WordPress community, but those connections remember to come to you for solutions. So the increased exposure can lead to revenue in the long term.  🙏 Sponsor: GoDaddy Pro  Top-Tier Managed WordPress hosting solutions for Enterprise, the Public Sector, and Media companies. We invented Managed WordPress and we never stopped raising the bar. Expect Extraordinary! 🔗 Mentioned in the show:  Brandon Dove Ad Sanity Pixel Jar WebDev Studios Avatar Manager Admin Columns WordCamp New York 🐦 You can follow Post Status and our guests on Twitter:  Brandon Dove (Cofounder, Pixel Jar) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      48 minutes |\n      Mar 3, 2023\n      \n          Brian Gardner On WordPress Now And Today, Talking Design And Workflows, Full Site Editing, Gutenberg And Beyond\n         Brian Gardner initially found WordPress as a blogger. His journey led him to found Studio Press which eventually became part of WPEngine. Brian and Cory flashback into what was and lean into the potential future of WordPress. Top Takeaways:  Workflow Education. Getting adoption for workflows can be challenging. Agencies may resist changes to their workflow even if the change may bring significant benefits. Investing in education is key. Contributing to WordPress education by testing things and hosting workshops and demonstrations can ensure the project as a whole succeeds. Scaling is the Safety of WordPress. Many of the page builder softwares are not built for much beyond brochure-type sites. The extensibility of WordPress makes so much possible for businesses looking to deliver excellent customer experience or expand their site capabilities. Competition vs. Cooperation. Today there is far more competition in WordPress. In the early days, competition existed alongside cooperation. We were competing while we shared, learned, and grew together. This cooperation led to innovation within WordPress and cultivated a vibrant, growing ecosystem. A shift towards community innovation can remind us that a rising tide lifts all boats. 🔗 Mentioned in the show:  Blogspot Revolution Studio Press Nathan Rice WP Tavern Justin Tadlock Webflow Figma AJ Morris Rafal Tomal Design Kit Frost WordPress Learn GoDaddy Automattic Squarespace Wix Weebly Shopify Sarah Dunn Gravity Forms Pagely Beaver Builder Elementor 🐦 You can follow Post Status and our guests on Twitter:  Brian Gardner (Developer Advocate, WPEngine) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      83 minutes |\n      Mar 3, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 3\n         In this episode, Corey Maass and Cory Miller share the results of submitting their WordPress plugin, Crop.Express to the repo. As they continue to build their product live, they develop branding, messaging, and strategy to validate their business and cultivate an audience. Top Takeaways:  Expanding Outwards. Repo offers inherent discoverability for WordPress products, but cultivating broader awareness is necessary for a product to succeed. Creating brand assets, a website, and a newsletter create conduits for growth. Feel Out Your Brand. Be cautious not to box yourself in with branding. Consider what feeling you want people to get when using your product. Go a little deeper and have a little fun exploring the solutions and feelings you hope to offer as you create your branding. Move from literal to conception to better understand what defines your business. Ring the Bell. Identify your customer’s problem and keep talking about it. Invite ideal users to talk about it. Leverage your personal platforms to highlight the pain point and how your product improves it. By telling that story and having others do the same, you start to build a case for your business. 🔗 Mentioned in the show:  Crop.Express Bill O’Reilly Generate WP Canva Minesweeper Photoshop Stock Unlimited Fiver Instagram Unsplash YouTube PayPal Content Journey Zoom 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)   \n      71 minutes |\n      Feb 23, 2023\n      \n          Corey & Cory Launch a WordPress Product Live - Session 2\n         In this episode, Corey Maass and Cory Miller share their initial version or MVP of the product they are building, Crop.Express.  Together they work through enhancing UX, selecting the right business model, crafting marketing messages, and more. Top Takeaways:  Work Out the Workflow. You will teach people how to use your product with demos or tutorials. While you want to make adjustments to improve UX, you don’t want to constantly change the workflows for your product. Being thoughtful on the front end can result in better usability and less change. Business Models. Building a product also means determining a business model. Offering some functionality for free can gain exposure for a base product. Adding a pro or paid version with increased value to deliver a better end product for a customer. Focus on Feedback. As a product builder, you work to anticipate pain points and solve for them. With a quality product, you will solve real struggles for users. But there is a reason users are uninstalling. Accessing their input and experience could be the key to taking your product to the next level. 🔗 Mentioned in the show:  Crop.Express Canva Elementor 🐦 You can follow Post Status and our guests on Twitter:  Corey Maass Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)   \n      24 minutes |\n      Feb 23, 2023\n      \n          Interview With Product Lead Mark Westguard Of WS Form\n         Learn from Mark Westguard, founder of WS Form, a powerful, next-generation WordPress form plugin. Mark and Cory discuss how AI is starting to integrate into the world of WordPress and how the WP Form software is leveraging its power.  Top Takeaways:  Harnessing the Power of Open AI. The possibilities are endless with the revolution of AI as an open-source tool. Making the most of its capabilities allows WordPress users to create more intuitive and integrated content, like better fields and options in WordPress forms. Create, Edit, Moderate. AI should be seen as an assistant working alongside you to help generate your content. You’re still essential in the creation process, and it’s important not to rely on AI 100% for accuracy. You can get creative prompts, edit for grammar or spelling and generate unique images, but moderating that content is essential. The Future is All-in-One AI Integrated Tools. Limiting time spent running around to different AI software is good for business. So how can that be accomplished? By integrating the AI capabilities into WordPress tools, where everything you need is in one place. These are the things we look forward to in WordPress software and plugins  🙏 Sponsor: A2 Hosting A2Hosting offers solutions for WordPress and WooCommerce that are both blazing fast and ultra-reliable. WordPress can be easily deployed on ANY web hosting plan from A2: Shared, VPS, or Dedicated. A2 also offers Managed WordPress and WooCommerce Hosting. Take a look at a2hosting.com today!🔗 Mentioned in the show:  Mark Westguard on Linkedin WS Form OpenAI ChatGPT DALL-EWordCamp Europe 🐦 You can follow Post Status and our guests on Twitter:  Mark Westguard, (Founder of WS Form) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)      \n      34 minutes |\n      Feb 17, 2023\n      \n          Product People Arnas Donauskas, Web Hosting Product Owner at Hostinger  — Post Status Draft 141\n         In this episode, Cory Miller and Arnas Donauskas, Web Hosting Product Owner at  Hostinger, talk about what it means to truly value customer obsession. This core value has shaped Arnas’ career path, from his roots in customer service to creating products to provide simple website restoration and security for principal vulnerabilities. Top Takeaways: Customer Obsession. Users are facing daily challenges that need real-time solutions. Think about their problems. Value their feedback. Sometimes clients are limited because we haven’t kept up with the speed of evolving technology. Approaching things from a user perspective to prioritize and build products creates optimal impact. Removing Manual Work. Wherever possible, we are working to automate things to provide more easy buttons for clients. Automating things, creating single-click solutions, and providing the best examples and guidance to reduce users' steps to accomplish tasks. Possibilities with AI. Everyone is eager to see how AI will change the industry. Cory and Arnas discuss the potential opportunities AI creates to build even better products in the future.🙏 Sponsor: Gravity Forms Gravity Forms is a powerful form builder for WordPress and the #1 choice for businesses and web professionals across the globe. Its vast array of features, intuitive drag-and-drop form editor, and extensive ecosystem of add-ons, ensure customers can design beautiful, intelligent, and accessible forms for any project requirement.   🔗 Mentioned in the show:  Hostinger Hostinger Website Backup Buddy Chat GPT Cloudflare 🐦 You can follow Post Status and our guests on Twitter:  Arnas Donauskas (Web Hosting Product Owner at  Hostinger) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)   \n      42 minutes |\n      Feb 9, 2023\n      \n          Interview With Product Lead Vova Feldman Of Freemius — Post Status Draft 139\n         Learn from the owner of Freemius, Vova Feldman, as he talks with  Cory Miller about the opportunities for indie developers, how to best bring products into the industry, the importance of community, and more. Top Takeaways:  Living in an Open Source Ecosystem. Developers don’t need to reinvent the wheel. With such a large ecosystem of products, finding a secret niche spot to develop your product isn’t always the best or even attainable solution. Doing something better than the next company is sometimes all it takes for great success. The David and Goliath Struggle. It’s obvious that there has always been and will continue to be an unbalanced level of success between independent WordPress product owners and large companies. But that’s not to say there isn’t room for everyone; there is. An independent startup can move much faster into achieving short-term goals and growth than large-scale established companies can with a heavier workload and slower forward movement. Valuing Community Over All Else. The WordPress community is what drives the future of WordPress. It’s not so much all the great new things the system offers but the people behind the process. Taking that same thought into your business, making people the center of your solutions, is an undeniable way to create a business that is surrounded by community. Removing Language Barriers. Creating website language translation is becoming more of a priority. It ties in with the need for developing a better user experience for your customers. Your community needs a specialized way to interact with your products and site. That’s one main task Vova’s team is tackling for their customers this year 🙏 Sponsor: Elementor Elementor enables web creators to build professional, pixel-perfect websites with an intuitive visual builder. Quickly create amazing websites for your clients or your business with complete control over every piece, without writing a single line of code. Join a vast community of web creators from all around the world who deliver exceptional websites using Elementor.🔗 Mentioned in the show:  Freemius iThemes Elementor WooCommerce Yoast Vova Feldman on Linkedin  WordCamp Asia 🐦 You can follow Post Status and our guests on Twitter:  Vova Feldman (Founder & CEO, Freemius) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝 Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      50 minutes |\n      Feb 3, 2023\n      \n          The WP Agency Journey with Bradford Campeau-Laurion of Alley Interactive — Post Status Draft 139\n         In 2001 Bradford Campeau-Laurion began his career in publishing technology at Forbes Magazine, which evolved into utilizing WordPress in the enterprise market. Today he leads Alley Interactive, an agency focused on publishers, non-profits, museums, and brands. Brad shares his extensive experience in publishing technology and his view of the strengths and challenges within the enterprise market of WordPress. Top Takeaways:  Shifting to Paywall Content. Perhaps a major misstep in early online publishing was setting the expectation of free content. Now print subscriptions are down. Publishers can’t secure advertising without extremely high volume. And consumers are hesitant to pay for online subscriptions.  WordPress Creator Economies. Within WordPress there are software and content creators. Software creators the directory to serve as a centralized community and marketplace. Content creators face a bigger challenge to find their market because there isn’t a collaboration tool and algorithm like a social platform driving the creator economy of WordPress. Enterprise WordPress vs. Competition. The closed platforms have appeal-single providers, monthly pricing models, built-in solutions. To customers who aren’t aware of the benefits of open source, it can be confusing to help them understand the optionality and freedom they relinquish even if the initial investment of time and money is more. Enterprise WordPress faces the challenge of crafting appealing solutions without becoming the antithesis of open source. 🙏 Sponsor: Pressable Founded in 2010, Pressable is a world-class managed WordPress hosting provider built on the same data network as WordPress.com and WordPress VIP. With industry-leading performance, 24/7 expert support, a 100% uptime guarantee, and seamless integrations with WooCommerce and Jetpack, Pressable provides the tools you need to manage your WordPress websites and grow your business all in one place. TRY PRESSABLE→🔗 Mentioned in the show:  Bradford Campeau-Laurion  Alley Interactive Joomla Drupal Forbes New York Times New York Observer Slate Kaiser Family Foundation National Science Foundation Figma Austin Smith Matt Johnson Time Magazine The Points Guy Washington Post Defector Deadspin Bright Spot Rebel Mouse Brightcove Tom Willmot Human Made 🐦 You can follow Post Status and our guests on Twitter:  Bradford Campeau-Laurion (CEO, Alley Interactive) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝 Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧   \n      46 minutes |\n      Jan 26, 2023\n      \n          The WP Agency Journey With Mario Peshev Of DevriX — Post Status Draft 138\n         Mario Peshev had an interest in technology from childhood. After working as a software developer, he transitioned into WordPress and founded his own agency, DevriX. They coined the term “WordPress retainer.” It is the mantra fueling their operations and one they hope other agencies will adopt. He joins Cory Miller to dive deep into the how and why of WordPress retainers, sharing his experience and his hopes for the future of WordPress. Top Takeaways:  WordPress Retainers: Business doesn’t have to be feast or famine. Several other industries utilize retainers because they provide consistent revenue and secure client commitment for ongoing work. The entire world is living around monthly costs. Not aligning your service-based business with that model is counterintuitive. Essentially it is just selling hours in bulk, turning services into products. Allotting 10% for project management while using the rest to prioritize and execute projects. The longevity and security enable you to plan, diversify, hire well and grow. Learn How the Sausage is Made: If you want to start your own business, work in a similar business for a few years. Learn what it takes to operate, what roles are needed, and how the pipeline works. Work with bosses, teams, and clients to learn how you want to build and operate once you’re on your own. Increase Adoption by Building Simplification: Many of us started in WordPress because of the famous 5-minute install, and any design could become a theme. It was easy, but now building on other platforms is actually easier. WP needs to create tools to solve for this in order to increase adoption by younger generations. 🙏 Sponsor: Elementor Elementor enables web creators to build professional, pixel-perfect websites with an intuitive visual builder. Quickly create amazing websites for your clients or your business with complete control over every piece, without writing a single line of code. Join a vast community of web creators from all around the world who deliver exceptional websites using Elementor.🔗 Mentioned in the show:  Mario Peshev DevriX Oracle Java Blogger Live Journal HubSpot React NitroPack Angel List Envato SAP VMware Cern Hadron Collider Company Unicef Jango Python Figma Elementor Ghost Fediverse 🐦 You can follow Post Status and our guests on Twitter:  Mario Peshev (CEO, DevriX) Cory Miller (CEO, Post Status) Olivia Bisset (Intern, Post Status)  The Post Status Draft podcast is geared toward WordPress professionals, with interviews, news, and deep analysis. 📝 Browse our archives, and don’t forget to subscribe via iTunes, Google Podcasts, YouTube, Stitcher, Simplecast, or RSS. 🎧                \n          COMPANY\n         \n          About us\n        \n          Careers\n        \n          Stitcher Blog\n        \n          Help\n         \n          AFFILIATES\n         \n          Partner Portal\n        \n          Advertisers\n        \n          Podswag\n        \n          Stitcher Studios\n                    \n          Privacy Policy\n        \n          Terms of Service\n        \n          Your Privacy Choices\n         \n          Cookie Settings\n         \n          © Stitcher 2023\n        \n",
    "links": [
        "/",
        "/premium",
        "/download",
        "/discover",
        "/discover",
        "/listen-premium",
        "/my-shows",
        "/likes",
        "https://www.podswag.com/pages/network/?utm_source=store_button&utm_medium=stitcher&utm_campaign=NAV_TAB_HOMEPAGE",
        "/discover",
        "/listen-premium",
        "/my-shows",
        "/likes",
        "/show/post-status-draft-wordpress-podcast",
        "/show/post-status-draft-wordpress-podcast",
        "/show/post-status-draft-wordpress-podcast/episode/talking-with-valets-ceo-kimberly-lipari-about-the-changing-value-of-websites-to-organizations-302595465",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-11-302593927",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-10-302275369",
        "/show/post-status-draft-wordpress-podcast/episode/jesse-friedman-on-raising-the-wp-hosting-standard-across-the-industry-with-wp-cloud-302242347",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-9-301951677",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-8-301642225",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-7-301286884",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-6-301016358",
        "/show/post-status-draft-wordpress-podcast/episode/post-status-live-the-right-approach-to-wordpress-accessibility-300631555",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-5-300629717",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-4-300414378",
        "/show/post-status-draft-wordpress-podcast/episode/interview-with-product-lead-brandon-dove-of-pixel-jar-300386616",
        "/show/post-status-draft-wordpress-podcast/episode/brian-gardner-on-wordpress-now-and-today-talking-design-and-workflows-full-site-editing-gutenberg-and-beyond-300154319",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-3-300149266",
        "/show/post-status-draft-wordpress-podcast/episode/corey-cory-launch-a-wordpress-product-live-session-2-212266725",
        "/show/post-status-draft-wordpress-podcast/episode/interview-with-product-lead-mark-westguard-of-ws-form-212257950",
        "/show/post-status-draft-wordpress-podcast/episode/product-people-arnas-donauskas-web-hosting-product-owner-at-hostinger-post-status-draft-141-212044148",
        "/show/post-status-draft-wordpress-podcast/episode/interview-with-product-lead-vova-feldman-of-freemius-post-status-draft-139-211768376",
        "/show/post-status-draft-wordpress-podcast/episode/the-wp-agency-journey-with-bradford-campeau-laurion-of-alley-interactive-post-status-draft-139-211491936",
        "/show/post-status-draft-wordpress-podcast/episode/the-wp-agency-journey-with-mario-peshev-of-devrix-post-status-draft-138-211226192",
        "/about",
        "https://careers.siriusxm.com/careers/",
        "https://medium.com/stitcher-blog",
        "/faqs",
        "/partners",
        "https://sxmmedia.com",
        "https://www.podswag.com/",
        "https://www.stitcherstudios.com",
        "https://www.facebook.com/stitcherpodcasts",
        "https://twitter.com/Stitcher",
        "https://www.instagram.com/stitcherpodcasts/",
        "https://apps.apple.com/us/app/stitcher-for-podcasts/id288087905",
        "https://play.google.com/store/apps/details?id=com.stitcher.app&hl=en_US",
        "https://apps.apple.com/us/app/stitcher-for-podcasts/id288087905",
        "https://play.google.com/store/apps/details?id=com.stitcher.app&hl=en_US",
        "https://www.facebook.com/stitcherpodcasts",
        "https://twitter.com/Stitcher",
        "https://www.instagram.com/stitcherpodcasts/",
        "/privacy",
        "/terms",
        "https://privacyportal.onetrust.com/webform/613d75ce-3c5b-4623-bcef-a0d3694b4214/01f8fe2e-c0f0-481e-9615-f5bb1c5b4e45"
    ]
}