{
    "title": "San Diego State University, Veterans Center:  Admissions",
    "body": "\n\n\n\n\n\nSkip Navigation Links\n\n\n\n\nProspective Students\n\nAdmissions\n\nAcademic Credit\nAcademic Programs\nAdmissions\nCompulsory Service for Admitted Students\nResidency Requirements\n\n\nMilitary and Veterans Education Benefits\nPaying\n\nCosts\nFinancial Aid\nScholarships\n\n\nROTC Programs\nTroops to Engineers\nGetting Involved\n\nHousing\nStudent Life\nStudent Veteran Organization\n\n\n\n\n\n\n\nCurrent Students\n\nMilitary and Veterans Education Benefits\nGeneral Studies 250\nCampus Policies\n\nAcademic Credit\nCompulsory Service\nResidency Requirements\n\n\nHealthcare\nGetting Involved\n\nHousing\nStudent Life\nStudent Veteran Organization\n\n\nResources\n\nCampus\nFinancial Aid\nScholarships\nNational\nState\n\n\nROTC Programs\nGraduation\n\nApply to Graduate\nVeterans Alumni Organization\n\n\nTroops to Engineers\n\n\n\n\n\nWho We Are\n\nContact Us\nMeet the Staff\nMeet Current Student Veterans\nHistory of the JABVC\n\n\n\n\nIn the News\n\n\nGive to SDSU Veterans\n\n\n\n\n\nSan Diego State University's primary commitment is to the safety, health and wellbeing of all campus community members, including students, faculty, staff, and visitors. Staying conscious of the uncertainty of COVID-19, the The Joan and Art Barron Veterans Center is now open. Please feel free to continue to contact us by email at veterans@sdsu.edu or connect virtually Monday to Thursday from 10 a.m.–12 p.m.\n\n\nAdmissions\n\nVeterans, Service Members and Military Families\nSan Diego State University values its Veterans, Service Members and Military Families. We will do everything in our means to assist you as you embark on an exciting academic career with us. \nWho is a Transfer Student? \nIf you have taken any college-level classes since the summer beyond your high school graduation, you are considered a transfer student.\nSDSU accepts transfer applications only from upper-division transfer or readmission applicants who will have completed 60 or more transferable semester (or 90 or more quarter) units by:\n\nthe end of summer 2020 for spring 2021 admission or\nthe end of spring 2021 for fall 2021 admission\n\nWe do not accept transfer applications from lower-division students with fewer than 60 transferable semester units.\nSan Diego State University is not accepting applications for a second bachelor's degree except in Nursing.\n\nSpring 2022 Admission\nSan Diego State University is accepting applications for select majors from upper-division transfer students between August 1 and August 31 for spring 2022 admission. Please go to our SDSU Transfer Admission Spring Steps to Apply website for more information.\nFall 2021 Admission\nAdmission for upper division transfer students: San Diego State University is accepting applications from upper-division transfer students between October 1 and December 4 for admission the following fall. \nWe receive applications from thousands of highly qualified applicants each year. Applicants are admitted based on intended major, so you must choose a major when you apply to SDSU. Learn how to make your application more competitive by closely reviewing the admission requirements on this website. \nTo apply, go to: Cal State Apply website (note that you are applying to SDSU almost one year in advance of attendance).  If you are a veteran or military service member and an upper division transfer student, you will receive additional consideration for admission. Subject to change, and at a minimum, you must meet the following criteria:\n\n60 Units: Complete a minimum of 60 transferable semester units by the end of spring 2021. Transferable units are defined as course units that are applicable to a baccalaureate degree. For information regarding transferable course work, please visit the ASSIST website or the Transfer Admission Planner website. \nGeneral Education: Complete a certified package of General Education courses, with a \"C-\" grade or higher in each of the \"Golden Four\" GE courses by the end of spring 2021: oral communication, written communication/composition, critical thinking, and quantitative reasoning (math above the level of college intermediate algebra).\nMajor Preparation: To have the highest admission priority, military applicants should have completed all major preparation courses by the end of spring 2021. For more information visit the SDSU Transfer Admission Planner (TAP) website.\nGrade Point Average: Meet and maintain the cumulative GPA required for your major. Your GPA is based on all transferable units attempted.\nPrior SDSU Coursework: If applicable, maintain a 2.0 or higher GPA for any SDSU Regular Session, Special Session, Open University or Cross Enrollment coursework. This is in addition to the cumulative GPA listed above.\n\nLate Application or Appeals: SDSU will accept appeals for late admission consideration from veterans, service members, and military dependents if you meet the above transfer criteria (subject to space availability). Applicants must also have a compelling reason for missing the deadline. SDSU will not accept late applications or appeals from majors in Athletic Training, Dance, English – Applied (ADT option), Kinesiology – Exercise Science Generalist (ADT option), Liberal Studies – Education – Generalist (ADT option), Music, Nursing, Psychology – Applied (ADT option), Social Work and Theatre Arts – Performance. For more information regarding appeals, please visit the Admission Appeals Process web page.\nPoints of contact: For more information regarding the application, admission, and services for veterans, service members and military families, contact Jose Esparza, School Certifying Official, at jesparza@sdsu.edu. \n            \n            \n\nSDSU President's Military Special Admission Program\nSDSU provides direct admission opportunities for highly qualified active duty military who will soon separate from the service. This program is for undergraduate admission only and for both the fall and spring semesters (note: majors in majors in Athletic Training, Dance, English - Applied (ADT option), Kinesiology - Exercise Science Generalist (ADT option), Liberal Studies - Education-Generalist (ADT option), Music, Nursing, Psychology - Applied (ADT option), Social Work and Theatre Arts - Performance are not eligible for this program for spring admission).\nFor eligibility and application information:\n\nU.S. Marine Corps: Please visit your base education office or go to the MCCS Forward Leadership Scholar website.\nU.S. Navy: For more information contact Karen Standbery at Karen.stanbery@navy.mil and Karen.l.stanbery.civ@us.navy.mil [Due to the Navy email platform transition, include both email addresses in your email].\nU.S. Coast Guard: CWO Shannon, Sector San Diego at Greg.M.Shannon@uscg.mil or (619) 278-7103.\n\nWounded Warrior Admission Program\nSick, ill or injured service personnel of any branch of service assigned within commands of Navy Medicine West or with U.S. Special Operations Command Care Coalition may be eligible for direct admission to SDSU under this program. Two slots are available each academic year. For more information contact:\n\t\t\tNavy Medicine West: Andrew Gasper, Transition Care Coordinator, at andrew.p.gasper.naf@mail.mil\n       U.S. Special Operations Command Care Coalition: Marcus Pace, Regional Program Director, at marcus.n.pace.naf@mail.mil\nOther Admission Information\nFreshmen applicants with no transferable college units: Admission is extremely competitive for first-time freshman (no college-level classes) applicants. Freshman applicants must complete a 15-unit comprehensive pattern of college preparatory courses in high school, must have a competitive high school GPA and competitive SAT and/or ACT test scores to be eligible for admission. For more information go to the Freshman Admission website\n\nLower-Division applicants: If you have fewer than 60 transferable semester units by the spring term prior to fall transfer, we encourage you to attend a California community college to become eligible to apply to SDSU as an upper division transfer student in a future term. Counselors at any community college can assist you with an academic plan of General Education (GE) and major preparation courses.\n Associate Degree for Transfer \n Admission priority is given to California community college students who complete an Associate in Arts or Associate in Science for Transfer (AA-T/AS-T) degree. See a list of approved AA-T/AS-T degrees. Associate Degree for Transfer applicants must meet within .1 of the grade point average (GPA) required by the major to which they are applying and follow all required enrollment steps within the deadlines.\n Enlisted to Officer Commissioning Program\nMilitary service members applying for STA-21 (Navy), MECEP (Marine Corps), or Green to Gold (Army) programs and who are interested in applying to SDSU should contact the Office of Admissions for application processing information at es.infoforocp@sdsu.edu.\n For information regarding College Student Pre-Commissioning Initiative (CSPI) for the U.S. Coast Guard, please visit: www.gocoastguard.com or contact (619) 226-8222. For other questions regarding military or veterans admission and services at SDSU, contact Jose Esparza, School Certifying Official, at jesparza@sdsu.edu.\nMilitary Transcripts\nRefer to the Academic Credit page under the Current Students > Campus Policies section of this website. \nOther local university contacts\nUniversity of California, San Diego: Timothy Borch (858) 822-0348 or tborch@ucsd.edu\nCalifornia State University (CSU) San Marcos: Jamie Rose (760) 750-6677 or jrose@csusm.edu\nUniversity of San Diego (USD): Amanda Etter (619) 260-5945 or aetter@sandiego.edu \nPoint Loma Nazarene: Lauren Lahn (619) 329-6783 or llahn@pointloma.edu\n\nOther resources\n\nSDSU Transfer Admission Planner (TAP) website: Determine SDSU course requirements in general education (GE) and your major, and determine potential equivalent or transferable courses from other colleges, universities or out-of-state institutions\nASSIST website: Determine transferable classes in GE and your major if you have attended or are attending a California community college\nCalifornia Virtual College website: Determine available online courses from a clearinghouse of California community colleges\nCalifornia Community Colleges website\n\n\n\n\n\n\n\nStay Connected:\n  \nThe Joan and Art Barron Veterans Center\nveterans@sdsu.edu\n(619) 594-5813\n            Student Services West 1661\n            Monday - Thursday from 10 a.m.–12 p.m.*\n\n\n \n \n \n \n \n  \n   \n\n\n\n\n\n\n        GI Bill® is a registered trademark of the United States Department of Veterans Affairs (VA). The absence of the registration symbol ® does not constitute a waiver of VA's trademark rights in that phrase. Documents on this website labeled PDF are in Portable Document Format and require Adobe Reader to view and print. Download Adobe Reader free from the Adobe website.\nThe information, images, and terminology located on websites associated with San Diego State University or any of its departments, offices, colleges, or employees does not represent endorsement by the U.S. Department of Defense nor any U.S. military branch, installation or base, or military unit. Additionally, any directly referenced partnerships or relationships associated between SDSU and any particular military and/or federal or state organization are properly vetted and established in accordance within applicable rules and guidelines. At no time are SDSU employees or affiliates compensated based on quantitative contact and/or connection with any military member, veteran, or military family member as an attempt to recruit individual.\n*Please visit the Contact Us page for the most up to date office hours and closures.\n\n\n\n© 2019 Enrollment Services\n\n\n",
    "links": [
        "https://www.sdsu.edu",
        "https://arweb.sdsu.edu/es/veterans/index.html",
        "#main-content",
        "https://arweb.sdsu.edu/es/veterans/ac.html",
        "https://arweb.sdsu.edu/es/veterans/acad_progs.html",
        "https://arweb.sdsu.edu/es/veterans/admissions.html",
        "https://arweb.sdsu.edu/es/veterans/cs.html",
        "https://arweb.sdsu.edu/es/veterans/residency.html",
        "https://arweb.sdsu.edu/es/veterans/military_veterans_education_benefits/index.html",
        "https://admissions.sdsu.edu/about_sdsu/costs_of_attendance",
        "https://studentaffairs.sdsu.edu/ofas2/",
        "https://arweb.sdsu.edu/es/veterans/scholarships.html",
        "https://arweb.sdsu.edu/es/veterans/rotc.html",
        "https://newscenter.sdsu.edu/engineering/info_for_veterans.aspx",
        "https://arweb.sdsu.edu/es/veterans/stud_housing.html",
        "https://admissions.sdsu.edu/student_life",
        "https://www.facebook.com/groups/sdsusvo/",
        "https://arweb.sdsu.edu/es/veterans/military_veterans_education_benefits/index.html",
        "general_studies_250.html",
        "https://arweb.sdsu.edu/es/veterans/ac.html",
        "https://arweb.sdsu.edu/es/veterans/cs_current.html",
        "https://arweb.sdsu.edu/es/veterans/residency.html",
        "https://arweb.sdsu.edu/es/veterans/healthcare.html",
        "https://arweb.sdsu.edu/es/veterans/stud_housing.html",
        "https://admissions.sdsu.edu/student_life",
        "https://www.facebook.com/groups/sdsusvo/",
        "https://arweb.sdsu.edu/es/veterans/resources_campus.html",
        "https://studentaffairs.sdsu.edu/ofas2/",
        "https://arweb.sdsu.edu/es/veterans/scholarships.html",
        "https://arweb.sdsu.edu/es/veterans/resources_national.html",
        "https://arweb.sdsu.edu/es/veterans/resources_state.html",
        "https://arweb.sdsu.edu/es/veterans/rotc.html",
        "https://advising.sdsu.edu/graduation/apply_to_graduate",
        "http://www.sdsualumni.org/s/997/index.aspx?sid=997&gid=1&pgid=3180",
        "https://newscenter.sdsu.edu/engineering/info_for_veterans.aspx",
        "https://arweb.sdsu.edu/es/veterans/center.html",
        "https://arweb.sdsu.edu/es/veterans/staff.html",
        "https://arweb.sdsu.edu/es/veterans/students.html",
        "https://arweb.sdsu.edu/es/veterans/history.html",
        "https://arweb.sdsu.edu/es/veterans/news.html",
        "https://arweb.sdsu.edu/es/veterans/give.html",
        "https://sa.sdsu.edu/student-health-services/coronavirus",
        "mailto:veterans@sdsu.edu",
        "https://SDSU.zoom.us/j/93122462256",
        "https://admissions.sdsu.edu/transfers",
        "https://www2.calstate.edu/apply",
        "https://www.assist.org/",
        "https://sunspot.sdsu.edu/pubred/!tap.disp",
        "https://admissions.sdsu.edu/transfers/apply",
        "https://sunspot.sdsu.edu/pubred/!tap.disp",
        "https://admissions.sdsu.edu/transfers/apply/gpa_requirements",
        "https://admissions.sdsu.edu/appeals",
        "mailto:jesparza@sdsu.edu",
        "https://usmc-mccs.org/services/education/leadership-scholar/",
        "mailto:Karen.stanbery@navy.mil",
        "mailto:Karen.l.stanbery.civ@us.navy.mil",
        "mailto:Greg.M.Shannon@uscg.mil",
        "tel:+16192787103",
        "mailto:andrew.p.gasper.naf@mail.mil",
        "mailto:marcus.n.pace.naf@mail.mil",
        "https://admissions.sdsu.edu/freshmen/apply",
        "https://admissions.sdsu.edu/transfers/apply/transfer_pathways",
        "mailto:es.infoforocp@sdsu.edu",
        "http://www.gocoastguard.com",
        "tel:+16192268222",
        "mailto:jesparza@sdsu.edu",
        "ac.html",
        "tel:+18588220348",
        "mailto:tborch@ucsd.edu",
        "tel:+17607506677",
        "mailto:jrose@csusm.edu",
        "tel:+16192605945",
        "mailto:aetter@sandiego.edu",
        "tel:+16193296783",
        "mailto:llahn@pointloma.edu",
        "https://sunspot.sdsu.edu/pubred/!tap.disp",
        "https://www.assist.org/",
        "https://cvc.edu/",
        "https://www.cccco.edu/Students/Find-a-College",
        "https://www.facebook.com/pages/San-Diego-CA/SDSU-Veterans-Center/140108866037687",
        "https://twitter.com/sdsuveterans",
        "https://www.linkedin.com/groups/8358843",
        "mailto:veterans@sdsu.edu",
        "tel:+16195945813",
        "https://www.211sandiego.org/",
        "https://www.veteranscrisisline.net/",
        "http://www.sdchamber.org/2015/10/introducing-the-veterans-honor-roll-program/",
        "http://bestforvets.militarytimes.com/2016/colleges/4-year/",
        "http://bestforvets.militarytimes.com/business-schools/2016/",
        "https://www.usveteransmagazine.com/recognition-lists/",
        "https://www.mae-kmi.com/",
        "https://get.adobe.com/reader/",
        "center.html"
    ]
}