{
    "title": "For Faculty & Staff | University Communications",
    "body": "\n \n \n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nUniversity Communications\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Menu\n\n\n\n\n\nSearch form\nSearch term\n\n\n\n\n\nHome\nNews & Publications\nFor Journalists\nFor Faculty & Staff\nPolicies\nContact Us\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nFor Faculty & Staff\nUniversity Communications can assist faculty and staff with a variety of communications and media issues:\nProvide help when a reporter calls\nThe Office of University Communications is staffed by professional journalists with extensive experience working with the media. Our office works with all media, including on-campus publications, local, national and international press. We issue press releases, organize press conferences and handle media relations for Stanford.  We can assist you in publicizing news that has a university connection.\nRead more about working with the media, or contact the News Service at (650) 723-2558 for assistance.\nPublicize an event or make a campus announcement\nUniversity Communications can also help you to publicize events and make announcements.  Stanford Report is an email sent every weekday to approximately 35,000 faculty, staff and other subscribers. Stanford  organizations may purchase display advertisements in Stanford Report.  For more information on announcements, contact Charity Ferreira, charityf(at)stanford.edu.\nUniversity Communications also maintains the Stanford Event Calendar, which allows you to publicize your events on the university website.\nManage the media at your event\nHaving media cover your event often requires special expertise. High profile visitors may have security concerns and reporters may have particular equipment or seating needs. University Communications regularly partners with the Office of Special Events and Protocol (OSEP) to ensure that these issues are addressed in the early planning stages.  For more information contact the News Service at (650)723-2558.\nCommunications policies\nUniversity Communications has oversight of policies regarding a variety of communications and media related topics, including filming and photography on campus and use of the university name, seal, and logos.\nIdentity Toolkit\nThe Stanford Identity Toolkit provides information about how to use the Stanford signature, emblems, fonts, colors and photos in your print and online projects.\nCommunicators Shared Resources\nThe Communicators Shared Resources site offers curated information and resources for communicators at Stanford, helping you benefit from the experience and recommendations of fellow communicators at the University.\nStanford on iTunes U and YouTube\nInformation about how to contribute audio and video content to Stanford’s iTunes U and YouTube channels.\nWeb resources\nThe University Communications Web Team can provide advice on creating and maintaining your university website, using campus resources for web design and development, or when appropriate, selecting a vendor for a web project.\nVideo production\nStanford Video, the university’s video production unit, serves the campus and community from state-of-the-art studios located on campus.\nNews Service Library\nThe News Service Library can help faculty and staff find archived Stanford Report articles, press releases and photographs.\nSALLIE Image Database\nSALLIE (Stanford ALL-Image Exchange) is Stanford’s campus-wide system for managing and sharing digital photographs used in communications.\n \n\n\n\n  \n\nStanford Report\n        Delivers news and information about the Stanford community via email each weekday.\n\nSubscribe | Suggest a story \n\n\n  \n\nFaculty and Staff News\n        Read our Stanford news for faculty and staff.      \n\n\n  \n\nThe Dish\nThe Dish blog highlights Stanford people on the move and in the spotlight. \n\n\n \n\n\n\n\n\n\n\n\n\n \n\nMore About Us\nThe Office of University Communications provides information about Stanford University; coordinates the university's public and media relations efforts; and produces the university's main web pages, social media channels and central publications.\n\nContact Us\n\nOur staff\nMap & directions\n\n\nConnect with Stanford\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n© Stanford University,  Stanford, California 94305.\n\n \n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "http://www.stanford.edu/",
        "https://ucomm.stanford.edu/",
        "https://ucomm.stanford.edu/",
        "https://ucomm.stanford.edu/",
        "https://ucomm.stanford.edu/publications/",
        "https://ucomm.stanford.edu/journalists/",
        "https://ucomm.stanford.edu/facstaff/",
        "https://ucomm.stanford.edu/policies/",
        "https://ucomm.stanford.edu/about/",
        "/facstaff/working-with-the-media/",
        "http://news.stanford.edu/sr/",
        "http://srads.stanford.edu",
        "http://events.stanford.edu/",
        "https://osep.stanford.edu/",
        "/policies/",
        "http://identity.stanford.edu",
        "https://communicators.stanford.edu/",
        "/contribute/",
        "/webteam/",
        "http://stanfordvideo.stanford.edu",
        "/journalists/news-library/",
        "http://sallie.stanford.edu",
        "https://news.stanford.edu/stanford-report/",
        "https://news.stanford.edu/contact/suggest-a-story/",
        "http://news.stanford.edu/news/staff/",
        "https://news.stanford.edu/thedish/",
        "/about",
        "/about/directions",
        "https://www.facebook.com/stanford",
        "https://www.twitter.com/stanford",
        "https://www.youtube.com/stanford",
        "https://www.instagram.com/stanford",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "http://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}