{
    "title": "Disclosure Support – WellCat Safe Place – Chico State",
    "body": "\n\nSkip to Main Content\nPortalEmailStudent ResourcesCatalogClass ScheduleCampus MapDirectoryLibrarySearch Chico StateCloseClose Task NavOpenOpen Task Nav\n\n\n\n\t\t\t        WellCat Safe Place\n\t\t\t    \n                            WCSP Menu\n                        Show search box.Safe Place HomeAbout UsMeet the TeamOur History and PrinciplesPositions at WCSPAnnual ReportsResourcesRacial Trauma, Resiliency and Ally ResourcesTrainingsSafe Place Training ServicesCSULearn - Title IX Alternative TrainingsEducational ToolkitBystander InterventionDisclosure SupportIntimate Partner ViolenceSexual AssaultSafe Place HomeAbout UsMeet the TeamOur History and PrinciplesPositions at WCSPAnnual ReportsResourcesRacial Trauma, Resiliency and Ally Resources(opens in new window)TrainingsSafe Place Training ServicesCSULearn - Title IX Alternative TrainingsEducational ToolkitBystander InterventionDisclosure SupportIntimate Partner ViolenceSexual Assault\n        Contact Us\n        Location IconWellCat Safe Place\n                                                                            Student Services Center, 430\n                                                                530-898-3030safeplace@csuchico.edu Office Hours\n                                                                            Monday-Friday\n                                                                \n                                                                                8:00 a.m. - 5:00 p.m.\n                                                                    Mailing Address\n                                                                            WellCat Safe Place\n                                                                \n                                                                                400 W. First St.\n                                                                \n                                                                                Chico, CA 95929–0261\n                                                                    Crisis ResourcesIf you are in crisis or in an unsafe situation, please utilize the following National hotline and/or text line:National Sexual Assault hotline 800-656-4673National Domestic Violence hotline 800−799−7233 or text LOVEIS to 22522assets/documents/org-chart.pdf (PDF)WCSPEducational ToolkitCurrent page:  Disclosure Support\n                        \n    \t\tDisclosure Support\n    \tOffering Support To Those Who Disclose Sexual Assault/ Intimate Partner Violence/ StalkingDOListen and be there without judgment\n\"I believe you and it is not your fault.\"Offer to go with them to report the incident if they decide that they want to\n\"You are not alone. I want to help you get through this in any way that I can.\"Encourage them to get supportBe patient because there is no timeline in recovering from traumaEmphasize the importance of practicing self-careBe consistent, if you canValidate their emotions – there is no \"normal way\" to respond to traumaEmpower them to make decisions for themselvesRefer them to resourcesDON'TTell them how it's their fault, because the only person who is at fault is the person who perpetrated the harmTell anyone else what happened unless they ask you toPressure them into reporting or tell them it is their responsibility toThreaten to hurt the person who hurt themAs a friend...You are the most common confidantIt is normal to struggle with your own emotions when told or to even be triggered from your own past experiencesBlaming your friend that was attacked, will lead to a loss of trustIt is important to not tell your friend what to do. Interpersonal violence is about power and control, so it is important for your friend to be empowered to make their own decisions For faculty and staff...Provide support to the student by believing them and not pressuring them to explain details of the abuseMake sure your students know that you are a mandated reporter and let them know about the two confidential resources (Safe Place and Counseling and Wellness Center)“Thank you so much for trusting me. I want to let you know that I do have to report this to the Title IX office, but you have control over what you do with that report. They will send a letter to your Wildcat email with resources and information.”“I can imagine how difficult it was to disclose that information. I believe you and appreciate you telling me. I do need to let you know that I must give this information to the Title IX office, and they will be reaching out with a letter of resources and information. You are in control over whether you move forward with reporting or not, but I must report to fulfill my reporting obligations.”Report to Title IX by calling 530-898-4949 and providing any information you recall. You do not need to ask the student for details, names, or further questions.If you are concerned with how to best support the student or struggling with emotions, then you can call or email Safe Place to consult and receive support.Remember that you do not have to be a counselor to provide supportAs a parent...It is natural to want to take control of the situationIt is important to give your child the power to control the situation since they had no power or control when the assault took placeTry not to be upset if it took some time for your child to reach out and tell youQuick ExitVice President for Student AffairsKendall Hall, Room 110530-898-6131www.csuchico.edu/saDivision of Student AffairsAccessibility Resource CenterAssociated StudentsBasic Needs ProjectCareer CenterEquity, Diversity & InclusionEarly Outreach & Support ProgramsEnrollment Management ServicesFinancial Aid & ScholarshipsIntercollegiate AthleticsOff-Campus Student ServicesStudent Conduct, Rights & ResponsibilitiesStudent Life & LeadershipUniversity HousingWellCat Services\nWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus. We are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.Contact UsNeed Help?FacebookFacebookTwitterTwitterInstagramInstagramReport an accessibility issueReport a broken link on this pageTitle IXPrivacy PolicyCalifornia State University, Chico400 West First StreetChico, CA 95929Copyright © 2023 All Rights Reserved\n\n\nBack to top\n\n\n",
    "links": [
        "#content",
        "https://www.csuchico.edu/index.shtml",
        "https://portal.csuchico.edu/",
        "https://outlook.com/csuchico.edu",
        "https://www.csuchico.edu/resources/index.shtml",
        "https://catalog.csuchico.edu/",
        "https://www.csuchico.edu/schedule/",
        "https://www.csuchico.edu/maps/campus/",
        "https://apps.csuchico.edu/directory/",
        "https://library.csuchico.edu",
        "#",
        "#task-nav",
        "../index.shtml",
        "javascript:void(0)",
        "../index.shtml",
        "../about-us/meet-the-team.shtml",
        "../about-us/principles.shtml",
        "../about-us/positions-at-sp.shtml",
        "../about-us/annual-report.shtml",
        "../resources/index.shtml",
        "https://www.csuchico.edu/wellcat/race.shtml",
        "../trainings/training-services.shtml",
        "../trainings/csulearn.shtml",
        "bystander.shtml",
        "disclosure.shtml",
        "ipviolence.shtml",
        "sexual-assault.shtml",
        "../index.shtml",
        "../about-us/meet-the-team.shtml",
        "../about-us/principles.shtml",
        "../about-us/positions-at-sp.shtml",
        "../about-us/annual-report.shtml",
        "../resources/index.shtml",
        "https://www.csuchico.edu/wellcat/race.shtml",
        "../trainings/training-services.shtml",
        "../trainings/csulearn.shtml",
        "bystander.shtml",
        "disclosure.shtml",
        "ipviolence.shtml",
        "sexual-assault.shtml",
        "tel:530-898-3030",
        "mailto:safeplace@csuchico.edu ",
        "../_assets/documents/org-chart.pdf",
        "https://www.facebook.com/chicostatesafeplace/",
        "https://www.instagram.com/chicostatesafeplace/",
        "https://twitter.com/CSUCSafePlace",
        "../index.shtml",
        "index.shtml",
        "https://www.google.com",
        "tel:530-898-6131",
        "https://www.csuchico.edu/sa/index.shtml",
        "https://www.csuchico.edu/arc/index.shtml",
        "https://as.csuchico.edu/",
        "https://www.csuchico.edu/basic-needs/index.shtml",
        "https://www.csuchico.edu/careers/index.shtml",
        "https://www.csuchico.edu/diversity/index.shtml",
        "https://www.csuchico.edu/eosp/index.shtml",
        "https://www.csuchico.edu/em/index.shtml",
        "https://www.csuchico.edu/fa/index.shtml",
        "https://www.chicowildcats.com/",
        "https://www.csuchico.edu/offcampus/index.shtml",
        "https://www.csuchico.edu/osrr/index.shtml",
        "https://www.csuchico.edu/sll/index.shtml",
        "https://www.csuchico.edu/housing/index.shtml",
        "https://www.csuchico.edu/wellcat/index.shtml",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.csuchico.edu/contact/index.shtml",
        "https://www.csuchico.edu/help/index.shtml",
        "https://www.facebook.com/CaliforniaStateUniversityChico",
        "https://twitter.com/chicostate",
        "https://instagram.com/chicostate",
        "https://www.csuchico.edu/ati/procedures/web-acccessibility.shtml",
        "https://www.csuchico.edu/contact/change-request/",
        "https://www.csuchico.edu/title-ix/index.shtml",
        "https://www.csuchico.edu/isec/privacy-policy-page.shtml",
        "#top"
    ]
}