{
    "title": "WTAW Press, an independent literary publisher",
    "body": "\n\n\n\n\n\n\n\n\n\ntop of pageHomeAboutOur StoryBook Publishing ProgramWhat Authors Say About WTAWJoin UsFirst ReadersSupport UsThanks to our supportersBooksBook OrderingReaders GuidesCourse adoptions2021 Books2019 Books2018 Books2017 BooksAuthorsShopContactSubmissionsAlcove ChapbooksConsultationsEven morePlaylistsOur Reading SeriesPrivacy PolicyMoreUse tab to navigate through the menu items.0\n\nThe WTAW Alcove Chapbook Series Prize ResultsWTAW Press is pleased to share the results of the 2023 WTAW Alcove Chapbook Series Open. \nThe quality of submissions we received was outstanding. The prize winner is Promiscuous Ruin by Julian Mithra, who receives an honorarium of $250, publication and 25 copies of their book.\n​\nBorrowing sensibility from docupoetics, where lyricism works to comment on an archive, and drawing upon Theodore Roosevelt’s “Daniel Boone’s Move to Kentucky,”  Promiscuous Ruin is a rich, expansive and wholly original book, and Julian Mithra’s voice is a treasure. In the bygone era of a decaying frontier, deer hunters Lemuel and Lars hitch up as backwoods companions. Each troubled by missing mothers and flinty fathers, they thwart attempts at intimacy, funneling these impulses into fantasies of violence and revenge. Occasioned by brief moments of sublimity, the two edge closer to a blizzard of repressed desire. Only the deer themselves might cede medicine for earthbound wounds.\n​\nReviewers are welcome to contact us for review copies.\n​\nWTAW haș selected the following five finalist chapbooks to publish in 2023.\n​\nFinalists (listed alphabetically according to authors' last names)\nOuttakes, Joanna Acevedo\nSomething I Could Say, Stephanie Austin\nMississippi River Museum, Keith Pilapil Lesmeister\nSarra Copia: A Locked-in Life, Nancy Ludmerer\nEggs in Purgatory, Genanne Walsh\n​\nWe would also like to honor the following chapbooks and their authors.\n​\nSemi-finalists\nAnnetta in Style, Stacy Bierlein\nDelivery, Martha Coats\nAttachment Disorders, Alice Hatcher\nThe Slough, Natalie Nebel\nThe Rest of Us, Tisha Marie Reichle-Aguilera\nNeurotypical, Meghan Williams \n​\nHonorable Mentions\nAmerican Filigree, Fatima Alharthi\nTherapy, Sean Bernard\nImaginary Places, Alicia Bones\nApplications, Anna Mantzaris\nA Natural Man, Reggie Scott Young\n​\nFind these authors at their websites and on social media. Stay tuned for information about publication dates, book launches, and author events. Sign up for our newsletter and/or follow us on social media.\n \nThe first 3 Alcove Chapbooks, including prize winner Promiscuous Ruin, are now available. \n \n​WTAW is proud to announce new acquisitions for publication.Announcing the Kevin McIlvoy Book PrizeIn honor of Kevin \"Mc\" McIlvoy, who passed away suddenly on September 30, 2022, WTAW is pleased to establish the annual Kevin Mc McIlvoy Book Prize for an unpublished book of prose. The award will offer a cash prize, publication, and book contract. The competition will take place in 2023, date to be announced, and Nina McConigley, Joan Silber, and Peter Turchi will judge the competition. More details will follow in the coming months. Watch our newsletter and social media shares.\n​\nMc was the author of One Kind Favor, a novel he said he knew was the most important work of his life. During his six decades of commitment to his art, he published five other novels: At the Gate of All Wonder (Tupelo) , Hyssop (TriQuarterly Press), Little Peg (Antheneum/Macmillan), The Fifth Station (Algonquin Books), and A Waltz (Lynx House Press); a short story collection, The Complete History of New Mexico (Graywolf); a book of short fictions and prose poems, 57 Octaves Below Middle C (Four Way Books); and, most recently, numerous poems. His short fiction appeared in Harper’s, Southern Review, Ploughshares, Missouri Review, and many other literary magazines.\n​\nWe will continue to be honored by Mc's testimony about his experience publishing with WTAW Press.\n​ \nAs I’ve said to you—and to everyone I know—I have never, ever had a more positive experience from beginning to end (contract to editing; pre-publication promotion and planning: publication planning and preparation and next-stage promotion; post-publication and mid-stage promotion; late-stage promotion that includes nominations for prizes) than I have had with WTAW. Your enthusiasm and wisdom and absolute commitment have been inspiring to me—and confirming to me in my overall life as an artist.\n\nI do not say any of this lightly; after all, I’ve worked with 11 different editors/houses (including Avon and Harper Perennial editors for paperback editions) for my 8 published books, and I’ve had many kinds of good experiences along the way.Find Kevin McIlvoy's ONE KIND FAVOR and more great books in our bookshop.\nComing November 9, 2023, WTAW will proudly publish Kevin McIlvoy's last book of fiction IS IT SO? GLIMPSES, GLYPHS & FOUND NOVELS. ©2023Donatebottom of page\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.wtawpress.org",
        "https://www.wtawpress.org/about",
        "https://www.wtawpress.org/our-story",
        "https://www.wtawpress.org/book-publishing",
        "https://www.wtawpress.org/what-authors-say-about-wtaw",
        "https://www.wtawpress.org/join-our-team",
        "https://www.wtawpress.org/first-readers",
        "https://www.wtawpress.org/support-us",
        "https://www.wtawpress.org/supporters",
        "https://www.wtawpress.org/books",
        "https://www.wtawpress.org/book-ordering",
        "https://www.wtawpress.org/readers-guides",
        "https://www.wtawpress.org/course-adoptions",
        "https://www.wtawpress.org/2021-books",
        "https://www.wtawpress.org/2019-books",
        "https://www.wtawpress.org/2018-books",
        "https://www.wtawpress.org/2017-book-catalogue",
        "https://www.wtawpress.org/authors",
        "https://www.wtawpress.org/shop",
        "https://www.wtawpress.org/contact",
        "https://www.wtawpress.org/submissions",
        "https://www.wtawpress.org/alcove-chapbooks",
        "https://www.wtawpress.org/manuscript-consultations",
        "https://www.wtawpress.org/more",
        "https://www.wtawpress.org/playlists",
        "http://www.whytherearewords.com",
        "https://www.wtawpress.org/privacy-policy",
        "https://www.wtawpress.org/cart",
        "https://www.wtawpress.org/alcove-chapbooks",
        "https://www.wtawpress.org/product-page/promiscuous-ruin-by-julian-mithra",
        "https://www.joannaacevedo.net",
        "https://www.stephanieaustin.net/",
        "https://www.wtawpress.org/product-page/mississippi-river-museum-keith-lesmeister",
        "https://keithlesmeister.com/",
        "https://www.nancyludmerer.com/",
        "https://www.wtawpress.org/product-page/eggs-in-purgatory-by-genanne-walsh",
        "https://genannewalsh.com/",
        "https://genannewalsh.com/",
        "http://www.marthacoats.com",
        "http://www.alice-hatcher.com",
        "http://tishareichle.com/",
        "https://anotherseanbernard.com/",
        "https://aliciabonescom.wordpress.com/",
        "https://www.annamantzaris.net/",
        "http://www.reggiescottyoung.com",
        "http://eepurl.com/dbXnRf",
        "https://www.wtawpress.org/shop",
        "http://eepurl.com/dbXnRf",
        "https://www.wtawpress.org/shop",
        "https://www.wtawpress.org/shop",
        "https://donorbox.org/support-wtaw-press",
        "http://www.facebook.com/wtawpress",
        "http://twitter.com/WTAWPress",
        "https://www.youtube.com/user/whytherearewords",
        "https://www.instagram.com/wtawpress"
    ]
}