{
    "title": "Big Bite Launches 2023 Enterprise WordPress Survey – WP Tavern",
    "body": "\n\n\n\n\n\n\n\n\n\n\n\nNewsOpinionPluginsThemesEventsPodcastContactSearchSearch\n\n\n\n\n\n\n\nSearch\n\n\n\nCancel\n\n\n\n\n\n\n\nApril 28, 2023\nSarah Gooding\nBig Bite Launches 2023 Enterprise WordPress Survey\n\nBig Bite, a UK-based enterprise WordPress agency, has launched a new survey called State of Enterprise WordPress to gather data and insights on how the platform can best serve large-scale brands.\nThe survey takes approximately 5-7 minutes to complete and covers budgets,publishing processes, platform strengths, user frustrations, custom functionality, infrastructure, architecture, and ongoing maintenance. It also attempts to gauge whether enterprise users have embraced the block editor and what other CMS’s the organization is using in addition to WordPress.\n“This particular survey is focused on brands that are using WordPress, in any part of their estate,” Big Bite CEO Iain McPherson said. “Maybe it could be a small blog, powering an intranet or a large publishing site. I want to understand why and how they are using WordPress, but then drill down into other valuable metrics such as team size and budgets.”\nThe survey will be used to create a new report that summarizes the findings from enterprise organizations. McPherson said if the report is well received in the WordPress community, his team may continue publishing the State of Enterprise WordPress on an annual basis.\nThe survey most directly applies to the people who are responsible for the enterprise organization’s website, as opposed to the business owners. \n“We find with companies of these sizes; multiple people are managing their WordPress products,” McPherson said. “Also, multiple respondents from the same company is totally OK, too.\n“This is one of a couple of initiatives I am working on to raise the brand awareness of Big Bite, but more importantly, show that WordPress should be considered as an enterprise CMS.”\nAccording to W3Techs, WordPress’ current CMS market share is at 63.3% of all the websites where a CMS can be detected. Enterprise organizations help keep this market growing, so insights about how they are using WordPress and their particular pain points could be helpful in developing solutions that benefit this segment. Data from the survey will be aggregated and anonymized and will not be attributed to the respondent or the organization.\nCategory: NewsShare this:Click to share on Twitter (Opens in new window)Click to share on Mastodon (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Telegram (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Pocket (Opens in new window)Click to share on Reddit (Opens in new window)Click to email a link to a friend (Opens in new window)Like thisLike Loading…\n\n0\n\n\n\n\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \nEmail * \nWebsite \n Notify me of follow-up comments by email. Notify me of new posts by email. \n\n Join the discussion via emailGet only replies to your comment, the best of the rest, as well as a daily recap of all comments on this post. No more than a few emails daily, which you can reply to/unsubscribe from directly from your inbox.Δ \nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\n\n\n\nYou may also like\nLast Call for the 2023 State of Open Source SurveyNovember 7, 2022WordPress Tops Alignable’s Small Business Trust IndexFebruary 22, 2016Participate In The 2013 Webhosting ReviewJuly 2, 2013\n\n\nNewsletter\nSubscribe Via Email\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubmit\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nAbout WP Tavern\nWordPress Tavern is a website about all things WordPress. We cover news and events, write plugin and theme reviews, and talk about key issues within the WordPress ecosystem…\n\n\n\nHomeAboutArchiveWrite For UsAsk the Bartender\n\n\nTwitter\nFacebook\nInstagram\n\n\n\n\n© All Rights Reserved. Powered by WordPress, hosted by Pressable \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n%d bloggers like this:\n\n",
    "links": [
        "https://wptavern.com/",
        "/category/news",
        "/category/opinion",
        "/category/plugins",
        "/category/themes",
        "/category/wordcamps-meetups",
        "/podcast",
        "https://wptavern.com/contact",
        "#",
        "#",
        "https://bigbite.net/state-of-enterprise-WordPress/",
        "https://w3techs.com/technologies/details/cm-wordpress",
        "https://bigbite.net/state-of-enterprise-wordpress/",
        "https://wptavern.com/category/news",
        "https://wptavern.com/big-bite-launches-2023-enterprise-wordpress-survey?share=twitter",
        "https://wptavern.com/big-bite-launches-2023-enterprise-wordpress-survey?share=mastodon",
        "https://wptavern.com/big-bite-launches-2023-enterprise-wordpress-survey?share=facebook",
        "https://wptavern.com/big-bite-launches-2023-enterprise-wordpress-survey?share=telegram",
        "https://wptavern.com/big-bite-launches-2023-enterprise-wordpress-survey?share=jetpack-whatsapp",
        "https://wptavern.com/big-bite-launches-2023-enterprise-wordpress-survey?share=pocket",
        "https://wptavern.com/big-bite-launches-2023-enterprise-wordpress-survey?share=reddit",
        "mailto:?subject=%5BShared%20Post%5D%20Big%20Bite%20Launches%202023%20Enterprise%20WordPress%20Survey&body=https%3A%2F%2Fwptavern.com%2Fbig-bite-launches-2023-enterprise-wordpress-survey&share=email",
        "/big-bite-launches-2023-enterprise-wordpress-survey#respond",
        "https://akismet.com/privacy/",
        "https://wptavern.com/last-call-for-the-2023-state-of-open-source-survey",
        "https://wptavern.com/last-call-for-the-2023-state-of-open-source-survey",
        "https://wptavern.com/wordpress-tops-alignables-small-business-trust-index",
        "https://wptavern.com/wordpress-tops-alignables-small-business-trust-index",
        "https://wptavern.com/participate-in-the-2013-webhosting-review",
        "https://wptavern.com/participate-in-the-2013-webhosting-review",
        "https://wptavern.com/about",
        "/",
        "https://wptavern.com/about",
        "https://wptavern.com/archives",
        "https://wptavern.com/contact",
        "https://wptavern.com/contact/ask-the-bartender",
        "http://twitter.com/wptavern",
        "http://facebook.com/wptavern",
        "https://www.instagram.com/wptav/",
        "https://wordpress.org",
        "http://pressable.com/?utm_source=Automattic&utm_medium=rpc&utm_campaign=Concierge%20Referral&utm_term=concierge"
    ]
}