{
    "title": "Excellence - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\n\nExcellence \n\n\n\n \nBusiness Double Major Ready for Life’s Next Big Challenge \n\n\t\tMore than 10 years ago, Hirra Khan moved from Pakistan to Gridley as a pre-teen. She will now graduate with one degree in business administration and another in business information systems, and an impressive work résumé.\t\n\n\n\n\n \nLife of Hard Work Pays Off for Agricultural Business Major \n\n\t\tZion Brigham says coming to Chico State: “felt like going from a black and white TV to full color.” He graduates in May with an agricultural business degree and a clear vision for what’s ahead.\t\n\n\n\n\n \nChild Development Major Owes Success to Her Grandmother \n\n\t\tOvercoming obstacles and adversity as a child, Abigail Resendez is ready to graduate with a degree in child development—and it was her grandmother who helped make it possible.\t\n\n\n\n\n \nChico State Recognizes 2022–23 Outstanding Faculty \n\n\t\tThese awards—among the highest at Chico State—celebrate eight phenomenal faculty for academic distinction, prominent scholarship, and commitment to transformative experiences.\t\n\n\n\n\n \nSoon-to-be Theatre Arts Graduate Has Played a Starring Role Offstage \n\n\t\tGaby Saxon has spent four years at Chico State telling outstanding stories, all while using her growing voice and passion for social justice to create one of the most compelling stories of all—her own! \t\n\n\n\n\n \nStudents Travel, Grow, and Build Friendships Through Speech and Debate Team \n\n\t\tThe speech and debate team, which doubles as a club and a course, offers team members space to grow far beyond the competition stage. \t\n\n\n\n\n \nMolecular Biology Student Turns ‘Beautiful Disasters’ into Lifelong Call to Service \n\n\t\tHikmat Abou Shahla has spent his formative years stepping up to help during seasons of global crisis. He is set to graduate and continue on the path of service.    \t\n\n\n\n\n \nFrom Northern California to Ocean Engineer \n\n\t\tGridley native Irene Duran (Mechatronic Engineering, '20), moved to Cape Cod after graduating with one mission: an engineering job. \t\n\n\n\n\n \nIn the Midst of a Successful Career of Catching Bad Guys, Military Vet  Pursues Online MBA \n\n\t\tAfter a long and successful career first in the military and then the financial industry, Rio Miner enrolled in Chico State's online MBA program to further his career and fill in the gaps in his business acumen.\t\n\n\n\n\n \nChico State Receives Transformational Gift to Support New College of Business Building \n\n\t\tAlum Jon Krabbenschmidt (Business Administration, ’76) wants to see Glenn Hall become a state-of-the-art building for business students—and he is committing a pair of $5 million toward its construction.\t\n\n\n\n\n \nGraduating Public Health Student Embraces Support and Grows Through Challenges \n\n\t\tFirst-gen student, Elizabeth “Eli” Contreras-Perez, has navigated many personal struggles on her path to graduating, finding newfound resilience, and beginning a new chapter in life.  \t\n\n\n\n\n \nChico State Freshman Impresses Coaches on The Voice \n\n\t\tSophia Hoffman overcame a processing disorder to make it to Chico State—now she is turning heads on international television.\t\n\n\n\n\n \nCelebrating Our Lt. Rawlins Merit Scholarship Recipients \n\n\t\tFrom aspiring educators and future doctors to those currently serving rural communities, these are the 2022-23 Lt. Rawlins Merit Scholarship Recipients—the best of the best at Chico State.\t\n\n\n\n\n \nIntroducing Delaney Sarantopulos: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tA \"roll-of-the-dice\" decision to attend Chico State came up aces for Delaney Sarantopulos and the University, which has benefited greatly from her service-based leadership.\t\n\n\n\n\n \nIntroducing Chloe Koschnick: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tWhether advocating for inclusivity and accessibility in STEM or living her values through community service in education and with animals, computer science major Chloe Koschnick approaches all she does with curiosity and enthusiasm.\t\n\n\n\n\n \nIntroducing Josephine Hernandez: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tAnimal science major Josephine Hernandez is an empathetic leader committed to inspiring future agricultural students and giving back to her field. \t\n\n\n\n\n \nIntroducing Madeline Litman: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tWhile at Chico State, Madeline Litman's work ethic, perseverance, and maturity have led to leadership roles in student clubs, a stellar academic career, and now a prestigious Rawlins Merit Scholarship.     \t\n\n\n\n\n \nIntroducing Hannah Scholzen: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tCivil engineering student and soon-to-be graduate, Hannah Scholzen, is a model of perseverance and leadership in her field.\t\n\n\n\n\n \nCelebrating Our 2023 Distinguished Alumni \n\n\t\tFrom working on cancer treatments to advocating for farmworkers to teaching human kindness through language, the 2023 Distinguished Alumni have chosen to \"Do and Dare\" in a big way.\t\n\n\n\n\n \nIntroducing Peyton Arnold: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tPeyton Arnold has studied the impacts of feeding cover crops to livestock and served as vice president of the Chico State Sheep Association, but she's most passionate about poultry. \t\n\n\n\n\n \n‘Living my dream’: Chico State Alumna Forges Path in Hollywood \n\n\t\tHannah Hull (Media Arts, '20) shares about her \"wild ride\" from Chico State to Hollywood, where she's been working on sets of films and television shows.\t\n\n\n\n\n \nDistinguished Alumna, Educator, and School Director Melanie Mello \n\n\t\tFormer exchange student and decorated educator Melanie Mello has been named a Chico State distinguished alumni of the College of Humanities and Fine Arts.\t\n\n\n\n\n \nDistinguished Alum, Scientist, and CEO Thomas Butler \n\n\t\tThomas Butler found his passion in a Chico State lab. Today, he's the CEO of a company creating medicines designed to attack cancer and diabetes. \t\n\n\n\n\n \nIntroducing Kristen Chatham: 2023 Lt. Rawlins Merit Scholarship Recipient \n\n\t\tBusiness administration and marketing double major Kristen Chatham aspires to become an officer at a corporation after she graduates.\t\n\n\n\n\n \nDistinguished Alum and Strategic Architect Kimate Richards \n\n\t\tVeteran and alum Kimate Richards designs cutting-edge smart technology while making time to give back to his community.\t\n\n\n\n\n \nChico State Program Encourages Students to Give Back Home \n\n\t\tChico State's Giving Back Home program offers support and resources to students looking to make a difference in their hometowns. \t\n\n\n\n\n \nDistinguished Alum and Owner of Advantage Therapy Services Haley Willis \n\n\t\tHaley Willis, CEO and founder of Advantage Therapy Services in Chico, is helping advance the field of speech-language pathology. She is being honored as the 2023 Distinguished Alumni of the College of Communications and Education. \t\n\n\n\n\n \nDistinguished Alum and Valley Water District CEO Rick Callender \n\n\t\tRick Callender (Industrial Technology, ’94) is being honored by Chico State with this year's Distinguished Alumni Service Award.\t\n\n\n\n\n \n‘Beauty in the Chaos’: Fulbright Scholar’s Focus on Gemstone Trade in Sri Lanka \n\n\t\tAnthropology faculty Brian Brazeal navigated the global pandemic and political unrest as he went to Sri Lanka to document the country's gemstone trade as part of his Fulbright Scholar Award.\t\n\n\n\n\n \nUniversity Faculty Awarded Prestigious Lantis Endowments \n\n\t\tChico State faculty shine as three professors are celebrated for their achievements in research and contributions to their fields.\t\n\n\n\n\n \nWorth Sharing: Student-Athletes Shine in the Classroom \n\n\t\tA listing of professional achievements by Chico State faculty, staff, and students. \t\n\n\n\n\n \nBiology Student Among First to Research Fish’s Unusual Schooling Pattern \n\n\t\tCole Schmitt has been working with the National Systemics Laboratory and the Smithsonian Museum of Natural History, studying the vertical schooling behavior of the cutlassfish.\t\n\n\n\n\n \nThe Orion Honored by the Associated Collegiate Press \n\n\t\tThe Orion, Chico State’s student news organization, was recognized as one of the top 100 student publications in the nation by Associated Collegiate Press.\t\n\n\n\n\n \nChico State Provost Inducted into Michigan Tech’s Academy for Engineering Education Leadership \n\n\t\tChico State's Debra Larson has been inducted into Michigan Tech's Academy for Engineering Education Leadership.\t\n\n\n\n\n \nWorth Sharing: Nenadal Explores Community Post-Camp Fire \n\n\t\tA listing of professional achievements by Chico State faculty, staff, and students.\t\n\n\n\n\n \nThe Princeton Review Honors Chico State as One of its Green Colleges \n\n\t\tThe Princeton Review recently listed Chico State on its 2023 Guide to Green Colleges.\t\n\n\n\n\n \nInterior Architecture Students Design Free Floor Plans for Wildfire Survivors \n\n\t\tUnder the guidance of interior architecture professor Rouben Mohiuddin, 30 design students have worked on floor plans that have now been used to build more than a dozen homes in the Camp Fire footprint.\t\n\n\n\n\n \nUltracold Atom Lab Attempting to Cross ‘Unreachable’ Threshold \n\n\t\tWith the ultra-high vacuum chamber up and running, the University's ultracold atom chamber is ready to cool atoms to near absolute zero so they display their true quantum nature.\t\n\n\n\n\n \nStudent Researchers Share Insight into Summer Projects \n\n\t\tCSC² has supported nearly 300 students in undergraduate research projects across the three colleges. \t\n\n\n\n\n \nMultimillion-Dollar Grants Provide Undergraduate Research Opportunities to Underserved Students in STEM \n\n\t\tSince 2016, the Chico STEM Connections Collaborative has provided academic and other support services to historically underserved students in science, technology, engineering, mathematics, and agriculture.\t\n\n\n\nPosts navigation\n1\n2\n3\n…\n6\nNext\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/abigail-resendez/",
        "https://today.csuchico.edu/2023-outstanding-faculty/",
        "https://today.csuchico.edu/gaby-saxon/",
        "https://today.csuchico.edu/friendships-through-speech-debate/",
        "https://today.csuchico.edu/hikmat-abou-shahla/",
        "https://today.csuchico.edu/from-northern-california-to-ocean-engineer/",
        "https://today.csuchico.edu/rio-miner-online-mba/",
        "https://today.csuchico.edu/business-building-5-million-gift/",
        "https://today.csuchico.edu/elizabeth-contreras-perez-profile/",
        "https://today.csuchico.edu/sophia-hoffman-the-voice/",
        "https://today.csuchico.edu/2023-rawlins-recipients/",
        "https://today.csuchico.edu/rawlins-delaney-sarantopulos/",
        "https://today.csuchico.edu/rawlins-chloe-koschnick/",
        "https://today.csuchico.edu/rawlins-josephine-hernandez/",
        "https://today.csuchico.edu/rawlins-madeline-litman/",
        "https://today.csuchico.edu/rawlings-hannah-scholzen/",
        "https://today.csuchico.edu/2023-distinguished-alumni/",
        "https://today.csuchico.edu/rawlins-peyton-arnold/",
        "https://today.csuchico.edu/media-arts-hannah-hull/",
        "https://today.csuchico.edu/mello-distinguished-alum/",
        "https://today.csuchico.edu/distinguished-alum-thomas-butler/",
        "https://today.csuchico.edu/rawlins-kristen-chatham/",
        "https://today.csuchico.edu/distinguished-alum-kimate-richards/",
        "https://today.csuchico.edu/giving-back-home/",
        "https://today.csuchico.edu/distinguished-alum-haley-willis/",
        "https://today.csuchico.edu/distinguished-alum-rick-callender/",
        "https://today.csuchico.edu/brazeal-fulbright-experience/",
        "https://today.csuchico.edu/lantis-endowments-2022/",
        "https://today.csuchico.edu/worth-sharing-11222022/",
        "https://today.csuchico.edu/biology-student-among-first-to-research-fishs-unusual-schooling-pattern/",
        "https://today.csuchico.edu/the-orion-wins-acp-award/",
        "https://today.csuchico.edu/debra-larson-michigan-tech-honor/",
        "https://today.csuchico.edu/worth-sharing-11072022/",
        "https://today.csuchico.edu/princeton-review-green-school/",
        "https://today.csuchico.edu/reimagining-home-update/",
        "https://today.csuchico.edu/ultracold-atom-lab-update/",
        "https://today.csuchico.edu/csc2-student-researchers/",
        "https://today.csuchico.edu/csc2/",
        "https://today.csuchico.edu/category/excellence/page/2/",
        "https://today.csuchico.edu/category/excellence/page/3/",
        "https://today.csuchico.edu/category/excellence/page/6/",
        "https://today.csuchico.edu/category/excellence/page/2/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}