{
    "title": "Unexpected Super Bowl Star Set to Graduate - Chico State Today",
    "body": "\n\nSkip to Main Content\n\n\n\n\nOpen Menu\n\n\n\n\n\nClose Menu\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\n\n\nOpen Search in Menu\n\n\n\n\n\n\nSearch\n\n\nSubmit Search\n\n\n\n\n\n\n\n\n\n\nHome\nNews\nPeople\nPrograms\nResearch\nContact\nSubscribe to Chico State Today\n \n\n\n\nUnexpected Super Bowl Star Set to Graduate\n\nAndrew Staples\nApril 22, 2022\n\n\n\n\nJason Halley \n\n\n\t\t\tBri Seiders works for Student Organizations and Leadership Education (SOLE) in Student Life and Leadership (SLL) on Tuesday, April 19, 2022 in Chico, Calif. Seiders is an outstanding senior and a first-generation student who has whole-heartedly embraced the college experience.\n(Jason Halley/University Photographer/Chico State)\t\t\n\n\n\n\nWhen thinking about Super Bowl LVI, it’s not the star-studded halftime show or the Los Angeles Rams’ dramatic comeback that Bri Seiders remembers most. Instead, her unforgettable experience is a man running up to her while she was working at the Super Bowl Experience and telling her he needed help because his wife’s water just broke. \nSuddenly, the recreation, hospitality, and parks management (RHPM) major went from directing fans to autographs and helping them participate in interactive football-themed games to clearing people out of the way and helping the couple get to the venue exits and on their way to the hospital. As paramedics arrived to assist, Seiders was composed enough to whisper “congratulations” to the father-to-be. \n“There is always a lot going on during large events—things can go wrong that need to quickly be fixed. I think it is the right career path for me because I do better when I’m stressed,” said Seiders with a laugh. “I always feel I need to be running around and doing something.” \nAnd run around she has. In addition to being one of just 40 of 600 applicants selected to work at the Super Bowl, putting her years of coursework into real-world application, Seiders has excelled at everything she’s signed up for at Chico State. She is currently the president of the Recreation, Hospitality, and Parks Management Society, a student-run club where she directs meetings, recruits members, and checks in with her peers to make sure they are on track with courses. \nShe also served as the Greek Week chairperson for her sorority’s winning team, which took home top honors in fall 2021 by raising $8,500 for Chico State Basic Needs and donating 1,500 non-perishable goods to the Wildcat Food Pantry. \nAnd in 2021, Seiders co-produced “New Wave”, a professional and personal development conference planned and produced by students in the event management capstone course. She, along with her teammates, attracted 9 speakers and more than 250 attendees from across the California State University. \nFinally, she has worked for the past year as a special events paraprofessional for Student Organizations and Leadership Education. As she helps student groups work with marketing, logistics, and risk management when they want to host an event on campus, she continues to put her classroom skills into play while helping her peers. \nBri Seiders at the Super Bowl Experience\n“I say yes to everything that I have the chance to. I believe that from every opportunity that I take, I will be able to learn something different about myself, and hopefully be able to inspire somebody else to take that action in their life to do something that they fear,” Seiders said. \nLecturer Kelli McCrea describes Seiders as an inspiration to her fellow students within the department. \n“RHPM is a major that is full of fun, cheery people, but I’ve never met anyone who lives every day quite like Bri,” said McCrea. “I think, because of her background, she is grateful for every opportunity and super eager to learn.” \nOriginally from Massachusetts and raised by a single mother, Seiders went to high school in Santa Clarita and knew Chico State was her next step when she visited the campus during a tour.  \n“The moment I walked onto campus, my eyes lit up. The trees, nature, and brick buildings just felt right, it reminded me of the Northeast where I grew up,” said Seiders.  \nThat’s not to say it has always been smooth sailing. In addition to persisting through the Camp Fire and the COVID-19 pandemic, Seiders dabbled in “four or five majors” before deciding on RHMP. As a first-generation student, she’s had to figure out how to navigate college largely on her own, including picking her classes, study and time management skills, and how to apply for a loan. \n“People sometimes make assumptions about my background because of my major, because I’m Caucasian, and I’m in a sorority and they assume my Chico State career has been an easy process that is filled with fun, special events. They don’t realize first-generation students don’t fit a specific profile,” she said. \nBut with the support of faculty like McCrea and opportunities to thrive in and out of the classroom, she persisted and is proud of her many successes—including being on the brink of earning her degree.  \nAt this point, Chico feels like home as much as anywhere else to Seiders. She has enjoyed her experience at Chico State so much that she isn’t quite ready to leave. After graduation, she is interested in continuing to work on campus. Long term, she’d like to work internationally in event management. Whether it’s a corporate conference or a music festival, she’s confident her experience and energy will be the right fit.  McCrea agrees.  \n“She could open her own event production company right now if she wanted to,” she said. “She has that kind of drive and confidence in herself.” \nFor now, Seiders is focused on wrapping up everything she has going on during her senior year, nailing down a post-graduation job, and working on the speech she’s been asked to deliver at Commencement.  \nSpeech aside, as someone who is planning her future around organizing large-scale events, this is one ceremony where she’ll be happy to leave the planning and the solving of unexpected issues that pop up in real-time to someone else so she can revel in the moment and think about the last four years. \n“Graduating from Chico State means that I have made my mark on the campus community through connecting and engagement in ways that I would have never imagined four years ago,” she said. “It means that I have found my best friends here, even some I would consider my family and that Chico will always have a piece of my heart.” \n\n\nShare this Article\nClick to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on LinkedIn (Opens in new window)Click to email a link to a friend (Opens in new window)Click to print (Opens in new window)\n\n\n \n\n\n\t\t\tAndrew Staples\t\t\n\n\n\t\tAndrew focuses on enhancing the University’s brand reputation, managing crisis communications and proactively telling the Chico State story. He earned his BA in Journalism from Chico State in 2000.\t\n\n\n\n\nMost Popular \n\n\t\t\t\t\tBusiness Double Major Ready for Life’s Next Big Challenge\t\t\t\t\n\n\n\n\t\t\t\t\tExpanded CalFresh Eligibility Brings Food Access to More Chico State Students\t\t\t\t\n\n\n\n\t\t\t\t\tWorth Sharing: Health Services Administration College Bowl Team Scores Wins\t\t\t\t\n\n\n\n\t\t\t\t\tLife of Hard Work Pays Off for Agricultural Business Major\t\t\t\t\n\n\n\n\t\t\t\t\tRooted in Connection: The Wildcat Family Tree\t\t\t\t\n\n\nSubscribe to Chico State Today\n \n\n\n\n\n\n\t\t\t\t\t\t\tType your email…\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSubscribe\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\tWe acknowledge and are mindful that Chico State stands on lands that were originally occupied by the first people of this area, the Mechoopda, and we recognize their distinctive spiritual relationship with this land, the flora, the fauna, and the waters that run through campus.\n\t\t\t\t\t\n\n\t\t\t\t\t\tWe are humbled that our campus resides upon sacred lands that since time immemorial have sustained the Mechoopda people and continue to do so today.\n\t\t\t\t\t\n\n\n\n\n\n\nYouTube\n\n\n\nTwitter\n\n\n\nFacebook\n\n\n\nInstagram\n\n\nChico State Today is an official site of California State University, Chico.\nReport an accessibility issue\n\n\n\n\n\n\n\nChico State\n\n\n\nCalifornia State University, Chico\n400 West First Street\nChico, CA 95929\n\n\n\t\t\t\t\tCopyright © 2023 All Rights Reserved\n\t\t\t\t\n\n\n\n\n\n\n\n\nClose Subscribe Pop-Up\n\n\n\n\n\t\t\t\t\tClose Subscribe Pop-Up\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#main",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://www.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/",
        "https://today.csuchico.edu/category/news/",
        "https://today.csuchico.edu/category/people/",
        "https://today.csuchico.edu/category/programs/",
        "https://today.csuchico.edu/category/research/",
        "https://today.csuchico.edu/contact-us/",
        "https://today.csuchico.edu/subscribe/",
        "https://today.csuchico.edu/author/ajstaples/",
        "https://today.csuchico.edu/outstanding-grad-bri-seiders/?share=facebook",
        "https://today.csuchico.edu/outstanding-grad-bri-seiders/?share=twitter",
        "https://today.csuchico.edu/outstanding-grad-bri-seiders/?share=linkedin",
        "mailto:?subject=%5BShared%20Post%5D%20Unexpected%20Super%20Bowl%20Star%20Set%20to%20Graduate&body=https%3A%2F%2Ftoday.csuchico.edu%2Foutstanding-grad-bri-seiders%2F&share=email",
        "https://today.csuchico.edu/outstanding-grad-bri-seiders/#print",
        "#",
        "https://today.csuchico.edu/author/ajstaples/",
        "https://today.csuchico.edu/hirra-khan/",
        "https://today.csuchico.edu/calfresh/",
        "https://today.csuchico.edu/worth-sharing-05012023/",
        "https://today.csuchico.edu/zion-brigham/",
        "https://today.csuchico.edu/rooted-in-connection-the-wildcat-family-tree/",
        "https://www.csuchico.edu/tribalrelations/land-acknowledgement.shtml",
        "https://www.youtube.com/channel/UCdqG_gjmcrPglhsxElQX4ZA",
        "https://twitter.com/chicostate",
        "https://www.facebook.com/CaliforniaStateUniversityChico/",
        "https://www.instagram.com/chicostate/",
        "mailto:publicaffairs@csuchico.edu",
        "https://www.csuchico.edu"
    ]
}