{
    "title": "Visitor Information : Stanford University",
    "body": "\n\n \n\n\n\n\n\n\n\n Skip to content \n\n\n\n\n\n\n\n\n\n\n  \n\n\n  Visitor Information Optional line 2 - add two-line-signature to body class to display  \n\n\n\n\n\n\n\n\n\n\n    Menu\n\n\n\n\n\nSearch form\nSearch term\n\n\n\n\n\n\n\n\n\n\n\n\n Home\n The Basics\n Prospective Students\n Explore Campus\n\n\n\nRelated sites...\n\nCommunity Engagement \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nVisitor Information Services\n\n\n\n\n\nWelcome to the Farm\nStanford University is a place where pioneering spirit meets 21st-century possibility.\n\n\n\n\nAnnouncementsTrying to plan a February visit during your Student's break? (Posted 2/8/2023)Registration for all guided campus tours and admission information sessions from Friday, February 17 through Sunday, February 26 filled up very quickly. But don't let that keep you from visiting!See detailsMany schools across the country take a week or more off surrounding the Presidents' Day holiday. This is often referred to as \"Ski Week\" and is a popular time for high school students to visit campuses -- second only to Spring Break in terms of visitor volume. \n\nThat being said, the Stanford Visitor Center, a division of Stanford's Office of Undergraduate Admission, will be open from Tuesday, February 21 through Friday, February 24 (closed Monday, February 20) to greet and assist all of you who would still like to visit campus, interact with students, and get information about applying to Stanford's undergraduate class.\n\nWhile tours and information sessions are at capacity (and we do not offer waiting lists), no registration is required to participate in our very popular  Student Forum  and the concurrent \"Parent/Supporter Q&A\" sessions taking place each day from 12:00 - 1:00pm at the Visitor Center. These are unique and valuable opportunities to interact with students and staff to find out more about what it's like to be a Stanford undergraduate and what the process looks like to become one!\n\nOur staff will also be available to help provide information on how to tour the campus on your own, whether navigating via our self-guided tour map or any of the many resources available under the \"Explore Campus\" tab on the Stanford visitor website at:  visit.stanford.edu/explore-campus.\n\nFor more information, call the Stanford Visitor Center during business hours (9:00am - 5:00pm weekdays, excluding holidays) at (650) 723-2560.\nSpring and Summer tour and program registration (Updated 2/13/2023)Initial registration for prospective undergraduate tours and programs being offered for Stanford's Spring Quarter (program dates: April 3 - June 2) was posted for registration on Monday, February 13. Initial registration for tours and programs for summer will be posted and go live at 12:00pm noon on Monday, May 8.See detailsRegistration for all tours and programs is located on the Stanford Undergraduate Admission website (admission.stanford.edu/engage).\nTours for Approved Groups/Organizations available by reservation (Updated 2/8/2023)Guided tours of campus for groups of prospective undergraduate students (schools, organizations, etc.) are available to approved groups by advance reservation on Tuesdays, Wednesdays, and Thursdays during the academic quarter.See detailsThe Office of Undergraduate Admission is pleased to announce that 45-minute tours are once again provided by advance reservation to qualifying organizations, with tours given during Winter Quarter at 11:15am and 1:15pm on Tuesdays, Wednesdays, and Thursdays from January 24 through March 16. Please note that at this point,  no Group Tours will be available during the period from March 17 through May 1. Group Tours for Spring Quarter will resume Tuesday, May 2 and continue through Thursday, June 2. Summer availability has not yet been determined.\n\nAt this point, all new Group Tour requests should be sent to grouptours@stanford.edu. Requests that have already been submitted for fall and beyond will be reviewed and receive responses based upon tour availability and qualifying status.\nQualifying organizations: The Office of Undergraduate Admission seasonally offers guided tours by appointment for prospective undergraduate student groups of 10 or more people (up to 100 max) from the following categories:\n\nHigh Schools\nCommunity Colleges\nNot-For-Profit Organizations focused on Access or Exposure to College\nQualifying Community Based Organizations\n\nOther groups: Middle schools, grade schools, and other qualifying organizations may request approval to visit and park on campus, and can be provided with resources to enjoy a self-guided visit with age appropriate sites, resources, and activities, but we are sorry to say that we are no longer providing staffing for guided tours for these age levels.\nPlease note that we will not grant requests for group visits through commercial or third party tour operators. All requests and communications must come from and and be processed through a qualifying organization. \n \n\nExperience Stanford\n\n \n\n\n\nStanford 360° Virtual Tour\nWelcome admitted students and all future applicants!\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nEvents\n\n\n\n\n\n\n\n Events at Stanford\n\n\nCurrent Weather\n Stanford, CA, USA\n\n\n Stanford Station \n\n\nNewsletter\n\nSubscribe to a free monthly email featuring upcoming events and activities.\n\n Stanford for You\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOnline Resources\n\n\n\nVirtual Tours\n\nStanford Mobile App \n\n\n\nRelated Sites\n\nFinancial Aid\nUndergraduate Admission\n\n\n\n\n\n\n Contact Us \n\n\n\nConnect with us\n   \n\n\n\n\n\n\n\n    \n\n\n\nStanford Home\nMaps & Directions\nSearch Stanford\nEmergency Info\n\n\nTerms of Use\nPrivacy\nCopyright\nTrademarks\nNon-Discrimination\nAccessibility\n\n\n\n\n© Stanford University.   Stanford, California 94305.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "#content",
        "https://www.stanford.edu/",
        "/",
        "/",
        "/basics/",
        "/prospects/",
        "/explore-campus/",
        "https://community.stanford.edu",
        "#item112",
        "http://visit.stanford.edu/explore-campus",
        "#item115",
        "http://admission.stanford.edu/engage",
        "#item113",
        "mailto:grouptours@stanford.edu ",
        "tours/virtual/index.html",
        "https://stanford.enterprise.localist.com/widget/view?schools=stanford&types=37006980816438&days=31&num=10&sponsored=1&show_view_all_cta=0&hide_past=1&format=rss",
        "http://events.stanford.edu/",
        "https://forecast7.com/en/37d42n122d17/stanford/?unit=us",
        "http://weather.stanford.edu/",
        "https://events.stanford.edu/stanfordforyou/",
        "https://visit.stanford.edu/tours/virtual/",
        "https://uit.stanford.edu/stanford-mobile",
        "https://financialaid.stanford.edu",
        "https://admission.stanford.edu",
        "https://visit.stanford.edu/contact",
        "https://www.facebook.com/stanford",
        "http://twitter.com/stanford",
        "https://itunes.stanford.edu/",
        "https://www.youtube.com/stanford",
        "https://instagram.com/stanford",
        "//futurity.org/university/stanford-university/",
        "https://www.stanford.edu",
        "https://www.stanford.edu",
        "https://visit.stanford.edu/plan/",
        "https://www.stanford.edu/search/",
        "https://emergency.stanford.edu",
        "https://www.stanford.edu/site/terms/",
        "https://www.stanford.edu/site/privacy/",
        "https://uit.stanford.edu/security/copyright-infringement",
        "https://adminguide.stanford.edu/chapter-1/subchapter-5/policy-1-5-4",
        "https://exploredegrees.stanford.edu/nonacademicregulations/nondiscrimination/",
        "https://www.stanford.edu/site/accessibility"
    ]
}